@node
@convertedToTextFabricBy=Martijn Naaijer and Christian Canu Højgaard
@dataset=sp
@datasetName=The Samaritan Pentateuch
@dateWritten=2025-05-23T14:55:23Z
@description=consonantal letter
@encodedBy=Christian Canu Højgaard and Martijn Naaijer
@licence=Creative Commons Attribution-NonCommercial 4.0 International License
@licenceUrl=http://creativecommons.org/licenses/by-nc/4.0/
@manuscripts=MS Dublin Chester Beatty Library 751 (Gen 1-Deut 32:36) + MS Garizim 1 (Deut 32:36b-34)
@source=Stefan Schorch in colloboration with Evelyn Burkhardt, Ulrike Hirschfelder, Irina Wandrey and József Zsengellér
@valueType=str
@version=4.0.1
@writtenBy=Text-Fabric
@writtenBy=Text-Fabric
@dateWritten=2025-07-01T13:37:21Z

ב
ר
א
ש
י
ת
 
ב
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
ה
ש
מ
י
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
ו
ה
א
ר
ץ
 
ה
י
ת
ה
 
ת
ה
ו
 
ו
ב
ה
ו
 
ו
ח
ש
ך
 
ע
ל
 
פ
נ
י
 
ת
ה
ו
ם
 
ו
ר
ו
ח
 
א
ל
ה
י
ם
 
מ
ר
ח
פ
ת
 
ע
ל
 
פ
נ
י
 
ה
מ
י
ם
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
י
ה
י
 
א
ו
ר
 
ו
י
ה
י
 
א
ו
ר
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ו
ר
 
כ
י
 
ט
ו
ב
 
ו
י
ב
ד
ל
 
א
ל
ה
י
ם
 
ב
י
ן
 
ה
א
ו
ר
 
ו
ב
י
ן
 
ה
ח
ש
ך
 
ו
י
ק
ר
א
 
א
ל
ה
י
ם
 
ל
א
ו
ר
 
י
ו
ם
 
ו
ל
ח
ש
ך
 
ק
ר
א
 
ל
י
ל
ה
 
ו
י
ה
י
 
ע
ר
ב
 
ו
י
ה
י
 
ב
ק
ר
 
י
ו
ם
 
א
ח
ד
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
י
ה
י
 
ר
ק
י
ע
 
ב
ת
ו
ך
 
ה
מ
י
ם
 
ו
י
ה
י
 
מ
ב
ד
י
ל
 
ב
י
ן
 
מ
י
ם
 
ל
מ
י
ם
 
ו
י
ע
ש
 
א
ל
ה
י
ם
 
א
ת
 
ה
ר
ק
י
ע
 
ו
י
ב
ד
ל
 
ב
י
ן
 
ה
מ
י
ם
 
א
ש
ר
 
מ
ת
ח
ת
 
ל
ר
ק
י
ע
 
ו
ב
י
ן
 
ה
מ
י
ם
 
א
ש
ר
 
מ
ע
ל
 
ל
ר
ק
י
ע
 
ו
י
ה
י
 
כ
ן
 
ו
י
ק
ר
א
 
א
ל
ה
י
ם
 
ל
ר
ק
י
ע
 
ש
מ
י
ם
 
ו
י
ה
י
 
ע
ר
ב
 
ו
י
ה
י
 
ב
ק
ר
 
י
ו
ם
 
ש
נ
י
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
י
ק
ו
ו
 
ה
מ
י
ם
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
א
ל
 
מ
ק
ו
ם
 
א
ח
ד
 
ו
ת
ר
א
ה
 
ה
י
ב
ש
ה
 
ו
י
ה
י
 
כ
ן
 
ו
י
ק
ר
א
 
א
ל
ה
י
ם
 
ל
י
ב
ש
ה
 
א
ר
ץ
 
ו
ל
מ
ק
ו
ה
 
ה
מ
י
ם
 
ק
ר
א
 
י
מ
י
ם
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
כ
י
 
ט
ו
ב
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
ת
ד
ש
א
 
ה
א
ר
ץ
 
ד
ש
א
 
ע
ש
ב
 
מ
ז
ר
י
ע
 
ז
ר
ע
 
ו
ע
ץ
 
פ
ר
י
 
ע
ש
ה
 
פ
ר
י
 
ל
מ
י
נ
ו
 
א
ש
ר
 
ז
ר
ע
ו
 
ב
ו
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ה
י
 
כ
ן
 
ו
ת
ו
צ
א
 
ה
א
ר
ץ
 
ד
ש
א
 
ע
ש
ב
 
מ
ז
ר
י
ע
 
ז
ר
ע
 
ל
מ
י
נ
ה
ו
 
ו
ע
ץ
 
ע
ש
ה
 
פ
ר
י
 
א
ש
ר
 
ז
ר
ע
ו
 
ב
ו
 
ל
מ
י
נ
ה
ו
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
כ
י
 
ט
ו
ב
 
ו
י
ה
י
 
ע
ר
ב
 
ו
י
ה
י
 
ב
ק
ר
 
י
ו
ם
 
ש
ל
י
ש
י
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
י
ה
י
 
מ
א
ו
ר
ו
ת
 
ב
ר
ק
י
ע
 
ה
ש
מ
י
ם
 
ל
ה
א
י
ר
 
ע
ל
 
ה
א
ר
ץ
 
ו
ל
ה
ב
ד
י
ל
 
ב
י
ן
 
ה
י
ו
ם
 
ו
ב
י
ן
 
ה
ל
י
ל
ה
 
ו
ה
י
ו
 
ל
א
ת
ו
ת
 
ו
ל
מ
ו
ע
ד
י
ם
 
ו
ל
י
מ
י
ם
 
ו
ש
נ
י
ם
 
ו
ה
י
ו
 
ל
מ
א
ו
ר
ו
ת
 
ב
ר
ק
י
ע
 
ה
ש
מ
י
ם
 
ל
ה
א
י
ר
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ה
י
 
כ
ן
 
ו
י
ע
ש
 
א
ל
ה
י
ם
 
א
ת
 
ש
נ
י
 
ה
מ
א
ו
ר
ו
ת
 
ה
ג
ד
ל
י
ם
 
א
ת
 
ה
מ
א
ו
ר
 
ה
ג
ד
ו
ל
 
ל
מ
מ
ש
ל
ת
 
ה
י
ו
ם
 
ו
א
ת
 
ה
מ
א
ו
ר
 
ה
ק
ט
ן
 
ל
מ
מ
ש
ל
ת
 
ה
ל
י
ל
ה
 
ו
א
ת
 
ה
כ
ו
כ
ב
י
ם
 
ו
י
ת
ן
 
א
ת
ם
 
א
ל
ה
י
ם
 
ב
ר
ק
י
ע
 
ה
ש
מ
י
ם
 
ל
ה
א
י
ר
 
ע
ל
 
ה
א
ר
ץ
 
ו
ל
מ
ש
ל
 
ב
י
ו
ם
 
ו
ב
ל
י
ל
ה
 
ו
ל
ה
ב
ד
י
ל
 
ב
י
ן
 
ה
א
ו
ר
 
ו
ב
י
ן
 
ה
ח
ש
ך
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
כ
י
 
ט
ו
ב
 
ו
י
ה
י
 
ע
ר
ב
 
ו
י
ה
י
 
ב
ק
ר
 
י
ו
ם
 
ר
ב
י
ע
י
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
י
ש
ר
צ
ו
 
ה
מ
י
ם
 
ש
ר
ץ
 
נ
פ
ש
 
ח
י
ה
 
ו
ע
ו
ף
 
י
ע
פ
ף
 
ע
ל
 
ה
א
ר
ץ
 
ע
ל
 
פ
נ
י
 
ר
ק
י
ע
 
ה
ש
מ
י
ם
 
ו
י
ב
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
ה
ת
נ
י
נ
י
ם
 
ה
ג
ד
ל
י
ם
 
ו
א
ת
 
כ
ל
 
נ
פ
ש
 
ה
ח
י
ה
 
ה
ר
מ
ש
ת
 
א
ש
ר
 
ש
ר
צ
ו
 
ה
מ
י
ם
 
ל
מ
י
נ
י
ה
ם
 
ו
א
ת
 
כ
ל
 
ע
ו
ף
 
כ
נ
ף
 
ל
מ
י
נ
ה
ו
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
כ
י
 
ט
ו
ב
 
ו
י
ב
ר
ך
 
א
ת
ם
 
א
ל
ה
י
ם
 
ל
א
מ
ר
 
פ
ר
ו
 
ו
ר
ב
ו
 
ו
מ
ל
א
ו
 
א
ת
 
ה
מ
י
ם
 
ב
י
מ
י
ם
 
ו
ה
ע
ו
ף
 
י
ר
ב
ה
 
ב
א
ר
ץ
 
ו
י
ה
י
 
ע
ר
ב
 
ו
י
ה
י
 
ב
ק
ר
 
י
ו
ם
 
ח
מ
י
ש
י
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
ת
ו
צ
א
 
ה
א
ר
ץ
 
נ
פ
ש
 
ח
י
ה
 
ל
מ
י
נ
ה
 
ב
ה
מ
ה
 
ו
ר
מ
ש
 
ו
ח
י
ת
 
ה
א
ר
ץ
 
ל
מ
י
נ
ה
 
ו
י
ה
י
 
כ
ן
 
ו
י
ע
ש
 
א
ל
ה
י
ם
 
א
ת
 
ח
י
ת
 
ה
א
ר
ץ
 
ל
מ
י
נ
ה
 
ו
א
ת
 
ה
ב
ה
מ
ה
 
ל
מ
י
נ
ה
 
ו
א
ת
 
כ
ל
 
ר
מ
ש
 
ה
א
ד
מ
ה
 
ל
מ
י
נ
ה
ו
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
כ
י
 
ט
ו
ב
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
נ
ע
ש
ה
 
א
ד
ם
 
ב
צ
ל
מ
נ
ו
 
ו
כ
ד
מ
ו
ת
נ
ו
 
ו
י
ר
ד
ו
 
ב
ד
ג
ת
 
ה
י
ם
 
ו
ב
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
ב
ב
ה
מ
ה
 
ו
ב
כ
ל
 
ה
א
ר
ץ
 
ו
ב
כ
ל
 
ה
ר
מ
ש
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ב
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ד
ם
 
ב
צ
ל
מ
ו
 
ב
צ
ל
ם
 
א
ל
ה
י
ם
 
ב
ר
א
 
א
ת
ו
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ב
ר
א
 
א
ת
ם
 
ו
י
ב
ר
ך
 
א
ת
ם
 
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
ל
ה
ם
 
א
ל
ה
י
ם
 
פ
ר
ו
 
ו
ר
ב
ו
 
ו
מ
ל
א
ו
 
א
ת
 
ה
א
ר
ץ
 
ו
כ
ב
ש
ו
ה
 
ו
ר
ד
ו
 
ב
ד
ג
ת
 
ה
י
ם
 
ו
ב
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
ב
כ
ל
 
ה
ח
י
ה
 
ה
ר
מ
ש
ת
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
ה
נ
ה
 
נ
ת
ת
י
 
ל
כ
ם
 
א
ת
 
כ
ל
 
ע
ש
ב
 
ז
ר
ע
 
ז
ר
ע
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
ו
א
ת
 
כ
ל
 
ע
ץ
 
א
ש
ר
 
ב
ו
 
פ
ר
י
 
ע
ץ
 
ז
ר
ע
 
ז
ר
ע
 
ל
כ
ם
 
י
ה
י
ה
 
ל
א
כ
ל
ה
 
ו
ל
כ
ל
 
ח
י
ת
 
ה
א
ר
ץ
 
ו
ל
כ
ל
 
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
ל
כ
ל
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
ב
ו
 
נ
פ
ש
 
ח
י
ה
 
א
ת
 
כ
ל
 
י
ר
ק
 
ע
ש
ב
 
ל
א
כ
ל
ה
 
ו
י
ה
י
 
כ
ן
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
ו
ה
נ
ה
 
ט
ו
ב
 
מ
א
ד
 
ו
י
ה
י
 
ע
ר
ב
 
ו
י
ה
י
 
ב
ק
ר
 
י
ו
ם
 
ה
ש
ש
י
 
ו
י
כ
ל
ו
 
ה
ש
מ
י
ם
 
ו
ה
א
ר
ץ
 
ו
כ
ל
 
צ
ב
א
ם
 
ו
י
כ
ל
 
א
ל
ה
י
ם
 
ב
י
ו
ם
 
ה
ש
ש
י
 
מ
ל
א
כ
ת
ו
 
א
ש
ר
 
ע
ש
ה
 
ו
י
ש
ב
ת
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
מ
כ
ל
 
מ
ל
א
כ
ת
ו
 
א
ש
ר
 
ע
ש
ה
 
ו
י
ב
ר
ך
 
א
ל
ה
י
ם
 
א
ת
 
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
י
ק
ד
ש
 
א
ת
ו
 
כ
י
 
ב
ו
 
ש
ב
ת
 
מ
כ
ל
 
מ
ל
א
כ
ת
ו
 
א
ש
ר
 
ב
ר
א
 
א
ל
ה
י
ם
 
ל
ע
ש
ו
ת
 
א
ל
ה
 
ת
ו
ל
ד
ת
 
ה
ש
מ
י
ם
 
ו
ה
א
ר
ץ
 
ב
ה
ב
ר
א
ם
 
ב
י
ו
ם
 
ע
ש
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ש
מ
י
ם
 
ו
א
ר
ץ
 
ו
כ
ל
 
ש
י
ח
 
ה
ש
ד
ה
 
ט
ר
ם
 
י
ה
י
ה
 
ב
א
ר
ץ
 
ו
כ
ל
 
ע
ש
ב
 
ה
ש
ד
ה
 
ט
ר
ם
 
י
צ
מ
ח
 
כ
י
 
ל
א
 
ה
מ
ט
י
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ע
ל
 
ה
א
ר
ץ
 
ו
א
ד
ם
 
א
י
ן
 
ל
ע
ב
ד
 
א
ת
 
ה
א
ד
מ
ה
 
ו
א
ד
 
י
ע
ל
ה
 
מ
ן
 
ה
א
ר
ץ
 
ו
ה
ש
ק
ה
 
א
ת
 
כ
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
י
צ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ד
ם
 
ע
פ
ר
 
מ
ן
 
ה
א
ד
מ
ה
 
ו
י
פ
ח
 
ב
א
פ
י
ו
 
נ
ש
מ
ת
 
ח
י
י
ם
 
ו
י
ה
י
 
א
ד
ם
 
ל
נ
פ
ש
 
ח
י
ה
 
ו
י
ט
ע
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ג
ן
 
ב
ע
ד
ן
 
מ
ק
ד
ם
 
ו
י
ש
ם
 
ש
ם
 
א
ת
 
ה
א
ד
ם
 
א
ש
ר
 
י
צ
ר
 
ו
י
צ
מ
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
מ
ן
 
ה
א
ד
מ
ה
 
א
ת
 
כ
ל
 
ע
ץ
 
נ
ח
מ
ד
 
ל
מ
ר
א
ה
 
ו
ט
ו
ב
 
ל
מ
א
כ
ל
 
ו
ע
ץ
 
ה
ח
י
י
ם
 
ב
ת
ו
ך
 
ה
ג
ן
 
ו
ע
ץ
 
ה
ד
ע
ת
 
ט
ו
ב
 
ו
ר
ע
 
ו
נ
ה
ר
 
י
צ
א
 
מ
ע
ד
ן
 
ל
ה
ש
ק
ו
ת
 
א
ת
 
ה
ג
ן
 
ו
מ
ש
ם
 
י
פ
ר
ד
 
ו
ה
י
ה
 
ל
א
ר
ב
ע
ה
 
ר
א
ש
י
ם
 
ש
ם
 
ה
א
ח
ד
 
פ
י
ש
ו
ן
 
ה
ו
א
 
ה
ס
ו
ב
ב
 
א
ת
 
כ
ל
 
א
ר
ץ
 
ה
ח
ו
י
ל
ה
 
א
ש
ר
 
ש
ם
 
ה
ז
ה
ב
 
ו
ז
ה
ב
 
ה
א
ר
ץ
 
ה
ה
י
א
 
ט
ו
ב
 
מ
א
ד
 
ש
ם
 
ה
ב
ד
ל
ח
 
ו
א
ב
ן
 
ה
ש
ה
ם
 
ו
ש
ם
 
ה
נ
ה
ר
 
ה
ש
נ
י
 
ג
י
ח
ו
ן
 
ה
ו
א
 
ה
ס
ו
ב
ב
 
א
ת
 
כ
ל
 
א
ר
ץ
 
כ
ו
ש
 
ו
ש
ם
 
ה
נ
ה
ר
 
ה
ש
ל
י
ש
י
 
ה
ד
ק
ל
 
ה
ו
א
 
ה
ה
ל
ך
 
ק
ד
מ
ת
 
א
ש
ו
ר
 
ו
ה
נ
ה
ר
 
ה
ר
ב
י
ע
י
 
ה
ו
א
 
פ
ר
ת
 
ו
י
ק
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ד
ם
 
ו
י
נ
י
ח
ה
ו
 
ב
ג
ן
 
ע
ד
ן
 
ל
ע
ב
ד
ה
 
ו
ל
ש
מ
ר
ה
 
ו
י
צ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ע
ל
 
ה
א
ד
ם
 
ל
א
מ
ר
 
מ
כ
ל
 
ע
ץ
 
ה
ג
ן
 
א
כ
ל
 
ת
א
כ
ל
 
ו
מ
ע
ץ
 
ה
ד
ע
ת
 
ט
ו
ב
 
ו
ר
ע
 
ל
א
 
ת
א
כ
ל
 
מ
מ
נ
ו
 
כ
י
 
ב
י
ו
ם
 
א
כ
ל
ך
 
מ
מ
נ
ו
 
מ
ו
ת
 
ת
מ
ו
ת
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ל
א
 
ט
ו
ב
 
ה
י
ו
ת
 
ה
א
ד
ם
 
ל
ב
ד
ו
 
א
ע
ש
ה
 
ל
ו
 
ע
ז
ר
 
כ
נ
ג
ד
ו
 
ו
י
צ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ע
ו
ד
 
מ
ן
 
ה
א
ד
מ
ה
 
א
ת
 
כ
ל
 
ח
י
ת
 
ה
ש
ד
ה
 
ו
א
ת
 
כ
ל
 
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
י
ב
א
 
א
ל
 
ה
א
ד
ם
 
ל
ר
א
ו
ת
 
מ
ה
 
י
ק
ר
א
 
ל
ו
 
ו
כ
ל
 
א
ש
ר
 
י
ק
ר
א
 
ל
ו
 
ה
א
ד
ם
 
נ
פ
ש
 
ח
י
ה
 
ה
ו
א
 
ש
מ
ו
 
ו
י
ק
ר
א
 
ה
א
ד
ם
 
ש
מ
ו
ת
 
ל
כ
ל
 
ה
ב
ה
מ
ה
 
ו
ל
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
ל
כ
ל
 
ח
י
ת
 
ה
ש
ד
ה
 
ו
ל
א
ד
ם
 
ל
א
 
מ
צ
א
 
ע
ז
ר
 
כ
נ
ג
ד
ו
 
ו
י
פ
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ת
ר
ד
מ
ה
 
ע
ל
 
ה
א
ד
ם
 
ו
י
י
ש
ן
 
ו
י
ק
ח
 
א
ח
ת
 
מ
צ
ל
ע
ת
י
ו
 
ו
י
ס
ג
ר
 
ב
ש
ר
 
ת
ח
ת
י
ה
 
ו
י
ב
ן
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
א
ת
 
ה
צ
ל
ע
 
א
ש
ר
 
ל
ק
ח
 
מ
ן
 
ה
א
ד
ם
 
ל
א
ש
ה
 
ו
י
ב
י
א
ה
 
א
ל
 
ה
א
ד
ם
 
ו
י
א
מ
ר
 
ה
א
ד
ם
 
ז
א
ת
 
ה
פ
ע
ם
 
ע
צ
ם
 
מ
ע
צ
מ
י
 
ו
ב
ש
ר
 
מ
ב
ש
ר
י
 
ל
ז
א
ת
 
י
ק
ר
א
 
א
ש
ה
 
כ
י
 
מ
א
י
ש
ה
 
ל
ק
ח
ה
 
ז
א
ת
 
ע
ל
 
כ
ן
 
י
ע
ז
ב
 
א
י
ש
 
א
ת
 
א
ב
י
ו
 
ו
א
ת
 
א
מ
ו
 
ו
ד
ב
ק
 
ב
א
ש
ת
ו
 
ו
ה
י
ה
 
מ
ש
נ
י
ה
ם
 
ל
ב
ש
ר
 
א
ח
ד
 
ו
י
ה
י
ו
 
ש
נ
י
ה
ם
 
ע
ר
מ
י
ם
 
א
ד
ם
 
ו
א
ש
ת
ו
 
ו
ל
א
 
י
ת
ב
ש
ש
ו
 
ו
ה
נ
ח
ש
 
ה
י
ה
 
ע
ר
ו
ם
 
מ
כ
ל
 
ח
י
ת
 
ה
ש
ד
ה
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
א
ל
 
ה
א
ש
ה
 
א
ף
 
כ
י
 
א
מ
ר
 
א
ל
ה
י
ם
 
ל
א
 
ת
א
כ
ל
ו
 
מ
כ
ל
 
ע
ץ
 
ה
ג
ן
 
ו
ת
א
מ
ר
 
ה
א
ש
ה
 
א
ל
 
ה
נ
ח
ש
 
מ
פ
ר
י
 
ע
ץ
 
ה
ג
ן
 
נ
א
כ
ל
 
ו
מ
פ
ר
י
 
ה
ע
ץ
 
ה
ז
ה
 
א
ש
ר
 
ב
ת
ו
ך
 
ה
ג
ן
 
א
מ
ר
 
א
ל
ה
י
ם
 
ל
א
 
ת
א
כ
ל
ו
 
מ
מ
נ
ו
 
ו
ל
א
 
ת
ג
ע
ו
 
ב
ו
 
פ
ן
 
ת
מ
ו
ת
ו
ן
 
ו
י
א
מ
ר
 
ה
נ
ח
ש
 
א
ל
 
ה
א
ש
ה
 
ל
א
 
מ
ו
ת
 
ת
מ
ו
ת
ו
ן
 
כ
י
 
י
ד
ע
 
א
ל
ה
י
ם
 
כ
י
 
ב
י
ו
ם
 
א
כ
ל
כ
ם
 
מ
מ
נ
ו
 
ו
נ
פ
ק
ח
ו
 
ע
י
נ
י
כ
ם
 
ו
ה
י
י
ת
ם
 
כ
א
ל
ה
י
ם
 
י
ד
ע
י
 
ט
ו
ב
 
ו
ר
ע
 
ו
ת
ר
א
 
ה
א
ש
ה
 
כ
י
 
ט
ו
ב
 
ה
ע
ץ
 
ל
מ
א
כ
ל
 
ו
כ
י
 
ת
א
ו
ה
 
ה
ו
א
 
ל
ע
י
נ
י
ם
 
ו
נ
ח
מ
ד
 
ה
ע
ץ
 
ל
ה
ש
כ
י
ל
 
ו
ת
ק
ח
 
מ
פ
ר
י
ו
 
ו
ת
א
כ
ל
 
ו
ת
ת
ן
 
ג
ם
 
ל
א
י
ש
ה
 
ע
מ
ה
 
ו
י
א
כ
ל
ו
 
ו
ת
פ
ק
ח
נ
ה
 
ע
י
נ
י
 
ש
נ
י
ה
ם
 
ו
י
ד
ע
ו
 
כ
י
 
ע
ר
מ
י
ם
 
ה
ם
 
ו
י
ת
פ
א
ר
ו
 
ע
ל
י
 
ת
א
נ
ה
 
ו
י
ע
ש
ו
 
ל
ה
ם
 
ח
ג
ר
ו
ת
 
ו
י
ש
מ
ע
ו
 
א
ת
 
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
מ
ת
ה
ל
ך
 
ב
ג
ן
 
ל
ר
ו
ח
 
ה
י
ו
ם
 
ו
י
ת
ח
ב
א
 
א
ד
ם
 
ו
א
ש
ת
ו
 
מ
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ב
ת
ו
ך
 
ע
ץ
 
ה
ג
ן
 
ו
י
ק
ר
א
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
א
ל
 
ה
א
ד
ם
 
ו
י
א
מ
ר
 
ל
ו
 
א
י
כ
ה
 
ו
י
א
מ
ר
 
א
ת
 
ק
ו
ל
ך
 
ש
מ
ע
ת
י
 
ב
ג
ן
 
ו
א
י
ר
א
 
כ
י
 
ע
ר
ו
ם
 
א
נ
כ
י
 
ו
א
ח
ב
א
 
ו
י
א
מ
ר
 
מ
י
 
ה
ג
י
ד
 
ל
ך
 
כ
י
 
ע
ר
ו
ם
 
א
ת
ה
 
ה
מ
ן
 
ה
ע
ץ
 
א
ש
ר
 
צ
ו
י
ת
י
ך
 
ל
ב
ל
ת
י
 
א
כ
ל
 
מ
מ
נ
ו
 
א
כ
ל
ת
 
ו
י
א
מ
ר
 
ה
א
ד
ם
 
ה
א
ש
ה
 
א
ש
ר
 
נ
ת
ת
ה
 
ע
מ
ד
י
 
ה
י
א
 
נ
ת
נ
ה
 
ל
י
 
מ
ן
 
ה
ע
ץ
 
ו
א
כ
ל
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ל
א
ש
ה
 
מ
ה
 
ז
א
ת
 
ע
ש
י
ת
י
 
ו
ת
א
מ
ר
 
ה
א
ש
ה
 
ה
נ
ח
ש
 
ה
ש
י
נ
י
 
ו
א
כ
ל
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
א
ל
 
ה
נ
ח
ש
 
כ
י
 
ע
ש
י
ת
 
ז
א
ת
 
א
ר
ו
ר
 
א
ת
ה
 
מ
כ
ל
 
ה
ב
ה
מ
ה
 
ו
מ
כ
ל
 
ח
י
ת
 
ה
ש
ד
ה
 
ע
ל
 
ג
ח
נ
ך
 
ת
ל
ך
 
ו
ע
פ
ר
 
ת
א
כ
ל
 
כ
ל
 
י
מ
י
 
ח
י
י
ך
 
ו
א
י
ב
ה
 
א
ש
י
ת
 
ב
י
נ
ך
 
ו
ב
י
ן
 
ה
א
ש
ה
 
ו
ב
י
ן
 
ז
ר
ע
ך
 
ו
ב
י
ן
 
ז
ר
ע
ה
 
ה
ו
א
 
י
ש
ו
פ
ך
 
ר
א
ש
 
ו
א
ת
ה
 
ת
ש
ו
פ
נ
ו
 
ע
ק
ב
 
ו
א
ל
 
ה
א
ש
ה
 
א
מ
ר
 
ה
ר
ב
ה
 
א
ר
ב
ה
 
ע
צ
ב
ו
נ
י
ך
 
ו
ה
ר
י
ו
נ
י
ך
 
ב
ע
צ
ב
ו
ן
 
ת
ל
ד
י
 
ב
נ
י
ם
 
ו
א
ל
 
א
י
ש
י
ך
 
ת
ש
ו
ק
ת
י
ך
 
ו
ה
ו
א
 
י
מ
ש
ל
 
ב
י
ך
 
ו
ל
א
ד
ם
 
א
מ
ר
 
כ
י
 
ש
מ
ע
ת
 
ל
ק
ו
ל
 
א
ש
ת
ך
 
ו
ת
א
כ
ל
 
מ
ן
 
ה
ע
ץ
 
א
ש
ר
 
צ
ו
י
ת
י
ך
 
ל
א
מ
ר
 
ל
א
 
ת
א
כ
ל
 
מ
מ
נ
ו
 
א
ר
ו
ר
ה
 
ה
א
ד
מ
ה
 
ב
ע
ב
ו
ר
ך
 
ב
ע
צ
ב
ו
ן
 
ת
א
כ
ל
נ
ה
 
כ
ל
 
י
מ
י
 
ח
י
י
ך
 
ו
ק
ו
ץ
 
ו
ד
ר
ד
ר
 
ת
צ
מ
י
ח
 
ל
ך
 
ו
א
כ
ל
ת
 
א
ת
 
ע
ש
ב
 
ה
ש
ד
ה
 
ב
ז
ע
ת
 
א
פ
י
ך
 
ת
א
כ
ל
 
ל
ח
ם
 
ע
ד
 
ש
ו
ב
ך
 
א
ל
 
ה
א
ד
מ
ה
 
כ
י
 
מ
מ
נ
ה
 
ל
ק
ח
ת
 
כ
י
 
ע
פ
ר
 
א
ת
ה
 
ו
א
ל
 
ע
פ
ר
ך
 
ת
ש
ו
ב
 
ו
י
ק
ר
א
 
ה
א
ד
ם
 
ש
ם
 
א
ש
ת
ו
 
ח
ו
ה
 
כ
י
 
ה
י
א
 
ה
י
ת
ה
 
א
ם
 
כ
ל
 
ח
י
 
ו
י
ע
ש
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ל
א
ד
ם
 
ו
ל
א
ש
ת
ו
 
כ
י
ת
נ
ו
ת
 
ע
ו
ר
 
ו
י
ל
ב
ש
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
ה
ן
 
ה
א
ד
ם
 
ה
י
ה
 
כ
א
ח
ד
 
מ
מ
נ
ו
 
ל
ד
ע
ת
 
ט
ו
ב
 
ו
ר
ע
 
ו
ע
ת
ה
 
פ
ן
 
י
ש
ל
ח
 
י
ד
ו
 
ו
ל
ק
ח
 
ג
ם
 
מ
ע
ץ
 
ה
ח
י
י
ם
 
ו
א
כ
ל
 
ו
ח
י
 
ל
ע
ו
ל
ם
 
ו
י
ש
ל
ח
ה
ו
 
י
ה
ו
ה
 
א
ל
ה
י
ם
 
מ
ג
ן
 
ע
ד
ן
 
ל
ע
ב
ד
 
א
ת
 
ה
א
ד
מ
ה
 
א
ש
ר
 
ל
ק
ח
 
מ
ש
ם
 
ו
י
ג
ר
ש
 
א
ת
 
ה
א
ד
ם
 
ו
י
ש
כ
ן
 
מ
ק
ד
ם
 
ל
ג
ן
 
ע
ד
ן
 
א
ת
 
ה
כ
ר
ו
ב
י
ם
 
ו
א
ת
 
ל
ח
ט
 
ה
ח
ר
ב
 
ה
מ
ת
ה
פ
כ
ת
 
ל
ש
מ
ר
 
א
ת
 
ד
ר
ך
 
ע
ץ
 
ה
ח
י
י
ם
 
ו
ה
א
ד
ם
 
י
ד
ע
 
א
ת
 
ח
ו
ה
 
א
ש
ת
ו
 
ו
ת
ה
ר
 
ו
ת
ל
ד
 
א
ת
 
ק
י
ן
 
ו
ת
א
מ
ר
 
ק
נ
י
ת
י
 
א
י
ש
 
א
ת
 
י
ה
ו
ה
 
ו
ת
ס
ף
 
ל
ל
ד
ת
 
א
ת
 
א
ח
י
ו
 
א
ת
 
ה
ב
ל
 
ו
י
ה
י
 
ה
ב
ל
 
ר
ע
י
 
צ
א
ן
 
ו
ק
י
ן
 
ה
י
ה
 
ע
ב
ד
 
א
ד
מ
ה
 
ו
י
ה
י
 
מ
ק
ץ
 
י
מ
י
ם
 
ו
י
ב
א
 
ק
י
ן
 
מ
פ
ר
י
 
ה
א
ד
מ
ה
 
מ
נ
ח
ה
 
ל
י
ה
ו
ה
 
ו
ה
ב
ל
 
ה
ב
י
א
 
ג
ם
 
ה
ו
א
 
מ
ב
כ
ו
ר
ו
ת
 
צ
א
נ
ו
 
ו
מ
ח
ל
ב
י
ה
ן
 
ו
י
ש
ע
 
י
ה
ו
ה
 
א
ל
 
ה
ב
ל
 
ו
א
ל
 
מ
נ
ח
ת
ו
 
ו
א
ל
 
ק
י
ן
 
ו
א
ל
 
מ
נ
ח
ת
ו
 
ל
א
 
ש
ע
ה
 
ו
י
ח
ר
 
ל
ק
י
ן
 
מ
א
ד
 
ו
י
פ
ל
ו
 
פ
נ
י
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
ק
י
ן
 
ל
מ
ה
 
ח
ר
ה
 
ל
ך
 
ו
ל
מ
ה
 
נ
פ
ל
ו
 
פ
נ
י
ך
 
ה
ל
ו
א
 
א
ם
 
ת
ט
י
ב
 
ש
א
ת
 
ו
א
ם
 
ל
א
 
ת
ט
י
ב
 
ל
פ
ת
ח
 
ח
ט
א
ת
 
ר
ב
ץ
 
ו
א
ל
י
ך
 
ת
ש
ו
ק
ת
ו
 
ו
א
ת
ה
 
ת
מ
ש
ל
 
ב
ו
 
ו
י
א
מ
ר
 
ק
י
ן
 
א
ל
 
ה
ב
ל
 
א
ח
י
ו
 
נ
ל
כ
ה
 
ה
ש
ד
ה
 
ו
י
ה
י
 
ב
ה
י
ו
ת
ם
 
ב
ש
ד
ה
 
ו
י
ק
ם
 
ק
י
ן
 
א
ל
 
ה
ב
ל
 
א
ח
י
ו
 
ו
י
ה
ר
ג
ה
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
ק
י
ן
 
א
י
ה
 
ה
ב
ל
 
א
ח
י
ך
 
ו
י
א
מ
ר
 
ל
א
 
י
ד
ע
ת
י
 
ה
ש
מ
ר
 
א
ח
י
 
א
נ
כ
י
 
ו
י
א
מ
ר
 
מ
ה
 
ע
ש
י
ת
 
ק
ו
ל
 
ד
ם
 
א
ח
י
ך
 
צ
ע
ק
 
א
ל
י
 
מ
ן
 
ה
א
ד
מ
ה
 
ו
ע
ת
ה
 
א
ר
ו
ר
 
א
ת
ה
 
מ
ן
 
ה
א
ד
מ
ה
 
א
ש
ר
 
פ
צ
ת
ה
 
א
ת
 
פ
י
ה
 
ל
ק
ח
ת
 
א
ת
 
ד
ם
 
א
ח
י
ך
 
מ
י
ד
ך
 
כ
י
 
ת
ע
ב
ד
 
א
ת
 
ה
א
ד
מ
ה
 
ל
א
 
ת
ו
ס
י
ף
 
ת
ת
 
כ
ח
ה
 
ל
ך
 
נ
ע
 
ו
נ
ד
 
ת
ה
י
ה
 
ב
א
ר
ץ
 
ו
י
א
מ
ר
 
ק
י
ן
 
א
ל
 
י
ה
ו
ה
 
ג
ד
ו
ל
 
ע
ו
נ
י
 
מ
נ
ש
א
 
ה
ן
 
ג
ר
ש
ת
 
א
ת
י
 
ה
י
ו
ם
 
מ
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
מ
פ
נ
י
ך
 
א
ס
ת
י
ר
 
ו
ה
י
י
ת
י
 
נ
ע
 
ו
נ
ד
 
ב
א
ר
ץ
 
ו
ה
י
ה
 
כ
ל
 
מ
צ
א
י
 
י
ה
ר
ג
נ
י
 
ו
י
א
מ
ר
 
ל
ו
 
י
ה
ו
ה
 
ל
כ
ן
 
כ
ל
 
ה
ר
ג
 
ק
י
ן
 
ש
ב
ע
ת
י
ם
 
י
ק
ם
 
ו
י
ש
ם
 
י
ה
ו
ה
 
ל
ק
י
ן
 
א
ו
ת
 
ל
ב
ל
ת
י
 
ה
כ
ו
ת
 
א
ת
ו
 
כ
ל
 
מ
צ
א
ו
 
ו
י
צ
א
 
ק
י
ן
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ש
ב
 
ב
א
ר
ץ
 
נ
ד
 
ק
ד
מ
ת
 
ע
ד
ן
 
ו
י
ד
ע
 
ק
י
ן
 
א
ת
 
א
ש
ת
ו
 
ו
ת
ה
ר
 
ו
ת
ל
ד
 
א
ת
 
ח
נ
ו
ך
 
ו
י
ה
י
 
ב
נ
ה
 
ע
י
ר
 
ו
י
ק
ר
א
 
א
ת
 
ש
ם
 
ה
ע
י
ר
 
כ
ש
ם
 
ב
נ
ו
 
ח
נ
ו
ך
 
ו
י
ו
ל
ד
 
ל
ח
נ
ו
ך
 
א
ת
 
ע
י
ר
ד
 
ו
ע
י
ר
ד
 
י
ל
ד
 
א
ת
 
מ
י
ה
א
ל
 
ו
מ
י
ה
א
ל
 
י
ל
ד
 
א
ת
 
מ
ת
ו
ש
א
ל
 
ו
מ
ת
ו
ש
א
ל
 
י
ל
ד
 
א
ת
 
ל
מ
ך
 
ו
י
ק
ח
 
ל
ו
 
ל
מ
ך
 
ש
ת
י
 
נ
ש
י
ם
 
ש
ם
 
ה
א
ח
ת
 
ע
ד
ה
 
ו
ש
ם
 
ה
ש
נ
י
ת
 
צ
ל
ה
 
ו
ת
ל
ד
 
ע
ד
ה
 
א
ת
 
י
ב
ל
 
ה
ו
א
 
ה
י
ה
 
א
ב
י
 
י
ש
ב
 
א
ה
ל
 
ו
מ
ק
נ
ה
 
ו
ש
ם
 
א
ח
י
ו
 
י
ו
ב
ל
 
ה
ו
א
 
ה
י
ה
 
א
ב
י
 
כ
ל
 
ת
פ
ש
 
כ
נ
ר
 
ו
ע
ג
ב
 
ו
צ
ל
ה
 
ג
ם
 
ה
י
א
 
י
ל
ד
ה
 
א
ת
 
ת
ו
ב
ל
 
ק
י
ן
 
ל
ט
ש
 
כ
ל
 
ח
ר
ש
 
נ
ח
ש
ת
 
ו
ב
ר
ז
ל
 
ו
א
ח
ו
ת
 
ת
ו
ב
ל
 
ק
י
ן
 
נ
ע
מ
ה
 
ו
י
א
מ
ר
 
ל
מ
ך
 
ל
נ
ש
י
ו
 
ע
ד
ה
 
ו
צ
ל
ה
 
ש
מ
ע
ן
 
ק
ו
ל
י
 
נ
ש
י
 
ל
מ
ך
 
ה
א
ז
י
נ
ה
 
א
מ
י
ר
ת
י
 
כ
י
 
א
י
ש
 
ה
ר
ג
ת
י
 
ל
פ
צ
ע
י
 
ו
י
ל
ד
 
ל
ח
ב
ר
ת
י
 
כ
י
 
ש
ב
ע
ת
י
ם
 
י
ק
ם
 
ק
י
ן
 
ו
ל
מ
ך
 
ש
ב
ע
י
ם
 
ו
ש
ב
ע
ה
 
ו
י
ד
ע
 
א
ד
ם
 
ע
ו
ד
 
א
ת
 
א
ש
ת
ו
 
ו
ת
ל
ד
 
ב
ן
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ש
ת
 
כ
י
 
ש
ת
 
ל
י
 
א
ל
ה
י
ם
 
ז
ר
ע
 
א
ח
ר
 
ת
ח
ת
 
ה
ב
ל
 
כ
י
 
ה
ר
ג
ו
 
ק
י
ן
 
ו
ל
ש
ת
 
ג
ם
 
ה
ו
א
 
י
ל
ד
 
ב
ן
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ו
 
א
נ
ו
ש
 
א
ז
 
ה
ח
ל
 
ל
ק
ר
א
 
ב
ש
ם
 
י
ה
ו
ה
 
ז
ה
 
ס
פ
ר
 
ת
ו
ל
ד
ת
 
א
ד
ם
 
ב
י
ו
ם
 
ב
ר
א
 
א
ל
ה
י
ם
 
א
ד
ם
 
ב
ד
מ
ו
ת
 
א
ל
ה
י
ם
 
ע
ש
ה
 
א
ת
ו
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ב
ר
א
ם
 
ו
י
ב
ר
ך
 
א
ת
ם
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ם
 
א
ד
ם
 
ב
י
ו
ם
 
ה
ב
ר
א
ם
 
ו
י
ח
י
 
א
ד
ם
 
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
ד
מ
ו
ת
ו
 
כ
צ
ל
מ
ו
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ש
ת
 
ו
י
ה
י
ו
 
י
מ
י
 
א
ד
ם
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ש
ת
 
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
א
ד
ם
 
א
ש
ר
 
ח
י
 
ת
ש
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ש
ת
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
א
נ
ו
ש
 
ו
י
ח
י
 
ש
ת
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
א
נ
ו
ש
 
ש
ב
ע
 
ש
נ
י
ם
 
ו
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ש
ת
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ש
נ
ה
 
ו
ת
ש
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
א
נ
ו
ש
 
ת
ש
ע
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ק
י
נ
ן
 
ו
י
ח
י
 
א
נ
ו
ש
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ק
י
נ
ן
 
ח
מ
ש
 
ע
ש
ר
ה
 
ש
נ
ה
 
ו
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
א
נ
ו
ש
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
ת
ש
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ק
י
נ
ן
 
ש
ב
ע
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
מ
ה
ל
ל
א
ל
 
ו
י
ח
י
 
ק
י
נ
ן
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
מ
ה
ל
ל
א
ל
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ק
י
נ
ן
 
ע
ש
ר
 
ש
נ
י
ם
 
ו
ת
ש
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
מ
ה
ל
ל
א
ל
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
ש
ש
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
י
ר
ד
 
ו
י
ח
י
 
מ
ה
ל
ל
א
ל
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
י
ר
ד
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
מ
ה
ל
ל
א
ל
 
ח
מ
ש
 
ו
ת
ש
ע
י
ם
 
ש
נ
ה
 
ו
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
י
ר
ד
 
ש
ת
י
ם
 
ו
ש
ש
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ח
נ
ו
ך
 
ו
י
ח
י
 
י
ר
ד
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ח
נ
ו
ך
 
ח
מ
ש
 
ו
ש
מ
נ
י
ם
 
ש
נ
ה
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
י
ר
ד
 
ש
ב
ע
 
ו
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
ש
מ
נ
ה
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ח
נ
ו
ך
 
ח
מ
ש
 
ו
ש
ש
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
מ
ת
ו
ש
ל
ח
 
ו
י
ת
ה
ל
ך
 
ח
נ
ו
ך
 
א
ת
 
ה
א
ל
ה
י
ם
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
מ
ת
ו
ש
ל
ח
 
ש
ל
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ח
נ
ו
ך
 
ח
מ
ש
 
ו
ש
ש
י
ם
 
ש
נ
ה
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ת
ה
ל
ך
 
ח
נ
ו
ך
 
א
ת
 
ה
א
ל
ה
י
ם
 
ו
א
י
נ
נ
ו
 
כ
י
 
ל
ק
ח
 
א
ת
ו
 
א
ל
ה
י
ם
 
ו
י
ח
י
 
מ
ת
ו
ש
ל
ח
 
ש
ב
ע
 
ו
ש
ש
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ל
מ
ך
 
ו
י
ח
י
 
מ
ת
ו
ש
ל
ח
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ל
מ
ך
 
ש
ל
ש
 
ו
ח
מ
ש
י
ם
 
ש
נ
ה
 
ו
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
מ
ת
ו
ש
ל
ח
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ל
מ
ך
 
ש
ל
ש
 
ו
ח
מ
ש
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
ן
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ו
 
נ
ח
 
ל
א
מ
ר
 
ז
ה
 
י
נ
ח
מ
נ
ו
 
מ
מ
ע
ש
י
נ
ו
 
ו
מ
ע
צ
ב
ו
ן
 
י
ד
י
נ
ו
 
מ
ן
 
ה
א
ד
מ
ה
 
א
ש
ר
 
א
ר
ר
ה
 
י
ה
ו
ה
 
ו
י
ח
י
 
ל
מ
ך
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
נ
ח
 
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ל
מ
ך
 
ש
ל
ש
 
ו
ח
מ
ש
י
ם
 
ש
נ
ה
 
ו
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ה
י
 
נ
ח
 
ב
ן
 
ח
מ
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ש
ם
 
ו
א
ת
 
ח
ם
 
ו
א
ת
 
י
פ
ת
 
ו
י
ה
י
 
כ
י
 
ה
ח
ל
 
ה
א
ד
ם
 
ל
ר
ב
 
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
ב
נ
ו
ת
 
י
ל
ד
ו
 
ל
ה
ם
 
ו
י
ר
א
ו
 
ב
נ
י
 
ה
א
ל
ה
י
ם
 
א
ת
 
ב
נ
ו
ת
 
ה
א
ד
ם
 
כ
י
 
ט
ו
ב
ו
ת
 
ה
נ
ה
 
ו
י
ק
ח
ו
 
ל
ה
ם
 
נ
ש
י
ם
 
מ
כ
ל
 
א
ש
ר
 
ב
ח
ר
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ל
א
 
י
ד
ו
ן
 
ר
ו
ח
י
 
ב
א
ד
ם
 
ל
ע
ו
ל
ם
 
ב
ש
ג
ם
 
ה
ו
א
 
ב
ש
ר
 
ו
ה
י
ו
 
י
מ
י
ו
 
מ
א
ה
 
ו
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
ה
נ
פ
ל
י
ם
 
ה
י
ו
 
ב
א
ר
ץ
 
ב
י
מ
י
ם
 
ה
ה
ם
 
ו
ג
ם
 
א
ח
ר
י
 
כ
ן
 
א
ש
ר
 
י
ב
א
ו
 
ב
נ
י
 
ה
א
ל
ה
י
ם
 
א
ל
 
ב
נ
ו
ת
 
ה
א
ד
ם
 
ו
י
ו
ל
י
ד
ו
 
ל
ה
ם
 
ה
ם
 
ה
ג
ב
ו
ר
י
ם
 
א
ש
ר
 
מ
ע
ו
ל
ם
 
א
נ
ש
י
 
ה
ש
ם
 
ו
י
ר
א
 
י
ה
ו
ה
 
כ
י
 
ר
ב
ה
 
ר
ע
ת
 
ה
א
ד
ם
 
ב
א
ר
ץ
 
ו
כ
ל
 
י
צ
ר
 
מ
ח
ש
ב
ו
ת
 
ל
ב
ו
 
ר
ק
 
ר
ע
 
כ
ל
 
ה
י
ו
ם
 
ו
י
נ
ח
ם
 
י
ה
ו
ה
 
כ
י
 
ע
ש
ה
 
א
ת
 
ה
א
ד
ם
 
ב
א
ר
ץ
 
ו
י
ת
ע
צ
ב
 
א
ל
 
ל
ב
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
מ
ח
ה
 
א
ת
 
ה
א
ד
ם
 
א
ש
ר
 
ב
ר
א
ת
י
 
מ
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
מ
א
ד
ם
 
ע
ד
 
ב
ה
מ
ה
 
ע
ד
 
ר
מ
ש
 
ע
ד
 
ע
ו
ף
 
ה
ש
מ
י
ם
 
כ
י
 
נ
ח
מ
ת
י
 
כ
י
 
ע
ש
י
ת
י
ם
 
ו
נ
ח
 
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
 
ת
ו
ל
ד
ת
 
נ
ח
 
נ
ח
 
א
י
ש
 
צ
ד
י
ק
 
ו
ת
מ
י
ם
 
ה
י
ה
 
ב
ד
ר
ת
י
ו
 
א
ת
 
ה
א
ל
ה
י
ם
 
ה
ת
ה
ל
ך
 
נ
ח
 
ו
י
ו
ל
י
ד
 
נ
ח
 
ש
ל
ש
ה
 
ב
נ
י
ם
 
א
ת
 
ש
ם
 
ו
א
ת
 
ח
ם
 
ו
א
ת
 
י
פ
ת
 
ו
ת
ש
ח
ת
 
ה
א
ר
ץ
 
ל
פ
נ
י
 
ה
א
ל
ה
י
ם
 
ו
ת
מ
ל
א
 
ה
א
ר
ץ
 
ח
מ
ס
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ר
ץ
 
ו
ה
נ
ה
 
נ
ש
ח
ת
ה
 
כ
י
 
ה
ש
ח
י
ת
 
כ
ל
 
ב
ש
ר
 
א
ת
 
ד
ר
כ
ו
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
ל
נ
ח
 
ק
ץ
 
כ
ל
 
ב
ש
ר
 
ב
א
 
ל
פ
נ
י
 
כ
י
 
מ
ל
א
ה
 
ה
א
ר
ץ
 
ח
מ
ס
 
מ
פ
נ
י
ה
ם
 
ו
ה
נ
נ
י
 
מ
ש
ח
י
ת
י
ם
 
א
ת
 
ה
א
ר
ץ
 
ע
ש
ה
 
ל
ך
 
ת
ב
ת
 
ע
צ
י
 
ג
פ
ר
 
ק
נ
י
ם
 
ת
ע
ש
ה
 
א
ת
 
ה
ת
ב
ה
 
ו
כ
פ
ר
ת
 
א
ת
ה
 
מ
ב
י
ת
 
ו
מ
ח
ו
ץ
 
ב
כ
פ
ר
 
ו
ז
ה
 
א
ש
ר
 
ת
ע
ש
ה
 
א
ת
ה
 
ש
ל
ש
 
מ
א
ו
ת
 
א
מ
ה
 
א
ר
ך
 
ה
ת
ב
ה
 
ו
ח
מ
ש
י
ם
 
א
מ
ה
 
ר
ח
ב
ה
 
ו
ש
ל
ש
י
ם
 
א
מ
ה
 
ק
ו
מ
ת
ה
 
צ
ה
ר
 
ת
ע
ש
ה
 
ל
ת
ב
ה
 
ו
ע
ל
 
א
מ
ה
 
ת
כ
ל
נ
ה
 
מ
ל
מ
ע
ל
ה
 
ו
פ
ת
ח
 
ה
ת
ב
ה
 
ב
צ
ד
ה
 
ת
ש
י
ם
 
ת
ח
ת
י
ם
 
ש
נ
י
ם
 
ו
ש
ל
י
ש
י
ם
 
ת
ע
ש
ה
 
ו
א
נ
י
 
ה
נ
נ
י
 
מ
ב
י
א
 
א
ת
 
ה
מ
ב
ו
ל
 
מ
י
ם
 
ע
ל
 
ה
א
ר
ץ
 
ל
ה
ש
ח
י
ת
 
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
ב
ו
 
ר
ו
ח
 
ח
י
י
ם
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
כ
ל
 
א
ש
ר
 
ב
א
ר
ץ
 
י
ג
ו
ע
 
ו
ה
ק
מ
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
א
ת
ך
 
ו
ב
א
ת
 
א
ל
 
ה
ת
ב
ה
 
א
ת
ה
 
ו
ב
נ
י
ך
 
ו
א
ש
ת
ך
 
ו
נ
ש
י
 
ב
נ
י
ך
 
א
ת
ך
 
ו
מ
כ
ל
 
ה
ח
י
ה
 
ו
מ
כ
ל
 
ה
ב
ש
ר
 
ש
נ
י
ם
 
מ
כ
ל
 
ת
ב
י
א
 
א
ל
 
ה
ת
ב
ה
 
ל
ה
ח
י
ו
ת
 
א
ת
ך
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ו
ה
י
ה
 
מ
ן
 
ה
ע
ו
ף
 
ל
מ
י
נ
ה
ו
 
ו
מ
ן
 
ה
ב
ה
מ
ה
 
ל
מ
י
נ
ה
 
ו
מ
כ
ל
 
א
ש
ר
 
ר
מ
ש
 
ע
ל
 
ה
א
ד
מ
ה
 
ל
מ
י
נ
י
ה
ם
 
ש
נ
י
ם
 
מ
כ
ל
 
י
ב
א
ו
 
א
ל
י
ך
 
ל
ה
ח
י
ו
ת
 
ו
א
ת
ה
 
ק
ח
 
ל
ך
 
מ
כ
ל
 
מ
א
כ
ל
 
א
ש
ר
 
י
א
כ
ל
 
ו
א
ס
פ
ת
 
א
ל
י
ך
 
ו
ה
י
ה
 
ל
ך
 
ו
ל
ה
ם
 
ל
א
כ
ל
ה
 
ו
י
ע
ש
 
נ
ח
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
א
ת
ו
 
א
ל
ה
י
ם
 
כ
ן
 
ע
ש
ה
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
נ
ח
 
ב
א
 
א
ת
ה
 
ו
כ
ל
 
ב
י
ת
ך
 
א
ל
 
ה
ת
ב
ה
 
כ
י
 
א
ת
ך
 
ר
א
י
ת
י
 
צ
ד
י
ק
 
ל
פ
נ
י
 
ב
ד
ו
ר
 
ה
ז
ה
 
מ
כ
ל
 
ה
ב
ה
מ
ה
 
ה
ט
ה
ר
ה
 
ת
ק
ח
 
ל
ך
 
ש
ב
ע
ה
 
ש
ב
ע
ה
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ו
מ
ן
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
ל
א
 
ט
ה
ר
ה
 
ה
י
א
 
ש
נ
י
ם
 
ש
נ
י
ם
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ו
ג
ם
 
מ
ע
ו
ף
 
ה
ש
מ
י
ם
 
ה
ט
ה
ו
ר
 
ש
ב
ע
ה
 
ש
ב
ע
ה
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ל
ה
ח
י
ו
ת
 
ז
ר
ע
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
כ
י
 
ל
י
מ
י
ם
 
ע
ו
ד
 
ש
ב
ע
ה
 
א
נ
כ
י
 
מ
מ
ט
י
ר
 
ע
ל
 
ה
א
ר
ץ
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ו
מ
ח
י
ת
י
 
א
ת
 
כ
ל
 
ה
י
ק
ו
ם
 
א
ש
ר
 
ע
ש
י
ת
י
 
מ
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
י
ע
ש
 
נ
ח
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
ו
 
י
ה
ו
ה
 
ו
נ
ח
 
ב
ן
 
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
ה
מ
ב
ו
ל
 
ה
י
ה
 
מ
י
ם
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ב
א
 
נ
ח
 
ו
ב
נ
י
ו
 
ו
א
ש
ת
ו
 
ו
נ
ש
י
 
ב
נ
י
ו
 
א
ת
ו
 
א
ל
 
ה
ת
ב
ה
 
מ
פ
נ
י
 
מ
י
 
ה
מ
ב
ו
ל
 
מ
ן
 
ה
ב
ה
מ
ה
 
ה
ט
ה
ר
ה
 
ו
מ
ן
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
א
י
נ
נ
ה
 
ט
ה
ר
ה
 
ו
מ
ן
 
ה
ע
ו
ף
 
ו
מ
כ
ל
 
א
ש
ר
 
ר
מ
ש
 
ע
ל
 
ה
א
ד
מ
ה
 
ש
נ
י
ם
 
ש
נ
י
ם
 
ב
א
ו
 
א
ל
 
נ
ח
 
א
ל
 
ה
ת
ב
ה
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
נ
ח
 
ו
י
ה
י
 
ל
ש
ב
ע
ת
 
ה
י
מ
י
ם
 
ו
מ
י
 
ה
מ
ב
ו
ל
 
ה
י
ו
 
ע
ל
 
ה
א
ר
ץ
 
ב
ש
נ
ת
 
ה
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ל
ח
י
י
 
נ
ח
 
ב
ח
ד
ש
 
ה
ש
נ
י
 
ב
ש
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ב
י
ו
ם
 
ה
ז
ה
 
נ
ב
ק
ע
ו
 
כ
ל
 
מ
ע
י
נ
ו
ת
 
ת
ה
ו
ם
 
ר
ב
ה
 
ו
א
ר
ב
ו
ת
 
ה
ש
מ
י
ם
 
נ
פ
ת
ח
ו
 
ו
י
ה
י
 
ה
ג
ש
ם
 
ע
ל
 
ה
א
ר
ץ
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ב
א
 
נ
ח
 
ש
ם
 
ח
ם
 
ו
י
פ
ת
 
ב
נ
י
 
נ
ח
 
ו
א
ש
ת
 
נ
ח
 
ו
ש
ל
ש
ת
 
נ
ש
י
 
ב
נ
י
ו
 
א
ת
ם
 
א
ל
 
ה
ת
ב
ה
 
ה
ם
 
ו
כ
ל
 
ה
ח
י
ה
 
ל
מ
י
נ
ה
 
ו
כ
ל
 
ה
ב
ה
מ
ה
 
ל
מ
י
נ
ה
 
ו
כ
ל
 
ה
ר
מ
ש
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
ל
מ
י
נ
ה
ו
 
ו
כ
ל
 
ה
ע
ו
ף
 
ל
מ
י
נ
ה
ו
 
כ
ל
 
צ
פ
ו
ר
 
כ
ל
 
כ
נ
ף
 
ו
י
ב
א
ו
 
א
ל
 
נ
ח
 
א
ל
 
ה
ת
ב
ה
 
ש
נ
י
ם
 
ש
נ
י
ם
 
מ
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
ב
ו
 
ר
ו
ח
 
ח
י
י
ם
 
ו
ה
ב
א
י
ם
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
ז
כ
ר
 
ו
נ
ק
ב
ה
 
מ
כ
ל
 
ב
ש
ר
 
ב
א
ו
 
כ
א
ש
ר
 
צ
ו
ה
 
א
ת
ו
 
א
ל
ה
י
ם
 
ו
י
ס
ג
ר
 
י
ה
ו
ה
 
ב
ע
ד
ו
 
ו
י
ה
י
 
ה
מ
ב
ו
ל
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ר
ב
ו
 
ה
מ
י
ם
 
ו
י
ש
א
ו
 
א
ת
 
ה
ת
ב
ה
 
ו
ת
ר
ם
 
מ
ע
ל
 
ה
א
ר
ץ
 
ו
י
ג
ב
ר
ו
 
ה
מ
י
ם
 
ו
י
ר
ב
ו
 
מ
א
ד
 
ע
ל
 
ה
א
ר
ץ
 
ו
ת
ל
ך
 
ה
ת
ב
ה
 
ע
ל
 
פ
נ
י
 
ה
מ
י
ם
 
ו
ה
מ
י
ם
 
ג
ב
ר
ו
 
מ
א
ד
 
מ
א
ד
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
כ
ס
ו
 
כ
ל
 
ה
ה
ר
י
ם
 
ה
ג
ב
ח
י
ם
 
א
ש
ר
 
ת
ח
ת
 
כ
ל
 
ה
ש
מ
י
ם
 
ח
מ
ש
 
ע
ש
ר
ה
 
א
מ
ה
 
מ
ל
מ
ע
ל
ה
 
ג
ב
ר
ו
 
ה
מ
י
ם
 
ו
י
כ
ס
ו
 
ה
ה
ר
י
ם
 
ו
י
ג
ו
ע
 
כ
ל
 
ב
ש
ר
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
ב
ע
ו
ף
 
ו
ב
ב
ה
מ
ה
 
ו
ב
ח
י
ה
 
ו
ב
כ
ל
 
ה
ש
ר
ץ
 
ה
ש
ר
ץ
 
ע
ל
 
ה
א
ר
ץ
 
ו
כ
ל
 
ה
א
ד
ם
 
כ
ל
 
א
ש
ר
 
נ
ש
מ
ת
 
ר
ו
ח
 
ח
י
י
ם
 
ב
א
פ
י
ו
 
מ
כ
ל
 
א
ש
ר
 
ב
ח
ר
ב
ה
 
מ
ת
ו
 
ו
י
מ
ח
 
א
ת
 
כ
ל
 
ה
י
ק
ו
ם
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
מ
א
ד
ם
 
ע
ד
 
ב
ה
מ
ה
 
ע
ד
 
ר
מ
ש
 
ע
ד
 
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
י
מ
ח
ו
 
מ
ן
 
ה
א
ר
ץ
 
ו
י
ש
א
ר
 
א
ך
 
נ
ח
 
ו
א
ש
ר
 
א
ת
ו
 
ב
ת
ב
ה
 
ו
י
ג
ב
ר
ו
 
ה
מ
י
ם
 
ע
ל
 
ה
א
ר
ץ
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
 
י
ו
ם
 
ו
י
ז
כ
ר
 
א
ל
ה
י
ם
 
א
ת
 
נ
ח
 
ו
א
ת
 
כ
ל
 
ה
ח
י
ה
 
ו
א
ת
 
כ
ל
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
א
ת
ו
 
ב
ת
ב
ה
 
ו
י
ע
ב
ר
 
א
ל
ה
י
ם
 
ר
ו
ח
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ש
כ
ו
 
ה
מ
י
ם
 
ו
י
ס
כ
ר
ו
 
מ
ע
י
נ
ו
ת
 
ת
ה
ו
ם
 
ו
א
ר
ב
ו
ת
 
ה
ש
מ
י
ם
 
ו
י
כ
ל
 
ה
ג
ש
ם
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
י
ש
ב
ו
 
ה
מ
י
ם
 
מ
ע
ל
 
ה
א
ר
ץ
 
ה
ל
כ
ו
 
ו
ש
ב
ו
 
ו
י
ח
ס
ר
ו
 
ה
מ
י
ם
 
מ
ק
ץ
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
 
י
ו
ם
 
ו
ת
נ
ח
 
ה
ת
ב
ה
 
ב
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ב
ש
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ע
ל
 
ה
ר
י
 
ה
ר
ר
ט
 
ו
ה
מ
י
ם
 
ה
י
ו
 
ה
ל
כ
ו
 
ו
ח
ס
ר
ו
 
ע
ד
 
ח
ד
ש
 
ה
ע
ש
י
ר
י
 
ב
ע
ש
י
ר
י
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
נ
ר
א
ו
 
ר
א
ש
י
 
ה
ה
ר
י
ם
 
ו
י
ה
י
 
מ
ק
ץ
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
י
פ
ת
ח
 
נ
ח
 
א
ת
 
ח
ל
ו
ן
 
ה
ת
ב
ה
 
א
ש
ר
 
ע
ש
ה
 
ו
י
ש
ל
ח
 
א
ת
 
ה
ע
ר
ב
 
ו
י
צ
א
 
י
צ
א
 
ו
ש
ב
 
ע
ד
 
י
ב
ש
ת
 
ה
מ
י
ם
 
מ
ע
ל
 
ה
א
ר
ץ
 
ו
י
ש
ל
ח
 
א
ת
 
ה
י
ו
נ
ה
 
מ
א
ת
ו
 
ל
ר
א
ו
ת
 
ה
ק
ל
ו
 
ה
מ
י
ם
 
מ
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
ל
א
 
מ
צ
א
 
ה
י
ו
נ
ה
 
מ
נ
ו
ח
 
ל
כ
ף
 
ר
ג
ל
ה
 
ו
ת
ש
ב
 
א
ל
י
ו
 
א
ל
 
ה
ת
ב
ה
 
כ
י
 
מ
י
ם
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
ו
י
ש
ל
ח
 
א
ת
 
י
ד
ו
 
ו
י
ק
ח
ה
 
ו
י
ב
א
 
א
ת
ה
 
א
ל
י
ו
 
א
ל
 
ה
ת
ב
ה
 
ו
י
ח
ל
 
ע
ו
ד
 
ש
ב
ע
ת
 
י
מ
י
ם
 
א
ח
ר
י
ם
 
ו
י
ס
ף
 
ש
ל
ח
 
א
ת
 
ה
י
ו
נ
ה
 
מ
ן
 
ה
ת
ב
ה
 
ו
ת
ב
א
 
א
ל
י
ו
 
ה
י
ו
נ
ה
 
ל
ע
ת
 
ע
ר
ב
 
ו
ה
נ
ה
 
ע
ל
י
 
ז
י
ת
 
ט
ר
ף
 
ב
פ
י
ה
 
ו
י
ד
ע
 
נ
ח
 
כ
י
 
ק
ל
ו
 
ה
מ
י
ם
 
מ
ע
ל
 
ה
א
ר
ץ
 
ו
י
ח
ל
 
ע
ו
ד
 
ש
ב
ע
ת
 
י
מ
י
ם
 
א
ח
ר
י
ם
 
ו
י
ש
ל
ח
 
א
ת
 
ה
י
ו
נ
ה
 
ו
ל
א
 
י
ס
פ
ה
 
ש
ו
ב
ה
 
א
ל
י
ו
 
ע
ו
ד
 
ו
י
ה
י
 
ב
א
ח
ת
 
ו
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ב
ר
א
י
ש
ו
ן
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ח
ר
ב
ו
 
ה
מ
י
ם
 
מ
ע
ל
 
ה
א
ר
ץ
 
ו
י
ס
ר
 
נ
ח
 
א
ת
 
מ
כ
ס
ה
 
ה
ת
ב
ה
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ח
ר
ב
ו
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
ב
ח
ד
ש
 
ה
ש
נ
י
 
ב
ש
ב
ע
ה
 
ו
ע
ש
ר
י
ם
 
י
ו
ם
 
ל
ח
ד
ש
 
י
ב
ש
ה
 
ה
א
ר
ץ
 
ו
י
ד
ב
ר
 
א
ל
ה
י
ם
 
א
ל
 
נ
ח
 
ל
א
מ
ר
 
צ
א
 
מ
ן
 
ה
ת
ב
ה
 
א
ת
ה
 
ו
א
ש
ת
ך
 
ו
ב
נ
י
ך
 
ו
נ
ש
י
 
ב
נ
י
ך
 
א
ת
ך
 
ו
כ
ל
 
ה
ח
י
ה
 
א
ש
ר
 
א
ת
ך
 
מ
כ
ל
 
ב
ש
ר
 
ב
ע
ו
ף
 
ו
ב
ב
ה
מ
ה
 
ו
ב
כ
ל
 
ה
ר
מ
ש
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
ה
ו
צ
י
א
 
א
ת
ך
 
ו
ש
ר
צ
ו
 
ב
א
ר
ץ
 
ו
פ
ר
ו
 
ו
ר
ב
ו
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
צ
א
 
נ
ח
 
ו
ב
נ
י
ו
 
ו
א
ש
ת
ו
 
ו
נ
ש
י
 
ב
נ
י
ו
 
א
ת
ו
 
ו
כ
ל
 
ה
ח
י
ה
 
ו
כ
ל
 
ה
ע
ו
ף
 
ו
כ
ל
 
ה
ר
מ
ש
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
ל
מ
ש
פ
ח
ו
ת
י
ה
ם
 
י
צ
א
ו
 
מ
ן
 
ה
ת
ב
ה
 
ו
י
ב
ן
 
נ
ח
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
ו
י
ק
ח
 
מ
כ
ל
 
ה
ב
ה
מ
ה
 
ה
ט
ה
ר
ה
 
ו
מ
כ
ל
 
ה
ע
ו
ף
 
ה
ט
ה
ו
ר
 
ו
י
ע
ל
 
ע
ל
ו
ת
 
ב
מ
ז
ב
ח
 
ו
י
ר
ח
 
י
ה
ו
ה
 
א
ת
 
ר
י
ח
 
ה
נ
י
ח
ח
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
ל
ב
ו
 
ל
א
 
א
ו
ס
י
ף
 
ע
ו
ד
 
ל
ק
ל
ל
 
א
ת
 
ה
א
ד
מ
ה
 
ב
ע
ב
ו
ר
 
ה
א
ד
ם
 
כ
י
 
י
צ
ר
 
ל
ב
 
ה
א
ד
ם
 
ר
ע
 
מ
נ
ע
ר
י
ו
 
ו
ל
א
 
א
ו
ס
י
ף
 
ע
ו
ד
 
ל
ה
כ
ו
ת
 
א
ת
 
כ
ל
 
ח
י
 
כ
א
ש
ר
 
ע
ש
י
ת
י
 
ע
ד
 
כ
ל
 
י
מ
י
 
ה
א
ר
ץ
 
ז
ר
ע
 
ו
ק
צ
י
ר
 
ק
ו
ר
 
ו
ח
ם
 
ק
י
ץ
 
ו
ח
ר
ף
 
י
ו
מ
ם
 
ו
ל
י
ל
ה
 
ל
א
 
י
ש
ב
ת
ו
 
ו
י
ב
ר
ך
 
א
ל
ה
י
ם
 
א
ת
 
נ
ח
 
ו
א
ת
 
ב
נ
י
ו
 
ו
י
א
מ
ר
 
ל
ה
ם
 
פ
ר
ו
 
ו
ר
ב
ו
 
ו
מ
ל
א
ו
 
א
ת
 
ה
א
ר
ץ
 
ו
מ
ר
א
כ
ם
 
ו
ח
ת
ת
כ
ם
 
י
ה
י
ה
 
ע
ל
 
כ
ל
 
ח
י
ת
 
ה
א
ר
ץ
 
ו
ע
ל
 
כ
ל
 
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
ב
כ
ל
 
א
ש
ר
 
ת
ר
מ
ש
 
ה
א
ד
מ
ה
 
ו
ב
כ
ל
 
ד
ג
י
 
ה
י
ם
 
ב
י
ד
כ
ם
 
נ
ת
ת
י
ו
 
כ
ל
 
ר
מ
ש
 
א
ש
ר
 
ה
ו
א
 
ח
י
 
ל
כ
ם
 
י
ה
י
ה
 
ל
א
כ
ל
ה
 
כ
י
ר
ק
 
ע
ש
ב
 
נ
ת
ת
י
 
ל
כ
ם
 
א
ת
 
ה
כ
ל
 
א
ך
 
ב
ש
ר
 
ב
נ
פ
ש
ו
 
ד
מ
ו
 
ל
א
 
ת
א
כ
ל
ו
 
ו
א
ת
 
ד
מ
כ
ם
 
ל
נ
פ
ש
ת
י
כ
ם
 
א
ד
ר
ש
 
מ
י
ד
 
כ
ל
 
ח
י
 
א
ד
ר
ש
נ
ו
 
מ
י
ד
 
ה
א
ד
ם
 
מ
י
ד
 
א
י
ש
 
ו
א
ח
י
ו
 
א
ד
ר
ש
 
א
ת
 
נ
פ
ש
 
ה
א
ד
ם
 
ש
פ
ך
 
ד
ם
 
ה
א
ד
ם
 
ב
א
ד
ם
 
ד
מ
ו
 
י
ש
פ
ך
 
כ
י
 
ב
צ
ל
ם
 
א
ל
ה
י
ם
 
ע
ש
ה
 
א
ת
 
ה
א
ד
ם
 
ו
א
ת
ם
 
פ
ר
ו
 
ו
ר
ב
ו
 
ו
ש
ר
צ
ו
 
ב
א
ר
ץ
 
ו
ר
ב
ו
 
ב
ה
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
נ
ח
 
ו
א
ל
 
ב
נ
י
ו
 
א
ת
ו
 
ל
א
מ
ר
 
ו
א
נ
י
 
ה
נ
נ
י
 
מ
ק
י
ם
 
א
ת
 
ב
ר
י
ת
י
 
א
ת
כ
ם
 
ו
א
ת
 
ז
ר
ע
כ
ם
 
א
ח
ר
י
כ
ם
 
ו
א
ת
 
כ
ל
 
נ
פ
ש
 
ה
ח
י
ה
 
א
ש
ר
 
א
ת
כ
ם
 
ב
ע
ו
ף
 
ו
ב
ב
ה
מ
ה
 
ו
ב
כ
ל
 
ח
י
ת
 
ה
א
ר
ץ
 
א
ת
כ
ם
 
מ
כ
ל
 
י
צ
א
י
 
ה
ת
ב
ה
 
ל
כ
ל
 
ח
י
ת
 
ה
א
ר
ץ
 
ו
ה
ק
מ
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
א
ת
כ
ם
 
ו
ל
א
 
י
כ
ר
ת
 
ע
ו
ד
 
כ
ל
 
ב
ש
ר
 
מ
מ
י
 
ה
מ
ב
ו
ל
 
ו
ל
א
 
י
ה
י
ה
 
ע
ו
ד
 
ה
מ
ב
ו
ל
 
ל
ה
ש
ח
י
ת
 
ה
א
ר
ץ
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
ז
א
ת
 
א
ו
ת
 
ה
ב
ר
י
ת
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ב
י
נ
י
 
ו
ב
י
נ
כ
ם
 
ו
ב
י
ן
 
כ
ל
 
נ
פ
ש
 
ה
ח
י
ה
 
א
ש
ר
 
א
ת
כ
ם
 
ל
ד
ר
ו
ת
 
ע
ו
ל
ם
 
א
ת
 
ק
ש
ת
י
 
נ
ת
ת
י
 
ב
ע
נ
ן
 
ו
ה
י
ת
ה
 
ל
א
ו
ת
 
ב
ר
י
ת
 
ב
י
נ
י
 
ו
ב
י
ן
 
ה
א
ר
ץ
 
ו
ה
י
ה
 
ב
ע
נ
נ
י
 
ע
נ
ן
 
ע
ל
 
ה
א
ר
ץ
 
ו
נ
ר
א
ת
ה
 
ה
ק
ש
ת
 
ב
ע
נ
ן
 
ו
ז
כ
ר
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
א
ש
ר
 
ב
י
נ
י
 
ו
ב
י
נ
כ
ם
 
ו
ב
י
ן
 
כ
ל
 
נ
פ
ש
 
ה
ח
י
ה
 
א
ש
ר
 
א
ת
כ
ם
 
ב
כ
ל
 
ב
ש
ר
 
ו
ל
א
 
י
ה
י
ה
 
ע
ו
ד
 
ה
מ
י
ם
 
ל
מ
ב
ו
ל
 
ל
ה
ש
ח
י
ת
 
כ
ל
 
ב
ש
ר
 
ו
ה
י
ת
ה
 
ה
ק
ש
ת
 
ב
ע
נ
ן
 
ו
ר
א
י
ת
ה
 
ל
א
ז
כ
ר
ה
 
ב
ר
י
ת
 
ע
ו
ל
ם
 
ב
י
ן
 
א
ל
ה
י
ם
 
ו
ב
י
ן
 
כ
ל
 
נ
פ
ש
 
ה
ח
י
ה
 
ב
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
נ
ח
 
ז
א
ת
 
א
ו
ת
 
ה
ב
ר
י
ת
 
א
ש
ר
 
ה
ק
מ
ת
י
 
ב
י
נ
י
 
ו
ב
י
ן
 
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ה
י
ו
 
ב
נ
י
 
נ
ח
 
ה
י
ו
צ
א
י
ם
 
מ
ן
 
ה
ת
ב
ה
 
ש
ם
 
ח
ם
 
ו
י
פ
ת
 
ו
ח
ם
 
ה
ו
א
 
א
ב
י
 
כ
נ
ע
ן
 
ש
ל
ש
ה
 
א
ל
ה
 
ב
נ
י
 
נ
ח
 
מ
א
ל
ה
 
נ
פ
צ
ה
 
כ
ל
 
ה
א
ר
ץ
 
ו
י
ח
ל
 
נ
ח
 
א
י
ש
 
ה
א
ד
מ
ה
 
ו
י
ט
ע
 
כ
ר
ם
 
ו
י
ש
ת
 
מ
ן
 
ה
י
י
ן
 
ו
י
ש
כ
ר
 
ו
י
ת
ג
ל
 
ב
ת
ו
ך
 
א
ה
ל
ו
 
ו
י
ר
א
 
ח
ם
 
א
ב
י
 
כ
נ
ע
ן
 
א
ת
 
ע
ר
ו
ת
 
א
ב
י
ו
 
ו
י
ג
ד
 
ל
ש
נ
י
 
א
ח
י
ו
 
ב
ח
ו
ץ
 
ו
י
ק
ח
 
ש
ם
 
ו
י
פ
ת
 
א
ת
 
ה
ש
מ
ל
ה
 
ו
י
ש
מ
ו
 
ע
ל
 
ש
כ
ם
 
ש
נ
י
ה
ם
 
ו
י
ל
כ
ו
 
א
ח
ר
נ
י
ת
 
ו
י
כ
ס
ו
 
א
ת
 
ע
ר
ו
ת
 
א
ב
י
ה
ם
 
ו
פ
נ
י
ה
ם
 
א
ח
ר
נ
י
ת
 
ו
ע
ר
ו
ת
 
א
ב
י
ה
ם
 
ל
א
 
ר
א
ו
 
ו
י
ק
ץ
 
נ
ח
 
מ
י
י
נ
ו
 
ו
י
ד
ע
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
ל
ו
 
ב
נ
ו
 
ה
ק
ט
ן
 
ו
י
א
מ
ר
 
א
ר
ו
ר
 
כ
נ
ע
ן
 
ע
ב
ד
 
ע
ב
ד
י
ם
 
י
ה
י
ה
 
ל
א
ח
י
ו
 
ו
י
א
מ
ר
 
ב
ר
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
 
ש
ם
 
ו
י
ה
י
 
כ
נ
ע
ן
 
ע
ב
ד
 
ל
מ
ו
 
י
פ
ת
 
א
ל
ה
י
ם
 
ל
י
פ
ת
 
ו
י
ש
כ
ן
 
ב
א
ה
ל
י
 
ש
ם
 
ו
י
ה
י
 
כ
נ
ע
ן
 
ע
ב
ד
 
ל
מ
ו
 
ו
י
ח
י
 
נ
ח
 
א
ח
ר
י
 
ה
מ
ב
ו
ל
 
ש
ל
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
ח
מ
ש
י
ם
 
ש
נ
ה
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
נ
ח
 
ת
ש
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
ח
מ
ש
י
ם
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
א
ל
ה
 
ת
ו
ל
ד
ת
 
ב
נ
י
 
נ
ח
 
ש
ם
 
ח
ם
 
ו
י
פ
ת
 
ו
י
ו
ל
י
ד
ו
 
ל
ה
ם
 
ב
נ
י
ם
 
א
ח
ר
י
 
ה
מ
ב
ו
ל
 
ב
נ
י
 
י
פ
ת
 
ג
מ
ר
 
ו
מ
ג
ו
ג
 
מ
ד
י
 
ו
י
ו
ן
 
ת
ו
ב
ל
 
מ
ו
ש
ך
 
ו
ת
י
ר
ס
 
ו
ב
נ
י
 
ג
מ
ר
 
א
ש
כ
נ
ז
 
ר
י
פ
ת
 
ו
ת
ג
ר
מ
ה
 
ו
ב
נ
י
 
י
ו
ן
 
א
ל
י
ש
 
ת
ר
ש
י
ש
 
כ
ת
י
ם
 
ו
ר
ו
ד
נ
י
ם
 
מ
א
ל
ה
 
נ
פ
ר
ד
ו
 
א
י
י
 
ה
ג
ו
י
ם
 
ב
א
ר
צ
ו
ת
ם
 
א
י
ש
 
ל
ל
ש
נ
ו
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ב
ג
ו
י
ה
ם
 
ו
ב
נ
י
 
ח
ם
 
כ
ו
ש
 
ו
מ
צ
ר
י
ם
 
פ
ו
ט
 
ו
כ
נ
ע
ן
 
ו
ב
נ
י
 
כ
ו
ש
 
ס
ב
ה
 
ו
ח
ו
י
ל
ה
 
ס
ב
ת
ה
 
ו
ר
ע
מ
ה
 
ו
ס
ב
ת
כ
ה
 
ו
ב
נ
י
 
ר
ע
מ
ה
 
ש
ב
א
 
ו
ד
ד
ן
 
ו
כ
ו
ש
 
ה
ו
ל
י
ד
 
א
ת
 
נ
מ
ר
ו
ד
 
ה
ו
א
 
ה
ח
ל
 
ל
ה
י
ו
ת
 
ג
ב
ו
ר
 
ב
א
ר
ץ
 
ה
ו
א
 
ה
י
ה
 
ג
ב
ו
ר
 
צ
י
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ל
 
כ
ן
 
י
א
מ
ר
 
כ
נ
מ
ר
ו
ד
 
ג
ב
ו
ר
 
צ
י
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ת
ה
י
 
ר
א
ש
י
ת
 
מ
מ
ל
כ
ת
ו
 
ב
ב
ל
 
ו
א
ר
ך
 
ו
א
כ
ד
 
ו
כ
ל
נ
ה
 
ב
א
ר
ץ
 
ש
נ
ע
ר
 
מ
ן
 
ה
א
ר
ץ
 
ה
ה
י
א
 
י
צ
א
 
א
ש
ו
ר
 
ו
י
ב
ן
 
א
ת
 
נ
י
נ
ו
ה
 
ו
א
ת
 
ר
ח
ב
ו
ת
 
ע
י
ר
 
ו
א
ת
 
כ
ל
ח
 
ו
א
ת
 
ר
ס
ן
 
ב
י
ן
 
נ
י
נ
ו
ה
 
ו
ב
י
ן
 
כ
ל
ח
 
ה
י
א
 
ה
ע
י
ר
 
ה
ג
ד
ל
ה
 
ו
מ
צ
ר
י
ם
 
י
ל
ד
 
א
ת
 
ל
ד
י
ם
 
ו
א
ת
 
ע
י
נ
מ
י
ם
 
ו
א
ת
 
ל
ה
ב
י
ם
 
ו
א
ת
 
נ
פ
ת
ח
י
ם
 
ו
א
ת
 
פ
ת
ר
ס
י
ם
 
ו
א
ת
 
כ
ס
ל
ח
י
ם
 
א
ש
ר
 
י
צ
א
ו
 
מ
ש
ם
 
פ
ל
ש
ת
י
ם
 
ו
א
ת
 
כ
פ
ת
ר
י
ם
 
ו
כ
נ
ע
ן
 
י
ל
ד
 
א
ת
 
צ
י
ד
ו
ן
 
ב
כ
ו
ר
ו
 
ו
א
ת
 
ה
ח
ת
 
ו
א
ת
 
ה
י
ב
ו
ס
י
 
ו
א
ת
 
ה
א
מ
ר
י
 
ו
א
ת
 
ה
ג
ר
ג
ש
י
 
ו
א
ת
 
ה
ח
ו
י
 
ו
א
ת
 
ה
ע
ר
ו
ק
י
 
ו
א
ת
 
ה
ס
י
נ
י
 
ו
א
ת
 
ה
א
ר
ו
ד
י
 
ו
א
ת
 
ה
צ
מ
ר
י
 
ו
א
ת
 
ה
ח
מ
ת
י
 
ו
א
ח
ר
 
נ
פ
צ
ה
 
מ
ש
פ
ח
ת
 
ה
כ
נ
ע
נ
י
 
ו
י
ה
י
 
ג
ב
ו
ל
 
ה
כ
נ
ע
נ
י
 
מ
נ
ה
ר
 
מ
צ
ר
י
ם
 
ע
ד
 
ה
נ
ה
ר
 
ה
ג
ד
ו
ל
 
נ
ה
ר
 
פ
ר
ת
 
ו
ע
ד
 
ה
י
ם
 
ה
א
ח
ר
ו
ן
 
א
ל
ה
 
ב
נ
י
 
ח
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ל
ש
נ
ו
ת
ם
 
ב
א
ר
צ
ו
ת
ם
 
ל
ג
ו
י
ה
ם
 
ו
ל
ש
ם
 
י
ל
ד
 
ג
ם
 
ה
ו
א
 
א
ב
י
 
כ
ל
 
ב
נ
י
 
ע
ב
ר
 
א
ח
י
 
י
פ
ת
 
ה
ג
ד
ו
ל
 
ב
נ
י
 
ש
ם
 
ע
י
ל
ם
 
ו
א
ש
ו
ר
 
ו
א
ר
פ
כ
ש
ד
 
ו
ל
ד
 
ו
א
ר
ם
 
ו
ב
נ
י
 
א
ר
ם
 
ע
ו
ץ
 
ו
ח
ו
י
ל
 
ג
ת
ר
 
ו
מ
ש
א
 
ו
א
ר
פ
כ
ש
ד
 
י
ל
ד
 
א
ת
 
ש
ל
ח
 
ו
ש
ל
ח
 
י
ל
ד
 
א
ת
 
ע
ב
ר
 
ו
ל
ע
ב
ר
 
י
ל
ד
ו
 
ש
נ
י
 
ב
נ
י
ם
 
ש
ם
 
ה
א
ח
ד
 
פ
ל
ג
 
כ
י
 
ב
י
מ
י
ו
 
נ
פ
ל
ג
ה
 
ה
א
ר
ץ
 
ו
ש
ם
 
א
ח
י
ו
 
י
ק
ט
ן
 
ו
י
ק
ט
ן
 
י
ל
ד
 
א
ת
 
א
ל
מ
ו
ד
ד
 
ו
א
ת
 
ש
ל
ף
 
ו
א
ת
 
ח
צ
ר
מ
ו
ת
 
ו
א
ת
 
י
ר
ח
 
ו
א
ת
 
א
ד
ו
ר
ם
 
ו
א
ת
 
ע
י
ז
ל
 
ו
א
ת
 
ד
ק
ל
ה
 
ו
א
ת
 
ע
י
ב
ל
 
ו
א
ת
 
א
ב
י
מ
א
ל
 
ו
א
ת
 
ש
ב
א
 
ו
א
ת
 
א
פ
ר
 
ו
א
ת
 
ח
ו
י
ל
ה
 
ו
א
ת
 
י
ו
ב
ב
 
כ
ל
 
א
ל
ה
 
ב
נ
י
 
י
ק
ט
ן
 
ו
י
ה
י
 
מ
ו
ש
ב
ם
 
מ
מ
ש
א
 
ב
א
כ
ה
 
ס
פ
ר
ה
 
ה
ר
 
ה
ק
ד
ם
 
א
ל
ה
 
ב
נ
י
 
ש
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ל
ש
נ
ו
ת
ם
 
ב
א
ר
צ
ו
ת
ם
 
ל
ג
ו
י
ה
ם
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
נ
ח
 
ל
ת
ו
ל
ד
ת
ם
 
ב
ג
ו
י
ה
ם
 
מ
א
ל
ה
 
נ
פ
ר
ד
ו
 
א
י
י
 
ה
ג
ו
י
ם
 
ב
א
ר
ץ
 
א
ח
ר
י
 
ה
מ
ב
ו
ל
 
ו
י
ה
י
 
כ
ל
 
ה
א
ר
ץ
 
ש
פ
ה
 
א
ח
ת
 
ו
ד
ב
ר
י
ם
 
א
ח
ד
י
ם
 
ו
י
ה
י
 
ב
נ
ס
ע
ם
 
מ
ק
ד
ם
 
ו
י
מ
צ
א
ו
 
ב
ק
ע
ה
 
ב
א
ר
ץ
 
ש
נ
ע
ר
 
ו
י
ש
ב
ו
 
ש
ם
 
ו
י
א
מ
ר
ו
 
א
י
ש
 
א
ל
 
ר
ע
ה
ו
 
ה
ב
ה
 
נ
ל
ב
נ
ה
 
ל
ב
נ
י
ם
 
ו
נ
ש
ר
פ
ה
 
ל
ש
ר
פ
ה
 
ו
ת
ה
י
 
ל
ה
ם
 
ה
ל
ב
נ
ה
 
ל
א
ב
ן
 
ו
ה
ח
י
מ
ר
 
ה
י
ה
 
ל
ה
ם
 
ל
ח
י
מ
ר
 
ו
י
א
מ
ר
ו
 
ה
ב
ה
 
נ
ב
נ
ה
 
ל
נ
ו
 
ע
י
ר
 
ו
מ
ג
ד
ל
 
ו
ר
א
ש
ו
 
ב
ש
מ
י
ם
 
ו
נ
ע
ש
ה
 
ל
נ
ו
 
ש
ם
 
פ
ן
 
נ
פ
ו
ץ
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
ו
י
ר
ד
 
י
ה
ו
ה
 
ל
ר
א
ו
ת
 
א
ת
 
ה
ע
י
ר
 
ו
א
ת
 
ה
מ
ג
ד
ל
 
א
ש
ר
 
ב
נ
ו
 
ב
נ
י
 
ה
א
ד
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ה
ן
 
ע
ם
 
א
ח
ד
 
ו
ש
פ
ה
 
א
ח
ת
 
ל
כ
ל
ם
 
ו
ז
ה
 
ה
ח
ל
ם
 
ל
ע
ש
ו
ת
 
ו
ע
ת
ה
 
ל
א
 
י
ב
צ
ר
 
מ
ה
ם
 
כ
ל
 
א
ש
ר
 
י
ז
מ
נ
ו
 
ל
ע
ש
ו
ת
 
ה
ב
ה
 
נ
ר
ד
ה
 
ו
נ
ב
ל
ה
 
ש
ם
 
ש
פ
ת
י
ם
 
א
ש
ר
 
ל
א
 
י
ש
מ
ע
 
א
י
ש
 
א
ת
 
ש
פ
ת
 
ר
ע
ה
ו
 
ו
י
פ
ץ
 
י
ה
ו
ה
 
א
ת
ם
 
מ
ש
ם
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
ו
י
ח
ד
ל
ו
 
ל
ב
נ
ו
ת
 
א
ת
 
ה
ע
י
ר
 
ו
א
ת
 
ה
מ
ג
ד
ל
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
מ
ה
 
ב
ב
ל
 
כ
י
 
ש
ם
 
ב
ל
ל
 
י
ה
ו
ה
 
א
ת
 
ש
פ
ת
 
כ
ל
 
ה
א
ר
ץ
 
ו
מ
ש
ם
 
ה
פ
י
צ
ם
 
י
ה
ו
ה
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
א
ל
ה
 
ת
ו
ל
ד
ת
 
ש
ם
 
ש
ם
 
ב
ן
 
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
א
ר
פ
כ
ש
ד
 
ש
נ
ת
י
ם
 
א
ח
ר
י
 
ה
מ
ב
ו
ל
 
ו
י
ח
י
 
ש
ם
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
א
ר
פ
כ
ש
ד
 
ח
מ
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ש
ם
 
ש
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
א
ר
פ
כ
ש
ד
 
ח
י
 
ח
מ
ש
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ש
ל
ח
 
ו
י
ח
י
 
א
ר
פ
כ
ש
ד
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ש
ל
ח
 
ש
ל
ש
 
ש
נ
י
ם
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
א
ר
פ
כ
ש
ד
 
ש
מ
נ
ה
 
ו
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ש
ל
ח
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ע
ב
ר
 
ו
י
ח
י
 
ש
ל
ח
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ע
ב
ר
 
ש
ל
ש
 
ש
נ
י
ם
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ש
ל
ח
 
ש
ל
ש
 
ו
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ע
ב
ר
 
א
ר
ב
ע
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
פ
ל
ג
 
ו
י
ח
י
 
ע
ב
ר
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
פ
ל
ג
 
ש
ב
ע
י
ם
 
ש
נ
ה
 
ו
מ
א
ת
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ע
ב
ר
 
א
ר
ב
ע
 
ש
נ
י
ם
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
פ
ל
ג
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ר
ע
ו
 
ו
י
ח
י
 
פ
ל
ג
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ר
ע
ו
 
ת
ש
ע
 
ש
נ
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
פ
ל
ג
 
ת
ש
ע
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
י
ם
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ר
ע
ו
 
ש
ת
י
ם
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ש
ר
ו
ג
 
ו
י
ח
י
 
ר
ע
ו
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ש
ר
ו
ג
 
ש
ב
ע
 
ש
נ
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ר
ע
ו
 
ת
ש
ע
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
י
ם
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ש
ר
ו
ג
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
נ
ח
ו
ר
 
ו
י
ח
י
 
ש
ר
ו
ג
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
נ
ח
ו
ר
 
מ
א
ת
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
ש
ר
ו
ג
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
א
ת
י
ם
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
נ
ח
ו
ר
 
ת
ש
ע
 
ו
ש
ב
ע
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
ת
ר
ח
 
ו
י
ח
י
 
נ
ח
ו
ר
 
א
ח
ר
י
 
ה
ו
ל
י
ד
ו
 
א
ת
 
ת
ר
ח
 
ת
ש
ע
 
ש
נ
י
ם
 
ו
ש
ש
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ו
י
ה
י
ו
 
כ
ל
 
י
מ
י
 
נ
ח
ו
ר
 
ש
מ
נ
ה
 
ו
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ו
י
ח
י
 
ת
ר
ח
 
ש
ב
ע
י
ם
 
ש
נ
ה
 
ו
י
ו
ל
י
ד
 
א
ת
 
א
ב
ר
ם
 
ו
א
ת
 
נ
ח
ו
ר
 
ו
א
ת
 
ה
ר
ן
 
א
ל
ה
 
ת
ו
ל
ד
ת
 
ת
ר
ח
 
ת
ר
ח
 
ה
ו
ל
י
ד
 
א
ת
 
א
ב
ר
ם
 
ו
א
ת
 
נ
ח
ו
ר
 
ו
א
ת
 
ה
ר
ן
 
ו
ה
ר
ן
 
ה
ו
ל
י
ד
 
א
ת
 
ל
ו
ט
 
ו
י
מ
ת
 
ה
ר
ן
 
ע
ל
 
פ
נ
י
 
ת
ר
ח
 
א
ב
י
ו
 
ב
א
ר
ץ
 
מ
ו
ל
ד
ת
ו
 
ב
א
ו
ר
 
כ
ש
ד
י
ם
 
ו
י
ק
ח
 
א
ב
ר
ם
 
ו
נ
ח
ו
ר
 
ל
ה
ם
 
נ
ש
י
ם
 
ש
ם
 
א
ש
ת
 
א
ב
ר
ם
 
ש
ר
י
 
ו
ש
ם
 
א
ש
ת
 
נ
ח
ו
ר
 
מ
ל
כ
ה
 
ב
ת
 
ה
ר
ן
 
א
ב
י
 
מ
ל
כ
ה
 
ו
א
ב
י
 
י
ס
כ
ה
 
ו
ת
ה
י
 
ש
ר
י
 
ע
ק
ר
ה
 
א
י
ן
 
ל
ה
 
י
ל
ד
 
ו
י
ק
ח
 
ת
ר
ח
 
א
ת
 
א
ב
ר
ם
 
ב
נ
ו
 
ו
א
ת
 
ל
ו
ט
 
ב
ן
 
ה
ר
ן
 
ב
ן
 
ב
נ
ו
 
ו
א
ת
 
ש
ר
י
 
ו
א
ת
 
מ
ל
כ
ה
 
כ
ל
ו
ת
ו
 
א
ש
ת
 
א
ב
ר
ם
 
ו
נ
ח
ו
ר
 
ב
נ
י
ו
 
ו
י
ו
צ
א
 
א
ת
ם
 
מ
א
ו
ר
 
כ
ש
ד
י
ם
 
ל
ל
כ
ת
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
י
ב
א
ו
 
ע
ד
 
ח
ר
ן
 
ו
י
ש
ב
ו
 
ש
ם
 
ו
י
ה
י
ו
 
י
מ
י
 
ת
ר
ח
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
א
ר
ב
ע
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
מ
ת
 
ת
ר
ח
 
ב
ח
ר
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
א
ב
ר
ם
 
ל
ך
 
ל
ך
 
מ
א
ר
צ
ך
 
ו
מ
מ
ו
ל
ד
ת
ך
 
ו
מ
ב
י
ת
 
א
ב
י
ך
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ר
א
ך
 
ו
א
ע
ש
ך
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
ו
א
ב
ר
כ
ך
 
ו
א
ג
ד
ל
ה
 
ש
מ
ך
 
ו
ה
ו
י
 
ב
ר
כ
ה
 
ו
א
ב
ר
ך
 
מ
ב
ר
כ
י
ך
 
ו
מ
ק
ל
ל
י
ך
 
א
א
ר
 
ו
נ
ב
ר
כ
ו
 
ב
ך
 
כ
ל
 
מ
ש
פ
ח
ו
ת
 
ה
א
ד
מ
ה
 
ו
י
ל
ך
 
א
ב
ר
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
א
ל
י
ו
 
י
ה
ו
ה
 
ו
י
ל
ך
 
א
ת
ו
 
ל
ו
ט
 
ו
א
ב
ר
ם
 
ב
ן
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
ש
ב
ע
י
ם
 
ש
נ
ה
 
ב
צ
א
ת
ו
 
מ
ח
ר
ן
 
ו
י
ק
ח
 
א
ב
ר
ם
 
א
ת
 
ש
ר
י
 
א
ש
ת
ו
 
ו
א
ת
 
ל
ו
ט
 
ב
ן
 
א
ח
י
ו
 
ו
א
ת
 
כ
ל
 
ר
כ
ו
ש
ם
 
א
ש
ר
 
ר
כ
ש
ו
 
ו
א
ת
 
ה
נ
פ
ש
 
א
ש
ר
 
ע
ש
ו
 
ב
ח
ר
ן
 
ו
י
צ
א
ו
 
ל
ל
כ
ת
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
י
ב
א
ו
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
י
ע
ב
ר
 
א
ב
ר
ם
 
ב
א
ר
ץ
 
ע
ד
 
מ
ק
ו
ם
 
ש
כ
ם
 
ע
ד
 
א
ל
ו
ן
 
מ
ו
ר
א
 
ו
ה
כ
נ
ע
נ
י
 
א
ז
 
ב
א
ר
ץ
 
ו
י
ר
א
 
י
ה
ו
ה
 
א
ל
 
א
ב
ר
ם
 
ו
י
א
מ
ר
 
ל
ו
 
ל
ז
ר
ע
ך
 
א
ת
ן
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ו
י
ב
ן
 
ש
ם
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
ה
נ
ר
א
ה
 
א
ל
י
ו
 
ו
י
ע
ת
ק
 
מ
ש
ם
 
ה
ה
ר
ה
 
מ
ק
ד
ם
 
ל
ב
י
ת
 
א
ל
 
ו
י
ט
 
א
ה
ל
ו
 
ב
י
ת
 
א
ל
 
מ
י
ם
 
ו
ה
ע
י
 
מ
ק
ד
ם
 
ו
י
ב
ן
 
ש
ם
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
ו
י
ק
ר
א
 
ב
ש
ם
 
י
ה
ו
ה
 
ו
י
ס
ע
 
א
ב
ר
ם
 
ה
ל
ו
ך
 
ו
נ
ס
ע
 
ה
נ
ג
ב
ה
 
ו
י
ה
י
 
ר
ע
ב
 
ב
א
ר
ץ
 
ו
י
ר
ד
 
א
ב
ר
ם
 
מ
צ
ר
י
מ
ה
 
ל
ג
ו
ר
 
ש
ם
 
כ
י
 
כ
ב
ד
 
ה
ר
ע
ב
 
ב
א
ר
ץ
 
ו
י
ה
י
 
כ
א
ש
ר
 
ה
ק
ר
י
ב
 
ל
ב
ו
א
 
מ
צ
ר
י
מ
ה
 
ו
י
א
מ
ר
 
א
ל
 
ש
ר
י
 
א
ש
ת
ו
 
ה
נ
ה
 
נ
א
 
י
ד
ע
ת
י
 
כ
י
 
א
ש
ה
 
י
פ
ת
 
מ
ר
א
ה
 
א
ת
י
 
ו
ה
י
ה
 
כ
י
 
י
ר
א
ו
 
א
ת
י
ך
 
ה
מ
צ
ר
י
ם
 
ו
א
מ
ר
ו
 
א
ש
ת
ו
 
ז
א
ת
 
ו
ה
ר
ג
ו
 
א
ת
י
 
ו
א
ת
י
ך
 
י
ח
י
ו
 
א
מ
ר
י
 
נ
א
 
א
ח
ו
ת
י
 
א
ת
י
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
י
 
ב
ע
ב
ו
ר
י
ך
 
ו
ח
י
ת
ה
 
נ
פ
ש
י
 
ב
ג
ל
ל
י
ך
 
ו
י
ה
י
 
כ
ב
ו
א
 
א
ב
ר
ם
 
מ
צ
ר
י
מ
ה
 
ו
י
ר
א
ו
 
ה
מ
צ
ר
י
ם
 
א
ת
 
ה
א
ש
ה
 
כ
י
 
י
פ
ה
 
ה
י
א
 
מ
א
ד
 
ו
י
ר
א
ו
 
א
ת
ה
 
ש
ר
י
 
פ
ר
ע
ה
 
ו
י
ה
ל
ל
ו
 
א
ת
ה
 
א
ל
 
פ
ר
ע
ה
 
ו
ת
ק
ח
 
ה
א
ש
ה
 
ב
י
ת
ה
 
פ
ר
ע
ה
 
ו
ל
א
ב
ר
ם
 
ה
י
י
ט
ב
 
ב
ע
ב
ו
ר
ה
 
ו
י
ה
י
 
ל
ו
 
צ
א
ן
 
ו
ב
ק
ר
 
מ
ק
נ
ה
 
כ
ב
ד
 
מ
א
ד
 
ע
ב
ד
י
ם
 
ו
ש
פ
ח
ו
ת
 
ו
ח
מ
ר
י
ם
 
ו
א
ת
נ
ו
ת
 
ו
ג
מ
ל
י
ם
 
ו
י
נ
ג
ע
 
י
ה
ו
ה
 
א
ת
 
פ
ר
ע
ה
 
נ
ג
ע
י
ם
 
ג
ד
ל
י
ם
 
ו
א
ת
 
ב
י
ת
ו
 
ע
ל
 
ד
ב
ר
 
ש
ר
י
 
א
ש
ת
 
א
ב
ר
ם
 
ו
י
ק
ר
א
 
פ
ר
ע
ה
 
ל
א
ב
ר
ם
 
ו
י
א
מ
ר
 
מ
ה
 
ז
א
ת
 
ע
ש
י
ת
 
ל
י
 
ל
מ
ה
 
ל
א
 
ה
ג
ד
ת
 
ל
י
 
כ
י
 
א
ש
ת
ך
 
ה
י
א
 
ו
ל
מ
ה
 
א
מ
ר
ת
 
א
ח
ו
ת
י
 
ה
י
א
 
ו
א
ק
ח
 
א
ת
ה
 
ל
י
 
ל
א
ש
ה
 
ו
ע
ת
ה
 
ה
נ
ה
 
א
ש
ת
ך
 
ק
ח
 
ו
ל
ך
 
ו
י
צ
ו
 
ע
ל
י
ו
 
פ
ר
ע
ה
 
א
נ
ש
י
ם
 
ו
י
ש
ל
ח
ו
 
א
ת
ו
 
ו
א
ת
 
א
ש
ת
ו
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ו
ל
ו
ט
 
ע
מ
ו
 
ו
י
ע
ל
 
א
ב
ר
ם
 
מ
מ
צ
ר
י
ם
 
ה
ו
א
 
ו
א
ש
ת
ו
 
ו
כ
ל
 
א
ש
ר
 
ל
ו
 
ו
ל
ו
ט
 
ע
מ
ו
 
ה
נ
ג
ב
ה
 
ו
א
ב
ר
ם
 
כ
ב
ד
 
מ
א
ד
 
ב
מ
ק
נ
ה
 
ב
כ
ס
ף
 
ו
ב
ז
ה
ב
 
ו
י
ל
ך
 
ל
מ
ס
ע
י
ו
 
מ
נ
ג
ב
 
ו
ע
ד
 
ב
י
ת
 
א
ל
 
ע
ד
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ה
י
ה
 
ש
ם
 
א
ה
ל
ו
 
ב
ת
ח
ל
ה
 
ב
י
ן
 
ב
י
ת
 
א
ל
 
ו
ב
י
ן
 
ה
ע
י
 
א
ל
 
מ
ק
ו
ם
 
ה
מ
ז
ב
ח
 
א
ש
ר
 
ע
ש
ה
 
ש
ם
 
ב
ר
א
י
ש
ו
נ
ה
 
ו
י
ק
ר
א
 
ש
ם
 
א
ב
ר
ם
 
ב
ש
ם
 
י
ה
ו
ה
 
ו
ג
ם
 
ל
ל
ו
ט
 
ה
ה
ל
ך
 
א
ת
 
א
ב
ר
ם
 
ה
י
ה
 
צ
א
ן
 
ו
ב
ק
ר
 
ו
א
ה
ל
י
ם
 
ו
ל
א
 
נ
ש
א
ה
 
א
ת
ם
 
ה
א
ר
ץ
 
ל
ש
ב
ת
 
י
ח
ד
ו
 
כ
י
 
ה
י
ה
 
ר
כ
ו
ש
ם
 
ר
ב
 
ו
ל
א
 
י
כ
ל
ו
 
ל
ש
ב
ת
 
י
ח
ד
ו
 
ו
י
ה
י
 
ר
י
ב
 
ב
י
ן
 
ר
ע
י
 
מ
ק
נ
ה
 
א
ב
ר
ם
 
ו
ב
י
ן
 
ר
ע
י
 
מ
ק
נ
ה
 
ל
ו
ט
 
ו
ה
כ
נ
ע
נ
י
 
ו
ה
פ
ר
ז
י
 
א
ז
 
י
ש
ב
י
ם
 
ב
א
ר
ץ
 
ו
י
א
מ
ר
 
א
ב
ר
ם
 
א
ל
 
ל
ו
ט
 
א
ל
 
נ
א
 
ת
ה
י
ה
 
מ
ר
י
ב
ה
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ו
ב
י
ן
 
ר
ע
י
 
ו
ב
י
ן
 
ר
ע
י
ך
 
כ
י
 
א
נ
ש
י
ם
 
א
ח
י
ם
 
א
נ
ח
נ
ו
 
ה
ל
ו
א
 
כ
ל
 
ה
א
ר
ץ
 
ל
פ
נ
י
ך
 
ה
פ
ר
ד
 
נ
א
 
מ
ע
ל
י
 
א
ם
 
ה
ש
מ
א
ל
ה
 
ו
ה
י
מ
י
נ
ה
 
ו
א
ם
 
ה
י
מ
י
נ
ה
 
ו
ה
ש
מ
א
ל
ה
 
ו
י
ש
א
 
ל
ו
ט
 
א
ת
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
א
ת
 
כ
ל
 
כ
כ
ר
 
ה
י
ר
ד
ן
 
כ
י
 
כ
ל
ו
 
מ
ש
ק
ה
 
ל
פ
נ
י
 
ש
ח
ת
 
י
ה
ו
ה
 
א
ת
 
ס
ד
ם
 
ו
א
ת
 
ע
מ
ר
ה
 
כ
ג
ן
 
י
ה
ו
ה
 
כ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
א
כ
ה
 
צ
ע
ר
ה
 
ו
י
ב
ח
ר
 
ל
ו
 
ל
ו
ט
 
א
ת
 
כ
ל
 
כ
כ
ר
 
ה
י
ר
ד
ן
 
ו
י
ס
ע
 
ל
ו
ט
 
מ
ק
ד
ם
 
ו
י
פ
ר
ד
ו
 
א
י
ש
 
מ
ע
ל
 
א
ח
י
ו
 
א
ב
ר
ם
 
י
ש
ב
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ל
ו
ט
 
י
ש
ב
 
ב
ע
ר
י
 
ה
כ
כ
ר
 
ו
י
א
ה
ל
 
ע
ד
 
ס
ד
ם
 
ו
א
נ
ש
י
 
ס
ד
ם
 
ר
ע
י
ם
 
ו
ח
ט
א
י
ם
 
ל
י
ה
ו
ה
 
מ
א
ד
 
ו
י
ה
ו
ה
 
א
מ
ר
 
א
ל
 
א
ב
ר
ם
 
א
ח
ר
י
 
ה
פ
ר
ד
 
ל
ו
ט
 
מ
ע
מ
ו
 
ש
א
 
נ
א
 
ע
י
נ
י
ך
 
ו
ר
א
ה
 
מ
ן
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
א
ת
ה
 
ש
ם
 
צ
פ
ו
נ
ה
 
ו
נ
ג
ב
ה
 
ו
ק
ד
מ
ה
 
ו
י
מ
ה
 
כ
י
 
א
ת
 
כ
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ר
א
ה
 
ל
ך
 
א
ת
נ
נ
ה
 
ו
ל
ז
ר
ע
ך
 
ע
ד
 
ע
ו
ל
ם
 
ו
ש
מ
ת
י
 
א
ת
 
ז
ר
ע
ך
 
כ
ע
פ
ר
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ם
 
י
ו
כ
ל
 
א
י
ש
 
ל
מ
נ
ו
ת
 
א
ת
 
ע
פ
ר
 
ה
א
ר
ץ
 
ג
ם
 
ז
ר
ע
ך
 
י
מ
נ
ה
 
ק
ו
ם
 
ה
ת
ה
ל
ך
 
ב
א
ר
ץ
 
ל
א
ר
כ
ה
 
ו
ל
ר
ח
ב
ה
 
כ
י
 
ל
ך
 
א
ת
נ
נ
ה
 
ו
י
א
ל
 
א
ב
ר
ם
 
ו
י
ב
א
 
ו
י
ש
ב
 
ב
א
ל
ו
נ
י
 
מ
מ
ר
א
 
א
ש
ר
 
ב
ח
ב
ר
ו
ן
 
ו
י
ב
ן
 
ש
ם
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
ו
י
ה
י
 
ב
י
מ
י
 
א
מ
ר
פ
ל
 
מ
ל
ך
 
ש
נ
ע
ר
 
ו
א
ר
י
ו
ך
 
מ
ל
ך
 
א
ל
ס
ר
 
כ
ד
ר
 
ל
ע
מ
ר
 
מ
ל
ך
 
ע
י
ל
ם
 
ו
ת
ד
ע
ל
 
מ
ל
ך
 
ג
ו
י
ם
 
ע
ש
ו
 
מ
ל
ח
מ
ה
 
א
ת
 
ב
ר
ע
 
מ
ל
ך
 
ס
ד
ם
 
ו
א
ת
 
ב
ר
ש
ע
 
מ
ל
ך
 
ע
מ
ר
ה
 
ו
ש
נ
א
ב
 
מ
ל
ך
 
א
ד
מ
ה
 
ו
ש
מ
 
א
ב
ד
 
מ
ל
ך
 
צ
ב
ו
א
י
ם
 
ו
מ
ל
ך
 
ב
ל
ע
 
ה
י
א
 
צ
ע
ר
 
כ
ל
 
א
ל
ה
 
ח
ב
ר
ו
 
א
ל
 
ע
מ
ק
 
ה
ש
ד
י
ם
 
ה
ו
א
 
י
ם
 
ה
מ
ל
ח
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ש
נ
ה
 
ע
ב
ד
ו
 
א
ת
 
כ
ד
ר
 
ל
ע
מ
ר
 
ו
ב
ש
ל
ש
 
ע
ש
ר
ה
 
ש
נ
ה
 
מ
ר
ד
ו
 
ו
ב
א
ר
ב
ע
 
ע
ש
ר
ה
 
ש
נ
ה
 
ב
א
 
כ
ד
ר
 
ל
ע
מ
ר
 
ו
ה
מ
ל
כ
י
ם
 
א
ש
ר
 
א
ת
ו
 
ו
י
כ
ו
 
א
ת
 
ה
ר
פ
א
י
ם
 
ב
ע
ש
ת
ר
ו
ת
 
ק
ר
נ
י
ם
 
ו
א
ת
 
ה
ז
ו
ז
י
ם
 
ב
ח
ם
 
ו
א
ת
 
ה
א
י
מ
י
ם
 
ב
ש
ב
י
 
ק
ר
י
ת
י
ם
 
ו
א
ת
 
ה
ח
ר
י
 
ב
ה
ר
ר
י
 
ש
ע
י
ר
 
ע
ד
 
א
י
ל
 
פ
ר
א
ן
 
א
ש
ר
 
ע
ל
 
ה
מ
ד
ב
ר
 
ו
י
ש
ב
ו
 
ו
י
ב
א
ו
 
א
ל
 
ע
י
נ
 
מ
ש
פ
ט
 
ה
י
א
 
ק
ד
ש
 
ו
י
כ
ו
 
א
ת
 
כ
ל
 
ש
ד
ה
 
ה
ע
מ
ל
ק
י
 
ו
ג
ם
 
א
ת
 
ה
א
מ
ר
י
 
ה
י
ש
ב
 
ב
ח
צ
צ
ו
נ
 
ת
מ
ר
 
ו
י
צ
א
 
מ
ל
ך
 
ס
ד
ם
 
ו
מ
ל
ך
 
ע
מ
ר
ה
 
ו
מ
ל
ך
 
א
ד
מ
ה
 
ו
מ
ל
ך
 
צ
ב
ו
א
י
ם
 
ו
מ
ל
ך
 
ב
ל
ע
 
ה
ו
א
 
צ
ע
ר
 
ו
י
ע
ר
כ
ו
 
א
ת
ם
 
מ
ל
ח
מ
ה
 
ב
ע
מ
ק
 
ה
ש
ד
י
ם
 
א
ת
 
כ
ד
ר
 
ל
ע
מ
ר
 
מ
ל
ך
 
ע
י
ל
ם
 
ו
ת
ד
ע
ל
 
מ
ל
ך
 
ג
ו
י
ם
 
א
מ
ר
פ
ל
 
מ
ל
ך
 
ש
נ
ע
ר
 
ו
א
ר
י
ו
ך
 
מ
ל
ך
 
א
ל
ס
ר
 
א
ר
ב
ע
ה
 
מ
ל
כ
י
ם
 
א
ת
 
ה
ח
מ
ש
ה
 
ו
ע
מ
ק
 
ה
ש
ד
י
ם
 
ב
א
ר
ו
ת
 
ב
א
ר
ו
ת
 
ח
י
מ
ר
 
ו
י
נ
ס
ו
 
מ
ל
ך
 
ס
ד
ם
 
ו
מ
ל
ך
 
ע
מ
ר
ה
 
ו
י
פ
ל
ו
 
ש
ם
 
ו
ה
נ
ש
א
ר
י
ם
 
ה
ה
ר
ה
 
נ
ס
ו
 
ו
י
ק
ח
ו
 
א
ת
 
כ
ל
 
ר
כ
ו
ש
 
ס
ד
ם
 
ו
ע
מ
ר
ה
 
ו
א
ת
 
כ
ל
 
א
כ
ל
ם
 
ו
י
ל
כ
ו
 
ו
י
ק
ח
ו
 
א
ת
 
ל
ו
ט
 
ו
א
ת
 
כ
ל
 
ר
כ
ו
ש
ו
 
ב
ן
 
א
ח
י
 
א
ב
ר
ם
 
ו
י
ל
ך
 
ו
ה
ו
א
 
י
ש
ב
 
ב
ס
ד
ם
 
ו
י
ב
א
 
ה
פ
ל
י
ט
 
ו
י
ג
ד
 
ל
א
ב
ר
ם
 
ה
ע
ב
ר
י
 
ו
ה
ו
א
 
ש
כ
ן
 
ב
א
ל
ו
נ
י
 
מ
מ
ר
א
 
ה
א
מ
ר
י
 
א
ח
י
 
א
ש
כ
ו
ל
 
ו
א
ח
י
 
ע
נ
ר
ם
 
ו
ה
ם
 
ב
ע
ל
י
 
ב
ר
י
ת
 
א
ב
ר
ם
 
ו
י
ש
מ
ע
 
א
ב
ר
ם
 
כ
י
 
נ
ש
ב
א
 
א
ח
י
ו
 
ו
י
ד
ק
 
א
ת
 
ח
נ
י
כ
י
ו
 
י
ל
י
ד
י
 
ב
י
ת
ו
 
ש
מ
נ
ה
 
ע
ש
ר
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ו
י
ר
ד
ף
 
ע
ד
 
ד
ן
 
ו
י
ח
ל
ק
 
ע
ל
י
ה
ם
 
ל
י
ל
ה
 
ה
ו
א
 
ו
ע
ב
ד
י
ו
 
ו
י
כ
ם
 
ו
י
ר
ד
פ
ם
 
ע
ד
 
ח
ו
ב
ה
 
א
ש
ר
 
מ
ש
מ
א
ל
 
ל
ד
מ
ש
ק
 
ו
י
ש
ב
 
א
ת
 
כ
ל
 
ה
ר
כ
ו
ש
 
ו
ג
ם
 
א
ת
 
ל
ו
ט
 
א
ח
י
ו
 
ו
ר
כ
ו
ש
ו
 
ה
ש
י
ב
 
ו
ג
ם
 
א
ת
 
ה
נ
ש
י
ם
 
ו
א
ת
 
ה
ע
ם
 
ו
י
צ
א
 
מ
ל
ך
 
ס
ד
ם
 
ל
ק
ר
א
ת
ו
 
א
ח
ר
י
 
ש
ו
ב
ו
 
מ
ה
כ
ו
ת
 
א
ת
 
כ
ד
ר
 
ל
ע
מ
ר
 
ו
א
ת
 
ה
מ
ל
כ
י
ם
 
א
ש
ר
 
א
ת
ו
 
א
ל
 
ע
מ
ק
 
ה
ש
ו
י
 
ה
ו
א
 
ע
מ
ק
 
ה
מ
ל
ך
 
ו
מ
ל
כ
י
 
צ
ד
ק
 
מ
ל
ך
 
ש
ל
ם
 
ה
ו
צ
י
א
 
ל
ח
ם
 
ו
י
י
ן
 
ו
ה
ו
א
 
כ
ה
ן
 
ל
א
ל
 
ע
ל
י
ו
ן
 
ו
י
ב
ר
ך
 
א
ת
 
א
ב
ר
ם
 
ו
י
א
מ
ר
 
ב
ר
ו
ך
 
א
ב
ר
ם
 
ל
א
ל
 
ע
ל
י
ו
ן
 
ק
נ
ה
 
ש
מ
י
ם
 
ו
א
ר
ץ
 
ו
ב
ר
ו
ך
 
א
ל
 
ע
ל
י
ו
ן
 
א
ש
ר
 
מ
ג
ן
 
צ
ר
י
ך
 
ב
י
ד
ך
 
ו
י
ת
ן
 
ל
ו
 
מ
ע
ש
ר
 
מ
כ
ל
 
ו
י
א
מ
ר
 
מ
ל
ך
 
ס
ד
ם
 
א
ל
 
א
ב
ר
ם
 
ת
נ
ה
 
ל
י
 
ה
נ
פ
ש
 
ו
ה
ר
כ
ו
ש
 
ק
ח
 
ל
ך
 
ו
י
א
מ
ר
 
א
ב
ר
ם
 
א
ל
 
מ
ל
ך
 
ס
ד
ם
 
ה
ר
מ
ת
י
 
א
ת
 
י
ד
י
 
א
ל
 
ה
א
ל
ה
י
ם
 
א
ל
 
ע
ל
י
ו
ן
 
ק
נ
ה
 
ש
מ
י
ם
 
ו
א
ר
ץ
 
א
ם
 
מ
ח
ו
ט
 
ו
ע
ד
 
ש
ר
ו
ג
 
נ
ע
ל
 
א
ם
 
א
ק
ח
 
מ
כ
ל
 
א
ש
ר
 
ל
ך
 
ו
ל
א
 
ת
א
מ
ר
 
א
נ
כ
י
 
א
ע
ש
ר
ת
י
 
א
ת
 
א
ב
ר
ם
 
ב
ל
ע
ד
י
 
ר
ק
 
א
ש
ר
 
א
כ
ל
ו
 
ה
נ
ע
ר
י
ם
 
ו
ח
ל
ק
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
ה
ל
כ
ו
 
א
ת
י
 
ע
נ
ר
ם
 
ו
א
ש
כ
ו
ל
 
ו
מ
מ
ר
א
 
ה
ם
 
י
ק
ח
ו
 
ח
ל
ק
ם
 
א
ח
ר
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ה
י
ה
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
א
ב
ר
ם
 
ב
מ
ח
ז
ה
 
ל
א
מ
ר
 
א
ל
 
ת
י
ר
א
 
א
ב
ר
ם
 
א
נ
כ
י
 
מ
ג
ן
 
ל
ך
 
ו
ש
כ
ר
ך
 
א
ר
ב
ה
 
מ
א
ד
 
ו
י
א
מ
ר
 
א
ב
ר
ם
 
א
ד
נ
י
 
י
ה
ו
ה
 
מ
ה
 
ת
ת
ן
 
ל
י
 
ו
א
נ
כ
י
 
ה
ל
ך
 
ע
ר
ר
י
 
ו
ב
ן
 
מ
ש
ק
 
ב
י
ת
י
 
ה
ו
א
 
ד
מ
ש
ק
 
א
ל
י
ע
ז
ר
 
ו
י
א
מ
ר
 
א
ב
ר
ם
 
ה
ן
 
ל
י
 
ל
א
 
נ
ת
ת
ה
 
ז
ר
ע
 
ו
ה
נ
ה
 
ב
ן
 
ב
י
ת
י
 
י
י
ר
ש
 
א
ת
י
 
ו
ה
נ
ה
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
ו
 
ל
א
מ
ר
 
ל
א
 
י
י
ר
ש
ך
 
ז
ה
 
כ
י
 
א
ם
 
א
ש
ר
 
י
צ
א
 
מ
מ
ע
י
ך
 
ה
ו
א
 
י
י
ר
ש
ך
 
ו
י
ו
צ
א
 
א
ת
ו
 
ה
ח
ו
צ
ה
 
ו
י
א
מ
ר
 
ה
ב
ט
 
נ
א
 
ה
ש
מ
י
ם
 
ו
ס
פ
ר
 
ה
כ
ו
כ
ב
י
ם
 
א
ם
 
ת
ו
כ
ל
 
ל
ס
פ
ר
 
א
ת
ם
 
ו
י
א
מ
ר
 
ל
ו
 
כ
ה
 
י
ה
י
ה
 
ז
ר
ע
ך
 
ו
ה
א
מ
ן
 
ב
י
ה
ו
ה
 
ו
י
ח
ש
ב
ה
 
ל
ו
 
צ
ד
ק
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
נ
י
 
י
ה
ו
ה
 
א
ש
ר
 
ה
ו
צ
א
ת
י
ך
 
מ
א
ו
ר
 
כ
ש
ד
י
ם
 
ל
ת
ת
 
ל
ך
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ל
ר
ש
ת
ה
 
ו
י
א
מ
ר
 
א
ד
נ
י
 
י
ה
ו
ה
 
ב
מ
ה
 
א
ד
ע
 
כ
י
 
א
י
י
ר
ש
נ
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ק
ח
 
ל
י
 
ע
ג
ל
ה
 
מ
ש
ל
ש
ת
 
ו
ע
ז
 
מ
ש
ל
ש
ת
 
ו
א
י
ל
 
מ
ש
ל
ש
 
ו
ת
ר
 
ו
ג
ו
ז
ל
 
ו
י
ק
ח
 
ל
ו
 
א
ת
 
כ
ל
 
א
ל
ה
 
ו
י
ב
ת
ר
 
א
ת
ם
 
ב
ת
ו
ר
 
ו
י
ת
ן
 
א
י
ש
 
א
ת
 
ב
ת
ר
ו
 
ל
ק
ר
א
ת
 
ר
ע
ה
ו
 
ו
א
ת
 
ה
צ
פ
ו
ר
י
ם
 
ל
א
 
ב
ת
ר
 
ו
י
ר
ד
 
ה
ע
י
ט
 
ע
ל
 
ה
פ
ג
ר
י
ם
 
ו
י
ש
ב
 
א
ת
ם
 
א
ב
ר
ם
 
ו
י
ה
י
 
ה
ש
מ
ש
 
ל
ב
ו
א
 
ו
ת
ר
ד
מ
ה
 
נ
פ
ל
ה
 
ע
ל
 
א
ב
ר
ם
 
ו
ה
נ
ה
 
א
י
מ
ה
 
ח
ש
כ
ה
 
ג
ד
ל
ה
 
נ
פ
ל
ת
 
ע
ל
י
ו
 
ו
י
א
מ
ר
 
ל
א
ב
ר
ם
 
י
ד
ע
 
ת
ד
ע
 
כ
י
 
ג
ר
 
י
ה
י
ה
 
ז
ר
ע
ך
 
ב
א
ר
ץ
 
ל
א
 
ל
ה
ם
 
ו
ע
ב
ד
ו
ם
 
ו
ע
נ
ו
 
א
ת
ם
 
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
ג
ם
 
א
ת
 
ה
ג
ו
י
 
א
ש
ר
 
י
ע
ב
ד
ו
 
ד
ן
 
א
נ
כ
י
 
ו
א
ח
ר
י
 
כ
ן
 
י
צ
א
ו
 
ב
ר
כ
ו
ש
 
ג
ד
ו
ל
 
ו
א
ת
ה
 
ת
ב
ו
א
 
א
ל
 
א
ב
ת
י
ך
 
ב
ש
ל
ו
ם
 
ת
ק
ב
ר
 
ב
ש
י
ב
ה
 
ט
ו
ב
ה
 
ו
ד
ו
ר
 
ה
ר
ב
י
ע
י
 
י
ש
ו
ב
 
ה
נ
ה
 
כ
י
 
ל
א
 
ש
ל
ם
 
ע
ו
ן
 
ה
א
מ
ר
י
 
ע
ד
 
ה
נ
ה
 
ו
י
ה
י
 
ה
ש
מ
ש
 
ב
א
ה
 
ו
ע
ל
ט
ה
 
ה
י
ה
 
ו
ה
נ
ה
 
ת
נ
ו
ר
 
ע
ש
ן
 
ו
ל
פ
י
ד
 
א
ש
 
א
ש
ר
 
ע
ב
ר
 
ב
י
ן
 
ה
ג
ז
ר
י
ם
 
ה
א
ל
ה
 
ב
י
ו
ם
 
ה
ה
ו
א
 
כ
ר
ת
 
י
ה
ו
ה
 
א
ת
 
א
ב
ר
ם
 
ב
ר
י
ת
 
ל
א
מ
ר
 
ל
ז
ר
ע
ך
 
נ
ת
ת
י
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
מ
נ
ה
ר
 
מ
צ
ר
י
ם
 
ע
ד
 
ה
נ
ה
ר
 
ה
ג
ד
ו
ל
 
נ
ה
ר
 
פ
ר
ת
 
א
ת
 
ה
ק
י
נ
י
 
ו
א
ת
 
ה
ק
נ
ז
י
 
ו
א
ת
 
ה
ק
ד
מ
ו
נ
י
 
ו
א
ת
 
ה
ח
ת
י
 
ו
א
ת
 
ה
פ
ר
ז
י
 
ו
א
ת
 
ה
ר
פ
א
י
ם
 
ו
א
ת
 
ה
א
מ
ר
י
 
ו
א
ת
 
ה
כ
נ
ע
נ
י
 
ו
א
ת
 
ה
ג
ר
ג
ש
י
 
ו
א
ת
 
ה
ח
ו
י
 
ו
א
ת
 
ה
י
ב
ו
ס
י
 
ו
ש
ר
י
 
א
ש
ת
 
א
ב
ר
ם
 
ל
א
 
י
ל
ד
ה
 
ל
ו
 
ו
ל
ה
 
ש
פ
ח
ה
 
מ
צ
ר
י
ת
 
ו
ש
מ
ה
 
ה
ג
ר
 
ו
ת
א
מ
ר
 
ש
ר
י
 
א
ל
 
א
ב
ר
ם
 
ה
נ
ה
 
נ
א
 
ע
צ
ר
נ
י
 
י
ה
ו
ה
 
מ
ל
ד
ת
 
ב
א
 
נ
א
 
א
ל
 
ש
פ
ח
ת
י
 
א
ו
ל
י
 
א
ב
נ
ה
 
מ
מ
נ
ה
 
ו
י
ש
מ
ע
 
א
ב
ר
ם
 
ל
ק
ו
ל
 
ש
ר
י
 
ו
ת
ק
ח
 
ש
ר
י
 
א
ש
ת
 
א
ב
ר
ם
 
א
ת
 
ה
ג
ר
 
ה
מ
צ
ר
י
ת
 
ש
פ
ח
ת
ה
 
מ
ק
ץ
 
ע
ש
ר
 
ש
נ
י
ם
 
ל
ש
ב
ת
 
א
ב
ר
ם
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ת
ת
ן
 
א
ת
ה
 
ל
א
ב
ר
ם
 
א
י
ש
ה
 
ל
ו
 
ל
א
ש
ה
 
ו
י
ב
א
 
א
ל
 
ה
ג
ר
 
ו
ת
ה
ר
 
ו
ת
ר
א
 
כ
י
 
ה
ר
ת
ה
 
ו
ת
ק
ל
 
ג
ב
ר
ת
ה
 
ב
ע
י
נ
י
ה
 
ו
ת
א
מ
ר
 
ש
ר
י
 
א
ל
 
א
ב
ר
ם
 
ח
מ
ס
י
 
ע
ל
י
ך
 
א
נ
כ
י
 
נ
ת
ת
י
 
ש
פ
ח
ת
י
 
ב
ח
י
ק
ך
 
ו
ת
ר
א
 
כ
י
 
ה
ר
ת
ה
 
ו
א
ק
ל
 
ב
ע
י
נ
י
ה
 
י
ש
פ
ט
 
י
ה
ו
ה
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ו
י
א
מ
ר
 
א
ב
ר
ם
 
א
ל
 
ש
ר
י
 
ה
נ
ה
 
ש
פ
ח
ת
י
ך
 
ב
י
ד
י
ך
 
ע
ש
ה
 
ל
ה
 
ה
ט
ו
ב
 
ב
ע
י
נ
י
ך
 
ו
ת
ע
נ
ה
 
ש
ר
י
 
ו
ת
ב
ר
ח
 
מ
פ
נ
י
ה
 
ו
י
מ
צ
א
ה
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ע
ל
 
ע
י
ן
 
ה
מ
י
ם
 
ב
מ
ד
ב
ר
 
ע
ל
 
ה
ע
י
ן
 
ב
ד
ר
ך
 
ש
ו
ר
 
ו
י
א
מ
ר
 
ה
ג
ר
 
ש
פ
ח
ת
 
ש
ר
י
 
א
ו
י
 
מ
ז
ה
 
ב
א
ת
י
 
ו
א
נ
ה
 
ת
ל
כ
י
 
ו
ת
א
מ
ר
 
מ
פ
נ
י
 
ש
ר
י
 
ג
ב
ר
ת
י
 
א
נ
כ
י
 
ב
ר
ח
ת
 
ו
י
א
מ
ר
 
ל
ה
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ש
ו
ב
י
 
א
ל
 
ג
ב
ר
ת
י
ך
 
ו
ה
ת
ע
נ
י
 
ת
ח
ת
 
י
ד
ה
 
ו
י
א
מ
ר
 
ל
ה
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ה
ר
ב
ה
 
א
ר
ב
ה
 
א
ת
 
ז
ר
ע
י
ך
 
ו
ל
א
 
י
ס
פ
ר
 
מ
ר
ב
 
ו
י
א
מ
ר
 
ל
ה
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ה
נ
ך
 
ה
ר
ה
 
ו
י
ל
ד
ת
 
ב
ן
 
ו
ק
ר
א
ת
 
א
ת
 
ש
מ
ו
 
י
ש
מ
ע
א
ל
 
כ
י
 
ש
מ
ע
 
י
ה
ו
ה
 
א
ל
 
ע
נ
י
ך
 
ו
ה
ו
א
 
י
ה
י
ה
 
פ
ר
ה
 
א
ד
ם
 
י
ד
ו
 
ב
כ
ל
 
ו
י
ד
 
כ
ל
 
ב
ו
 
ו
ע
ל
 
פ
נ
י
 
כ
ל
 
א
ח
י
ו
 
י
ש
כ
ן
 
ו
ת
ק
ר
א
 
ש
ם
 
י
ה
ו
ה
 
ה
ד
ב
ר
 
א
ל
י
ה
 
א
ת
ה
 
א
ל
 
ר
א
ה
 
כ
י
 
א
מ
ר
ה
 
ה
ג
ם
 
ה
ל
ם
 
ר
א
י
ת
י
 
א
ח
ר
י
 
ר
א
ה
 
ע
ל
 
כ
ן
 
ק
ר
א
ה
 
ל
ב
א
ר
 
ב
א
ר
 
ל
ח
י
 
ר
א
ה
 
ה
נ
ה
 
ב
י
ן
 
ק
ד
ש
 
ו
ב
י
ן
 
ב
ר
ד
 
ו
ת
ל
ד
 
ה
ג
ר
 
ל
א
ב
ר
ם
 
ב
ן
 
ו
י
ק
ר
א
 
א
ב
ר
ם
 
א
ת
 
ש
ם
 
ב
נ
ו
 
א
ש
ר
 
י
ל
ד
ה
 
ה
ג
ר
 
י
ש
מ
ע
א
ל
 
ו
א
ב
ר
ם
 
ב
ן
 
ש
מ
נ
י
ם
 
ש
נ
ה
 
ו
ש
ש
 
ש
נ
י
ם
 
ב
ל
ד
ת
 
ה
ג
ר
 
א
ת
 
י
ש
מ
ע
א
ל
 
ל
א
ב
ר
ם
 
ו
י
ה
י
 
א
ב
ר
ם
 
ב
ן
 
ת
ש
ע
י
ם
 
ו
ת
ש
ע
 
ש
נ
י
ם
 
ו
י
ר
א
 
י
ה
ו
ה
 
א
ל
 
א
ב
ר
ם
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
נ
י
 
א
ל
 
ש
ד
י
 
ה
ת
ה
ל
ך
 
ל
פ
נ
י
 
ו
ה
ו
י
 
ת
מ
י
ם
 
ו
א
ת
נ
ה
 
ב
ר
י
ת
י
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ו
א
ר
ב
ה
 
א
ת
ך
 
ב
מ
א
ד
 
מ
א
ד
 
ו
י
פ
ל
 
א
ב
ר
ם
 
ע
ל
 
פ
נ
י
ו
 
ו
י
ד
ב
ר
 
א
ת
ו
 
א
ל
ה
י
ם
 
ל
א
מ
ר
 
ו
א
נ
י
 
ה
נ
ה
 
ב
ר
י
ת
י
 
א
ת
ך
 
ו
ה
י
י
ת
 
ל
א
ב
 
ה
מ
ו
ן
 
ג
ו
י
ם
 
ו
ל
א
 
י
ק
ר
א
 
ע
ו
ד
 
ש
מ
ך
 
א
ב
ר
ם
 
ו
ה
י
ה
 
ש
מ
ך
 
א
ב
ר
ה
ם
 
כ
י
 
א
ב
 
ה
מ
ו
ן
 
ג
ו
י
ם
 
נ
ת
ת
י
ך
 
ו
ה
פ
ר
י
ת
י
 
א
ת
ך
 
ב
מ
א
ד
 
מ
א
ד
 
ו
נ
ת
ת
י
ך
 
ל
ג
ו
י
ם
 
ו
מ
ל
כ
י
ם
 
מ
מ
ך
 
י
צ
א
ו
 
ו
ה
ק
מ
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ו
ב
י
ן
 
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
ל
ד
ר
ת
ם
 
ל
ב
ר
י
ת
 
ע
ו
ל
ם
 
ל
ה
י
ו
ת
 
ל
ך
 
ל
א
ל
ה
י
ם
 
ו
ל
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
ו
נ
ת
ת
י
 
ל
ך
 
ו
ל
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
א
ת
 
א
ר
ץ
 
מ
ג
ר
י
ך
 
א
ת
 
כ
ל
 
א
ר
ץ
 
כ
נ
ע
ן
 
ל
א
ח
ז
ת
 
ע
ו
ל
ם
 
ו
ה
י
י
ת
י
 
ל
ה
ם
 
ל
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
א
ב
ר
ה
ם
 
ו
א
ת
ה
 
א
ת
 
ב
ר
י
ת
י
 
ת
ש
מ
ר
 
א
ת
ה
 
ו
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
ל
ד
ר
ו
ת
ם
 
ז
א
ת
 
ב
ר
י
ת
י
 
א
ש
ר
 
ת
ש
מ
ר
ו
 
ב
י
נ
י
 
ו
ב
י
נ
כ
ם
 
ו
ב
י
ן
 
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
ה
מ
ו
ל
 
ל
כ
ם
 
כ
ל
 
ז
כ
ר
 
ו
נ
מ
ל
ת
ם
 
א
ת
 
ב
ש
ר
 
ע
ר
ל
ת
כ
ם
 
ו
ה
י
ת
ה
 
ל
א
ו
ת
 
ב
ר
י
ת
 
ב
י
נ
י
 
ו
ב
י
נ
כ
ם
 
ו
ב
ן
 
ש
מ
נ
ת
 
י
מ
י
ם
 
י
מ
ו
ל
 
ל
כ
ם
 
כ
ל
 
ז
כ
ר
 
ל
ד
ר
ת
י
כ
ם
 
י
ל
י
ד
 
ב
י
ת
 
ו
מ
ק
נ
ת
 
כ
ס
ף
 
מ
כ
ל
 
ב
ן
 
נ
כ
ר
 
א
ש
ר
 
ל
א
 
מ
ז
ר
ע
ך
 
ה
ו
א
 
ה
מ
ו
ל
 
י
מ
ו
ל
 
י
ל
י
ד
י
 
ב
י
ת
ך
 
ו
מ
ק
נ
ת
 
כ
ס
פ
ך
 
ו
ה
י
ת
ה
 
ב
ר
י
ת
י
 
ב
ב
ש
ר
כ
ם
 
ל
ב
ר
י
ת
 
ע
ו
ל
ם
 
ו
ע
ר
ל
 
ז
כ
ר
 
א
ש
ר
 
ל
א
 
י
מ
ו
ל
 
א
ת
 
ב
ש
ר
 
ע
ר
ל
ת
ו
 
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
מ
י
ה
 
א
ת
 
ב
ר
י
ת
י
 
ה
פ
ר
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
א
ב
ר
ה
ם
 
ש
ר
י
 
א
ש
ת
ך
 
ל
א
 
ת
ק
ר
א
 
א
ת
 
ש
מ
ה
 
ש
ר
י
 
כ
י
 
ש
ר
ה
 
ש
מ
ה
 
ו
ב
ר
כ
ת
י
 
א
ת
ה
 
ו
ג
ם
 
נ
ת
ת
י
 
מ
מ
נ
ה
 
ל
ך
 
ב
ן
 
ו
ב
ר
כ
ת
י
ו
 
ו
ה
י
ת
ה
 
ל
ג
ו
י
ם
 
ו
מ
ל
כ
י
 
ע
מ
י
ם
 
מ
מ
נ
ה
 
י
ה
י
ו
 
ו
י
פ
ל
 
א
ב
ר
ה
ם
 
ע
ל
 
פ
נ
י
ו
 
ו
י
צ
ח
ק
 
ו
י
א
מ
ר
 
ב
ל
ב
ו
 
ה
ל
ב
ן
 
מ
א
ת
 
ש
נ
ה
 
א
ו
ל
י
ד
 
ו
א
ם
 
ש
ר
ה
 
ה
ב
ת
 
ת
ש
ע
י
ם
 
ש
נ
ה
 
ת
ל
ד
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
ל
 
ה
א
ל
ה
י
ם
 
ל
ו
י
 
י
ש
מ
ע
א
ל
 
י
ח
י
ה
 
ל
פ
נ
י
ך
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ב
ל
 
ה
נ
ה
 
ש
ר
ה
 
א
ש
ת
ך
 
י
ל
ד
ת
 
ל
ך
 
ב
ן
 
ו
ק
ר
א
ת
 
א
ת
 
ש
מ
ו
 
י
צ
ח
ק
 
ו
ה
ק
מ
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
א
ת
ו
 
ל
ב
ר
י
ת
 
ע
ו
ל
ם
 
ו
ל
ז
ר
ע
ו
 
א
ח
ר
י
ו
 
ו
ל
י
ש
מ
ע
א
ל
 
ש
מ
ע
ת
י
ך
 
ה
נ
ה
 
ב
ר
כ
ת
י
 
א
ת
ו
 
ו
ה
פ
ר
י
ת
י
 
א
ת
ו
 
ו
ה
ר
ב
י
ת
י
 
א
ת
ו
 
ב
מ
א
ד
 
מ
א
ד
 
ש
נ
י
ם
 
ע
ש
ר
 
נ
ש
י
א
י
ם
 
י
ו
ל
י
ד
 
ו
נ
ת
ת
י
ו
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
ו
א
ת
 
ב
ר
י
ת
י
 
א
ק
י
ם
 
א
ת
 
י
צ
ח
ק
 
א
ש
ר
 
ת
ל
ד
 
ל
ך
 
ש
ר
ה
 
ל
מ
ו
ע
ד
 
ה
ז
ה
 
ב
ש
נ
ה
 
ה
א
ח
ר
ת
 
ו
י
כ
ל
 
ל
ד
ב
ר
 
א
ת
ו
 
ו
י
ע
ל
 
א
ל
ה
י
ם
 
מ
ע
ל
 
א
ב
ר
ה
ם
 
ו
י
ק
ח
 
א
ב
ר
ה
ם
 
א
ת
 
י
ש
מ
ע
א
ל
 
ב
נ
ו
 
ו
א
ת
 
כ
ל
 
י
ל
י
ד
י
 
ב
י
ת
ו
 
ו
א
ת
 
כ
ל
 
מ
ק
נ
ת
 
כ
ס
פ
ו
 
כ
ל
 
ז
כ
ר
 
ב
א
נ
ש
י
 
ב
י
ת
 
א
ב
ר
ה
ם
 
ו
י
מ
ל
 
א
ת
 
ב
ש
ר
 
ע
ר
ל
ת
ם
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
כ
א
ש
ר
 
ד
ב
ר
 
א
ת
ו
 
א
ל
ה
י
ם
 
ו
א
ב
ר
ה
ם
 
ב
ן
 
ת
ש
ע
י
ם
 
ו
ת
ש
ע
 
ש
נ
י
ם
 
ב
ה
מ
ל
ו
 
א
ת
 
ב
ש
ר
 
ע
ר
ל
ת
ו
 
ו
י
ש
מ
ע
א
ל
 
ב
נ
ו
 
ב
ן
 
ש
ל
ש
 
ע
ש
ר
ה
 
ש
נ
ה
 
ב
ה
מ
ל
ו
 
א
ת
 
ב
ש
ר
 
ע
ר
ל
ת
ו
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
נ
מ
ל
 
א
ב
ר
ה
ם
 
ו
י
ש
מ
ע
א
ל
 
ב
נ
ו
 
ו
כ
ל
 
א
נ
ש
י
 
ב
י
ת
ו
 
י
ל
י
ד
 
ב
י
ת
 
ו
מ
ק
נ
ת
 
כ
ס
ף
 
מ
א
ת
 
ב
ן
 
נ
כ
ר
 
נ
מ
ל
ו
 
א
ת
ו
 
ו
י
ר
א
 
א
ל
י
ו
 
י
ה
ו
ה
 
ב
א
ל
ו
נ
י
 
מ
מ
ר
א
 
ו
ה
ו
א
 
י
ש
ב
 
פ
ת
ח
 
ה
א
ה
ל
 
כ
ח
ם
 
ה
י
ו
ם
 
ו
י
ש
א
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ש
ל
ש
ה
 
א
נ
ו
ש
י
ם
 
נ
צ
ב
י
ם
 
ע
ל
י
ו
 
ו
י
ר
א
 
ו
י
ר
ץ
 
ל
ק
ר
א
ת
ם
 
מ
פ
ת
ח
 
ה
א
ה
ל
 
ו
י
ש
ת
ח
ו
י
 
א
ר
צ
ה
 
ו
י
א
מ
ר
 
א
ד
נ
י
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
כ
ם
 
א
ל
 
נ
א
 
ת
ע
ב
ר
ו
 
מ
ע
ל
 
ע
ב
ד
כ
ם
 
י
ק
ח
 
נ
א
 
מ
ע
ט
 
מ
י
ם
 
ו
ר
ח
צ
ו
 
ר
ג
ל
י
כ
ם
 
ו
ה
ש
ע
י
נ
ו
 
ת
ח
ת
 
ה
ע
ץ
 
ו
א
ק
ח
 
פ
ת
 
ל
ח
ם
 
ו
ס
ע
ד
ו
 
ל
ב
ב
כ
ם
 
ו
א
ח
ר
 
ת
ע
ב
ר
ו
 
כ
י
 
ע
ל
 
כ
ן
 
ע
ב
ר
ת
ם
 
ע
ל
 
ע
ב
ד
כ
ם
 
ו
י
א
מ
ר
ו
 
כ
ן
 
ת
ע
ש
ה
 
כ
א
ש
ר
 
ד
ב
ר
ת
 
ו
י
מ
ה
ר
 
א
ב
ר
ה
ם
 
ה
א
ה
ל
ה
 
א
ל
 
ש
ר
ה
 
ו
י
א
מ
ר
 
מ
ה
ר
י
 
ש
ל
ש
 
ס
י
ם
 
ק
מ
ח
 
ס
ל
ת
 
ל
ו
ש
י
 
ו
ע
ש
ה
 
ע
ג
ו
ת
 
ו
א
ל
 
ה
ב
ק
ר
 
ר
ץ
 
א
ב
ר
ה
ם
 
ו
י
ק
ח
 
ב
ן
 
ב
ק
ר
 
ר
ך
 
ו
ט
ו
ב
 
ו
י
ת
ן
 
א
ל
 
ה
נ
ע
ר
 
ו
י
מ
ה
ר
 
ל
ע
ש
ו
ת
ו
 
ו
י
ק
ח
 
ח
מ
א
ה
 
ו
ח
ל
ב
 
ו
א
ת
 
ב
ן
 
ה
ב
ק
ר
 
א
ש
ר
 
ע
ש
ה
 
ו
י
ת
ן
 
ל
פ
נ
י
ה
ם
 
ו
ה
ו
א
 
ע
מ
ד
 
ע
ל
י
ה
ם
 
ת
ח
ת
 
ה
ע
ץ
 
ו
י
א
כ
ל
ו
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
א
י
ה
 
ש
ר
ה
 
א
ש
ת
ך
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ב
א
ה
ל
 
ו
י
א
מ
ר
 
ש
ו
ב
 
א
ש
ו
ב
 
א
ל
י
ך
 
כ
ע
ת
 
ח
י
ה
 
ו
ה
נ
ה
 
ב
ן
 
ל
ש
ר
ה
 
א
ש
ת
ך
 
ו
ש
ר
ה
 
ש
מ
ע
ת
 
פ
ת
ח
 
ה
א
ה
ל
 
ו
ה
י
א
 
א
ח
ר
י
ו
 
ו
א
ב
ר
ה
ם
 
ו
ש
ר
ה
 
ז
ק
נ
י
ם
 
ב
א
י
ם
 
ב
י
מ
י
ם
 
ח
ד
ל
 
ל
ה
י
ו
ת
 
ל
ש
ר
ה
 
א
ר
ח
 
כ
נ
ש
י
ם
 
ו
ת
צ
ח
ק
 
ש
ר
ה
 
ב
ק
ר
ב
ה
 
ל
א
מ
ר
 
א
ח
ר
י
 
ב
ל
ת
י
 
ה
י
ת
ה
 
ל
י
 
ע
ד
נ
ה
 
ו
א
ד
נ
י
 
ז
ק
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
א
ב
ר
ה
ם
 
ל
מ
ה
 
ז
ה
 
צ
ח
ק
ה
 
ש
ר
ה
 
ל
א
מ
ר
 
ה
א
ף
 
א
מ
נ
ם
 
א
ל
ד
 
ו
א
נ
י
 
ז
ק
נ
ת
י
 
ה
י
פ
ל
א
 
מ
י
ה
ו
ה
 
ד
ב
ר
 
ל
מ
ו
ע
ד
 
א
ש
ו
ב
 
א
ל
י
ך
 
כ
ע
ת
 
ח
י
ה
 
ו
ל
ש
ר
ה
 
ב
ן
 
ו
ת
כ
ח
ש
 
ש
ר
ה
 
ל
א
מ
ר
 
ל
א
 
צ
ח
ק
ת
י
 
כ
י
 
י
ר
א
ה
 
ו
י
א
מ
ר
 
ל
ה
 
כ
י
 
צ
ח
ק
ת
 
ו
י
ק
מ
ו
 
מ
ש
ם
 
ה
א
נ
ו
ש
י
ם
 
ו
י
ש
ק
פ
ו
 
ע
ל
 
פ
נ
י
 
ס
ד
ם
 
ו
א
ב
ר
ה
ם
 
ה
ל
ך
 
ע
מ
ם
 
ל
ש
ל
ח
ם
 
ו
י
ה
ו
ה
 
א
מ
ר
 
ה
מ
כ
ס
ה
 
א
נ
י
 
מ
א
ב
ר
ה
ם
 
א
ת
 
א
ש
ר
 
א
נ
י
 
ע
ש
ה
 
ו
א
ב
ר
ה
ם
 
ה
י
ו
 
י
ה
י
ה
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
ו
ע
צ
ו
ם
 
ו
נ
ב
ר
כ
ו
 
ב
ו
 
כ
ל
 
ג
ו
י
 
ה
א
ר
ץ
 
כ
י
 
י
ד
ע
ת
י
 
ל
מ
ע
ן
 
א
ש
ר
 
י
צ
ו
ה
 
א
ב
ר
ה
ם
 
א
ת
 
ב
נ
י
ו
 
ו
א
ת
 
ב
י
ת
ו
 
א
ח
ר
י
ו
 
ו
ש
מ
ר
ו
 
ד
ר
ך
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
צ
ד
ק
ה
 
ו
מ
ש
פ
ט
 
ל
מ
ע
ן
 
ה
ב
י
א
 
י
ה
ו
ה
 
ע
ל
 
א
ב
ר
ה
ם
 
א
ת
 
א
ש
ר
 
ד
ב
ר
 
ע
ל
י
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
צ
ע
ק
ת
 
ס
ד
ם
 
ו
ע
מ
ר
ה
 
כ
י
 
ר
ב
ה
 
ו
ח
ט
א
ת
ם
 
כ
י
 
כ
ב
ד
ה
 
מ
א
ד
 
א
ר
ד
ה
 
נ
א
 
ו
א
ר
א
ה
 
ה
ך
 
צ
ע
ק
ת
ה
 
ה
ב
א
ה
 
א
ל
י
 
ע
ש
ו
 
כ
ל
ה
 
ו
א
ם
 
ל
א
 
א
ד
ע
ה
 
ו
י
פ
נ
ו
 
מ
ש
ם
 
ה
א
נ
ו
ש
י
ם
 
ו
י
ל
כ
ו
 
ס
ד
מ
ה
 
ו
א
ב
ר
ה
ם
 
ע
ו
ד
נ
ו
 
ע
מ
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ג
ש
 
א
ב
ר
ה
ם
 
ו
י
א
מ
ר
 
ה
א
ף
 
ת
ס
פ
ה
 
צ
ד
י
ק
 
ע
ם
 
ר
ש
ע
 
א
ו
ל
י
 
י
ש
 
ח
מ
ש
י
ם
 
צ
ד
י
ק
י
ם
 
ב
ת
ו
ך
 
ה
ע
י
ר
 
ה
א
ף
 
ת
ס
פ
ה
 
ו
ל
א
 
ת
ש
א
 
ל
מ
ק
ו
ם
 
ל
מ
ע
ן
 
ח
מ
ש
י
ם
 
ה
צ
ד
ק
י
ם
 
א
ש
ר
 
ב
ק
ר
ב
ה
 
ח
ל
י
ל
ה
 
ל
ך
 
מ
ע
ש
ו
ת
 
כ
ד
ב
ר
 
ה
ז
ה
 
ל
ה
מ
י
ת
 
צ
ד
י
ק
 
ע
ם
 
ר
ש
ע
 
ו
ה
י
ה
 
כ
צ
ד
י
ק
 
כ
ר
ש
ע
 
ח
ל
י
ל
ה
 
ל
ך
 
ה
ש
פ
ט
 
כ
ל
 
ה
א
ר
ץ
 
ל
א
 
י
ע
ש
ה
 
מ
ש
פ
ט
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ם
 
א
מ
צ
א
 
ב
ס
ד
ם
 
ח
מ
ש
י
ם
 
צ
ד
ק
י
ם
 
ב
ת
ו
ך
 
ה
ע
י
ר
 
ו
נ
ש
א
ת
י
 
ל
כ
ל
 
ה
מ
ק
ו
ם
 
ב
ע
ב
ו
ר
ם
 
ו
י
ע
ן
 
א
ב
ר
ה
ם
 
ו
י
א
מ
ר
 
ה
נ
ה
 
נ
א
 
ה
ו
א
ל
ת
י
 
ל
ד
ב
ר
 
א
ל
 
א
ד
נ
י
 
ו
א
נ
כ
י
 
ע
פ
ר
 
ו
א
פ
ר
 
א
ו
ל
י
 
י
ח
ס
ר
ו
ן
 
ח
מ
ש
י
ם
 
ה
צ
ד
ק
י
ם
 
ח
מ
ש
ה
 
ה
ת
ש
ח
י
ת
 
ב
ח
מ
ש
ה
 
א
ת
 
כ
ל
 
ה
ע
י
ר
 
ו
י
א
מ
ר
 
ל
א
 
א
ש
ח
י
ת
 
א
ם
 
א
מ
צ
א
 
ש
ם
 
א
ר
ב
ע
י
ם
 
ו
ח
מ
ש
ה
 
ו
י
ס
ף
 
ע
ו
ד
 
ל
ד
ב
ר
 
א
ל
י
ו
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ו
ל
י
 
י
מ
צ
א
ו
ן
 
ש
ם
 
א
ר
ב
ע
י
ם
 
ו
י
א
מ
ר
 
ל
א
 
א
ש
ח
י
ת
 
ב
ע
ב
ו
ר
 
ה
א
ר
ב
ע
י
ם
 
ו
י
א
מ
ר
 
א
ל
 
נ
א
 
י
ח
ר
 
ל
א
ד
נ
י
 
ו
א
ד
ב
ר
ה
 
א
ו
ל
י
 
י
מ
צ
א
ו
ן
 
ש
ם
 
ש
ל
ש
י
ם
 
ו
י
א
מ
ר
 
ל
א
 
א
ש
ח
י
ת
 
א
ם
 
א
מ
צ
א
 
ש
ם
 
ש
ל
ש
י
ם
 
ו
י
א
מ
ר
 
ה
נ
ה
 
נ
א
 
ה
ו
א
ל
ת
י
 
ל
ד
ב
ר
 
א
ל
 
א
ד
נ
י
 
א
ו
ל
י
 
י
מ
צ
א
ו
ן
 
ש
ם
 
ע
ש
ר
י
ם
 
ו
י
א
מ
ר
 
ל
א
 
א
ש
ח
י
ת
 
ב
ע
ב
ו
ר
 
ה
ע
ש
ר
י
ם
 
ו
י
א
מ
ר
 
א
ל
 
נ
א
 
י
ח
ר
 
ל
א
ד
נ
י
 
ו
א
ד
ב
ר
ה
 
א
ך
 
ה
פ
ע
ם
 
א
ו
ל
י
 
י
מ
צ
א
ו
ן
 
ש
ם
 
ע
ש
ר
ה
 
ו
י
א
מ
ר
 
ל
א
 
א
ש
ח
י
ת
 
ב
ע
ב
ו
ר
 
ה
ע
ש
ר
ה
 
ו
י
ל
ך
 
י
ה
ו
ה
 
כ
א
ש
ר
 
כ
ל
ה
 
ל
ד
ב
ר
 
א
ל
 
א
ב
ר
ה
ם
 
ו
א
ב
ר
ה
ם
 
ש
ב
 
ל
מ
ק
ו
מ
ו
 
ו
י
ב
א
ו
 
ש
נ
י
 
ה
מ
ל
א
כ
י
ם
 
ס
ד
מ
ה
 
ב
ע
ר
ב
 
ו
ל
ו
ט
 
י
ש
ב
 
ב
ש
ע
ר
 
ס
ד
ם
 
ו
י
ר
א
 
ל
ו
ט
 
ו
י
ק
ם
 
ל
ק
ר
א
ת
ם
 
ו
י
ש
ת
ח
ו
י
 
א
פ
י
ם
 
א
ר
צ
ה
 
ו
י
א
מ
ר
 
ה
נ
ה
 
נ
א
 
א
ד
נ
י
 
ס
ו
ר
ו
 
נ
א
 
א
ל
 
ב
י
ת
 
ע
ב
ד
כ
ם
 
ו
ל
י
נ
ו
 
ו
ר
ח
צ
ו
 
ר
ג
ל
י
כ
ם
 
ו
ה
ש
כ
מ
ת
ם
 
ו
ה
ל
כ
ת
ם
 
ל
ד
ר
כ
כ
ם
 
ו
י
א
מ
ר
ו
 
ל
א
 
כ
י
 
ב
ר
ח
ב
 
נ
ל
י
ן
 
ו
י
פ
צ
ר
 
ב
ם
 
מ
א
ד
 
ו
י
ס
ר
ו
 
א
ל
י
ו
 
ו
י
ב
א
ו
 
א
ל
 
ב
י
ת
ו
 
ו
י
ע
ש
 
ל
ה
ם
 
מ
ש
ת
ה
 
ו
מ
צ
ו
ת
 
א
פ
ה
 
ו
י
א
כ
ל
ו
 
ט
ר
ם
 
י
ש
כ
ב
ו
 
א
נ
ש
י
 
ה
ע
י
ר
 
א
נ
ש
י
 
ס
ד
ם
 
נ
ס
ב
ו
 
ע
ל
 
ה
ב
י
ת
 
מ
נ
ע
ר
 
ו
ע
ד
 
ז
ק
ן
 
כ
ל
 
ה
ע
ם
 
מ
ק
צ
ה
 
ו
י
ק
ר
א
ו
 
א
ל
 
ל
ו
ט
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
א
י
ה
 
ה
א
נ
ו
ש
י
ם
 
א
ש
ר
 
ב
א
ו
 
א
ל
י
ך
 
ה
ל
י
ל
ה
 
ה
ו
צ
י
א
ם
 
א
ל
י
נ
ו
 
ו
נ
ד
ע
 
א
ת
ם
 
ו
י
צ
א
 
א
ל
י
ה
ם
 
ל
ו
ט
 
ה
פ
ת
ח
 
ו
ה
ד
ל
ת
 
ס
ג
ר
ו
 
א
ח
ר
י
ו
 
ו
י
א
מ
ר
 
א
ל
 
נ
א
 
א
ח
י
 
ת
ר
י
ע
ו
 
ה
נ
ה
 
נ
א
 
ל
י
 
ש
ת
י
 
ב
נ
ו
ת
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
 
א
י
ש
 
ה
ו
צ
י
א
 
נ
א
 
א
ת
ה
ן
 
א
ל
י
כ
ם
 
ו
ע
ש
ו
 
ל
ה
ן
 
כ
ט
ו
ב
 
ב
ע
י
נ
י
כ
ם
 
ר
ק
 
ל
א
נ
ש
י
ם
 
ה
א
ל
ה
 
א
ל
 
ת
ע
ש
ו
 
ד
ב
ר
 
כ
י
 
ע
ל
 
כ
ן
 
ב
א
ו
 
ב
צ
ל
 
ק
ו
ר
ת
י
 
ו
י
א
מ
ר
ו
 
ג
ש
ה
 
ה
ל
א
ה
 
ו
י
א
מ
ר
ו
 
א
ח
ד
 
ב
א
 
ל
ג
ו
ר
 
ו
י
ש
פ
ט
 
ג
ם
 
ש
פ
ט
 
ע
ת
ה
 
נ
ר
י
ע
 
ל
ך
 
מ
ה
ם
 
ו
י
פ
צ
ר
ו
 
ב
א
י
ש
 
ב
ל
ו
ט
 
מ
א
ד
 
ו
י
ג
ש
ו
 
ל
ש
ב
ר
 
ה
ד
ל
ת
 
ו
י
ש
ל
ח
ו
 
ה
א
נ
ו
ש
י
ם
 
א
ת
 
י
ד
ם
 
ו
י
ב
י
א
ו
 
א
ת
 
ל
ו
ט
 
א
ל
י
ה
ם
 
ה
ב
י
ת
ה
 
ו
א
ת
 
ה
ד
ל
ת
 
ס
ג
ר
ו
 
ו
א
ת
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
פ
ת
ח
 
ה
ב
י
ת
 
ה
כ
ו
 
ב
ס
נ
ו
ר
י
ם
 
מ
ק
ט
ן
 
ו
ע
ד
 
ג
ד
ו
ל
 
ו
י
ל
א
ו
 
ל
מ
צ
א
 
ה
פ
ת
ח
 
ו
י
א
מ
ר
ו
 
ה
מ
ל
א
כ
י
ם
 
א
ל
 
ל
ו
ט
 
ע
ו
ד
 
מ
י
 
ל
ך
 
פ
ה
 
ח
ת
ן
 
ב
נ
י
ך
 
ו
ב
נ
ת
י
ך
 
ו
כ
ל
 
א
ש
ר
 
ל
ך
 
ב
ע
י
ר
 
ה
ו
צ
י
א
 
מ
ן
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
כ
י
 
מ
ש
ח
י
ת
י
ם
 
א
נ
ח
נ
ו
 
א
ת
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
כ
י
 
ג
ד
ל
ה
 
צ
ע
ק
ת
ם
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ש
ל
ח
נ
ו
 
י
ה
ו
ה
 
ל
ה
ש
ח
י
ת
ה
 
ו
י
צ
א
 
ל
ו
ט
 
ו
י
ד
ב
ר
 
א
ל
 
ח
ת
נ
י
ו
 
ל
ק
ח
י
 
ב
נ
ת
י
ו
 
ו
י
א
מ
ר
 
ק
ו
מ
ו
 
צ
א
ו
 
מ
ן
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
כ
י
 
מ
ש
ח
י
ת
 
י
ה
ו
ה
 
א
ת
 
ה
ע
י
ר
 
ו
י
ה
י
 
כ
מ
צ
ח
ק
 
ב
ע
י
נ
י
 
ח
ת
נ
י
ו
 
ו
כ
מ
ו
 
ה
ש
ח
ר
 
ע
ל
ה
 
ו
י
א
י
צ
ו
 
ה
מ
ל
א
כ
י
ם
 
ב
ל
ו
ט
 
ל
א
מ
ר
 
ק
ו
ם
 
ק
ח
 
א
ת
 
א
ש
ת
ך
 
ו
א
ת
 
ש
ת
י
 
ב
נ
ת
י
ך
 
ה
נ
מ
צ
א
ו
ת
 
פ
ן
 
ת
ס
פ
ה
 
ב
ע
ו
ן
 
ה
ע
י
ר
 
ו
י
ת
מ
ה
מ
ה
 
ו
י
ח
ז
ק
ו
 
ה
א
נ
ו
ש
י
ם
 
ב
י
ד
ו
 
ו
ב
י
ד
 
א
ש
ת
ו
 
ו
ב
י
ד
 
ש
ת
י
 
ב
נ
ת
י
ו
 
ב
ח
מ
ל
ת
 
י
ה
ו
ה
 
ע
ל
י
ו
 
ו
י
ו
צ
י
א
ה
ו
 
ו
י
נ
י
ח
ה
ו
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
ו
י
ה
י
 
כ
ה
ו
צ
י
א
ם
 
א
ת
ם
 
ה
ח
ו
צ
ה
 
ו
י
א
מ
ר
 
ה
מ
ל
ט
 
ע
ל
 
נ
פ
ש
ך
 
א
ל
 
ת
ב
ט
 
א
ח
ר
י
ך
 
ו
א
ל
 
ת
ע
מ
ד
 
ב
כ
ל
 
ה
כ
כ
ר
 
ה
ה
ר
ה
 
ה
מ
ל
ט
 
פ
ן
 
ת
ס
פ
ה
 
ו
י
א
מ
ר
 
ל
ו
ט
 
א
ל
י
ה
ם
 
א
ל
 
נ
א
 
א
ד
נ
י
 
ה
נ
ה
 
נ
א
 
מ
צ
א
 
ע
ב
ד
ך
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ו
ת
ג
ד
ל
 
ח
ס
ד
ך
 
א
ש
ר
 
ע
ש
י
ת
 
ע
מ
ד
י
 
ל
ה
ח
י
ו
ת
 
א
ת
 
נ
פ
ש
י
 
ו
א
נ
כ
י
 
ל
א
 
א
ו
כ
ל
 
ל
ה
מ
ל
ט
 
ה
ה
ר
ה
 
פ
ן
 
ת
ד
ב
ק
נ
י
 
ה
ר
ע
ה
 
ו
מ
ת
י
 
ה
נ
ה
 
נ
א
 
ה
ע
י
ר
 
ה
ז
א
ת
 
ק
ר
ו
ב
ה
 
ל
נ
ו
ס
 
ש
מ
ה
 
ו
ה
י
א
 
מ
צ
ע
ר
 
א
מ
ל
ט
 
נ
א
 
ש
מ
ה
 
ה
ל
ו
א
 
מ
צ
ע
ר
 
ה
י
א
 
ו
ת
ח
י
ה
 
נ
פ
ש
י
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ה
נ
ה
 
נ
ש
א
ת
י
 
פ
נ
י
ך
 
ג
ם
 
ל
ד
ב
ר
 
ה
ז
ה
 
ל
ב
ל
ת
י
 
ה
פ
כ
י
 
א
ת
 
ה
ע
י
ר
 
א
ש
ר
 
ד
ב
ר
ת
 
מ
ה
ר
 
ה
מ
ל
ט
 
ש
מ
ה
 
כ
י
 
ל
א
 
א
ו
כ
ל
 
ל
ע
ש
ו
ת
 
ד
ב
ר
 
ע
ד
 
ב
א
כ
ה
 
ש
מ
ה
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
ם
 
ה
ע
י
ר
 
צ
ע
ר
 
ה
ש
מ
ש
 
י
צ
א
 
ע
ל
 
ה
א
ר
ץ
 
ו
ל
ו
ט
 
ב
א
 
צ
ע
ר
ה
 
ו
י
ה
ו
ה
 
ה
מ
ט
י
ר
 
ע
ל
 
ס
ד
ם
 
ו
ע
ל
 
ע
מ
ר
ה
 
ג
פ
ר
י
ת
 
ו
א
ש
 
מ
א
ת
 
י
ה
ו
ה
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
י
ה
פ
ך
 
א
ת
 
ה
ע
ר
י
ם
 
ה
א
ל
ה
 
ו
א
ת
 
כ
ל
 
ה
כ
כ
ר
 
ו
א
ת
 
כ
ל
 
י
ש
ב
י
 
ה
ע
ר
י
ם
 
ו
צ
מ
ח
 
ה
א
ד
מ
ה
 
ו
ת
ב
ט
 
א
ש
ת
ו
 
מ
א
ח
ר
י
ו
 
ו
ת
ה
י
 
נ
צ
ב
 
מ
ל
ח
 
ו
י
ש
כ
ם
 
א
ב
ר
ה
ם
 
ב
ב
ק
ר
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ע
מ
ד
 
ש
ם
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ש
ק
ף
 
ע
ל
 
פ
נ
י
 
ס
ד
ם
 
ו
ע
מ
ר
ה
 
ו
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
ה
כ
כ
ר
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ע
ל
ה
 
ק
י
ט
ו
ר
 
ה
א
ר
ץ
 
כ
ק
י
ט
ו
ר
 
ה
כ
ב
ש
ן
 
ו
י
ה
י
 
ב
ה
ש
ח
י
ת
 
א
ל
ה
י
ם
 
א
ת
 
ע
ר
י
 
ה
כ
כ
ר
 
ו
י
ז
כ
ר
 
א
ל
ה
י
ם
 
א
ת
 
א
ב
ר
ה
ם
 
ו
י
ש
ל
ח
 
א
ת
 
ל
ו
ט
 
מ
ת
ו
ך
 
ה
א
פ
כ
ה
 
ב
ה
פ
כ
ו
 
א
ת
 
ה
ע
ר
י
ם
 
א
ש
ר
 
י
ש
ב
 
ב
ה
ן
 
ל
ו
ט
 
ו
י
ע
ל
 
ל
ו
ט
 
מ
צ
ע
ר
 
ו
י
ש
ב
 
ב
ה
ר
 
ו
ש
ת
י
 
ב
נ
ת
י
ו
 
ע
מ
ו
 
כ
י
 
י
ר
א
 
ל
ש
ב
ת
 
ב
צ
ע
ר
 
ו
י
ש
ב
 
ב
מ
ע
ר
ה
 
ה
ו
א
 
ו
ש
ת
י
 
ב
נ
ת
י
ו
 
ע
מ
ו
 
ו
ת
א
מ
ר
 
ה
ב
כ
י
ר
ה
 
א
ל
 
ה
צ
ע
י
ר
ה
 
א
ב
י
נ
ו
 
ז
ק
ן
 
ו
א
י
ש
 
א
י
ן
 
ב
א
ר
ץ
 
ל
ב
ו
א
 
ע
ל
י
נ
ו
 
כ
ד
ר
ך
 
כ
ל
 
ה
א
ר
ץ
 
ל
כ
י
 
נ
ש
ק
ה
 
א
ת
 
א
ב
י
נ
ו
 
י
י
ן
 
ו
נ
ש
כ
ב
ה
 
ע
מ
ו
 
ו
נ
ח
י
ה
 
מ
א
ב
י
נ
ו
 
ז
ר
ע
 
ו
ת
ש
ק
י
ה
ן
 
א
ת
 
א
ב
י
ה
ן
 
י
י
ן
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ו
ת
ב
א
 
ה
ב
כ
י
ר
ה
 
ו
ת
ש
כ
ב
 
א
ת
 
א
ב
י
ה
 
ו
ל
א
 
י
ד
ע
 
ב
ש
כ
ב
ה
 
ו
ב
ק
ו
מ
ה
 
ו
י
ה
י
 
מ
מ
ח
ר
ת
 
ו
ת
א
מ
ר
 
ה
ב
כ
י
ר
ה
 
א
ל
 
ה
צ
ע
י
ר
ה
 
ה
נ
ה
 
ש
כ
ב
ת
י
 
א
מ
ש
 
א
ת
 
א
ב
י
 
נ
ש
ק
י
נ
ו
 
י
י
ן
 
ג
ם
 
ה
ל
י
ל
ה
 
ו
ב
א
י
 
ש
כ
ב
י
 
ע
מ
ו
 
ו
נ
ח
י
ה
 
מ
א
ב
י
נ
ו
 
ז
ר
ע
 
ו
ת
ש
ק
י
ה
ן
 
ג
ם
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
א
ת
 
א
ב
י
ה
ן
 
י
י
ן
 
ו
ת
ק
ם
 
ה
צ
ע
י
ר
ה
 
ו
ת
ש
כ
ב
 
ע
מ
ו
 
ו
ל
א
 
י
ד
ע
 
ב
ש
כ
ב
ה
 
ו
ב
ק
ו
מ
ה
 
ו
ת
ה
ר
נ
ה
 
ש
ת
י
 
ב
נ
ו
ת
 
ל
ו
ט
 
מ
א
ב
י
ה
ן
 
ו
ת
ל
ד
 
ה
ב
כ
י
ר
ה
 
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
מ
ו
א
ב
 
ה
ו
א
 
א
ב
י
 
מ
ו
א
ב
 
ע
ד
 
ה
י
ו
ם
 
ו
ה
צ
ע
י
ר
ה
 
ג
ם
 
ה
י
א
 
י
ל
ד
ה
 
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ב
נ
 
ע
מ
י
 
ה
ו
א
 
א
ב
י
 
ב
נ
י
 
ע
מ
ו
ן
 
ע
ד
 
ה
י
ו
ם
 
ו
י
ס
ע
 
מ
ש
ם
 
א
ב
ר
ה
ם
 
א
ר
ץ
 
ה
נ
ג
ב
 
ו
י
ש
ב
 
ב
י
ן
 
ק
ד
ש
 
ו
ב
י
ן
 
ש
ו
ר
 
ו
י
ג
ר
 
ב
ג
ר
ר
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
ל
 
ש
ר
ה
 
א
ש
ת
ו
 
א
ח
ו
ת
י
 
ה
י
א
 
ו
י
ש
ל
ח
 
א
ב
י
מ
ל
ך
 
מ
ל
ך
 
ג
ר
ר
 
ו
י
ק
ח
 
א
ת
 
ש
ר
ה
 
ו
י
ב
א
 
א
ל
ה
י
ם
 
א
ל
 
א
ב
י
מ
ל
ך
 
ב
ח
ל
ו
ם
 
ה
ל
י
ל
ה
 
ו
י
א
מ
ר
 
ל
ו
 
ה
נ
ך
 
מ
ת
 
ע
ל
 
א
ד
ו
ת
 
ה
א
ש
ה
 
א
ש
ר
 
ל
ק
ח
ת
 
ו
ה
י
א
 
ב
ע
י
ל
ת
 
ב
ע
ל
 
ו
א
ב
י
מ
ל
ך
 
ל
א
 
ק
ר
ב
 
א
ל
י
ה
 
ו
י
א
מ
ר
 
א
ד
נ
י
 
ה
ג
ו
י
 
ג
ם
 
צ
ד
י
ק
 
ת
ה
ר
ג
 
ה
ל
ו
א
 
ה
ו
א
 
א
מ
ר
 
ל
י
 
א
ח
ו
ת
י
 
ה
י
א
 
ו
ה
י
א
 
ג
ם
 
א
מ
ר
ה
 
א
ח
י
 
ה
ו
א
 
ב
ת
ם
 
ל
ב
ב
י
 
ו
ב
נ
ק
י
ו
ן
 
כ
פ
י
 
ע
ש
י
ת
י
 
ז
א
ת
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ה
א
ל
ה
י
ם
 
ב
ח
ל
ו
ם
 
ג
ם
 
א
נ
כ
י
 
י
ד
ע
ת
י
 
כ
י
 
ב
ת
ם
 
ל
ב
ב
ך
 
ע
ש
י
ת
 
ז
א
ת
 
ו
א
ח
ש
ך
 
ג
ם
 
א
נ
כ
י
 
א
ת
ך
 
מ
ח
ט
א
ה
 
ל
י
 
ע
ל
 
כ
ן
 
ל
א
 
נ
ת
ת
י
ך
 
ל
נ
ג
ע
 
א
ל
י
ה
 
ו
ע
ת
ה
 
ה
ש
ב
 
א
ת
 
א
ש
ת
 
ה
א
י
ש
 
כ
י
 
נ
ב
י
א
 
ה
ו
א
 
ו
י
ת
פ
ל
ל
 
ב
ע
ד
ך
 
ו
ח
י
ה
 
ו
א
ם
 
א
י
נ
ך
 
מ
ש
י
ב
 
ד
ע
 
כ
י
 
מ
ו
ת
 
ת
מ
ו
ת
 
א
ת
ה
 
ו
כ
ל
 
א
ש
ר
 
ל
ך
 
ו
י
ש
כ
ם
 
א
ב
י
מ
ל
ך
 
ב
ב
ק
ר
 
ו
י
ק
ר
א
 
ל
כ
ל
 
ע
ב
ד
י
ו
 
ו
י
ד
ב
ר
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ב
א
ז
נ
י
ה
ם
 
ו
י
י
ר
א
ו
 
כ
ל
 
ה
א
נ
ש
י
ם
 
מ
א
ד
 
ו
י
ק
ר
א
 
א
ב
י
מ
ל
ך
 
ל
א
ב
ר
ה
ם
 
ו
י
א
מ
ר
 
ל
ו
 
מ
ה
 
ע
ש
י
ת
 
ל
נ
ו
 
ו
מ
ה
 
ח
ט
א
ת
י
 
ל
ך
 
כ
י
 
ה
ב
א
ת
 
ע
ל
י
 
ו
ע
ל
 
מ
מ
ל
כ
ת
י
 
ח
ט
א
ה
 
ג
ד
ל
ה
 
מ
ע
ש
י
ם
 
א
ש
ר
 
ל
א
 
י
ע
ש
ו
ן
 
ע
ש
י
ת
 
ע
מ
ד
י
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
א
ל
 
א
ב
ר
ה
ם
 
מ
ה
 
ר
א
י
ת
 
כ
י
 
ע
ש
י
ת
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
כ
י
 
י
ר
א
ת
י
 
כ
י
 
א
מ
ר
ת
י
 
ר
ק
 
א
י
ן
 
י
ר
א
ת
 
א
ל
ה
י
ם
 
ב
מ
ק
ו
ם
 
ה
ז
ה
 
ו
ה
ר
ג
ו
נ
י
 
ע
ל
 
ד
ב
ר
 
א
ש
ת
י
 
ו
ג
ם
 
ה
א
מ
נ
ם
 
א
ח
ו
ת
י
 
ה
י
א
 
ב
ת
 
א
ב
י
 
א
ך
 
ל
א
 
ב
ת
 
א
מ
י
 
ו
ת
ה
י
 
ל
י
 
ל
א
ש
ה
 
ו
י
ה
י
 
כ
א
ש
ר
 
ה
ת
ע
ה
 
א
ת
י
 
א
ל
ה
י
ם
 
מ
ב
י
ת
 
א
ב
י
 
ו
מ
א
ר
ץ
 
מ
ו
ל
ד
ת
י
 
ו
א
מ
ר
 
ל
ה
 
ז
ה
 
ח
ס
ד
י
ך
 
א
ש
ר
 
ת
ע
ש
י
ן
 
ע
מ
ד
י
 
א
ל
 
כ
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
נ
ב
ו
א
 
ש
מ
ה
 
א
מ
ר
י
 
ל
י
 
א
ח
י
 
ה
ו
א
 
ו
י
ק
ח
 
א
ב
י
מ
ל
ך
 
א
ל
ף
 
כ
ס
ף
 
ו
צ
א
ן
 
ו
ב
ק
ר
 
ו
ע
ב
ד
י
ם
 
ו
ש
פ
ח
ו
ת
 
ו
י
ת
ן
 
ל
א
ב
ר
ה
ם
 
ו
י
ש
ב
 
ל
ו
 
א
ת
 
ש
ר
ה
 
א
ש
ת
ו
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
ה
נ
ה
 
א
ר
צ
י
 
ל
פ
נ
י
ך
 
ב
ט
ו
ב
 
ב
ע
י
נ
י
ך
 
ש
ב
 
ו
ל
ש
ר
ה
 
א
מ
ר
 
ה
נ
ה
 
נ
ת
ת
י
 
א
ל
ף
 
כ
ס
ף
 
ל
א
ח
י
ך
 
ה
נ
ה
 
ה
ו
א
 
ל
י
ך
 
כ
ס
ו
ת
 
ע
י
נ
י
ם
 
ו
ל
כ
ל
 
א
ש
ר
 
א
ת
י
ך
 
ו
א
ת
 
ה
כ
ל
 
ו
נ
ו
כ
ח
ת
 
ו
י
ת
פ
ל
ל
 
א
ב
ר
ה
ם
 
א
ל
 
ה
א
ל
ה
י
ם
 
ו
י
ר
פ
א
 
א
ל
ה
י
ם
 
א
ת
 
א
ב
י
מ
ל
ך
 
ו
א
ת
 
א
ש
ת
ו
 
ו
א
מ
ת
י
ו
 
ו
י
ל
ד
ו
 
כ
י
 
ע
צ
ר
 
ע
צ
ר
 
א
ל
ה
י
ם
 
ב
ע
ד
 
כ
ל
 
ר
ח
ם
 
ל
ב
י
ת
 
א
ב
י
מ
ל
ך
 
ע
ל
 
ד
ב
ר
 
ש
ר
ה
 
א
ש
ת
 
א
ב
ר
ה
ם
 
ו
י
ה
ו
ה
 
פ
ק
ד
 
א
ת
 
ש
ר
ה
 
כ
א
ש
ר
 
א
מ
ר
 
ו
י
ע
ש
 
י
ה
ו
ה
 
ל
ש
ר
ה
 
כ
א
ש
ר
 
ד
ב
ר
 
ו
ת
ה
ר
 
ו
ת
ל
ד
 
ש
ר
ה
 
ל
א
ב
ר
ה
ם
 
ב
ן
 
ל
ז
ק
נ
י
ו
 
ל
מ
ו
ע
ד
 
א
ש
ר
 
ד
ב
ר
 
א
ת
ו
 
א
ל
ה
י
ם
 
ו
י
ק
ר
א
 
א
ב
ר
ה
ם
 
א
ת
 
ש
ם
 
ב
נ
ו
 
ה
נ
ו
ל
ד
 
ל
ו
 
א
ש
ר
 
י
ל
ד
ה
 
ל
ו
 
ש
ר
ה
 
י
צ
ח
ק
 
ו
י
מ
ל
 
א
ב
ר
ה
ם
 
א
ת
 
י
צ
ח
ק
 
ב
נ
ו
 
ב
ן
 
ש
מ
נ
ת
 
י
מ
י
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
א
ת
ו
 
א
ל
ה
י
ם
 
ו
א
ב
ר
ה
ם
 
ב
ן
 
מ
א
ת
 
ש
נ
ה
 
ב
ה
ו
ל
ד
 
ל
ו
 
א
ת
 
י
צ
ח
ק
 
ב
נ
ו
 
ו
ת
א
מ
ר
 
ש
ר
ה
 
צ
ח
ק
 
ע
ש
ה
 
ל
י
 
א
ל
ה
י
ם
 
כ
ל
 
ה
ש
מ
ע
 
י
צ
ח
ק
 
ל
י
 
ו
ת
א
מ
ר
 
מ
י
 
מ
ל
ל
 
ל
א
ב
ר
ה
ם
 
ה
י
נ
י
ק
ה
 
ב
נ
י
ם
 
ש
ר
ה
 
כ
י
 
י
ל
ד
ת
י
 
ל
ו
 
ב
ן
 
ל
ז
ק
נ
י
ו
 
ו
י
ג
ד
ל
 
ה
י
ל
ד
 
ו
י
ג
מ
ל
 
ו
י
ע
ש
 
א
ב
ר
ה
ם
 
מ
ש
ת
ה
 
ג
ד
ו
ל
 
ב
י
ו
ם
 
ה
ג
מ
ל
 
א
ת
 
י
צ
ח
ק
 
ב
נ
ו
 
ו
ת
ר
א
 
ש
ר
ה
 
א
ת
 
ב
ן
 
ה
ג
ר
 
ה
מ
צ
ר
י
ת
 
א
ש
ר
 
י
ל
ד
ה
 
ל
א
ב
ר
ה
ם
 
מ
צ
ח
ק
 
ו
ת
א
מ
ר
 
ל
א
ב
ר
ה
ם
 
ג
ר
ש
 
א
ת
 
ה
א
מ
ה
 
ה
ז
א
ת
 
ו
א
ת
 
ב
נ
ה
 
כ
י
 
ל
א
 
י
י
ר
ש
 
ב
ן
 
ה
א
מ
ה
 
ה
ז
א
ת
 
ע
ם
 
ב
נ
י
 
ע
ם
 
י
צ
ח
ק
 
ו
י
ר
ע
 
ה
ד
ב
ר
 
מ
א
ד
 
ב
ע
י
נ
י
 
א
ב
ר
ה
ם
 
ע
ל
 
א
ד
ו
ת
 
ב
נ
ו
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
א
ב
ר
ה
ם
 
א
ל
 
י
ר
ע
 
ב
ע
י
נ
י
ך
 
ע
ל
 
ה
נ
ע
ר
 
ו
ע
ל
 
א
מ
ת
ך
 
כ
ל
 
א
ש
ר
 
ת
א
מ
ר
 
א
ל
י
ך
 
ש
ר
ה
 
ש
מ
ע
 
ב
ק
ו
ל
ה
 
כ
י
 
ב
י
צ
ח
ק
 
י
ק
ר
א
 
ל
ך
 
ז
ר
ע
 
ו
ג
ם
 
א
ת
 
ב
ן
 
ה
א
מ
ה
 
ה
ז
א
ת
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
א
ש
י
מ
נ
ו
 
כ
י
 
ז
ר
ע
ך
 
ה
ו
א
 
ו
י
ש
כ
ם
 
א
ב
ר
ה
ם
 
ב
ב
ק
ר
 
ו
י
ק
ח
 
ל
ח
ם
 
ו
ח
מ
ת
 
מ
י
ם
 
ו
י
ת
ן
 
א
ל
 
ה
ג
ר
 
ש
ם
 
ע
ל
 
ש
כ
מ
ה
 
ו
א
ת
 
ה
י
ל
ד
 
ו
י
ש
ל
ח
ה
 
ו
ת
ל
ך
 
ו
ת
ת
ע
 
ב
מ
ד
ב
ר
 
ב
א
ר
 
ש
ב
ע
 
ו
י
כ
ל
ו
 
ה
מ
י
ם
 
מ
ן
 
ה
ח
מ
ת
 
ו
ת
ש
ל
י
ך
 
א
ת
 
ה
י
ל
ד
 
ת
ח
ת
 
א
ח
ד
 
ה
ש
ח
י
ם
 
ו
ת
ל
ך
 
ו
ת
ש
ב
 
ל
ה
 
מ
נ
ג
ד
 
ה
ר
ח
ק
ה
 
כ
מ
ט
ו
י
 
ק
ש
ת
 
כ
י
 
א
מ
ר
ה
 
א
ל
 
א
ר
א
ה
 
ב
מ
ו
ת
 
ה
י
ל
ד
 
ו
ת
ש
ב
 
מ
נ
ג
ד
 
ו
ת
ש
א
 
א
ת
 
ק
ו
ל
ה
 
ו
ת
ב
ך
 
ו
י
ש
מ
ע
 
א
ל
ה
י
ם
 
א
ת
 
ק
ו
ל
 
ה
נ
ע
ר
 
ו
י
ק
ר
א
 
מ
ל
א
ך
 
א
ל
ה
י
ם
 
א
ל
 
ה
ג
ר
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
י
א
מ
ר
 
ל
ה
 
מ
ל
כ
י
 
ה
ג
ר
 
א
ל
 
ת
י
ר
א
י
 
כ
י
 
ש
מ
ע
 
א
ל
ה
י
ם
 
א
ת
 
ק
ו
ל
 
ה
נ
ע
ר
 
ב
א
ש
ר
 
ה
ו
א
 
ש
ם
 
ק
ו
מ
י
 
ש
א
י
 
א
ת
 
ה
נ
ע
ר
 
ו
ח
ז
ק
י
 
א
ת
 
י
ד
ך
 
ב
ו
 
כ
י
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
א
ש
י
מ
נ
ו
 
ו
י
פ
ק
ח
 
א
ל
ה
י
ם
 
א
ת
 
ע
י
נ
י
ה
 
ו
ת
ר
א
 
ב
א
ר
 
מ
י
ם
 
ו
ת
ל
ך
 
ו
ת
מ
ל
א
 
א
ת
 
ה
ח
מ
ת
 
מ
י
ם
 
ו
ת
ש
ק
 
א
ת
 
ה
נ
ע
ר
 
ו
י
ה
י
 
א
ל
ה
י
ם
 
א
ת
 
ה
נ
ע
ר
 
ו
י
ג
ד
ל
 
ו
י
ש
ב
 
ב
מ
ד
ב
ר
 
ו
י
ה
י
 
ר
ב
י
 
ק
ש
ת
 
ו
י
ש
ב
 
ב
מ
ד
ב
ר
 
פ
ר
א
ן
 
ו
ת
ק
ח
 
ל
ו
 
א
מ
ו
 
א
ש
ה
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ה
י
 
ב
ע
ת
 
ה
ה
י
א
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
ו
פ
י
 
כ
ל
 
ש
ר
 
צ
ב
א
ו
 
א
ל
 
א
ב
ר
ה
ם
 
ל
א
מ
ר
 
א
ל
ה
י
ם
 
ע
מ
ך
 
ב
כ
ל
 
א
ש
ר
 
א
ת
ה
 
ע
ש
ה
 
ו
ע
ת
ה
 
ה
ש
ב
ע
 
ל
י
 
ב
א
ל
ה
י
ם
 
ה
נ
ה
 
א
ם
 
ת
ש
ק
ר
 
ל
י
 
ו
ל
נ
י
נ
י
 
ו
ל
נ
ג
ד
י
 
ו
כ
ח
ס
ד
 
א
ש
ר
 
ע
ש
י
ת
י
 
ע
מ
ך
 
ת
ע
ש
ה
 
ע
מ
ד
י
 
ו
ע
ם
 
ה
א
ר
ץ
 
א
ש
ר
 
ג
ר
ת
 
ב
ה
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
נ
כ
י
 
ה
ש
ב
ע
 
ו
ה
ו
כ
י
ח
 
א
ב
ר
ה
ם
 
א
ת
 
א
ב
י
מ
ל
ך
 
ע
ל
 
א
ד
ו
ת
 
ב
א
ר
 
ה
מ
י
ם
 
א
ש
ר
 
ג
ז
ל
ו
 
ע
ב
ד
י
 
א
ב
י
מ
ל
ך
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
ל
א
 
י
ד
ע
ת
י
 
מ
י
 
ע
ש
ה
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
ג
ם
 
א
ת
ה
 
ל
א
 
ה
ג
ד
ת
 
ל
י
 
ו
ג
ם
 
א
נ
כ
י
 
ל
א
 
ש
מ
ע
ת
י
 
ב
ל
ת
י
 
ה
י
ו
ם
 
ו
י
ק
ח
 
א
ב
ר
ה
ם
 
צ
א
ן
 
ו
ב
ק
ר
 
ו
י
ת
ן
 
ל
א
ב
י
מ
ל
ך
 
ו
י
כ
ר
ת
ו
 
ש
נ
י
ה
ם
 
ב
ר
י
ת
 
ו
י
צ
ב
 
א
ב
ר
ה
ם
 
ש
ב
ע
 
כ
ב
ש
ו
ת
 
צ
א
ן
 
ל
ב
ד
ה
ן
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
א
ל
 
א
ב
ר
ה
ם
 
מ
ה
 
ה
נ
ה
 
ש
ב
ע
 
ה
כ
ב
ש
ו
ת
 
ה
א
ל
ה
 
א
ש
ר
 
ה
צ
ב
ת
 
ל
ב
ד
ה
ן
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
כ
י
 
א
ת
 
ש
ב
ע
 
ה
כ
ב
ש
ו
ת
 
ת
ק
ח
 
מ
י
ד
י
 
ב
ע
ב
ו
ר
 
ת
ה
י
ה
 
ל
י
 
ל
ע
ד
ה
 
כ
י
 
ח
פ
ר
ת
י
 
א
ת
 
ה
ב
א
ר
 
ה
ז
א
ת
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ל
מ
ק
ו
ם
 
ה
ה
ו
א
 
ב
א
ר
 
ש
ב
ע
 
כ
י
 
ש
ם
 
נ
ש
ב
ע
ו
 
ש
נ
י
ה
ם
 
ו
י
כ
ר
ת
ו
 
ב
ר
י
ת
 
ב
ב
א
ר
 
ש
ב
ע
 
ו
י
ק
ם
 
א
ב
י
מ
ל
ך
 
ו
פ
י
 
כ
ל
 
ש
ר
 
צ
ב
א
ו
 
ו
י
ש
ב
ו
 
א
ל
 
א
ר
ץ
 
פ
ל
ש
ת
י
ם
 
ו
י
ט
ע
 
א
ב
ר
ה
ם
 
א
ש
ל
 
ב
ב
א
ר
 
ש
ב
ע
 
ו
י
ק
ר
א
 
ש
ם
 
ב
ש
ם
 
י
ה
ו
ה
 
א
ל
 
ע
ו
ל
ם
 
ו
י
ג
ר
 
א
ב
ר
ה
ם
 
ב
א
ר
ץ
 
פ
ל
ש
ת
י
ם
 
י
מ
י
ם
 
ר
ב
י
ם
 
ו
י
ה
י
 
א
ח
ר
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
ה
א
ל
ה
י
ם
 
נ
ס
ה
 
א
ת
 
א
ב
ר
ה
ם
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ב
ר
ה
ם
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
ק
ח
 
נ
א
 
א
ת
 
ב
נ
ך
 
א
ת
 
י
ח
י
ד
ך
 
א
ש
ר
 
א
ה
ב
ת
 
א
ת
 
י
צ
ח
ק
 
ו
ל
ך
 
ל
ך
 
א
ל
 
א
ר
ץ
 
ה
מ
ו
ר
א
ה
 
ו
ה
ע
ל
ה
ו
 
ש
ם
 
ע
ל
ה
 
ע
ל
 
א
ח
ד
 
ה
ה
ר
י
ם
 
א
ש
ר
 
א
מ
ר
 
א
ל
י
ך
 
ו
י
ש
כ
ם
 
א
ב
ר
ה
ם
 
ב
ב
ק
ר
 
ו
י
ח
ב
ש
 
א
ת
 
ח
מ
ו
ר
ו
 
ו
י
ק
ח
 
א
ת
 
ש
נ
י
 
נ
ע
ר
י
ו
 
א
ת
ו
 
ו
א
ת
 
י
צ
ח
ק
 
ב
נ
ו
 
ו
י
ב
ק
ע
 
ע
צ
י
 
ה
ע
ל
ה
 
ו
י
ק
ם
 
ו
י
ל
ך
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
א
מ
ר
 
ל
ו
 
ה
א
ל
ה
י
ם
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ו
י
ש
א
 
א
ב
ר
ה
ם
 
א
ת
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
א
ת
 
ה
מ
ק
ו
ם
 
מ
ר
ח
ק
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
ל
 
נ
ע
ר
י
ו
 
ש
ב
ו
 
ל
כ
ם
 
פ
ה
 
ע
ם
 
ה
ח
מ
ו
ר
 
ו
א
נ
י
 
ו
ה
נ
ע
ר
 
נ
ל
כ
ה
 
ע
ד
 
כ
ה
 
ו
נ
ש
ת
ח
ו
י
 
ו
נ
ש
ו
ב
 
א
ל
י
כ
ם
 
ו
י
ק
ח
 
א
ב
ר
ה
ם
 
א
ת
 
ע
צ
י
 
ה
ע
ל
ה
 
ו
י
ש
ם
 
ע
ל
 
י
צ
ח
ק
 
ב
נ
ו
 
ו
י
ק
ח
 
ב
י
ד
ו
 
א
ת
 
ה
א
ש
 
ו
א
ת
 
ה
מ
א
כ
ל
ת
 
ו
י
ל
כ
ו
 
ש
נ
י
ה
ם
 
י
ח
ד
ו
 
ו
י
א
מ
ר
 
י
צ
ח
ק
 
א
ל
 
א
ב
ר
ה
ם
 
א
ב
י
ו
 
ו
י
א
מ
ר
 
א
ב
י
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
ב
נ
י
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ה
א
ש
 
ו
ה
ע
צ
י
ם
 
ו
א
י
ה
 
ה
ש
ה
 
ל
ע
ל
ה
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
ל
ה
י
ם
 
י
ר
א
ה
 
ל
ו
 
ש
ה
 
ל
ע
ל
ה
 
ב
נ
י
 
ו
י
ל
כ
ו
 
ש
נ
י
ה
ם
 
י
ח
ד
ו
 
ו
י
ב
א
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
א
מ
ר
 
ל
ו
 
ה
א
ל
ה
י
ם
 
ו
י
ב
ן
 
ש
ם
 
א
ב
ר
ה
ם
 
א
ת
 
ה
מ
ז
ב
ח
 
ו
י
ע
ר
ך
 
א
ת
 
ה
ע
צ
י
ם
 
ו
י
ע
ק
ד
 
א
ת
 
י
צ
ח
ק
 
ב
נ
ו
 
ו
י
ש
ם
 
א
ת
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
מ
מ
ע
ל
 
ל
ע
צ
י
ם
 
ו
י
ש
ל
ח
 
א
ב
ר
ה
ם
 
א
ת
 
י
ד
ו
 
ו
י
ק
ח
 
א
ת
 
ה
מ
א
כ
ל
ת
 
ל
ש
ח
ט
 
א
ת
 
ב
נ
ו
 
ו
י
ק
ר
א
 
א
ל
י
ו
 
מ
ל
א
ך
 
י
ה
ו
ה
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
ב
ר
ה
ם
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
א
ל
 
ת
ש
ל
ח
 
י
ד
ך
 
ע
ל
 
ה
נ
ע
ר
 
ו
א
ל
 
ת
ע
ש
ה
 
ל
ו
 
מ
א
ו
מ
ה
 
כ
י
 
ע
ת
ה
 
י
ד
ע
ת
י
 
כ
י
 
י
ר
א
 
א
ל
ה
י
ם
 
א
ת
ה
 
ו
ל
א
 
ח
ש
כ
ת
 
א
ת
 
ב
נ
ך
 
א
ת
 
י
ח
י
ד
ך
 
מ
מ
נ
י
 
ו
י
ש
א
 
א
ב
ר
ה
ם
 
א
ת
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
ו
ה
נ
ה
 
א
י
ל
 
א
ח
ד
 
נ
א
ח
ז
 
ב
ס
ב
ך
 
ב
ק
ר
נ
י
ו
 
ו
י
ל
ך
 
א
ב
ר
ה
ם
 
ו
י
ק
ח
 
א
ת
 
ה
א
י
ל
 
ו
י
ע
ל
ה
ו
 
ע
ל
ה
 
ת
ח
ת
 
ב
נ
ו
 
ו
י
ק
ר
א
 
א
ב
ר
ה
ם
 
א
ת
 
ש
ם
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
י
ה
ו
ה
 
י
ר
א
ה
 
א
ש
ר
 
י
א
מ
ר
 
ה
י
ו
ם
 
ב
ה
ר
 
י
ה
ו
ה
 
י
ר
א
ה
 
ו
י
ק
ר
א
 
מ
ל
א
ך
 
י
ה
ו
ה
 
א
ל
 
א
ב
ר
ה
ם
 
ש
נ
י
ת
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
י
א
מ
ר
 
ב
י
 
נ
ש
ב
ע
ת
י
 
נ
א
ם
 
י
ה
ו
ה
 
כ
י
 
י
ע
ן
 
א
ש
ר
 
ע
ש
י
ת
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
ל
א
 
ח
ש
כ
ת
 
א
ת
 
ב
נ
ך
 
א
ת
 
י
ח
י
ד
ך
 
מ
מ
נ
י
 
כ
י
 
ב
ר
ו
ך
 
א
ב
ר
כ
ך
 
ו
ה
ר
ב
ה
 
א
ר
ב
ה
 
א
ת
 
ז
ר
ע
ך
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ו
כ
ח
ו
ל
 
א
ש
ר
 
ע
ל
 
ש
פ
ת
 
ה
י
ם
 
ו
י
י
ר
ש
 
ז
ר
ע
ך
 
א
ת
 
ש
ע
ר
 
א
י
ב
י
ו
 
ו
ה
ת
ב
ר
כ
ו
 
ב
ז
ר
ע
ך
 
כ
ל
 
ג
ו
י
 
ה
א
ר
ץ
 
ע
ק
ב
 
א
ש
ר
 
ש
מ
ע
ת
 
ב
ק
ו
ל
י
 
ו
י
ש
ב
 
א
ב
ר
ה
ם
 
א
ל
 
נ
ע
ר
י
ו
 
ו
י
ק
מ
ו
 
ו
י
ל
כ
ו
 
י
ח
ד
ו
 
א
ל
 
ב
א
ר
 
ש
ב
ע
 
ו
י
ש
ב
 
א
ב
ר
ה
ם
 
ב
ב
א
ר
 
ש
ב
ע
 
ו
י
ה
י
 
א
ח
ר
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
י
ג
ד
 
ל
א
ב
ר
ה
ם
 
ל
א
מ
ר
 
ה
נ
ה
 
י
ל
ד
ה
 
מ
ל
כ
ה
 
ג
ם
 
ה
י
א
 
ב
נ
י
ם
 
ל
נ
ח
ו
ר
 
א
ח
י
ך
 
א
ת
 
ע
ו
ץ
 
ב
כ
ו
ר
ו
 
ו
א
ת
 
ב
ו
ז
 
א
ח
י
ו
 
ו
א
ת
 
ק
מ
ו
א
ל
 
א
ב
י
 
א
ר
ם
 
ו
א
ת
 
כ
ש
ד
 
ו
א
ת
 
ח
ז
ו
 
ו
א
ת
 
פ
י
ל
ד
ש
 
ו
א
ת
 
י
ד
ל
ף
 
ו
א
ת
 
ב
ת
ו
א
ל
 
ו
ב
ת
ו
א
ל
 
ה
ו
ל
י
ד
 
א
ת
 
ר
ב
ק
ה
 
ש
מ
נ
ה
 
א
ל
ה
 
י
ל
ד
ה
 
מ
ל
כ
ה
 
ל
נ
ח
ו
ר
 
א
ח
י
 
א
ב
ר
ה
ם
 
ו
פ
י
ל
ג
ש
ו
 
ו
ש
מ
ה
 
ר
ו
מ
ה
 
ו
ת
ל
ד
 
ג
ם
 
ה
י
א
 
א
ת
 
ט
ב
ח
 
ו
א
ת
 
ג
ח
ם
 
ו
א
ת
 
ת
ח
ש
 
ו
א
ת
 
מ
ע
כ
ה
 
ו
י
ה
י
ו
 
ח
י
י
 
ש
ר
ה
 
מ
א
ת
 
ש
נ
ה
 
ו
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
ש
ב
ע
 
ש
נ
י
ם
 
ש
נ
י
 
ח
י
י
 
ש
ר
ה
 
ו
ת
מ
ת
 
ש
ר
ה
 
ב
ק
ר
י
ת
 
ה
א
ר
ב
ע
 
א
ל
 
ע
מ
ק
 
ה
י
א
 
ח
ב
ר
ו
ן
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ב
א
 
א
ב
ר
ה
ם
 
ל
ס
פ
ד
 
ל
ש
ר
ה
 
ו
ל
ב
כ
ו
ת
ה
 
ו
י
ק
ם
 
א
ב
ר
ה
ם
 
מ
ע
ל
 
פ
נ
י
 
מ
י
ת
ו
 
ו
י
ד
ב
ר
 
א
ל
 
ב
נ
י
 
ח
ת
 
ל
א
מ
ר
 
ג
ר
 
ו
ת
ו
ש
ב
 
א
נ
כ
י
 
ע
מ
כ
ם
 
ת
נ
ו
 
ל
י
 
א
ח
ז
ת
 
ק
ב
ר
 
ע
מ
כ
ם
 
ו
א
ק
ב
ר
ה
 
א
ת
 
מ
י
ת
י
 
מ
ל
פ
נ
י
 
ו
י
ע
נ
ו
 
ב
נ
י
 
ח
ת
 
א
ת
 
א
ב
ר
ה
ם
 
ל
א
מ
ר
 
ל
א
 
ש
מ
ע
נ
ו
 
א
ד
נ
י
 
נ
ש
י
א
 
א
ל
ה
י
ם
 
א
ת
ה
 
ב
ת
ו
כ
נ
ו
 
ב
מ
ב
ח
ר
 
ק
ב
ר
י
נ
ו
 
ק
ב
ר
 
א
ת
 
מ
י
ת
ך
 
א
י
ש
 
מ
מ
נ
ו
 
א
ת
 
ק
ב
ר
ו
 
ל
א
 
י
כ
ל
ה
 
מ
מ
ך
 
מ
ק
ב
ר
 
מ
י
ת
ך
 
ו
י
ק
ם
 
א
ב
ר
ה
ם
 
ו
י
ש
ת
ח
ו
י
 
ל
ע
ם
 
ה
א
ר
ץ
 
ל
ב
נ
י
 
ח
ת
 
ו
י
ד
ב
ר
 
א
ת
ם
 
ל
א
מ
ר
 
א
ם
 
י
ש
ת
 
נ
פ
ש
כ
ם
 
ל
ק
ב
ר
 
א
ת
 
מ
י
ת
י
 
מ
ל
פ
נ
י
 
ש
מ
ע
ו
נ
י
 
ו
פ
ג
ע
ו
 
ל
י
 
ב
ע
פ
ר
ו
ן
 
ב
ן
 
צ
ה
ר
 
ה
ח
ת
י
 
ו
י
ת
ן
 
ל
י
 
א
ת
 
מ
ע
ר
ת
 
ה
מ
כ
פ
ל
ה
 
א
ש
ר
 
ל
ו
 
א
ש
ר
 
ב
ק
צ
ה
 
ש
ד
ה
ו
 
ב
כ
ס
ף
 
מ
ל
א
 
י
ת
נ
נ
ה
 
ל
י
 
ב
ת
ו
כ
כ
ם
 
ל
א
ח
ז
ת
 
ק
ב
ר
 
ו
ע
פ
ר
ו
ן
 
י
ש
ב
 
ב
ת
ו
ך
 
ב
נ
י
 
ח
ת
 
ו
י
ע
ן
 
ע
פ
ר
ו
ן
 
ה
ח
ת
י
 
א
ת
 
א
ב
ר
ה
ם
 
ב
א
ז
נ
י
 
ב
נ
י
 
ח
ת
 
ל
כ
ל
 
ב
א
י
 
ש
ע
ר
 
ע
י
ר
ו
 
ל
א
מ
ר
 
ל
א
 
א
ד
נ
י
 
ש
מ
ע
נ
י
 
ה
ש
ד
ה
 
נ
ת
ת
י
 
ל
ך
 
ו
ה
מ
ע
ר
ה
 
א
ש
ר
 
ב
ו
 
ל
ך
 
נ
ת
ת
י
ה
 
ל
ע
י
נ
י
 
ב
נ
י
 
ע
מ
י
 
נ
ת
ת
י
ה
 
ל
ך
 
ק
ב
ר
 
מ
י
ת
ך
 
ו
י
ש
ת
ח
ו
י
 
א
ב
ר
ה
ם
 
ל
פ
נ
י
 
ע
ם
 
ה
א
ר
ץ
 
ו
י
ד
ב
ר
 
א
ל
 
ע
פ
ר
ו
ן
 
ב
א
ז
נ
י
 
ע
ם
 
ה
א
ר
ץ
 
ל
א
מ
ר
 
א
ך
 
א
ם
 
א
ת
ה
 
ל
י
 
ש
מ
ע
נ
י
 
נ
ת
ת
י
 
כ
ס
ף
 
ה
ש
ד
ה
 
ק
ח
 
מ
מ
נ
י
 
ו
א
ק
ב
ר
ה
 
א
ת
 
מ
י
ת
י
 
ש
ם
 
ו
י
ע
ן
 
ע
פ
ר
ו
ן
 
א
ת
 
א
ב
ר
ה
ם
 
ל
א
מ
ר
 
ל
א
 
א
ד
נ
י
 
ש
מ
ע
נ
י
 
א
ר
ץ
 
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
ק
ל
 
כ
ס
ף
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
מ
ה
 
ה
ו
א
 
ו
א
ת
 
מ
י
ת
ך
 
ק
ב
ר
 
ו
י
ש
מ
ע
 
א
ב
ר
ה
ם
 
א
ל
 
ע
פ
ר
ו
ן
 
ו
י
ש
ק
ל
 
א
ב
ר
ה
ם
 
ל
ע
פ
ר
ו
ן
 
א
ת
 
ה
כ
ס
ף
 
א
ש
ר
 
ד
ב
ר
 
ב
א
ז
נ
י
 
ב
נ
י
 
ח
ת
 
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
ק
ל
 
כ
ס
ף
 
ע
ב
ר
 
ל
ס
ח
ר
 
ו
י
ק
ם
 
ש
ד
ה
 
ע
פ
ר
ו
ן
 
א
ש
ר
 
ב
מ
כ
פ
ל
ה
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
מ
מ
ר
א
 
ה
ש
ד
ה
 
ו
ה
מ
ע
ר
ה
 
א
ש
ר
 
ב
ו
 
ו
כ
ל
 
ה
ע
ץ
 
א
ש
ר
 
ב
ש
ד
ה
 
א
ש
ר
 
ב
כ
ל
 
ג
ב
ו
ל
ו
 
ס
ב
י
ב
 
ל
א
ב
ר
ה
ם
 
ל
מ
ק
נ
ה
 
ל
ע
י
נ
י
 
ב
נ
י
 
ח
ת
 
ב
כ
ל
 
ב
א
י
 
ש
ע
ר
 
ע
י
ר
ו
 
ו
א
ח
ר
י
 
כ
ן
 
ק
ב
ר
 
א
ב
ר
ה
ם
 
א
ת
 
ש
ר
ה
 
א
ש
ת
ו
 
א
ל
 
מ
ע
ר
ת
 
ש
ד
ה
 
ה
מ
כ
פ
ל
ה
 
ע
ל
 
פ
נ
י
 
מ
מ
ר
א
 
ה
י
א
 
ח
ב
ר
ו
ן
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ק
ם
 
ה
ש
ד
ה
 
ו
ה
מ
ע
ר
ה
 
א
ש
ר
 
ב
ו
 
ל
א
ב
ר
ה
ם
 
ל
א
ח
ז
ת
 
ק
ב
ר
 
מ
א
ת
 
ב
נ
י
 
ח
ת
 
ו
א
ב
ר
ה
ם
 
ז
ק
ן
 
ב
א
 
ב
י
מ
י
ם
 
ו
י
ה
ו
ה
 
ב
ר
ך
 
א
ת
 
א
ב
ר
ה
ם
 
ב
כ
ל
 
ו
י
א
מ
ר
 
א
ב
ר
ה
ם
 
א
ל
 
ע
ב
ד
ו
 
ז
ק
ן
 
ב
י
ת
ו
 
ה
מ
ש
ל
 
ב
כ
ל
 
א
ש
ר
 
ל
ו
 
ש
י
ם
 
נ
א
 
י
ד
ך
 
ת
ח
ת
 
י
ר
כ
י
 
ו
א
ש
ב
י
ע
ך
 
ב
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ש
מ
י
ם
 
ו
א
ל
ה
י
 
ה
א
ר
ץ
 
א
ש
ר
 
ל
א
 
ת
ק
ח
 
א
ש
ה
 
ל
ב
נ
י
 
מ
ב
נ
ו
ת
 
ה
כ
נ
ע
נ
י
 
א
ש
ר
 
א
נ
כ
י
 
י
ש
ב
 
ב
ק
ר
ב
ו
 
כ
י
 
א
ם
 
א
ל
 
א
ר
צ
י
 
ו
א
ל
 
מ
ו
ל
ד
ת
י
 
ת
ל
ך
 
ו
ל
ק
ח
ת
 
א
ש
ה
 
ל
ב
נ
י
 
ל
י
צ
ח
ק
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ה
ע
ב
ד
 
א
ו
ל
י
 
ל
א
 
ת
א
ב
ה
 
ה
א
ש
ה
 
ל
ל
כ
ת
 
א
ח
ר
י
 
א
ל
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ה
ה
ש
ב
 
א
ש
י
ב
 
א
ת
 
ב
נ
ך
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
צ
א
ת
 
מ
ש
ם
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ב
ר
ה
ם
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
ש
י
ב
 
א
ת
 
ב
נ
י
 
ש
מ
ה
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ש
מ
י
ם
 
א
ש
ר
 
ל
ק
ח
נ
י
 
מ
ב
י
ת
 
א
ב
י
 
ו
מ
א
ר
ץ
 
מ
ו
ל
ד
ת
י
 
ו
א
ש
ר
 
ד
ב
ר
 
ל
י
 
ו
א
ש
ר
 
נ
ש
ב
ע
 
ל
י
 
ל
א
מ
ר
 
ל
ז
ר
ע
ך
 
א
ת
ן
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ה
ו
א
 
י
ש
ל
ח
 
מ
ל
א
כ
ו
 
ל
פ
נ
י
ך
 
ו
ל
ק
ח
ת
 
א
ש
ה
 
ל
ב
נ
י
 
מ
ש
ם
 
ו
א
ם
 
ל
א
 
ת
א
ב
ה
 
ה
א
ש
ה
 
ל
ל
כ
ת
 
א
ח
ר
י
ך
 
ו
נ
ק
י
ת
 
מ
ש
ב
ו
ע
ת
י
 
ז
א
ת
 
ר
ק
 
א
ת
 
ב
נ
י
 
ל
א
 
ת
ש
י
ב
 
ש
מ
ה
 
ו
י
ש
ם
 
ה
ע
ב
ד
 
א
ת
 
י
ד
ו
 
ת
ח
ת
 
י
ר
ך
 
א
ב
ר
ה
ם
 
א
ד
נ
י
ו
 
ו
י
ש
ב
ע
 
ל
ו
 
ע
ל
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
י
ק
ח
 
ה
ע
ב
ד
 
ע
ש
ר
ה
 
ג
מ
ל
י
ם
 
מ
ג
מ
ל
י
 
א
ד
נ
י
ו
 
ו
י
ל
ך
 
ו
כ
ל
 
ט
ו
ב
 
א
ד
נ
י
ו
 
ב
י
ד
ו
 
ו
י
ק
ם
 
ו
י
ל
ך
 
א
ל
 
א
ר
ם
 
נ
ה
ר
י
ם
 
א
ל
 
ע
י
ר
 
נ
ח
ו
ר
 
ו
י
ב
ר
ך
 
ה
ג
מ
ל
י
ם
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
ע
ל
 
ב
א
ר
 
ה
מ
י
ם
 
ל
ע
ת
 
ע
ר
ב
 
ל
ע
ת
 
צ
א
ת
 
ה
ש
א
ב
ו
ת
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
ה
ק
ר
א
 
נ
א
 
ל
פ
נ
י
 
ה
י
ו
ם
 
ו
ע
ש
ה
 
ח
ס
ד
 
ע
ם
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
ה
נ
ה
 
א
נ
כ
י
 
נ
צ
ב
 
ע
ל
 
ע
י
ן
 
ה
מ
י
ם
 
ו
ב
נ
ו
ת
 
א
נ
ש
י
 
ה
ע
י
ר
 
י
צ
א
ת
 
ל
ש
א
ב
 
מ
י
ם
 
ו
ה
י
ה
 
ה
נ
ע
ר
ה
 
א
ש
ר
 
א
מ
ר
 
א
ל
י
ה
 
ה
ט
נ
י
 
כ
ד
ך
 
ו
א
ש
ת
ה
 
ו
א
מ
ר
ה
 
ש
ת
ה
 
ו
ג
ם
 
ג
מ
ל
י
ך
 
א
ש
ק
ה
 
א
ת
ה
 
ה
ו
כ
ח
ת
 
ל
ע
ב
ד
ך
 
ל
י
צ
ח
ק
 
ו
ב
ה
 
א
ד
ע
 
כ
י
 
ע
ש
י
ת
 
ח
ס
ד
 
ע
ם
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
ו
י
ה
י
 
ה
ו
א
 
ט
ר
ם
 
כ
ל
ה
 
ל
ד
ב
ר
 
א
ל
 
ל
ב
ו
 
ו
ה
נ
ה
 
ר
ב
ק
ה
 
י
צ
א
ת
 
א
ש
ר
 
י
ל
ד
ה
 
ל
ב
ת
ו
א
ל
 
ב
ן
 
מ
ל
כ
ה
 
א
ש
ת
 
נ
ח
ו
ר
 
א
ח
י
 
א
ב
ר
ה
ם
 
ו
כ
ד
ה
 
ע
ל
 
ש
כ
מ
ה
 
ו
ה
נ
ע
ר
ה
 
ט
ו
ב
ת
 
מ
ר
א
ה
 
מ
א
ד
 
ב
ת
ו
ל
ה
 
ו
א
י
ש
 
ל
א
 
י
ד
ע
ה
 
ו
ת
ר
ד
 
ה
ע
י
ן
 
ו
ת
מ
ל
א
 
כ
ד
ה
 
ו
ת
ע
ל
 
ו
י
ר
ץ
 
ה
ע
ב
ד
 
ל
ק
ר
א
ת
ה
 
ו
י
א
מ
ר
 
ה
ג
מ
י
נ
י
 
נ
א
 
מ
ע
ט
 
מ
י
ם
 
מ
כ
ד
ך
 
ו
ת
א
מ
ר
 
ש
ת
ה
 
א
ד
נ
י
 
ו
ת
מ
ה
ר
 
ו
ת
ו
ר
ד
 
כ
ד
ה
 
ע
ל
 
י
ד
ה
 
ו
ת
ש
ק
ה
ו
 
ו
ת
כ
ל
 
ל
ה
ש
ק
ו
ת
ו
 
ו
ת
א
מ
ר
 
ג
ם
 
ל
ג
מ
ל
י
ך
 
א
ש
א
ב
 
ע
ד
 
א
ם
 
כ
ל
ו
 
ל
ש
ת
ו
ת
 
ו
ת
מ
ה
ר
 
ו
ת
ו
ר
ד
 
כ
ד
ה
 
ע
ל
 
ה
ש
ק
ו
ת
 
ו
ת
ר
ץ
 
ע
ו
ד
 
א
ל
 
ה
ב
א
ר
 
ל
ש
א
ב
 
ו
ת
ש
א
ב
 
ל
כ
ל
 
ג
מ
ל
י
ו
 
ו
ה
א
י
ש
 
מ
ש
ת
ה
 
ל
ה
 
ו
מ
ח
ר
י
ש
 
ל
ד
ע
ת
 
ה
צ
ל
י
ח
 
י
ה
ו
ה
 
ד
ר
כ
ו
 
א
ם
 
ל
א
 
ו
י
ה
י
 
כ
א
ש
ר
 
כ
ל
ו
 
ה
ג
מ
ל
י
ם
 
ל
ש
ת
ו
ת
 
ו
י
ק
ח
 
ה
א
י
ש
 
נ
ז
ם
 
ז
ה
ב
 
ב
ק
ע
 
מ
ש
ק
ל
ו
 
ו
י
ש
ם
 
ע
ל
 
א
פ
ה
 
ו
ש
נ
י
 
צ
מ
י
ד
י
ם
 
ע
ל
 
י
ד
י
ה
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ש
ק
ל
ם
 
ו
י
א
מ
ר
 
ב
ת
 
מ
י
 
א
ת
י
 
ה
ג
י
ד
י
 
נ
א
 
ל
י
 
ה
י
ש
 
ב
ב
י
ת
 
א
ב
י
ך
 
מ
ק
ו
ם
 
ל
נ
ו
 
ל
ל
י
ן
 
ו
ת
א
מ
ר
 
א
ל
י
ו
 
ב
ת
 
ב
ת
ו
א
ל
 
א
נ
כ
י
 
ב
ן
 
מ
ל
כ
ה
 
א
ש
ר
 
י
ל
ד
ה
 
ל
נ
ח
ו
ר
 
ו
ת
א
מ
ר
 
א
ל
י
ו
 
ג
ם
 
ת
ב
ן
 
ג
ם
 
מ
ס
פ
ה
 
ר
ב
 
ע
מ
נ
ו
 
ו
ג
ם
 
מ
ק
ו
ם
 
ל
ל
י
ן
 
ו
י
ק
ד
 
ה
א
י
ש
 
ו
י
ש
ת
ח
ו
י
 
ל
י
ה
ו
ה
 
ו
י
א
מ
ר
 
ב
ר
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
א
ש
ר
 
ל
א
 
ע
ז
ב
 
ח
ס
ד
ו
 
ו
א
מ
ת
ו
 
מ
ע
ם
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
א
נ
כ
י
 
ב
ד
ר
ך
 
נ
ח
נ
י
 
י
ה
ו
ה
 
ב
י
ת
 
א
ח
י
 
א
ד
נ
י
 
ו
ת
ר
ץ
 
ה
נ
ע
ר
ה
 
ו
ת
ג
ד
 
ל
ב
י
ת
 
א
מ
ה
 
כ
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
ל
ר
ב
ק
ה
 
א
ח
 
ו
ש
מ
ו
 
ל
ב
ן
 
ו
י
ר
ץ
 
ל
ב
ן
 
א
ל
 
ה
א
י
ש
 
ה
ח
ו
צ
ה
 
א
ל
 
ה
ע
י
ן
 
ו
י
ה
י
 
כ
ר
א
ו
ת
ו
 
א
ת
 
ה
נ
ז
ם
 
ו
א
ת
 
ה
צ
מ
י
ד
י
ם
 
ע
ל
 
י
ד
י
 
א
ח
ו
ת
ו
 
ו
כ
ש
מ
ע
ו
 
א
ת
 
ד
ב
ר
י
 
ר
ב
ק
ה
 
א
ח
ו
ת
ו
 
ל
א
מ
ר
 
כ
ה
 
ד
ב
ר
 
א
ל
י
 
ה
א
י
ש
 
ו
י
ב
א
 
א
ל
 
ה
א
י
ש
 
ו
ה
נ
ה
 
ע
מ
ד
 
ע
ל
 
ה
ג
מ
ל
י
ם
 
ע
ל
 
ה
ע
י
ן
 
ו
י
א
מ
ר
 
ב
א
 
ב
ר
ו
ך
 
י
ה
ו
ה
 
ל
מ
ה
 
ת
ע
מ
ד
 
ב
ח
ו
ץ
 
ו
א
נ
כ
י
 
פ
נ
י
ת
י
 
ה
ב
י
ת
 
ו
מ
ק
ו
ם
 
ל
ג
מ
ל
י
ם
 
ו
י
ב
א
 
ה
א
י
ש
 
ה
ב
י
ת
ה
 
ו
י
פ
ת
ח
 
ה
ג
מ
ל
י
ם
 
ו
י
ת
ן
 
ת
ב
ן
 
ו
מ
ס
פ
ה
 
ל
ג
מ
ל
י
ם
 
ו
מ
י
ם
 
ל
ר
ח
ץ
 
ר
ג
ל
י
ו
 
ו
ר
ג
ל
י
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
א
ת
ו
 
ו
י
ו
ש
ם
 
ל
פ
נ
י
ו
 
ל
א
כ
ל
 
ו
י
א
מ
ר
 
ל
א
 
א
כ
ל
 
ע
ד
 
א
ם
 
ד
ב
ר
ת
י
 
ד
ב
ר
י
 
ו
י
א
מ
ר
ו
 
ד
ב
ר
 
ו
י
א
מ
ר
 
ע
ב
ד
 
א
ב
ר
ה
ם
 
א
נ
כ
י
 
ו
י
ה
ו
ה
 
ב
ר
ך
 
א
ת
 
א
ד
נ
י
 
מ
א
ד
 
ו
י
ג
ד
ל
 
ו
י
ת
ן
 
ל
ו
 
צ
א
ן
 
ו
ב
ק
ר
 
כ
ס
ף
 
ו
ז
ה
ב
 
ע
ב
ד
י
ם
 
ו
ש
פ
ח
ו
ת
 
ו
ג
מ
ל
י
ם
 
ו
ח
מ
ר
י
ם
 
ו
ת
ל
ד
 
ש
ר
ה
 
א
ש
ת
 
א
ד
נ
י
 
ב
ן
 
ל
א
ד
נ
י
 
א
ח
ר
י
 
ז
ק
נ
ת
ו
 
ו
י
ת
ן
 
ל
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ו
י
ש
ב
ע
נ
י
 
א
ד
נ
י
 
ל
א
מ
ר
 
ל
א
 
ת
ק
ח
 
א
ש
ה
 
ל
ב
נ
י
 
מ
ב
נ
ו
ת
 
ה
כ
נ
ע
נ
י
 
א
ש
ר
 
א
נ
כ
י
 
י
ש
ב
 
ב
א
ר
צ
ו
 
כ
י
 
א
ם
 
א
ל
 
ב
י
ת
 
א
ב
י
 
ת
ל
ך
 
ו
א
ל
 
מ
ש
פ
ח
ת
י
 
ו
ל
ק
ח
ת
 
א
ש
ה
 
ל
ב
נ
י
 
ו
א
מ
ר
 
א
ל
 
א
ד
נ
י
 
א
ו
ל
י
 
ל
א
 
ת
ל
ך
 
ה
א
ש
ה
 
א
ח
ר
י
 
ו
י
א
מ
ר
 
א
ל
י
 
י
ה
ו
ה
 
א
ש
ר
 
ה
ת
ה
ל
כ
ת
י
 
ל
פ
נ
י
ו
 
י
ש
ל
ח
 
מ
ל
א
כ
ו
 
א
ת
ך
 
ו
ה
צ
ל
י
ח
 
ד
ר
כ
ך
 
ו
ל
ק
ח
ת
 
א
ש
ה
 
ל
ב
נ
י
 
מ
מ
ש
פ
ח
ת
י
 
ו
מ
ב
י
ת
 
א
ב
י
 
א
ז
 
ת
נ
ק
י
א
 
מ
א
ל
ת
י
 
כ
י
 
ת
ב
ו
א
 
א
ל
 
מ
ש
פ
ח
ת
י
 
ו
א
ם
 
ל
א
 
י
ת
נ
ו
 
ל
ך
 
ו
ה
י
י
ת
 
נ
ק
י
א
 
מ
א
ל
ת
י
 
ו
א
ב
ו
א
 
ה
י
ו
ם
 
א
ל
 
ה
ע
י
ן
 
ו
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
א
ם
 
י
ש
ך
 
נ
א
 
מ
צ
ל
י
ח
 
ד
ר
כ
י
 
א
ש
ר
 
א
נ
י
 
ה
ל
ך
 
ע
ל
י
ה
 
ה
נ
ה
 
א
נ
כ
י
 
נ
צ
ב
 
ע
ל
 
ע
י
ן
 
ה
מ
י
ם
 
ו
ה
י
ה
 
ה
ע
ל
מ
ה
 
ה
י
צ
א
ת
 
ל
ש
א
ב
 
ו
א
מ
ר
ת
י
 
א
ל
י
ה
 
ה
ש
ק
י
נ
י
 
נ
א
 
מ
ע
ט
 
מ
י
ם
 
מ
כ
ד
ך
 
ו
א
מ
ר
ה
 
א
ל
י
 
ג
ם
 
א
ת
ה
 
ש
ת
ה
 
ו
ג
ם
 
ל
ג
מ
ל
י
ך
 
א
ש
א
ב
 
ה
י
א
 
ה
א
ש
ה
 
א
ש
ר
 
ה
ו
כ
י
ח
 
י
ה
ו
ה
 
ל
ב
ן
 
א
ד
נ
י
 
א
נ
י
 
ט
ר
ם
 
א
כ
ל
ה
 
ל
ד
ב
ר
 
א
ל
 
ל
ב
י
 
ו
ה
נ
ה
 
ר
ב
ק
ה
 
י
צ
א
ת
 
ו
כ
ד
ה
 
ע
ל
 
ש
כ
מ
ה
 
ו
ת
ר
ד
 
ה
ע
י
ן
 
ו
ת
ש
א
ב
 
ו
א
מ
ר
 
א
ל
י
ה
 
ה
ש
ק
י
נ
י
 
נ
א
 
מ
ע
ט
 
מ
י
ם
 
מ
כ
ד
ך
 
ו
ת
מ
ה
ר
 
ו
ת
ו
ר
ד
 
כ
ד
ה
 
מ
ע
ל
י
ה
 
ו
ת
א
מ
ר
 
ש
ת
ה
 
ו
ג
ם
 
ג
מ
ל
י
ך
 
א
ש
ק
ה
 
ו
א
ש
ת
ה
 
ו
ג
ם
 
ה
ג
מ
ל
י
ם
 
ה
ש
ק
ת
ה
 
ו
א
ש
א
ל
 
א
ת
ה
 
ו
א
מ
ר
 
ב
ת
 
מ
י
 
א
ת
י
 
ו
ת
א
מ
ר
 
ב
ת
 
ב
ת
ו
א
ל
 
ב
ן
 
נ
ח
ו
ר
 
א
ש
ר
 
י
ל
ד
ה
 
ל
ו
 
מ
ל
כ
ה
 
ו
א
ש
י
ם
 
ה
נ
ז
ם
 
ע
ל
 
א
פ
ה
 
ו
ה
צ
מ
י
ד
י
ם
 
ע
ל
 
י
ד
י
ה
 
ו
א
ק
ד
 
ו
א
ש
ת
ח
ו
י
 
ל
י
ה
ו
ה
 
ו
א
ב
ר
ך
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ד
נ
י
 
א
ב
ר
ה
ם
 
א
ש
ר
 
ה
נ
ח
נ
י
 
ב
ד
ר
ך
 
א
מ
ת
 
ל
ק
ח
ת
 
א
ת
 
ב
ת
 
א
ח
י
 
א
ד
נ
י
 
ל
ב
נ
ו
 
ו
ע
ת
ה
 
א
ם
 
י
ש
כ
ם
 
ע
ש
י
ם
 
ח
ס
ד
 
ו
א
מ
ת
 
א
ת
 
א
ד
נ
י
 
ה
ג
י
ד
ו
 
ל
י
 
ו
א
ם
 
ל
א
 
ה
ג
י
ד
ו
 
ל
י
 
ו
א
פ
נ
ה
 
ע
ל
 
ה
י
מ
י
ן
 
א
ו
 
ע
ל
 
ה
ש
מ
א
ל
 
ו
י
ע
ן
 
ל
ב
ן
 
ו
ב
ת
ו
א
ל
 
ו
י
א
מ
ר
ו
 
מ
י
ה
ו
ה
 
י
צ
א
 
ה
ד
ב
ר
 
ל
א
 
נ
ו
כ
ל
 
ד
ב
ר
 
א
ל
י
ך
 
ר
ע
 
ו
ט
ו
ב
 
ה
נ
ה
 
ר
ב
ק
ה
 
ל
פ
נ
י
ך
 
ק
ח
 
ו
ל
ך
 
ו
ת
ה
י
 
א
ש
ה
 
ל
ב
ן
 
א
ד
נ
י
ך
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
ה
י
 
כ
א
ש
ר
 
ש
מ
ע
 
ע
ב
ד
 
א
ב
ר
ה
ם
 
א
ת
 
ד
ב
ר
י
ה
ם
 
ו
י
ש
ת
ח
ו
י
 
א
ר
צ
ה
 
ל
י
ה
ו
ה
 
ו
י
ו
צ
א
 
ה
ע
ב
ד
 
כ
ל
י
 
כ
ס
ף
 
ו
כ
ל
י
 
ז
ה
ב
 
ו
ב
ג
ד
י
ם
 
ו
י
ת
ן
 
ל
ר
ב
ק
ה
 
ו
מ
ג
ד
נ
ו
ת
 
נ
ת
ן
 
ל
א
ח
י
ה
 
ו
ל
א
מ
ה
 
ו
י
א
כ
ל
ו
 
ו
י
ש
ת
ו
 
ה
ו
א
 
ו
ה
א
נ
ש
י
ם
 
א
ש
ר
 
ע
מ
ו
 
ו
י
ל
י
נ
ו
 
ו
י
ק
מ
ו
 
ב
ב
ק
ר
 
ו
י
א
מ
ר
 
ש
ל
ח
ו
נ
י
 
ל
א
ד
נ
י
 
ו
י
א
מ
ר
ו
 
א
ח
י
ה
 
ו
א
מ
ה
 
ת
ש
ב
 
ה
נ
ע
ר
ה
 
א
ת
נ
ו
 
י
מ
י
ם
 
א
ו
 
ח
ד
ש
 
ו
א
ח
ר
 
ת
ל
ך
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
ל
 
ת
א
ח
ר
ו
 
א
ת
י
 
ו
י
ה
ו
ה
 
ה
צ
ל
י
ח
 
א
ת
 
ד
ר
כ
י
 
ש
ל
ח
ו
נ
י
 
ו
א
ל
כ
ה
 
א
ל
 
א
ד
נ
י
 
ו
י
א
מ
ר
ו
 
נ
ק
ר
א
 
ל
נ
ע
ר
ה
 
ו
נ
ש
א
ל
 
א
ת
 
פ
י
ה
 
ו
י
ק
ר
א
ו
 
ל
ר
ב
ק
ה
 
ו
י
א
מ
ר
ו
 
ל
ה
 
ה
ת
ל
כ
י
 
ע
ם
 
ה
א
י
ש
 
ה
ז
ה
 
ו
ת
א
מ
ר
 
א
ל
ך
 
ו
י
ש
ל
ח
ו
 
א
ת
 
ר
ב
ק
ה
 
א
ח
ו
ת
ם
 
ו
א
ת
 
מ
י
נ
ק
ת
ה
 
ו
א
ת
 
ע
ב
ד
 
א
ב
ר
ה
ם
 
ו
א
ת
 
א
נ
ש
י
ו
 
ו
י
ב
ר
כ
ו
 
א
ת
 
ר
ב
ק
ה
 
ו
י
א
מ
ר
ו
 
ל
ה
 
א
ח
ו
ת
נ
ו
 
א
ת
י
 
ה
ו
י
 
ל
א
ל
פ
י
 
ר
ב
ב
ה
 
ו
י
י
ר
ש
 
ז
ר
ע
י
ך
 
א
ת
 
ש
ע
ר
 
א
י
ב
י
ו
 
ו
ת
ק
ם
 
ר
ב
ק
ה
 
ו
נ
ע
ר
ת
י
ה
 
ו
ת
ר
כ
ב
נ
ה
 
ע
ל
 
ה
ג
מ
ל
י
ם
 
ו
ת
ל
כ
נ
ה
 
א
ח
ר
י
 
ה
א
י
ש
 
ו
י
ק
ח
 
ה
ע
ב
ד
 
א
ת
 
ר
ב
ק
ה
 
ו
י
ל
ך
 
ו
י
צ
ח
ק
 
ב
א
 
ב
מ
ד
ב
ר
 
ב
א
ר
 
ל
ח
י
 
ר
א
ה
 
ו
ה
ו
א
 
י
ש
ב
 
ב
א
ר
ץ
 
ה
נ
ג
ב
 
ו
י
צ
א
 
י
צ
ח
ק
 
ל
ש
ו
ח
 
ב
ש
ד
ה
 
ל
פ
נ
ו
ת
 
ע
ר
ב
 
ו
י
ש
א
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ה
ג
מ
ל
י
ם
 
ב
א
י
ם
 
ו
ת
ש
א
 
ר
ב
ק
ה
 
א
ת
 
ע
י
נ
י
ה
 
ו
ת
ר
א
 
א
ת
 
י
צ
ח
ק
 
ו
ת
פ
ל
 
מ
ע
ל
 
ה
ג
מ
ל
 
ו
ת
א
מ
ר
 
א
ל
 
ה
ע
ב
ד
 
מ
י
 
ה
א
י
ש
 
ה
ל
ז
 
ה
ה
ל
ך
 
ב
ש
ד
ה
 
ל
ק
ר
א
ת
נ
ו
 
ו
י
א
מ
ר
 
ה
ע
ב
ד
 
ה
ו
א
 
א
ד
נ
י
 
ו
ת
ק
ח
 
ה
צ
ע
י
ף
 
ו
ת
ת
כ
ס
 
ו
י
ס
פ
ר
 
ה
ע
ב
ד
 
ל
י
צ
ח
ק
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ע
ש
ה
 
ו
י
ב
י
א
ה
 
י
צ
ח
ק
 
ה
א
ה
ל
ה
 
ש
ר
ה
 
א
מ
ו
 
ו
י
ק
ח
 
א
ת
 
ר
ב
ק
ה
 
ו
ת
ה
י
 
ל
ו
 
ל
א
ש
ה
 
ו
י
א
ה
ב
ה
 
ו
י
נ
ח
ם
 
י
צ
ח
ק
 
א
ח
ר
י
 
א
מ
ו
 
ו
י
ס
ף
 
א
ב
ר
ה
ם
 
ו
י
ק
ח
 
א
ש
ה
 
ו
ש
מ
ה
 
ק
ט
ו
ר
ה
 
ו
ת
ל
ד
 
ל
ו
 
א
ת
 
ז
מ
ר
ו
ן
 
ו
א
ת
 
י
ק
ש
ן
 
ו
א
ת
 
מ
ד
ן
 
ו
א
ת
 
מ
ד
י
ן
 
ו
א
ת
 
י
ש
ב
ק
 
ו
א
ת
 
ש
ו
ח
 
ו
י
ק
ש
ן
 
י
ל
ד
 
א
ת
 
ש
ב
א
 
ו
א
ת
 
ד
ד
ן
 
ו
ב
נ
י
 
ד
ד
ן
 
ה
י
ו
 
א
ש
ו
ר
י
ם
 
ו
ל
ט
ש
י
ם
 
ו
ל
א
מ
י
ם
 
ו
ב
נ
י
 
מ
ד
י
ן
 
ע
י
פ
ה
 
ו
א
פ
ר
 
ח
נ
ו
ך
 
ו
א
ב
י
ד
ע
 
ו
א
ל
ד
ע
ה
 
כ
ל
 
א
ל
ה
 
ב
נ
י
 
ק
ט
ו
ר
ה
 
ו
י
ת
ן
 
א
ב
ר
ה
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ל
י
צ
ח
ק
 
ב
נ
ו
 
ו
ל
ב
נ
י
 
ה
פ
י
ל
ג
ש
י
ם
 
א
ש
ר
 
ל
א
ב
ר
ה
ם
 
נ
ת
ן
 
א
ב
ר
ה
ם
 
מ
ת
נ
ו
ת
 
ו
י
ש
ל
ח
ם
 
מ
ע
ל
 
י
צ
ח
ק
 
ב
נ
ו
 
ב
ע
ו
ד
נ
ו
 
ח
י
 
ק
ד
מ
ה
 
א
ל
 
א
ר
ץ
 
ק
ד
מ
ה
 
ו
א
ל
ה
 
י
מ
י
 
ש
נ
י
 
ח
י
י
 
א
ב
ר
ה
ם
 
א
ש
ר
 
ח
י
 
מ
א
ת
 
ש
נ
ה
 
ו
ש
ב
ע
י
ם
 
ש
נ
ה
 
ו
ח
מ
ש
 
ש
נ
י
ם
 
ו
י
ג
ו
ע
 
ו
י
מ
ת
 
א
ב
ר
ה
ם
 
ב
ש
י
ב
ה
 
ט
ו
ב
ה
 
ז
ק
ן
 
ו
ש
ב
ע
 
י
מ
י
ם
 
ו
י
א
ס
ף
 
א
ל
 
ע
מ
ו
 
ו
י
ק
ב
ר
ו
 
א
ת
ו
 
י
צ
ח
ק
 
ו
י
ש
מ
ע
א
ל
 
ב
נ
י
ו
 
א
ל
 
מ
ע
ר
ת
 
ה
מ
כ
פ
ל
ה
 
א
ל
 
ש
ד
ה
 
ע
פ
ר
ו
ן
 
ב
ן
 
צ
ה
ר
 
ה
ח
ת
י
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
מ
מ
ר
א
 
ה
ש
ד
ה
 
א
ש
ר
 
ק
נ
ה
 
א
ב
ר
ה
ם
 
מ
א
ת
 
ב
נ
י
 
ח
ת
 
ש
ם
 
ק
ב
ו
ר
 
א
ב
ר
ה
ם
 
ו
ש
ר
ה
 
א
ש
ת
ו
 
ו
י
ה
י
 
א
ח
ר
י
 
מ
ו
ת
 
א
ב
ר
ה
ם
 
ו
י
ב
ר
ך
 
א
ל
ה
י
ם
 
א
ת
 
י
צ
ח
ק
 
ב
נ
ו
 
ו
י
ש
ב
 
י
צ
ח
ק
 
ע
ם
 
ב
א
ר
 
ל
ח
י
 
ר
א
י
 
ו
א
ל
ה
 
ת
ו
ל
ד
ת
 
י
ש
מ
ע
א
ל
 
ב
ן
 
א
ב
ר
ה
ם
 
א
ש
ר
 
י
ל
ד
ה
 
ה
ג
ר
 
ה
מ
צ
ר
י
ת
 
ש
פ
ח
ת
 
ש
ר
ה
 
ל
א
ב
ר
ה
ם
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
מ
ע
א
ל
 
ב
ש
מ
ו
ת
ם
 
ל
ת
ו
ל
ד
ת
ם
 
ב
כ
ו
ר
 
י
ש
מ
ע
א
ל
 
נ
ב
א
ו
ת
 
ו
ק
ד
ד
 
ו
א
ד
ב
ל
 
ו
מ
ב
ש
ם
 
ו
מ
ש
מ
ע
 
ו
ד
ו
מ
ה
 
ו
מ
ש
א
 
ה
ד
ד
 
ו
ת
י
מ
ה
 
י
ט
ו
ר
 
נ
פ
י
ש
 
ו
ק
ד
מ
ה
 
א
ל
ה
 
ה
ם
 
ב
נ
י
 
י
ש
מ
ע
א
ל
 
ו
א
ל
ה
 
ש
מ
ו
ת
ם
 
ב
ח
צ
ר
ו
ת
ם
 
ו
ב
ט
י
ר
ת
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
נ
ש
י
א
י
ם
 
ל
א
מ
ת
ם
 
ו
א
ל
ה
 
ש
נ
י
 
ח
י
י
 
י
ש
מ
ע
א
ל
 
מ
א
ת
 
ש
נ
ה
 
ו
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
ש
ב
ע
 
ש
נ
י
ם
 
ו
י
ג
ו
ע
 
ו
י
מ
ת
 
ו
י
א
ס
ף
 
א
ל
 
ע
מ
ו
 
ו
י
ש
כ
נ
ו
 
מ
ח
ו
י
ל
ה
 
ע
ד
 
ש
ו
ר
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
מ
צ
ר
י
ם
 
ב
א
כ
ה
 
א
ש
ו
ר
ה
 
ע
ל
 
פ
נ
י
 
כ
ל
 
א
ח
י
ו
 
נ
פ
ל
 
ו
א
ל
ה
 
ת
ו
ל
ד
ת
 
י
צ
ח
ק
 
ב
ן
 
א
ב
ר
ה
ם
 
א
ב
ר
ה
ם
 
ה
ו
ל
י
ד
 
א
ת
 
י
צ
ח
ק
 
ו
י
ה
י
 
י
צ
ח
ק
 
ב
ן
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ב
ק
ח
ת
ו
 
א
ת
 
ר
ב
ק
ה
 
ב
ת
 
ב
ת
ו
א
ל
 
ה
א
ר
מ
י
 
מ
פ
ד
ן
 
א
ר
ם
 
א
ח
ו
ת
 
ל
ב
ן
 
ה
א
ר
מ
י
 
ל
ו
 
ל
א
ש
ה
 
ו
י
ע
ת
ר
 
י
צ
ח
ק
 
א
ל
 
י
ה
ו
ה
 
ל
נ
כ
ח
 
א
ש
ת
ו
 
כ
י
 
ע
ק
ר
ה
 
ה
י
א
 
ו
י
ע
ת
ר
 
ל
ו
 
י
ה
ו
ה
 
ו
ת
ה
ר
 
ר
ב
ק
ה
 
א
ש
ת
ו
 
ו
י
ת
ר
צ
צ
ו
 
ה
ב
נ
י
ם
 
ב
ק
ר
ב
ה
 
ו
ת
א
מ
ר
 
א
ם
 
כ
ן
 
ל
מ
ה
 
ז
ה
 
א
נ
כ
י
 
ו
ת
ל
ך
 
ל
ד
ר
ש
 
א
ת
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ל
ה
 
ש
נ
י
 
ג
ו
י
ם
 
ב
ב
ט
נ
ך
 
ו
ש
נ
י
 
ל
א
מ
י
ם
 
מ
מ
ע
י
ך
 
י
פ
ר
ד
ו
 
ו
ל
א
ם
 
מ
ל
א
ם
 
י
א
מ
ץ
 
ו
ר
ב
 
י
ע
ב
ד
 
צ
ע
י
ר
 
ו
י
מ
ל
א
ו
 
י
מ
י
ה
 
ל
ל
ד
ת
 
ו
ה
נ
ה
 
ת
א
מ
י
ם
 
ב
ב
ט
נ
ה
 
ו
י
צ
א
 
ה
ר
א
י
ש
ו
ן
 
א
ד
מ
ו
נ
י
 
כ
ל
ו
 
כ
א
ד
ר
ת
 
ש
ע
ר
 
ו
י
ק
ר
א
ו
 
ש
מ
ו
 
ע
ש
ו
 
ו
א
ח
ר
י
 
כ
ן
 
י
צ
א
 
א
ח
י
ו
 
ו
י
ד
ו
 
א
ח
ז
ת
 
ב
ע
ק
ב
 
ע
ש
ו
 
ו
י
ק
ר
א
ו
 
ש
מ
ו
 
י
ע
ק
ב
 
ו
י
צ
ח
ק
 
ב
ן
 
ש
ש
י
ם
 
ש
נ
ה
 
ב
ל
ד
ת
 
א
ת
ם
 
ו
י
ג
ד
ל
ו
 
ה
נ
ע
ר
י
ם
 
ו
י
ה
י
 
ע
ש
ו
 
א
י
ש
 
י
ד
ע
 
צ
י
ד
 
א
י
ש
 
ש
ד
ה
 
ו
י
ע
ק
ב
 
א
י
ש
 
ת
ם
 
י
ש
ב
 
א
ה
ל
י
ם
 
ו
י
א
ה
ב
 
י
צ
ח
ק
 
א
ת
 
ע
ש
ו
 
כ
י
 
צ
י
ד
ו
 
ב
פ
י
ו
 
ו
ר
ב
ק
ה
 
א
ה
ב
ת
 
א
ת
 
י
ע
ק
ב
 
ו
י
ז
ד
 
י
ע
ק
ב
 
נ
ז
י
ד
 
ו
י
ב
א
 
ע
ש
ו
 
מ
ן
 
ה
ש
ד
ה
 
ו
ה
ו
א
 
ע
י
ף
 
ו
י
א
מ
ר
 
ע
ש
ו
 
א
ל
 
י
ע
ק
ב
 
ה
ל
ע
ט
נ
י
 
נ
א
 
מ
ן
 
ה
א
ד
ו
ם
 
ה
א
ד
ם
 
ה
ז
ה
 
כ
י
 
ע
י
ף
 
א
נ
כ
י
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
מ
ו
 
א
ד
ו
ם
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
מ
כ
ר
ה
 
כ
י
ו
ם
 
א
ת
 
ב
כ
ר
ת
ך
 
ל
י
 
ו
י
א
מ
ר
 
ע
ש
ו
 
ה
נ
ה
 
א
נ
כ
י
 
ה
ל
ך
 
ל
מ
ו
ת
 
ו
ל
מ
ה
 
ז
ה
 
ל
י
 
ב
כ
ו
ר
ה
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
ה
ש
ב
ע
 
ל
י
 
כ
י
ו
ם
 
ו
י
ש
ב
ע
 
ל
ו
 
ו
י
מ
כ
ר
 
א
ת
 
ב
כ
ו
ר
ת
ו
 
ל
י
ע
ק
ב
 
ו
י
ע
ק
ב
 
נ
ת
ן
 
ל
ע
ש
ו
 
ל
ח
ם
 
ו
נ
ז
י
ד
 
ע
ד
 
ש
י
ם
 
ו
י
א
כ
ל
 
ו
י
ש
ת
 
ו
י
ק
ם
 
ו
י
ל
ך
 
ו
י
ב
ז
 
ע
ש
ו
 
א
ת
 
ה
ב
כ
ו
ר
ה
 
ו
י
ה
י
 
ר
ע
ב
 
ב
א
ר
ץ
 
מ
ל
ב
ד
 
ה
ר
ע
ב
 
ה
ר
א
י
ש
ו
ן
 
א
ש
ר
 
ה
י
ה
 
ב
י
מ
י
 
א
ב
ר
ה
ם
 
ו
י
ל
ך
 
י
צ
ח
ק
 
א
ל
 
א
ב
י
מ
ל
ך
 
מ
ל
ך
 
פ
ל
ש
ת
י
ם
 
ג
ר
ר
ה
 
ו
י
ר
א
 
א
ל
י
ו
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
א
ל
 
ת
ר
ד
 
מ
צ
ר
י
מ
ה
 
ש
כ
ן
 
ב
א
ר
ץ
 
א
ש
ר
 
א
מ
ר
 
א
ל
י
ך
 
ג
ר
 
ב
א
ר
ץ
 
ה
ז
א
ת
 
ו
א
ה
י
ה
 
ע
מ
ך
 
ו
א
ב
ר
כ
ך
 
כ
י
 
ל
ך
 
ו
ל
ז
ר
ע
ך
 
א
ת
ן
 
א
ת
 
כ
ל
 
ה
א
ר
צ
ו
ת
 
ה
א
ל
ה
 
ו
ה
ק
מ
ת
י
 
א
ת
 
ה
ש
ב
ו
ע
ה
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ר
ה
ם
 
א
ב
י
ך
 
ו
ה
ר
ב
י
ת
י
 
א
ת
 
ז
ר
ע
ך
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ו
נ
ת
ת
י
 
ל
ז
ר
ע
ך
 
א
ת
 
כ
ל
 
ה
א
ר
צ
ו
ת
 
ה
א
ל
ה
 
ו
ה
ת
ב
ר
כ
ו
 
ב
ז
ר
ע
ך
 
כ
ל
 
ג
ו
י
 
ה
א
ר
ץ
 
ע
ק
ב
 
א
ש
ר
 
ש
מ
ע
 
א
ב
ר
ה
ם
 
א
ב
י
ך
 
ב
ק
ו
ל
י
 
ו
י
ש
מ
ר
 
מ
ש
מ
ר
ת
י
 
מ
צ
ו
ת
י
 
ח
ק
ו
ת
י
 
ו
ת
ו
ר
ו
ת
י
 
ו
י
ש
ב
 
י
צ
ח
ק
 
ב
ג
ר
ר
 
ו
י
ש
א
ל
ו
 
א
נ
ש
י
 
ה
מ
ק
ו
ם
 
ע
ל
 
א
ש
ת
ו
 
ו
י
א
מ
ר
 
א
ח
ו
ת
י
 
ה
י
א
 
כ
י
 
י
ר
א
 
ל
א
מ
ר
 
א
ש
ת
י
 
ה
י
א
 
פ
ן
 
י
ה
ר
ג
ו
נ
י
 
א
נ
ש
י
 
ה
מ
ק
ו
ם
 
ע
ל
 
ר
ב
ק
ה
 
כ
י
 
ט
ו
ב
ת
 
מ
ר
א
ה
 
ה
י
א
 
ו
י
ה
י
 
כ
א
ש
ר
 
ה
ר
כ
ו
 
ל
ו
 
ש
ם
 
ה
י
מ
י
ם
 
ו
י
ש
ק
ף
 
א
ב
י
מ
ל
ך
 
מ
ל
ך
 
פ
ל
ש
ת
י
ם
 
ב
ע
ד
 
ה
ח
ל
ו
ן
 
ו
י
ר
א
 
ו
ה
נ
ה
 
י
צ
ח
ק
 
מ
צ
ח
ק
 
א
ת
 
ר
ב
ק
ה
 
א
ש
ת
ו
 
ו
י
ק
ר
א
 
א
ב
י
מ
ל
ך
 
ל
י
צ
ח
ק
 
ו
י
א
מ
ר
 
א
ך
 
ה
נ
ה
 
א
ש
ת
ך
 
ה
י
א
 
ו
א
י
ך
 
א
מ
ר
ת
 
א
ח
ו
ת
י
 
ה
י
א
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
י
צ
ח
ק
 
כ
י
 
א
מ
ר
ת
י
 
פ
ן
 
א
מ
ו
ת
 
ע
ל
י
ה
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
מ
ה
 
ז
א
ת
 
ע
ש
י
ת
 
ל
נ
ו
 
כ
מ
ע
ט
 
ש
כ
ב
 
א
ח
ד
 
ה
ע
ם
 
א
ת
 
א
ש
ת
ך
 
ו
ה
ב
א
ת
 
ע
ל
י
נ
ו
 
א
ש
ם
 
ו
י
צ
ו
 
א
ב
י
מ
ל
ך
 
א
ת
 
כ
ל
 
ע
מ
ו
 
ל
א
מ
ר
 
ה
נ
ג
ע
 
ב
א
י
ש
 
ה
ז
ה
 
ו
ב
א
ש
ת
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
י
ז
ר
ע
 
י
צ
ח
ק
 
ב
א
ר
ץ
 
ה
ה
י
א
 
ו
י
מ
צ
א
 
ב
ש
נ
ה
 
ה
ה
י
א
 
מ
א
ה
 
ש
ע
ר
י
ם
 
ו
י
ב
ר
כ
ה
ו
 
י
ה
ו
ה
 
ו
י
ג
ד
ל
 
ה
א
י
ש
 
ו
י
ל
ך
 
ה
ל
ך
 
ו
ג
ד
ל
 
ע
ד
 
כ
י
 
ג
ד
ל
 
מ
א
ד
 
ו
י
ה
י
 
ל
ו
 
מ
ק
נ
ה
 
צ
א
ן
 
ו
מ
ק
נ
ה
 
ב
ק
ר
 
ו
ע
ב
ד
ה
 
ר
ב
ה
 
ו
י
ק
נ
א
ו
 
א
ת
ו
 
פ
ל
ש
ת
י
ם
 
ו
כ
ל
 
ה
ב
א
ר
ו
ת
 
א
ש
ר
 
ח
פ
ר
ו
 
ע
ב
ד
י
 
א
ב
י
ו
 
ב
י
מ
י
 
א
ב
ר
ה
ם
 
א
ב
י
ו
 
ס
ת
מ
ו
ם
 
פ
ל
ש
ת
י
ם
 
ו
י
מ
ל
א
ו
ם
 
ע
פ
ר
 
ו
י
א
מ
ר
 
א
ב
י
מ
ל
ך
 
א
ל
 
י
צ
ח
ק
 
ל
ך
 
מ
ע
מ
נ
ו
 
כ
י
 
ע
צ
מ
ת
 
מ
מ
נ
ו
 
מ
א
ד
 
ו
י
ל
ך
 
מ
ש
ם
 
י
צ
ח
ק
 
ו
י
ח
ן
 
ב
נ
ח
ל
 
ג
ר
ר
 
ו
י
ש
ב
 
ש
ם
 
ו
י
ש
ב
 
י
צ
ח
ק
 
ו
י
ח
פ
ר
 
א
ת
 
ב
א
ר
ו
ת
 
ה
מ
י
ם
 
א
ש
ר
 
ח
פ
ר
ו
 
ע
ב
ד
י
 
א
ב
ר
ה
ם
 
א
ב
י
ו
 
ו
י
ס
ת
מ
ו
ם
 
פ
ל
ש
ת
י
ם
 
א
ח
ר
י
 
מ
ו
ת
 
א
ב
ר
ה
ם
 
ו
י
ק
ר
א
 
ל
ה
ן
 
ש
מ
ו
ת
 
כ
ש
מ
ו
ת
 
א
ש
ר
 
ק
ר
א
 
ל
ה
ן
 
א
ב
י
ו
 
ו
י
ח
פ
ר
ו
 
ע
ב
ד
י
 
י
צ
ח
ק
 
ב
נ
ח
ל
 
ו
י
מ
צ
א
ו
 
ש
ם
 
ב
א
ר
 
מ
י
ם
 
ח
י
י
ם
 
ו
י
ר
י
ב
ו
 
ר
ע
י
 
ג
ר
ר
 
ע
ם
 
ר
ע
י
 
י
צ
ח
ק
 
ל
א
מ
ר
 
ל
נ
ו
 
ה
מ
י
ם
 
ו
י
ק
ר
א
 
ש
ם
 
ה
ב
א
ר
 
ע
ש
ק
 
כ
י
 
ה
ת
ע
ש
ק
ו
 
ע
מ
ו
 
ו
י
ח
פ
ר
ו
 
ב
א
ר
 
א
ח
ר
ת
 
ו
י
ר
י
ב
ו
 
ג
ם
 
ע
ל
י
ה
 
ו
י
ק
ר
א
 
ש
מ
ה
 
ש
ט
נ
ה
 
ו
י
ע
ת
ק
 
מ
ש
ם
 
ו
י
ח
פ
ר
ו
 
ב
א
ר
 
א
ח
ר
ת
 
ו
ל
א
 
ר
ב
ו
 
ע
ל
י
ה
 
ו
י
ק
ר
א
 
ש
מ
ה
 
ר
ח
ב
ו
ת
 
ו
י
א
מ
ר
 
כ
י
 
ע
ת
ה
 
ה
ר
ח
י
ב
 
י
ה
ו
ה
 
ל
נ
ו
 
ו
פ
ר
י
נ
ו
 
ב
א
ר
ץ
 
ו
י
ע
ל
 
מ
ש
ם
 
ב
א
ר
 
ש
ב
ע
 
ו
י
ר
א
 
א
ל
י
ו
 
י
ה
ו
ה
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ו
י
א
מ
ר
 
א
נ
כ
י
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
א
ב
י
ך
 
א
ל
 
ת
י
ר
א
 
כ
י
 
א
ת
ך
 
א
נ
כ
י
 
ו
ב
ר
כ
ת
י
ך
 
ו
ה
ר
ב
י
ת
י
 
א
ת
 
ז
ר
ע
ך
 
ב
ע
ב
ו
ר
 
א
ב
ר
ה
ם
 
ע
ב
ד
י
 
ו
י
ב
ן
 
ש
ם
 
מ
ז
ב
ח
 
ו
י
ק
ר
א
 
ב
ש
ם
 
י
ה
ו
ה
 
ו
י
ט
 
ש
ם
 
א
ה
ל
ו
 
ו
י
כ
ר
ו
 
ש
ם
 
ע
ב
ד
י
 
י
צ
ח
ק
 
ב
א
ר
 
ו
א
ב
י
מ
ל
ך
 
ה
ל
ך
 
א
ל
י
ו
 
מ
ג
ר
ר
 
ו
א
ח
ז
ת
 
מ
ר
ע
ה
ו
 
ו
פ
י
כ
ל
 
ש
ר
 
צ
ב
א
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
צ
ח
ק
 
מ
ד
ו
ע
 
ב
א
ת
ם
 
א
ל
י
 
ו
א
ת
ם
 
ש
נ
א
ת
ם
 
א
ת
י
 
ו
ת
ש
ל
ח
ו
נ
י
 
מ
א
ת
כ
ם
 
ו
י
א
מ
ר
ו
 
ר
א
ו
 
ר
א
י
נ
ו
 
כ
י
 
ה
י
ה
 
י
ה
ו
ה
 
ע
מ
ך
 
ו
נ
א
מ
ר
 
ת
ה
י
ה
 
נ
א
 
א
ל
ה
 
ב
י
נ
ת
נ
ו
 
ב
י
נ
נ
ו
 
ו
ב
י
נ
ך
 
ו
נ
כ
ר
ת
ה
 
ב
ר
י
ת
 
ע
מ
ך
 
א
ם
 
ת
ע
ש
ה
 
ע
מ
נ
ו
 
ר
ע
 
כ
א
ש
ר
 
ל
א
 
נ
ג
ע
נ
ו
ך
 
ו
כ
א
ש
ר
 
ע
ש
י
נ
ו
 
ע
מ
ך
 
ר
ק
 
ט
ו
ב
 
ו
נ
ש
ל
ח
ך
 
ב
ש
ל
ו
ם
 
ע
ת
ה
 
א
ת
ה
 
ב
ר
ו
ך
 
י
ה
ו
ה
 
ו
י
ע
ש
 
ל
ה
ם
 
מ
ש
ת
ה
 
ו
י
א
כ
ל
ו
 
ו
י
ש
ת
ו
 
ו
י
ש
כ
מ
ו
 
ב
ב
ק
ר
 
ו
י
ש
ב
ע
ו
 
א
י
ש
 
ל
ר
ע
ה
ו
 
ו
י
ש
ל
ח
ם
 
י
צ
ח
ק
 
ו
י
ל
כ
ו
 
מ
א
ת
ו
 
ב
ש
ל
ו
ם
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
י
ב
א
ו
 
ע
ב
ד
י
 
י
צ
ח
ק
 
ו
י
ג
ד
ו
 
ל
ו
 
ע
ל
 
א
ד
ו
ת
 
ה
ב
א
ר
 
א
ש
ר
 
ח
פ
ר
ו
 
ו
י
א
מ
ר
ו
 
ל
ו
 
מ
צ
א
נ
ו
 
מ
י
ם
 
ו
י
ק
ר
א
 
א
ת
ה
 
ש
ב
ע
ה
 
ע
ל
 
כ
ן
 
ש
ם
 
ה
ע
י
ר
 
ב
א
ר
 
ש
ב
ע
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
י
ה
י
 
ע
ש
ו
 
ב
ן
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
י
ק
ח
 
א
ש
ה
 
א
ת
 
י
ה
ו
ד
י
ת
 
ב
ת
 
ב
א
ר
י
 
ה
ח
ת
י
 
ו
א
ת
 
ב
ש
מ
ת
 
ב
ת
 
א
י
ל
ו
ן
 
ה
ח
ו
י
 
ו
ת
ה
י
י
נ
ה
 
מ
ר
ת
 
ר
ו
ח
 
ל
י
צ
ח
ק
 
ו
ל
ר
ב
ק
ה
 
ו
י
ה
י
 
כ
י
 
ז
ק
ן
 
י
צ
ח
ק
 
ו
ת
כ
ה
נ
ה
 
ע
י
נ
י
ו
 
מ
ר
א
ו
ת
 
ו
י
ק
ר
א
 
א
ת
 
ע
ש
ו
 
ב
נ
ו
 
ה
ג
ד
ו
ל
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ב
נ
י
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
ה
נ
ה
 
נ
א
 
ז
ק
נ
ת
י
 
ל
א
 
י
ד
ע
ת
י
 
י
ו
ם
 
מ
ו
ת
י
 
ו
ע
ת
ה
 
ש
א
 
נ
א
 
כ
ל
י
ך
 
ת
ל
י
ת
ך
 
ו
ק
ש
ת
ך
 
ו
צ
א
 
ה
ש
ד
ה
 
ו
צ
ו
ד
 
ל
י
 
צ
י
ד
 
ו
ע
ש
ה
 
ל
י
 
מ
ט
ע
מ
י
ם
 
כ
א
ש
ר
 
א
ה
ב
ת
י
 
ו
ה
ב
א
ת
 
ל
י
 
ו
א
כ
ל
 
ב
ע
ב
ו
ר
 
ת
ב
ר
כ
ך
 
נ
פ
ש
י
 
ב
ט
ר
ם
 
א
מ
ו
ת
 
ו
ר
ב
ק
ה
 
ש
מ
ע
ת
 
ב
ד
ב
ר
 
י
צ
ח
ק
 
א
ל
 
ע
ש
ו
 
ב
נ
ו
 
ו
י
ל
ך
 
ע
ש
ו
 
ה
ש
ד
ה
 
ל
צ
ו
ד
 
צ
י
ד
 
ל
ה
ב
י
א
 
ו
ר
ב
ק
ה
 
א
מ
ר
ה
 
א
ל
 
י
ע
ק
ב
 
ב
נ
ה
 
ל
א
מ
ר
 
ה
נ
ה
 
ש
מ
ע
ת
י
 
א
ת
 
א
ב
י
ך
 
מ
ד
ב
ר
 
א
ל
 
ע
ש
ו
 
א
ח
י
ך
 
ל
א
מ
ר
 
ה
ב
א
 
ל
י
 
צ
י
ד
 
ו
ע
ש
ה
 
ל
י
 
מ
ט
ע
מ
י
ם
 
ו
א
כ
ל
ה
 
ו
א
ב
ר
כ
ך
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
פ
נ
י
 
מ
ו
ת
י
 
ו
ע
ת
ה
 
ב
נ
י
 
ש
מ
ע
 
ב
ק
ו
ל
י
 
ל
א
ש
ר
 
א
נ
י
 
מ
צ
ו
י
ה
 
א
ת
ך
 
ל
ך
 
נ
א
 
א
ל
 
ה
צ
א
ן
 
ו
ק
ח
 
ל
י
 
מ
ש
ם
 
ש
נ
י
 
ג
ד
י
י
 
ע
ז
י
ם
 
ט
ו
ב
י
ם
 
ו
א
ע
ש
ה
 
א
ת
ם
 
מ
ט
ע
מ
י
ם
 
ל
א
ב
י
ך
 
כ
א
ש
ר
 
א
ה
ב
 
ו
ה
ב
א
ת
 
ל
א
ב
י
ך
 
ו
א
כ
ל
 
ב
ע
ב
ו
ר
 
א
ש
ר
 
י
ב
ר
כ
ך
 
ל
פ
נ
י
 
מ
ו
ת
ו
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
ר
ב
ק
ה
 
א
מ
ו
 
ה
נ
ה
 
ע
ש
ו
 
א
ח
י
 
א
י
ש
 
ש
ע
י
ר
 
ו
א
נ
כ
י
 
א
י
ש
 
ח
ל
ק
 
א
ו
ל
י
 
י
מ
ש
נ
י
 
א
ב
י
 
ו
ה
י
י
ת
י
 
ב
ע
י
נ
י
ו
 
כ
מ
ת
ע
ת
ע
 
ו
ה
ב
א
ת
 
ע
ל
י
 
ק
ל
ל
ה
 
ו
ל
א
 
ב
ר
כ
ה
 
ו
ת
א
מ
ר
 
ל
ו
 
א
מ
ו
 
ע
ל
י
 
ק
ל
ל
ת
ך
 
ב
נ
י
 
א
ך
 
ש
מ
ע
 
ב
ק
ו
ל
י
 
ו
ל
ך
 
ק
ח
 
ל
י
 
ו
י
ל
ך
 
ו
י
ק
ח
 
ו
י
ב
א
 
ל
א
מ
ו
 
ו
ת
ע
ש
 
א
מ
ו
 
מ
ט
ע
מ
י
ם
 
כ
א
ש
ר
 
א
ה
ב
 
א
ב
י
ו
 
ו
ת
ק
ח
 
ר
ב
ק
ה
 
א
ת
 
ב
ג
ד
י
 
ע
ש
ו
 
ב
נ
ה
 
ה
ג
ד
ו
ל
 
ה
ח
מ
ד
ו
ת
 
א
ש
ר
 
א
ת
ה
 
ב
ב
י
ת
 
ו
ת
ל
ב
י
ש
 
א
ת
 
י
ע
ק
ב
 
ב
נ
ה
 
ה
ק
ט
ן
 
ו
א
ת
 
ע
ו
ר
ו
ת
 
ג
ד
י
י
 
ה
ע
ז
י
ם
 
ה
ל
ב
י
ש
ה
 
ע
ל
 
י
ד
ו
 
ו
ע
ל
 
ח
ל
ק
ת
 
צ
ו
א
ר
ו
 
ו
ת
ת
ן
 
א
ת
 
ה
מ
ט
ע
מ
י
ם
 
ו
א
ת
 
ה
ל
ח
ם
 
א
ש
ר
 
ע
ש
ת
ה
 
ב
י
ד
 
י
ע
ק
ב
 
ב
נ
ה
 
ו
י
ב
א
 
א
ל
 
א
ב
י
ו
 
ו
י
א
מ
ר
 
א
ב
י
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
מ
י
 
א
ת
ה
 
ב
נ
י
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
א
ב
י
ו
 
א
נ
כ
י
 
ע
ש
ו
 
ב
כ
ר
ך
 
ע
ש
י
ת
י
 
כ
א
ש
ר
 
ד
ב
ר
ת
 
א
ל
י
 
ק
ו
ם
 
נ
א
 
ש
ב
ה
 
ו
א
כ
ל
ה
 
מ
צ
י
ד
י
 
ב
ע
ב
ו
ר
 
ת
ב
ר
כ
נ
י
 
נ
פ
ש
ך
 
ו
י
א
מ
ר
 
י
צ
ח
ק
 
א
ל
 
ב
נ
ו
 
מ
ה
 
ז
ה
 
מ
ה
ר
ת
 
ל
מ
צ
א
 
ב
נ
י
 
ו
י
א
מ
ר
 
כ
י
 
ה
ק
ר
א
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
פ
נ
י
 
ו
י
א
מ
ר
 
י
צ
ח
ק
 
א
ל
 
י
ע
ק
ב
 
ג
ש
ה
 
נ
א
 
ו
א
מ
ו
ש
ך
 
ב
נ
י
 
ה
א
ת
ה
 
ז
ה
 
ב
נ
י
 
ע
ש
ו
 
א
ם
 
ל
א
 
ו
י
ג
ש
 
י
ע
ק
ב
 
א
ל
 
י
צ
ח
ק
 
א
ב
י
ו
 
ו
י
מ
ש
ה
ו
 
ו
י
א
מ
ר
 
ה
ק
ו
ל
 
ק
ו
ל
 
י
ע
ק
ב
 
ו
ה
י
ד
י
ם
 
י
ד
י
 
ע
ש
ו
 
ו
ל
א
 
ה
כ
י
ר
ו
 
כ
י
 
ה
י
ו
 
י
ד
י
ו
 
כ
י
ד
י
 
ע
ש
ו
 
א
ח
י
ו
 
ש
ע
י
ר
ו
ת
 
ו
י
ב
ר
כ
ה
ו
 
ו
י
א
מ
ר
 
ה
א
ת
ה
 
ז
ה
 
ב
נ
י
 
ע
ש
ו
 
ו
י
א
מ
ר
 
א
נ
י
 
ו
י
א
מ
ר
 
ה
ג
י
ש
ה
 
ל
י
 
ו
א
כ
ל
 
מ
צ
י
ד
 
ב
נ
י
 
ל
מ
ע
ן
 
ת
ב
ר
כ
ך
 
נ
פ
ש
י
 
ו
י
ג
ש
 
ל
ו
 
ו
י
א
כ
ל
 
ו
י
ב
א
 
ל
ו
 
י
י
ן
 
ו
י
ש
ת
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
י
צ
ח
ק
 
א
ב
י
ו
 
ג
ש
ה
 
נ
א
 
ו
ש
ק
ה
 
ל
י
 
ב
נ
י
 
ו
י
ג
ש
 
ו
י
ש
ק
 
ל
ו
 
ו
י
ר
ח
 
א
ת
 
ר
י
ח
 
ב
ג
ד
י
ו
 
ו
י
ב
ר
כ
ה
ו
 
ו
י
א
מ
ר
 
ר
א
ו
 
ר
י
ח
 
ב
נ
י
 
כ
ר
י
ח
 
ה
ש
ד
ה
 
מ
ל
א
 
א
ש
ר
 
ב
ר
כ
ה
ו
 
י
ה
ו
ה
 
י
ת
ן
 
ל
ך
 
ה
א
ל
ה
י
ם
 
מ
ט
ל
 
ה
ש
מ
י
ם
 
ו
מ
ש
מ
נ
י
 
ה
א
ר
ץ
 
ו
ר
ב
 
ד
ג
ן
 
ו
ת
י
ר
ש
 
י
ע
ב
ד
ו
ך
 
ע
מ
י
ם
 
ו
י
ש
ת
ח
ו
ו
 
ל
ך
 
ל
א
מ
י
ם
 
ה
ו
י
 
ג
ב
י
ר
 
ל
א
ח
י
ך
 
ו
י
ש
ת
ח
ו
ו
 
ל
ך
 
ב
נ
י
 
א
מ
ך
 
א
ר
ר
י
ך
 
א
ר
ו
ר
 
ו
מ
ב
ר
כ
י
ך
 
ב
ר
ו
ך
 
ו
י
ה
י
 
כ
א
ש
ר
 
כ
ל
ה
 
י
צ
ח
ק
 
ל
ב
ר
ך
 
א
ת
 
י
ע
ק
ב
 
ו
י
ה
י
 
א
ך
 
י
צ
א
 
י
צ
א
 
י
ע
ק
ב
 
מ
א
ת
 
פ
נ
י
 
י
צ
ח
ק
 
א
ב
י
ו
 
ו
ע
ש
ו
 
א
ח
י
ו
 
ב
א
 
מ
צ
י
ד
ו
 
ו
י
ע
ש
 
ג
ם
 
ה
ו
א
 
מ
ט
ע
מ
י
ם
 
ו
י
ב
א
 
ל
א
ב
י
ו
 
ו
י
א
מ
ר
 
ל
א
ב
י
ו
 
י
ק
ו
ם
 
א
ב
י
 
ו
י
א
כ
ל
 
מ
צ
י
ד
 
ב
נ
ו
 
ב
ע
ב
ו
ר
 
ת
ב
ר
כ
נ
י
 
נ
פ
ש
ך
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
י
צ
ח
ק
 
א
ב
י
ו
 
מ
י
 
א
ת
ה
 
ו
י
א
מ
ר
 
א
נ
י
 
ב
נ
ך
 
ב
כ
ר
ך
 
ע
ש
ו
 
ו
י
ח
ר
ד
 
י
צ
ח
ק
 
ח
ר
ד
ה
 
ג
ד
ל
ה
 
ע
ד
 
מ
א
ד
 
ו
י
א
מ
ר
 
מ
י
 
א
פ
ו
 
ה
צ
ד
 
צ
י
ד
 
ו
י
ב
א
 
ל
י
 
ו
א
כ
ל
 
מ
כ
ל
 
ב
ט
ר
ם
 
ת
ב
ו
א
 
ו
א
ב
ר
כ
ה
ו
 
ו
ג
ם
 
ב
ר
ו
ך
 
י
ה
י
ה
 
ו
י
ה
י
 
כ
ש
מ
ע
 
ע
ש
ו
 
א
ת
 
ד
ב
ר
י
 
א
ב
י
ו
 
ו
י
צ
ע
ק
 
צ
ע
ק
ה
 
ג
ד
ל
ה
 
ו
מ
ר
ה
 
ע
ד
 
מ
א
ד
 
ו
י
א
מ
ר
 
ל
א
ב
י
ו
 
ב
ר
כ
נ
י
 
ג
ם
 
א
נ
י
 
א
ב
י
 
ו
י
א
מ
ר
 
ב
א
 
א
ח
י
ך
 
ב
מ
ר
מ
ה
 
ו
י
ק
ח
 
א
ת
 
ב
ר
כ
ת
ך
 
ו
י
א
מ
ר
 
ה
כ
ו
 
ק
ר
א
 
ש
מ
ו
 
י
ע
ק
ב
 
ו
י
ע
ק
ב
נ
י
 
ז
ה
 
פ
ע
מ
י
ם
 
א
ת
 
ב
כ
ר
ת
י
 
ל
ק
ח
 
ו
ה
נ
ה
 
ע
ת
ה
 
ל
ק
ח
 
ב
ר
כ
ת
י
 
ו
י
א
מ
ר
 
ה
ל
א
 
ה
צ
ל
ת
 
ל
י
 
ב
ר
כ
ה
 
ו
י
ע
ן
 
י
צ
ח
ק
 
ו
י
א
מ
ר
 
ל
ע
ש
ו
 
ה
ן
 
ג
ב
י
ר
 
ש
מ
ת
י
ו
 
ל
ך
 
ו
א
ת
 
כ
ל
 
א
ח
י
ו
 
נ
ת
ת
י
 
ל
ו
 
ל
ע
ב
ד
י
ם
 
ו
ד
ג
ן
 
ו
ת
י
ר
ש
 
ס
מ
כ
ת
י
ו
 
ו
ל
ך
 
א
פ
ו
א
 
מ
ה
 
א
ע
ש
ה
 
ב
נ
י
 
ו
י
א
מ
ר
 
ע
ש
ו
 
א
ל
 
א
ב
י
ו
 
ה
ב
ר
כ
ה
 
א
ח
ת
 
ה
י
א
 
ל
ך
 
א
ב
י
 
ב
ר
כ
נ
י
 
ג
ם
 
א
נ
י
 
א
ב
י
 
ו
י
ש
א
 
ע
ש
ו
 
ק
ו
ל
ו
 
ו
י
ב
ך
 
ו
י
ע
ן
 
י
צ
ח
ק
 
א
ב
י
ו
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ה
ן
 
מ
ש
מ
נ
י
 
ה
א
ר
ץ
 
י
ה
י
ה
 
מ
ו
ש
ב
ך
 
מ
ט
ל
 
ה
ש
מ
י
ם
 
מ
מ
ע
ל
 
ו
ע
ל
 
ח
ר
ב
ך
 
ת
ח
י
ה
 
ו
א
ת
 
א
ח
י
ך
 
ת
ע
ב
ד
 
ו
ה
י
ה
 
כ
א
ש
ר
 
ת
ה
ד
ר
 
ו
פ
ר
ק
ת
 
ע
ו
ל
ו
 
מ
ע
ל
 
צ
ו
א
ר
ך
 
ו
י
ש
ט
ם
 
ע
ש
ו
 
א
ת
 
י
ע
ק
ב
 
ע
ל
 
ה
ב
ר
כ
ה
 
א
ש
ר
 
ב
ר
כ
ו
 
א
ב
י
ו
 
ו
י
א
מ
ר
 
ע
ש
ו
 
ב
ל
ב
ו
 
י
ק
ר
ב
ו
 
י
מ
י
 
א
ב
ל
 
א
ב
י
 
ו
א
ה
ר
ג
ה
 
א
ת
 
י
ע
ק
ב
 
א
ח
י
 
ו
י
ג
ד
 
ל
ר
ב
ק
ה
 
א
ת
 
ד
ב
ר
י
 
ע
ש
ו
 
ב
נ
ה
 
ה
ג
ד
ו
ל
 
ו
ת
ש
ל
ח
 
ו
ת
ק
ר
א
 
ל
י
ע
ק
ב
 
ב
נ
ה
 
ה
ק
ט
ן
 
ו
ת
א
מ
ר
 
א
ל
י
ו
 
ה
נ
ה
 
ע
ש
ו
 
א
ח
י
ך
 
מ
ת
נ
ח
ם
 
ל
ך
 
ל
ה
ר
ג
ך
 
ו
ע
ת
ה
 
ב
נ
י
 
ש
מ
ע
 
ב
ק
ו
ל
י
 
ו
ק
ו
ם
 
ב
ר
ח
 
ל
ך
 
א
ל
 
ל
ב
ן
 
א
ח
י
 
ח
ר
נ
ה
 
ו
י
ש
ב
ת
 
ע
מ
ו
 
י
מ
י
ם
 
א
ח
ד
י
ם
 
ע
ד
 
א
ש
ר
 
ת
ש
ו
ב
 
ח
מ
ת
 
א
ח
י
ך
 
ע
ד
 
ש
ו
ב
 
א
ף
 
א
ח
י
ך
 
מ
מ
ך
 
ו
ש
כ
ח
 
א
ת
 
א
ש
ר
 
ע
ש
י
ת
 
ל
ו
 
ו
ש
ל
ח
ת
י
 
ו
ל
ק
ח
ת
י
ך
 
מ
ש
ם
 
ל
מ
ה
 
א
ש
כ
ל
 
ג
ם
 
ש
נ
י
כ
ם
 
י
ו
ם
 
א
ח
ד
 
ו
ת
א
מ
ר
 
ר
ב
ק
ה
 
א
ל
 
י
צ
ח
ק
 
ק
צ
ת
י
 
ב
ח
י
י
 
מ
פ
נ
י
 
ב
נ
ו
ת
 
ח
ת
 
א
ם
 
ל
ק
ח
 
י
ע
ק
ב
 
א
ש
ה
 
מ
ב
נ
ו
ת
 
ח
ת
 
כ
א
ל
ה
 
מ
ב
נ
ו
ת
 
ה
א
ר
ץ
 
ל
מ
ה
 
ל
י
 
ח
י
י
ם
 
ו
י
ק
ר
א
 
י
צ
ח
ק
 
א
ל
 
י
ע
ק
ב
 
ו
י
ב
ר
ך
 
א
ת
ו
 
ו
י
צ
ו
ה
ו
 
ו
י
א
מ
ר
 
ל
ו
 
ל
א
 
ת
ק
ח
 
א
ש
ה
 
מ
ב
נ
ו
ת
 
כ
נ
ע
ן
 
ק
ו
ם
 
ל
ך
 
פ
ד
נ
ה
 
א
ר
ם
 
ב
י
ת
 
ב
ת
ו
א
ל
 
א
ב
י
 
א
מ
ך
 
ו
ק
ח
 
ל
ך
 
מ
ש
ם
 
א
ש
ה
 
מ
ב
נ
ו
ת
 
ל
ב
ן
 
א
ח
י
 
א
מ
ך
 
ו
א
ל
 
ש
ד
י
 
י
ב
ר
ך
 
א
ת
ך
 
ו
י
פ
ר
ך
 
ו
י
ר
ב
ך
 
ו
ה
י
י
ת
 
ל
ק
ה
ל
 
ע
מ
י
ם
 
ו
י
ת
ן
 
ל
ך
 
א
ת
 
ב
ר
כ
ת
 
א
ב
ר
ה
ם
 
א
ב
י
ך
 
ל
ך
 
ו
ל
ז
ר
ע
ך
 
א
ת
ך
 
ל
ר
ש
ת
 
א
ת
 
א
ר
ץ
 
מ
ג
ר
י
ך
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ל
א
ב
ר
ה
ם
 
ו
י
ש
ל
ח
 
י
צ
ח
ק
 
א
ת
 
י
ע
ק
ב
 
ו
י
ל
ך
 
פ
ד
נ
ה
 
א
ר
ם
 
א
ל
 
ל
ב
ן
 
ב
ן
 
ב
ת
ו
א
ל
 
ה
א
ר
מ
י
 
א
ח
י
 
ר
ב
ק
ה
 
א
ם
 
י
ע
ק
ב
 
ו
ע
ש
ו
 
ו
י
ר
א
 
ע
ש
ו
 
כ
י
 
ב
ר
ך
 
י
צ
ח
ק
 
א
ת
 
י
ע
ק
ב
 
ו
ש
ל
ח
 
א
ת
ו
 
פ
ד
נ
ה
 
א
ר
ם
 
ל
ק
ח
ת
 
ל
ו
 
מ
ש
ם
 
א
ש
ה
 
ב
ב
ר
כ
ו
 
א
ת
ו
 
ו
י
צ
ו
ו
 
ע
ל
י
ו
 
ל
א
מ
ר
 
ל
א
 
ת
ק
ח
 
א
ש
ה
 
מ
ב
נ
ו
ת
 
כ
נ
ע
ן
 
ו
י
ש
מ
ע
 
י
ע
ק
ב
 
א
ל
 
א
ב
י
ו
 
ו
א
ל
 
א
מ
ו
 
ו
י
ל
ך
 
פ
ד
נ
ה
 
א
ר
ם
 
ו
י
ר
א
 
ע
ש
ו
 
כ
י
 
ר
ע
ו
ת
 
ב
נ
ו
ת
 
כ
נ
ע
ן
 
ב
ע
י
נ
י
 
י
צ
ח
ק
 
א
ב
י
ו
 
ו
י
ל
ך
 
ע
ש
ו
 
ו
י
ק
ח
 
א
ת
 
מ
ח
ל
ת
 
ב
ת
 
י
ש
מ
ע
א
ל
 
ב
ן
 
א
ב
ר
ה
ם
 
א
ח
ו
ת
 
נ
ב
א
ו
ת
 
ע
ל
 
נ
ש
י
ו
 
ל
ו
 
ל
א
ש
ה
 
ו
י
צ
א
 
י
ע
ק
ב
 
מ
ב
א
ר
 
ש
ב
ע
 
ל
ל
כ
ת
 
ח
ר
נ
ה
 
ו
י
פ
ג
ע
 
ב
מ
ק
ו
ם
 
ו
י
ל
ן
 
ש
ם
 
כ
י
 
ב
א
 
ה
ש
מ
ש
 
ו
י
ק
ח
 
מ
א
ב
נ
י
 
ה
מ
ק
ו
ם
 
ו
י
ש
ם
 
מ
ר
א
ש
י
ת
ו
 
ו
י
ש
כ
ב
 
ב
מ
ק
ו
ם
 
ה
ה
ו
א
 
ו
י
ח
ל
ם
 
ו
ה
נ
ה
 
ס
ל
ם
 
מ
צ
ב
 
א
ר
צ
ה
 
ו
ר
א
ש
ו
 
מ
ג
י
ע
 
ה
ש
מ
י
ם
 
ו
ה
נ
ה
 
מ
ל
א
כ
י
 
א
ל
ה
י
ם
 
ע
ל
י
ם
 
ו
י
ר
ד
י
ם
 
ב
ו
 
ו
ה
נ
ה
 
י
ה
ו
ה
 
נ
צ
ב
 
ע
ל
י
ו
 
ו
י
א
מ
ר
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
א
ב
י
ך
 
ו
א
ל
ה
י
 
י
צ
ח
ק
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ש
כ
ב
 
ע
ל
י
ה
 
ל
ך
 
א
ת
נ
נ
ה
 
ו
ל
ז
ר
ע
ך
 
ו
ה
י
ה
 
ז
ר
ע
ך
 
כ
ע
פ
ר
 
ה
א
ר
ץ
 
ו
פ
ר
צ
ת
 
י
מ
ה
 
ו
ק
ד
מ
ה
 
ו
צ
פ
ו
נ
ה
 
ו
נ
ג
ב
ה
 
ו
נ
ב
ר
כ
ו
 
ב
ך
 
כ
ל
 
מ
ש
פ
ח
ו
ת
 
ה
א
ד
מ
ה
 
ו
ב
ז
ר
ע
ך
 
ו
ה
נ
ה
 
א
נ
כ
י
 
ע
מ
ך
 
ו
ש
מ
ר
ת
י
ך
 
ב
כ
ל
 
א
ש
ר
 
ת
ל
ך
 
ו
ה
ש
ב
ת
י
ך
 
א
ל
 
ה
א
ד
מ
ה
 
ה
ז
א
ת
 
כ
י
 
ל
א
 
א
ע
ז
ב
ך
 
ע
ד
 
א
ש
ר
 
א
ם
 
ע
ש
י
ת
י
 
א
ת
 
א
ש
ר
 
ד
ב
ר
ת
י
 
ל
ך
 
ו
י
ק
ץ
 
י
ע
ק
ב
 
מ
ש
נ
ת
ו
 
ו
י
א
מ
ר
 
א
כ
ן
 
י
ש
 
י
ה
ו
ה
 
ב
מ
ק
ו
ם
 
ה
ז
ה
 
ו
א
נ
כ
י
 
ל
א
 
י
ד
ע
ת
י
 
ו
י
י
ר
א
 
ו
י
א
מ
ר
 
מ
ה
 
נ
ו
ר
א
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
א
י
ן
 
ז
ה
 
כ
י
 
א
ם
 
ב
י
ת
 
א
ל
ה
י
ם
 
ו
ז
ה
 
ש
ע
ר
 
ה
ש
מ
י
ם
 
ו
י
ש
כ
ם
 
י
ע
ק
ב
 
ב
ב
ק
ר
 
ו
י
ק
ח
 
א
ת
 
ה
א
ב
ן
 
א
ש
ר
 
ש
ם
 
מ
ר
א
ש
י
ת
ו
 
ו
י
ש
ם
 
א
ת
ה
 
מ
צ
ב
ה
 
ו
י
צ
ק
 
ש
מ
ן
 
ע
ל
 
ר
א
ש
ה
 
ו
י
ק
ר
א
 
א
ת
 
ש
ם
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
ב
י
ת
 
א
ל
 
ו
א
ו
ל
ם
 
ל
ו
ז
ה
 
ש
ם
 
ה
ע
י
ר
 
ל
ר
א
י
ש
ו
נ
ה
 
ו
י
ד
ר
 
י
ע
ק
ב
 
נ
ד
ר
 
ל
א
מ
ר
 
א
ם
 
י
ה
י
ה
 
א
ל
ה
י
ם
 
ע
מ
ד
י
 
ו
ש
מ
ר
נ
י
 
ב
ד
ר
ך
 
ה
ז
ה
 
א
ש
ר
 
א
נ
י
 
ה
ל
ך
 
ו
נ
ת
ן
 
ל
י
 
ל
ח
ם
 
ל
א
כ
ל
 
ו
ב
ג
ד
 
ל
ל
ב
ש
 
ו
ש
ב
ת
י
 
ב
ש
ל
ו
ם
 
א
ל
 
ב
י
ת
 
א
ב
י
 
ו
ה
י
ה
 
י
ה
ו
ה
 
ל
י
 
ל
א
ל
ה
י
ם
 
ו
ה
א
ב
ן
 
ה
ז
א
ת
 
א
ש
ר
 
ש
מ
ת
י
 
מ
צ
ב
ה
 
י
ה
י
ה
 
ב
י
ת
 
א
ל
ה
י
ם
 
ו
כ
ל
 
א
ש
ר
 
ת
ת
ן
 
ל
י
 
א
ע
ש
ר
 
א
ע
ש
ר
נ
ו
 
ל
ך
 
ו
י
ש
א
 
י
ע
ק
ב
 
ר
ג
ל
י
ו
 
ו
י
ל
ך
 
א
ר
ץ
 
ב
נ
י
 
ק
ד
ם
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ב
א
ר
 
ב
ש
ד
ה
 
ו
ה
נ
ה
 
ש
ם
 
ש
ל
ש
ה
 
ע
ד
ר
י
 
צ
א
ן
 
ר
ב
צ
י
ם
 
ע
ל
י
ה
 
כ
י
 
מ
ן
 
ה
ב
א
ר
 
ה
ה
י
א
 
י
ש
ק
ו
 
ה
ע
ד
ר
י
ם
 
ו
א
ב
ן
 
ג
ד
ל
ה
 
ע
ל
 
פ
י
 
ה
ב
א
ר
 
ו
נ
א
ס
פ
ו
 
ש
ם
 
כ
ל
 
ה
ר
ע
י
ם
 
ו
ג
ל
ל
ו
 
א
ת
 
ה
א
ב
ן
 
מ
ע
ל
 
פ
י
 
ה
ב
א
ר
 
ו
ה
ש
ק
ו
 
א
ת
 
ה
צ
א
ן
 
ו
ה
ש
י
ב
ו
 
א
ת
 
ה
א
ב
ן
 
ע
ל
 
פ
י
 
ה
ב
א
ר
 
ל
מ
ק
ו
מ
ה
 
ו
י
א
מ
ר
 
ל
ה
ם
 
י
ע
ק
ב
 
א
ח
י
 
מ
א
י
ן
 
א
ת
ם
 
ו
י
א
מ
ר
ו
 
מ
ח
ר
ן
 
א
נ
ח
נ
ו
 
ו
י
א
מ
ר
 
ל
ה
ם
 
ה
י
ד
ע
ת
ם
 
א
ת
 
ל
ב
ן
 
ב
ן
 
נ
ח
ו
ר
 
ו
י
א
מ
ר
ו
 
י
ד
ע
נ
ו
 
ו
י
א
מ
ר
 
ל
ה
ם
 
ה
ש
ל
ו
ם
 
ל
ו
 
ו
י
א
מ
ר
ו
 
ש
ל
ו
ם
 
ו
ה
נ
ה
 
ר
ח
ל
 
ב
ת
ו
 
ב
א
ה
 
ע
ם
 
ה
צ
א
ן
 
ו
י
א
מ
ר
 
ל
ה
ם
 
ה
ן
 
ע
ו
ד
 
ה
י
ו
ם
 
ג
ד
ו
ל
 
ל
א
 
ע
ת
 
ה
א
ס
ף
 
ה
מ
ק
נ
ה
 
ה
ש
ק
ו
 
ה
צ
א
ן
 
ו
ל
כ
ו
 
ר
ע
ו
 
ו
י
א
מ
ר
ו
 
ל
א
 
נ
ו
כ
ל
 
ע
ד
 
א
ש
ר
 
י
א
ס
פ
ו
 
כ
ל
 
ה
ר
ע
י
ם
 
ו
ג
ל
ל
ו
 
א
ת
 
ה
א
ב
ן
 
מ
ע
ל
 
פ
י
 
ה
ב
א
ר
 
ו
ה
ש
ק
י
נ
ו
 
ה
צ
א
ן
 
ע
ו
ד
נ
ו
 
מ
ד
ב
ר
 
ע
מ
ם
 
ו
ר
ח
ל
 
ב
א
ה
 
ע
ם
 
ה
צ
א
ן
 
א
ש
ר
 
ל
א
ב
י
ה
 
כ
י
 
ר
ע
ה
 
ה
י
א
 
ו
י
ה
י
 
כ
א
ש
ר
 
ר
א
ה
 
י
ע
ק
ב
 
א
ת
 
ר
ח
ל
 
ב
ת
 
ל
ב
ן
 
א
ח
י
 
א
מ
ו
 
ו
א
ת
 
צ
א
ן
 
ל
ב
ן
 
א
ח
י
 
א
מ
ו
 
ו
י
ג
ש
 
י
ע
ק
ב
 
ו
י
ג
ל
 
א
ת
 
ה
א
ב
ן
 
מ
ע
ל
 
פ
י
 
ה
ב
א
ר
 
ו
י
ש
ק
 
א
ת
 
צ
א
ן
 
ל
ב
ן
 
א
ח
י
 
א
מ
ו
 
ו
י
ש
ק
 
י
ע
ק
ב
 
ל
ר
ח
ל
 
ו
י
ש
א
 
א
ת
 
ק
ו
ל
ו
 
ו
י
ב
ך
 
ו
י
ג
ד
 
י
ע
ק
ב
 
ל
ר
ח
ל
 
כ
י
 
א
ח
י
 
א
ב
י
ה
 
ה
ו
א
 
ו
כ
י
 
ב
ן
 
ר
ב
ק
ה
 
ה
ו
א
 
ו
ת
ר
ץ
 
ו
ת
ג
ד
 
ל
א
ב
י
ה
 
ו
י
ה
י
 
כ
ש
מ
ע
 
ל
ב
ן
 
א
ת
 
ש
מ
ע
 
י
ע
ק
ב
 
ב
ן
 
א
ח
ו
ת
ו
 
ו
י
ר
ץ
 
ל
ק
ר
א
ת
ו
 
ו
י
ח
ב
ק
 
ל
ו
 
ו
י
נ
ש
ק
 
ל
ו
 
ו
י
ב
י
א
ה
ו
 
א
ל
 
ב
י
ת
ו
 
ו
י
ס
פ
ר
 
ל
ל
ב
ן
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
י
א
מ
ר
 
ל
ו
 
ל
ב
ן
 
א
ך
 
ע
צ
מ
י
 
ו
ב
ש
ר
י
 
א
ת
ה
 
ו
י
ש
ב
 
ע
מ
ו
 
ח
ד
ש
 
י
מ
י
ם
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ל
י
ע
ק
ב
 
ה
כ
י
 
א
ח
י
 
א
ת
ה
 
ו
ע
ב
ד
ת
נ
י
 
ח
נ
ם
 
ה
ג
י
ד
ה
 
ל
י
 
מ
ה
 
מ
ש
כ
ר
ת
ך
 
ו
ל
ל
ב
ן
 
ש
ת
י
 
ב
נ
ו
ת
 
ש
ם
 
ה
ג
ד
ל
ה
 
ל
א
ה
 
ו
ש
ם
 
ה
ק
ט
נ
ה
 
ר
ח
ל
 
ו
ע
י
נ
י
 
ל
א
ה
 
ר
כ
ו
ת
 
ו
ר
ח
ל
 
ה
י
ת
ה
 
י
פ
ת
 
ת
א
ר
 
ו
י
פ
ת
 
מ
ר
א
ה
 
ו
י
א
ה
ב
 
י
ע
ק
ב
 
א
ת
 
ר
ח
ל
 
ו
י
א
מ
ר
 
א
ע
ב
ד
ך
 
ש
ב
ע
 
ש
נ
י
ם
 
ב
ר
ח
ל
 
ב
ת
ך
 
ה
ק
ט
נ
ה
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ט
ו
ב
 
ת
ת
י
 
א
ת
ה
 
ל
ך
 
מ
ת
ת
י
 
א
ת
ה
 
ל
א
י
ש
 
א
ח
ר
 
ש
ב
 
ע
מ
ד
י
 
ו
י
ע
ב
ד
 
י
ע
ק
ב
 
ב
ר
ח
ל
 
ש
ב
ע
 
ש
נ
י
ם
 
ו
י
ה
י
ו
 
ב
ע
י
נ
י
ו
 
כ
י
מ
י
ם
 
א
ח
ד
י
ם
 
ב
א
ה
ב
ת
ו
 
א
ת
ה
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
ל
ב
ן
 
ה
ב
ה
 
א
ת
 
א
ש
ת
י
 
כ
י
 
מ
ל
א
ו
 
י
מ
י
 
ו
א
ב
ו
א
 
א
ל
י
ה
 
ו
י
א
ס
ף
 
ל
ב
ן
 
א
ת
 
כ
ל
 
א
נ
ש
י
 
ה
מ
ק
ו
ם
 
ו
י
ע
ש
 
מ
ש
ת
ה
 
ו
י
ה
י
 
ב
ע
ר
ב
 
ו
י
ק
ח
 
א
ת
 
ל
א
ה
 
ב
ת
ו
 
ו
י
ב
א
 
א
ת
ה
 
א
ל
י
ו
 
ו
י
ב
א
 
א
ל
י
ה
 
י
ע
ק
ב
 
ו
י
ת
ן
 
ל
ב
ן
 
א
ת
 
ז
ל
פ
ה
 
ש
פ
ח
ת
ו
 
ל
ל
א
ה
 
ב
ת
ו
 
ל
ש
פ
ח
ה
 
ו
י
ה
י
 
ב
ב
ק
ר
 
ו
ה
נ
ה
 
ה
י
א
 
ל
א
ה
 
ו
י
א
מ
ר
 
א
ל
 
ל
ב
ן
 
מ
ה
 
ז
א
ת
 
ע
ש
י
ת
 
ל
י
 
ה
ל
ו
א
 
ב
ר
ח
ל
 
ע
ב
ד
ת
י
 
ע
מ
ך
 
ו
ל
מ
ה
 
ר
מ
י
ת
נ
י
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ל
א
 
י
ע
ש
ה
 
כ
ן
 
ב
מ
ק
ו
מ
י
נ
ו
 
ל
ת
ת
 
ה
צ
ע
י
ר
ה
 
ל
פ
נ
י
 
ה
ב
כ
י
ר
ה
 
מ
ל
א
 
ש
ב
ע
 
ז
א
ת
 
ו
א
ת
ן
 
ל
ך
 
ג
ם
 
א
ת
 
ז
א
ת
 
ב
ע
ב
ד
ה
 
א
ש
ר
 
ת
ע
ב
ד
 
ע
מ
ד
י
 
ע
ו
ד
 
ש
ב
ע
 
ש
נ
י
ם
 
א
ח
ר
ו
ת
 
ו
י
ע
ש
 
י
ע
ק
ב
 
כ
ן
 
ו
י
מ
ל
א
 
ש
ב
ע
 
ז
א
ת
 
ו
י
ת
ן
 
ל
ו
 
א
ת
 
ר
ח
ל
 
ב
ת
ו
 
ל
ו
 
ל
א
ש
ה
 
ו
י
ת
ן
 
ל
ב
ן
 
ל
ר
ח
ל
 
ב
ת
ו
 
א
ת
 
ב
ל
ה
ה
 
ש
פ
ח
ת
ו
 
ל
ה
 
ל
ש
פ
ח
ה
 
ו
י
ב
א
 
ג
ם
 
א
ל
 
ר
ח
ל
 
ו
י
א
ה
ב
 
ג
ם
 
א
ת
 
ר
ח
ל
 
מ
ל
א
ה
 
ו
י
ע
ב
ד
 
ע
מ
ו
 
ע
ו
ד
 
ש
ב
ע
 
ש
נ
י
ם
 
א
ח
ר
ו
ת
 
ו
י
ר
א
 
י
ה
ו
ה
 
כ
י
 
ש
נ
ו
א
ה
 
ל
א
ה
 
ו
י
פ
ת
ח
 
א
ת
 
ר
ח
מ
ה
 
ו
ר
ח
ל
 
ע
ק
ר
ה
 
ו
ת
ה
ר
 
ל
א
ה
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ר
א
ו
ב
ן
 
כ
י
 
א
מ
ר
ה
 
כ
י
 
ר
א
ה
 
י
ה
ו
ה
 
ב
ע
נ
י
י
 
כ
י
 
ע
ת
ה
 
י
א
ה
ב
נ
י
 
א
י
ש
י
 
ו
ת
ה
ר
 
ע
ו
ד
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
א
מ
ר
 
כ
י
 
ש
מ
ע
 
י
ה
ו
ה
 
כ
י
 
ש
נ
ו
א
ה
 
א
נ
כ
י
 
ו
י
ת
ן
 
ל
י
 
ג
ם
 
א
ת
 
ז
ה
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ש
מ
ע
ו
ן
 
ו
ת
ה
ר
 
ע
ו
ד
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
א
מ
ר
 
ע
ת
ה
 
ה
פ
ע
ם
 
י
ל
ו
ה
 
א
י
ש
י
 
א
ל
י
 
כ
י
 
י
ל
ד
ת
י
 
ל
ו
 
ש
ל
ש
ה
 
ב
נ
י
ם
 
ע
ל
 
כ
ן
 
ק
ר
א
ה
 
ש
מ
ו
 
ל
ו
י
 
ו
ת
ה
ר
 
ע
ו
ד
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
א
מ
ר
 
ה
פ
ע
ם
 
א
ו
ד
ה
 
א
ת
 
י
ה
ו
ה
 
ע
ל
 
כ
ן
 
ק
ר
א
ה
 
ש
מ
ו
 
י
ה
ו
ד
ה
 
ו
ת
ע
מ
ד
 
מ
ל
ד
ת
 
ו
ת
ר
א
 
ר
ח
ל
 
כ
י
 
ל
א
 
י
ל
ד
ה
 
ל
י
ע
ק
ב
 
ו
ת
ק
נ
א
 
ר
ח
ל
 
ב
א
ח
ו
ת
ה
 
ו
ת
א
מ
ר
 
א
ל
 
י
ע
ק
ב
 
ה
ב
ה
 
ל
י
 
ב
נ
י
ם
 
ו
א
ם
 
א
י
ן
 
מ
ת
ה
 
א
נ
כ
י
 
ו
י
ח
ר
 
א
ף
 
י
ע
ק
ב
 
ב
ר
ח
ל
 
ו
י
א
מ
ר
 
ה
ת
ח
ת
 
א
ל
ה
י
ם
 
א
נ
כ
י
 
א
ש
ר
 
מ
נ
ע
 
מ
מ
ע
י
ך
 
פ
ר
י
 
ב
ט
ן
 
ו
ת
א
מ
ר
 
ה
נ
ה
 
א
מ
ת
י
 
ב
ל
ה
ה
 
ב
א
 
א
ל
י
ה
 
ו
ת
ל
ד
 
ע
ל
 
ב
ר
כ
י
 
ו
א
ב
נ
ה
 
ג
ם
 
א
נ
כ
י
 
מ
מ
נ
ה
 
ו
ת
ת
ן
 
ל
ו
 
א
ת
 
ב
ל
ה
ה
 
ש
פ
ח
ת
ה
 
ל
א
ש
ה
 
ו
י
ב
א
 
א
ל
י
ה
 
י
ע
ק
ב
 
ו
ת
ה
ר
 
ב
ל
ה
ה
 
ו
ת
ל
ד
 
ל
י
ע
ק
ב
 
ב
ן
 
ו
ת
א
מ
ר
 
ר
ח
ל
 
ד
נ
נ
י
 
א
ל
ה
י
ם
 
ו
ג
ם
 
ש
מ
ע
 
ב
ק
ו
ל
י
 
ו
י
ת
ן
 
ל
י
 
ב
ן
 
ע
ל
 
כ
ן
 
ק
ר
א
ה
 
ש
מ
ו
 
ד
ן
 
ו
ת
ה
ר
 
ע
ו
ד
 
ו
ת
ל
ד
 
ב
ל
ה
ה
 
ש
פ
ח
ת
 
ר
ח
ל
 
ב
ן
 
ש
נ
י
 
ל
י
ע
ק
ב
 
ו
ת
א
מ
ר
 
ר
ח
ל
 
נ
פ
ת
ל
י
 
א
ל
ה
י
ם
 
נ
פ
ת
ל
ת
י
 
ע
ם
 
א
ח
ו
ת
י
 
ו
ג
ם
 
י
כ
ל
ת
י
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
נ
פ
ת
ל
י
 
ו
ת
ר
א
 
ל
א
ה
 
כ
י
 
ע
מ
ד
ה
 
מ
ל
ד
ת
 
ו
ת
ק
ח
 
א
ת
 
ז
ל
פ
ה
 
ש
פ
ח
ת
ה
 
ו
ת
ת
ן
 
א
ת
ה
 
ל
י
ע
ק
ב
 
ל
א
ש
ה
 
ו
ת
ל
ד
 
ז
ל
פ
ה
 
ש
פ
ח
ת
 
ל
א
ה
 
ל
י
ע
ק
ב
 
ב
ן
 
ו
ת
א
מ
ר
 
ל
א
ה
 
ב
ג
ד
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ג
ד
 
ו
ת
ל
ד
 
ז
ל
פ
ה
 
ש
פ
ח
ת
 
ל
א
ה
 
ב
ן
 
ש
נ
י
 
ל
י
ע
ק
ב
 
ו
ת
א
מ
ר
 
ל
א
ה
 
ב
א
ש
ר
י
 
כ
י
 
א
ש
ר
ו
נ
י
 
ב
נ
ו
ת
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
א
ש
ר
 
ו
י
ל
ך
 
ר
א
ו
ב
ן
 
ב
י
מ
י
 
ק
צ
י
ר
 
ח
ט
י
ם
 
ו
י
מ
צ
א
 
ד
ו
ד
י
ם
 
ב
ש
ד
ה
 
ו
י
ב
א
 
א
ת
ם
 
א
ל
 
ל
א
ה
 
א
מ
ו
 
ו
ת
א
מ
ר
 
ר
ח
ל
 
א
ל
 
ל
א
ה
 
ת
נ
י
 
נ
א
 
ל
י
 
מ
ד
ו
ד
י
 
ב
נ
י
ך
 
ו
ת
א
מ
ר
 
ל
ה
 
ה
מ
ע
ט
 
ק
ח
ת
י
ך
 
א
ת
 
א
י
ש
י
 
ו
ל
ק
ח
ת
י
 
ג
ם
 
א
ת
 
ד
ו
ד
י
 
ב
נ
י
 
ו
ת
א
מ
ר
 
ר
ח
ל
 
ל
כ
ן
 
י
ש
כ
ב
 
ע
מ
י
ך
 
ה
ל
י
ל
ה
 
ת
ח
ת
 
ד
ו
ד
י
 
ב
נ
י
ך
 
ו
י
ב
א
 
י
ע
ק
ב
 
מ
ן
 
ה
ש
ד
ה
 
ב
ע
ר
ב
 
ו
ת
צ
א
 
ל
א
ה
 
ל
ק
ר
א
ת
ו
 
ו
ת
א
מ
ר
 
א
ל
י
 
ת
ב
ו
א
 
ה
ל
י
ל
ה
 
כ
י
 
ש
כ
ר
 
ש
כ
ר
ת
י
ך
 
ב
ד
ו
ד
י
 
ב
נ
י
 
ו
י
ש
כ
ב
 
ע
מ
ה
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ו
י
ש
מ
ע
 
א
ל
ה
י
ם
 
א
ל
 
ל
א
ה
 
ו
ת
ה
ר
 
ו
ת
ל
ד
 
ל
י
ע
ק
ב
 
ב
ן
 
ח
מ
י
ש
י
 
ו
ת
א
מ
ר
 
ל
א
ה
 
נ
ת
ן
 
א
ל
ה
י
ם
 
ש
כ
ר
י
 
א
ש
ר
 
נ
ת
ת
י
 
ש
פ
ח
ת
י
 
ל
א
י
ש
י
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
י
ש
ש
כ
ר
 
ו
ת
ה
ר
 
ע
ו
ד
 
ל
א
ה
 
ו
ת
ל
ד
 
ב
ן
 
ש
ש
י
 
ל
י
ע
ק
ב
 
ו
ת
א
מ
ר
 
ל
א
ה
 
ז
ב
ד
נ
י
 
א
ל
ה
י
ם
 
א
ת
י
 
ז
ב
ד
 
ט
ו
ב
 
ה
פ
ע
ם
 
י
ז
ב
ל
נ
י
 
א
י
ש
י
 
כ
י
 
י
ל
ד
ת
י
 
ל
ו
 
ש
ש
ה
 
ב
נ
י
ם
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ז
ב
ו
ל
ן
 
ו
א
ח
ר
 
י
ל
ד
ה
 
ב
ת
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ה
 
ד
י
נ
ה
 
ו
י
ז
כ
ר
 
א
ל
ה
י
ם
 
א
ת
 
ר
ח
ל
 
ו
י
ש
מ
ע
 
א
ל
י
ה
 
א
ל
ה
י
ם
 
ו
י
פ
ת
ח
 
א
ת
 
ר
ח
מ
ה
 
ו
ת
ה
ר
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
א
מ
ר
 
א
ס
ף
 
א
ל
ה
י
ם
 
א
ת
 
ח
ר
פ
ת
י
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
י
ו
ס
ף
 
ל
א
מ
ר
 
י
ס
ף
 
י
ה
ו
ה
 
ל
י
 
ב
ן
 
א
ח
ר
 
ו
י
ה
י
 
כ
א
ש
ר
 
י
ל
ד
ה
 
ר
ח
ל
 
א
ת
 
י
ו
ס
ף
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
ל
ב
ן
 
ש
ל
ח
נ
י
 
ו
א
ל
כ
ה
 
א
ל
 
מ
ק
ו
מ
י
 
ו
א
ל
 
א
ר
צ
י
 
ת
נ
ה
 
א
ת
 
נ
ש
י
 
ו
א
ת
 
י
ל
ד
י
 
א
ש
ר
 
ע
ב
ד
ת
י
 
א
ת
ך
 
ב
ה
ן
 
ו
א
ל
כ
ה
 
כ
י
 
א
ת
ה
 
י
ד
ע
ת
 
א
ת
 
ע
ב
ד
ת
י
 
א
ש
ר
 
ע
ב
ד
ת
י
ך
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ל
ב
ן
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
נ
ח
ש
ת
י
 
ו
י
ב
ר
כ
נ
י
 
י
ה
ו
ה
 
ב
ג
ל
ל
ך
 
ו
י
א
מ
ר
 
נ
ק
ב
ה
 
ש
כ
ר
ך
 
ע
ל
י
 
ו
א
ת
נ
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ת
ה
 
י
ד
ע
ת
 
א
ת
 
א
ש
ר
 
ע
ב
ד
ת
י
ך
 
ו
א
ת
 
א
ש
ר
 
ה
י
ה
 
מ
ק
נ
י
ך
 
א
ת
י
 
כ
י
 
מ
ע
ט
 
א
ש
ר
 
ה
י
ה
 
ל
ך
 
ל
פ
נ
י
 
ו
י
פ
ר
ץ
 
ל
ר
ב
 
ו
י
ב
ר
ך
 
י
ה
ו
ה
 
א
ת
ך
 
ל
ר
ג
ל
י
 
ו
ע
ת
ה
 
מ
ת
י
 
א
ע
ש
ה
 
ג
ם
 
א
נ
כ
י
 
ל
ב
י
ת
י
 
ו
י
א
מ
ר
 
מ
ה
 
א
ת
ן
 
ל
ך
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
ל
א
 
ת
ת
ן
 
ל
י
 
מ
א
ו
מ
ה
 
א
ם
 
ת
ע
ש
ה
 
ל
י
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
א
ש
ו
ב
ה
 
א
ר
ע
ה
 
צ
א
נ
ך
 
א
ש
מ
ר
 
א
ע
ב
ר
 
ב
כ
ל
 
צ
א
נ
ך
 
ה
י
ו
ם
 
ה
ס
י
ר
 
מ
ש
ם
 
כ
ל
 
ש
ה
 
נ
ק
ו
ד
 
ו
ט
ל
ו
א
 
ו
כ
ל
 
ש
ה
 
ח
ו
ם
 
ב
כ
ש
ב
י
ם
 
ו
ט
ל
ו
א
 
ו
נ
ק
ו
ד
 
ב
ע
ז
י
ם
 
ו
ה
י
ה
 
ש
כ
ר
י
 
ו
ע
נ
ת
ה
 
ב
י
 
צ
ד
ק
ת
י
 
ב
י
ו
ם
 
מ
ח
ר
 
כ
י
 
י
ב
ו
א
 
ע
ל
 
ש
כ
ר
י
 
ל
פ
נ
י
ך
 
כ
ל
 
א
ש
ר
 
א
י
נ
נ
ו
 
נ
ק
ו
ד
 
ו
ט
ל
ו
א
 
ב
ע
ז
י
ם
 
ו
ח
ו
ם
 
ב
כ
ש
ב
י
ם
 
ג
נ
ו
ב
 
ה
ו
א
 
א
ת
י
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ו
ה
ן
 
ל
א
 
י
ה
י
ה
 
כ
ד
ב
ר
י
ך
 
ו
י
ס
ר
 
ב
י
ו
ם
 
ה
ה
ו
א
 
א
ת
 
ה
ת
י
ש
י
ם
 
ה
ע
ק
ו
ד
י
ם
 
ו
ה
ט
ל
ו
א
י
ם
 
ו
א
ת
 
כ
ל
 
ה
ע
ז
י
ם
 
ה
נ
ק
ו
ד
ו
ת
 
ו
ה
ט
ל
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ב
ן
 
ב
ו
 
ו
כ
ל
 
ח
ו
ם
 
ב
כ
ש
ב
י
ם
 
ו
י
ת
ן
 
ב
י
ד
 
ב
נ
י
ו
 
ו
י
ש
ם
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ב
י
נ
ם
 
ו
ב
י
ן
 
י
ע
ק
ב
 
ו
י
ע
ק
ב
 
ר
ע
ה
 
א
ת
 
צ
א
ן
 
ל
ב
ן
 
ה
נ
ו
ת
ר
ת
 
ו
י
א
מ
ר
 
מ
ל
א
ך
 
א
ל
ה
י
ם
 
א
ל
 
י
ע
ק
ב
 
ב
ח
ל
ו
ם
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
ש
א
 
נ
א
 
ע
י
נ
י
ך
 
ו
ר
א
ה
 
א
ת
 
כ
ל
 
ה
ע
ת
ו
ד
י
ם
 
ה
ע
ל
י
ם
 
ע
ל
 
ה
צ
א
ן
 
ע
ק
ו
ד
י
ם
 
נ
ק
ו
ד
י
ם
 
ו
ב
ר
ו
ד
י
ם
 
כ
י
 
ר
א
י
ת
י
 
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ב
ן
 
ע
ש
ה
 
ל
ך
 
א
נ
כ
י
 
ה
א
ל
 
ב
י
ת
 
א
ל
 
א
ש
ר
 
מ
ש
ח
ת
 
ש
ם
 
מ
צ
ב
ה
 
ו
א
ש
ר
 
נ
ד
ר
ת
 
ל
י
 
ש
ם
 
נ
ד
ר
 
ו
ע
ת
ה
 
ק
ו
ם
 
צ
א
 
מ
ן
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ו
ש
ו
ב
 
א
ל
 
א
ר
ץ
 
א
ב
י
ך
 
ו
א
ט
י
ב
 
ע
מ
ך
 
ו
י
ק
ח
 
ל
ו
 
י
ע
ק
ב
 
מ
ק
ל
 
ל
ב
נ
ה
 
ל
ח
 
ו
ל
ו
ז
 
ו
ע
ר
מ
ו
ן
 
ו
י
פ
צ
ל
 
ב
ה
ם
 
פ
צ
ל
ו
ת
 
ל
ב
נ
ו
ת
 
מ
ח
ש
ף
 
ה
ל
ב
ן
 
א
ש
ר
 
ע
ל
 
ה
מ
ק
ל
ו
ת
 
ו
י
צ
ג
 
א
ת
 
ה
מ
ק
ל
ו
ת
 
א
ש
ר
 
פ
צ
ל
 
ב
ר
ח
ט
י
ם
 
ב
ה
ש
ק
ו
ת
 
ה
מ
י
ם
 
א
ש
ר
 
ת
ב
א
נ
ה
 
ה
צ
א
ן
 
ל
ש
ת
ו
ת
 
ל
נ
כ
ח
 
ה
צ
א
ן
 
ו
י
ח
מ
נ
ה
 
ב
ב
א
נ
ה
 
ל
ש
ת
ו
ת
 
ו
י
ח
מ
נ
ה
 
ה
צ
א
ן
 
ע
ל
 
ה
מ
ק
ל
ו
ת
 
ו
ת
ל
ד
נ
ה
 
ה
צ
א
ן
 
ע
ק
ו
ד
י
ם
 
נ
ק
ו
ד
י
ם
 
ו
ט
ל
א
י
ם
 
ו
ה
כ
ש
ב
י
ם
 
ה
פ
ר
י
ד
 
י
ע
ק
ב
 
ו
י
ת
ן
 
פ
נ
י
 
ה
צ
א
ן
 
א
י
ל
 
ע
ק
ו
ד
 
ו
כ
ל
 
ח
ו
ם
 
ב
צ
א
ן
 
ל
ב
ן
 
ו
י
ש
ת
 
ל
ו
 
ע
ד
ר
י
ם
 
ל
ב
ד
ו
 
ו
ל
א
 
ש
ת
ם
 
ע
ל
 
צ
א
ן
 
ל
ב
ן
 
ו
י
ה
י
 
ב
כ
ל
 
י
ח
ם
 
ה
צ
א
ן
 
ה
מ
ק
ש
ר
ו
ת
 
י
ש
י
ם
 
י
ע
ק
ב
 
א
ת
 
ה
מ
ק
ל
ו
ת
 
ל
ע
י
נ
י
 
ה
צ
א
ן
 
ב
ר
ח
ט
י
ם
 
ל
י
ח
מ
נ
ה
 
ב
מ
ק
ל
ו
ת
 
ו
ב
ה
ע
ט
י
ף
 
ה
צ
א
ן
 
ל
א
 
י
ש
י
ם
 
ו
ה
י
ו
 
ה
ע
ט
ו
פ
י
ם
 
ל
ל
ב
ן
 
ו
ה
ק
ש
ו
ר
י
ם
 
ל
י
ע
ק
ב
 
ו
י
פ
ר
ץ
 
ה
א
י
ש
 
מ
א
ד
 
מ
א
ד
 
ו
י
ה
י
 
ל
ו
 
צ
א
ן
 
ר
ב
ו
ת
 
ו
ש
פ
ח
ו
ת
 
ע
ב
ד
י
ם
 
ו
ג
מ
ל
י
ם
 
ו
ח
מ
ר
י
ם
 
ו
י
ש
מ
ע
 
א
ת
 
ד
ב
ר
י
 
ב
נ
י
 
ל
ב
ן
 
ל
א
מ
ר
 
ל
ק
ח
 
י
ע
ק
ב
 
א
ת
 
כ
ל
 
א
ש
ר
 
ל
א
ב
י
נ
ו
 
ו
מ
א
ש
ר
 
ל
א
ב
י
נ
ו
 
ע
ש
ה
 
א
ת
 
כ
ל
 
ה
כ
ב
ו
ד
 
ה
ז
ה
 
ו
י
ר
א
 
י
ע
ק
ב
 
א
ת
 
פ
נ
י
 
ל
ב
ן
 
ו
ה
נ
ה
 
א
י
נ
ם
 
ע
מ
ו
 
כ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
י
ע
ק
ב
 
ש
ו
ב
 
א
ל
 
א
ר
ץ
 
א
ב
ת
י
ך
 
ו
א
ל
 
מ
ו
ל
ד
ת
ך
 
ו
א
ה
י
ה
 
ע
מ
ך
 
ו
י
ש
ל
ח
 
י
ע
ק
ב
 
ו
י
ק
ר
א
 
ל
ר
ח
ל
 
ו
ל
ל
א
ה
 
ה
ש
ד
ה
 
א
ל
 
צ
א
נ
ו
 
ו
י
א
מ
ר
 
ל
ה
ן
 
ר
א
ה
 
א
נ
כ
י
 
א
ת
 
פ
נ
י
 
א
ב
י
כ
ן
 
כ
י
 
א
י
נ
ם
 
א
ל
י
 
כ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ו
א
ל
ה
י
 
א
ב
י
 
ה
י
ה
 
ע
מ
ד
י
 
ו
א
ת
י
ן
 
י
ד
ע
ת
ן
 
כ
י
 
ב
כ
ל
 
כ
ח
י
 
ע
ב
ד
ת
י
 
א
ת
 
א
ב
י
כ
ן
 
ו
א
ב
י
כ
ן
 
ה
ת
ל
 
ב
י
 
ו
י
ח
ל
ף
 
א
ת
 
מ
ש
כ
ר
ת
י
 
ע
ש
ר
ת
 
מ
נ
י
ם
 
ו
ל
א
 
נ
ת
נ
ו
 
י
ה
ו
ה
 
ל
ה
ר
י
ע
 
ע
מ
ד
י
 
א
ם
 
כ
ה
 
י
א
מ
ר
 
נ
ק
ו
ד
י
ם
 
י
ה
י
ה
 
ש
כ
ר
ך
 
ו
י
ל
ד
ו
 
כ
ל
 
ה
צ
א
ן
 
נ
ק
ו
ד
י
ם
 
ו
א
ם
 
כ
ה
 
י
א
מ
ר
 
ע
ק
ו
ד
י
ם
 
י
ה
י
ה
 
ש
כ
ר
ך
 
ו
י
ל
ד
ו
 
כ
ל
 
ה
צ
א
ן
 
ע
ק
ו
ד
י
ם
 
ו
י
צ
ל
 
י
ה
ו
ה
 
א
ת
 
מ
ק
נ
ה
 
א
ב
י
כ
ן
 
ו
י
ת
ן
 
ל
י
 
ו
י
ה
י
 
ב
ע
ת
 
י
ח
ם
 
ה
צ
א
ן
 
ו
א
ש
א
 
ע
י
נ
י
 
ו
א
ר
א
ה
 
ב
ח
ל
ו
ם
 
ו
ה
נ
ה
 
ה
ע
ת
ו
ד
י
ם
 
ה
ע
ל
י
ם
 
ע
ל
 
ה
צ
א
ן
 
ע
ק
ו
ד
י
ם
 
נ
ק
ו
ד
י
ם
 
ו
ב
ר
ו
ד
י
ם
 
ו
י
א
מ
ר
 
א
ל
י
 
מ
ל
א
ך
 
ה
א
ל
ה
י
ם
 
ב
ח
ל
ו
ם
 
י
ע
ק
ב
 
ו
א
מ
ר
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
ש
א
 
נ
א
 
ע
י
נ
י
ך
 
ו
ר
א
ה
 
א
ת
 
כ
ל
 
ה
ע
ת
ו
ד
י
ם
 
ה
ע
ל
י
ם
 
ע
ל
 
ה
צ
א
ן
 
ע
ק
ו
ד
י
ם
 
נ
ק
ו
ד
י
ם
 
ו
ב
ר
ו
ד
י
ם
 
כ
י
 
ר
א
י
ת
י
 
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ב
ן
 
ע
ש
ה
 
ל
ך
 
א
נ
כ
י
 
ה
א
ל
 
ב
י
ת
 
א
ל
 
א
ש
ר
 
מ
ש
ח
ת
 
ש
ם
 
מ
צ
ב
ה
 
ו
א
ש
ר
 
נ
ד
ר
ת
 
ל
י
 
ש
ם
 
נ
ד
ר
 
ו
ע
ת
ה
 
ק
ו
ם
 
צ
א
 
מ
ן
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ו
ש
ו
ב
 
א
ל
 
א
ר
ץ
 
מ
ו
ל
ד
ת
ך
 
ו
ת
ע
ן
 
ר
ח
ל
 
ו
ל
א
ה
 
ו
ת
א
מ
ר
נ
ה
 
ל
ו
 
ה
ע
ו
ד
 
ל
נ
ו
 
ח
ל
ק
 
ו
נ
ח
ל
ה
 
ב
ב
י
ת
 
א
ב
י
נ
ו
 
ה
ל
ו
א
 
כ
נ
כ
ר
י
ו
ת
 
נ
ח
ש
ב
נ
ו
 
ל
ו
 
כ
י
 
מ
כ
ר
נ
ו
 
ו
י
א
כ
ל
 
ג
ם
 
א
כ
ל
 
א
ת
 
כ
ס
פ
נ
ו
 
כ
י
 
כ
ל
 
ה
ע
ש
ר
 
א
ש
ר
 
ה
צ
י
ל
 
י
ה
ו
ה
 
מ
א
ב
י
נ
ו
 
ל
נ
ו
 
ה
ו
א
 
ו
ל
ב
נ
י
נ
ו
 
ו
ע
ת
ה
 
כ
ל
 
א
ש
ר
 
א
מ
ר
 
א
ל
י
ך
 
א
ל
ה
י
ם
 
ע
ש
ה
 
ו
י
ק
ם
 
י
ע
ק
ב
 
ו
י
ש
א
 
א
ת
 
נ
ש
י
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ע
ל
 
ה
ג
מ
ל
י
ם
 
ו
י
נ
ה
ג
 
א
ת
 
כ
ל
 
מ
ק
נ
ה
ו
 
ו
א
ת
 
כ
ל
 
ר
כ
ו
ש
ו
 
א
ש
ר
 
ר
כ
ש
 
מ
ק
נ
ה
 
ק
נ
י
נ
ו
 
א
ש
ר
 
ר
כ
ש
 
ב
פ
ד
ן
 
א
ר
ם
 
ל
ב
ו
א
 
א
ל
 
י
צ
ח
ק
 
א
ב
י
ו
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
ל
ב
ן
 
ה
ל
ך
 
ל
ג
ו
ז
 
א
ת
 
צ
א
נ
ו
 
ו
ת
ג
נ
ב
 
ר
ח
ל
 
א
ת
 
ה
ת
ר
פ
י
ם
 
א
ש
ר
 
ל
א
ב
י
ה
 
ו
י
ג
נ
ב
 
י
ע
ק
ב
 
א
ת
 
ל
ב
 
ל
ב
ן
 
ה
א
ר
מ
י
 
ע
ד
 
ב
ל
ת
י
 
ה
ג
י
ד
 
ל
ו
 
כ
י
 
ב
ר
ח
 
ה
ו
א
 
ו
י
ב
ר
ח
 
ה
ו
א
 
ו
כ
ל
 
א
ש
ר
 
ל
ו
 
ו
י
ק
ם
 
ו
י
ע
ב
ר
 
א
ת
 
ה
נ
ה
ר
 
ו
י
ש
ם
 
א
ת
 
פ
נ
י
ו
 
ה
ר
 
ה
ג
ל
ע
ד
 
ו
י
ג
ד
 
ל
ל
ב
ן
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
כ
י
 
ב
ר
ח
 
י
ע
ק
ב
 
ו
י
ק
ח
 
א
ת
 
א
ח
י
ו
 
ע
מ
ו
 
ו
י
ר
ד
ף
 
א
ח
ר
י
ו
 
ד
ר
ך
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
י
ד
ב
ק
 
א
ת
ו
 
ב
ה
ר
 
ה
ג
ל
ע
ד
 
ו
י
ב
א
 
א
ל
ה
י
ם
 
א
ל
 
ל
ב
ן
 
ה
א
ר
מ
י
 
ב
ח
ל
ו
ם
 
ה
ל
י
ל
ה
 
ו
י
א
מ
ר
 
ל
ו
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
ד
ב
ר
 
ע
ם
 
י
ע
ק
ב
 
מ
ט
ו
ב
 
ע
ד
 
ר
ע
 
ו
י
ש
ג
 
ל
ב
ן
 
א
ת
 
י
ע
ק
ב
 
ו
י
ע
ק
ב
 
ת
ק
ע
 
א
ת
 
א
ה
ל
ו
 
ב
ה
ר
 
ו
ל
ב
ן
 
ת
ק
ע
 
א
ת
 
א
ח
י
ו
 
ב
ה
ר
 
ה
ג
ל
ע
ד
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ל
י
ע
ק
ב
 
מ
ה
 
ע
ש
י
ת
 
ו
ת
ג
נ
ב
 
א
ת
 
ל
ב
ב
י
 
ו
ת
נ
ה
ג
 
א
ת
 
ב
נ
ו
ת
י
 
כ
ש
ב
י
ו
ת
 
ח
ר
ב
 
ל
מ
ה
 
נ
ח
ב
ת
 
ל
ב
ר
ח
 
ו
ת
ג
נ
ב
 
א
ת
י
 
ו
ל
א
 
ה
ג
ד
ת
 
ל
י
 
ו
א
ש
ל
ח
ך
 
ב
ש
מ
ח
ה
 
ב
ש
ר
י
ם
 
ב
ת
ף
 
ו
ב
כ
נ
ר
 
ו
ל
א
 
נ
ט
ש
ת
נ
י
 
ל
נ
ש
ק
 
ל
ב
נ
י
 
ו
ל
ב
נ
ו
ת
י
 
ע
ת
ה
 
ה
ס
כ
ל
ת
 
ע
ש
ו
ת
 
י
ש
 
ל
א
ל
 
י
ד
י
 
ל
ע
ש
ו
ת
 
ע
מ
ך
 
ר
ע
 
ו
א
ל
ה
י
 
א
ב
י
ך
 
א
מ
ש
 
א
מ
ר
 
א
ל
י
 
ל
א
מ
ר
 
ה
ש
מ
ר
 
ל
ך
 
מ
ד
ב
ר
 
ע
ם
 
י
ע
ק
ב
 
מ
ט
ו
ב
 
ע
ד
 
ר
ע
 
ו
ע
ת
ה
 
ה
ל
ך
 
ה
ל
כ
ת
 
כ
י
 
נ
כ
ס
ף
 
נ
כ
ס
פ
ת
 
ל
ב
י
ת
 
א
ב
י
ך
 
ל
מ
ה
 
ג
נ
ב
ת
 
א
ת
 
א
ל
ה
י
 
ו
י
ע
ן
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ל
ל
ב
ן
 
כ
י
 
י
ר
א
ת
י
 
כ
י
 
א
מ
ר
ת
י
 
פ
ן
 
ת
ג
ז
ל
 
א
ת
 
ב
נ
ו
ת
ך
 
מ
ע
מ
י
 
ע
ם
 
א
ש
ר
 
ת
מ
צ
א
 
א
ת
 
א
ל
ה
י
ך
 
ל
א
 
י
ח
י
ה
 
נ
ג
ד
 
א
ח
י
נ
ו
 
ה
כ
ר
 
ל
ך
 
מ
ה
 
ע
מ
ד
י
 
ו
ק
ח
 
ל
ך
 
ו
ל
א
 
י
ד
ע
 
י
ע
ק
ב
 
כ
י
 
ר
ח
ל
 
ג
נ
ב
ת
ם
 
ו
י
ב
א
 
ל
ב
ן
 
ו
י
ח
פ
ש
 
ב
א
ה
ל
 
י
ע
ק
ב
 
ו
ב
א
ה
ל
 
ל
א
ה
 
ו
ב
א
ה
ל
 
ש
ת
י
 
ה
ש
פ
ח
ו
ת
 
ו
ל
א
 
מ
צ
א
 
ו
י
צ
א
 
מ
א
ה
ל
 
ל
א
ה
 
ו
י
ב
א
 
ב
א
ה
ל
 
ר
ח
ל
 
ו
ר
ח
ל
 
ל
ק
ח
ה
 
א
ת
 
ה
ת
ר
פ
י
ם
 
ו
ת
ש
י
מ
ם
 
ב
כ
ר
 
ה
ג
מ
ל
 
ו
ת
ש
ב
 
ע
ל
י
ה
ם
 
ו
י
מ
ש
ש
 
ל
ב
ן
 
א
ת
 
כ
ל
 
ה
א
ה
ל
 
ו
ל
א
 
מ
צ
א
 
ו
ת
א
מ
ר
 
א
ל
 
א
ב
י
ה
 
א
ל
 
י
ח
ר
 
ב
ע
י
נ
י
 
א
ד
נ
י
 
כ
י
 
ל
א
 
א
ו
כ
ל
 
ל
ק
ו
ם
 
מ
פ
נ
י
ך
 
כ
י
 
ד
ר
ך
 
ה
נ
ש
י
ם
 
ל
י
 
ו
י
ח
פ
ש
 
ו
ל
א
 
מ
צ
א
 
א
ת
 
ה
ת
ר
פ
י
ם
 
ו
י
ח
ר
 
ל
י
ע
ק
ב
 
ו
י
ר
ב
 
ב
ל
ב
ן
 
ו
י
ע
ן
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ל
ל
ב
ן
 
מ
ה
 
פ
ש
ע
י
 
ו
מ
ה
 
ח
ט
א
ת
י
 
כ
י
 
ד
ל
ק
ת
 
א
ח
ר
י
 
ו
כ
י
 
מ
ש
ש
ת
 
א
ת
 
כ
ל
 
כ
ל
י
 
מ
ה
 
מ
צ
א
ת
 
מ
כ
ל
 
כ
ל
י
 
ב
י
ת
ך
 
ש
י
ם
 
כ
ה
 
נ
ג
ד
 
א
ח
י
 
ו
א
ח
י
ך
 
ו
י
ו
כ
י
ח
ו
 
ב
י
ן
 
ש
נ
י
נ
ו
 
ז
ה
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
א
נ
כ
י
 
ע
מ
ך
 
ר
ח
ל
י
ך
 
ו
ע
ז
י
ך
 
ל
א
 
ש
כ
ל
ו
 
א
י
ל
י
 
צ
א
נ
ך
 
ל
א
 
א
כ
ל
ת
י
 
ט
ר
פ
ה
 
ל
א
 
ה
ב
א
ת
י
 
א
ל
י
ך
 
א
נ
כ
י
 
א
ח
ט
נ
ה
 
מ
י
ד
י
 
ג
נ
ו
ב
ת
 
י
ו
ם
 
ו
ג
נ
ו
ב
ת
 
ל
י
ל
ה
 
ה
י
י
ת
י
 
ב
י
ו
ם
 
א
כ
ל
נ
י
 
ח
ר
ף
 
ו
ק
ר
ח
 
ב
ל
י
ל
ה
 
ו
ת
ד
ד
 
ש
נ
ת
י
 
מ
ע
י
נ
י
 
ז
ה
 
ל
י
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ב
ב
י
ת
ך
 
ע
ב
ד
ת
י
ך
 
א
ר
ב
ע
 
ע
ש
ר
ה
 
ש
נ
ה
 
ב
ש
ת
י
 
ב
נ
ו
ת
ך
 
ו
ש
ש
 
ש
נ
י
ם
 
ב
צ
א
נ
ך
 
ו
ת
ח
ל
ף
 
א
ת
 
מ
ש
כ
ר
ת
י
 
ע
ש
ר
ת
 
מ
נ
י
ם
 
ל
ו
 
ל
א
 
א
ל
ה
י
 
א
ב
י
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
פ
ח
ד
 
י
צ
ח
ק
 
ה
י
ה
 
ל
י
 
כ
י
 
ע
ת
ה
 
ר
י
ק
ם
 
ש
ל
ח
ת
נ
י
 
א
ת
 
ע
נ
י
י
 
ו
א
ת
 
י
ג
ע
 
כ
פ
י
 
ר
א
ה
 
א
ל
ה
י
ם
 
ו
ה
ו
כ
י
ח
 
א
מ
ש
 
ו
י
ע
ן
 
ל
ב
ן
 
ו
י
א
מ
ר
 
א
ל
 
י
ע
ק
ב
 
ה
ב
נ
ו
ת
 
ב
נ
ו
ת
י
 
ו
ה
ב
נ
י
ם
 
ב
נ
י
 
ו
ה
צ
א
ן
 
צ
א
נ
י
 
ו
כ
ל
 
א
ש
ר
 
א
ת
ה
 
ר
א
ה
 
ל
י
 
ה
ו
א
 
ו
ל
ב
נ
ו
ת
י
 
מ
ה
 
א
ע
ש
ה
 
ל
א
ל
ה
 
ה
י
ו
ם
 
א
ו
 
ל
ב
נ
י
ה
ם
 
א
ש
ר
 
י
ל
ד
ו
 
ו
ע
ת
ה
 
ל
כ
ה
 
נ
כ
ר
ת
ה
 
ב
ר
י
ת
 
א
נ
י
 
ו
א
ת
ה
 
ו
ה
י
ה
 
ל
ע
ד
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ו
י
ק
ח
 
י
ע
ק
ב
 
א
ב
ן
 
ו
י
ר
מ
ה
 
מ
צ
ב
ה
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
ל
א
ח
י
ו
 
ל
ק
ט
ו
 
א
ב
נ
י
ם
 
ו
י
ק
ח
ו
 
א
ב
נ
י
ם
 
ו
י
ע
ש
ו
 
ג
ל
 
ו
י
א
כ
ל
ו
 
ש
ם
 
ע
ל
 
ה
ג
ל
 
ו
י
ק
ר
א
 
ל
ו
 
ל
ב
ן
 
י
ג
ר
 
ש
ה
ד
ו
ת
ה
 
ו
י
ע
ק
ב
 
ק
ר
א
 
ל
ו
 
ג
ל
 
ע
ד
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ה
ג
ל
 
ה
ז
ה
 
ע
ד
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ה
י
ו
ם
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
מ
ו
 
ג
ל
 
ע
ד
 
ו
ה
מ
צ
ב
ה
 
א
ש
ר
 
א
מ
ר
 
י
צ
ף
 
י
ה
ו
ה
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
כ
י
 
נ
ס
ת
ר
 
א
י
ש
 
מ
ר
ע
ה
ו
 
א
ם
 
ת
ע
נ
ה
 
א
ת
 
ב
נ
ו
ת
י
 
ו
א
ם
 
ת
ק
ח
 
נ
ש
י
ם
 
ע
ל
 
ב
נ
ו
ת
י
 
א
י
ן
 
א
י
ש
 
ע
מ
נ
ו
 
ר
א
ה
 
א
ל
ה
י
ם
 
ע
ד
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ו
י
א
מ
ר
 
ל
ב
ן
 
ל
י
ע
ק
ב
 
ה
נ
ה
 
ה
ג
ל
 
ה
ז
ה
 
ו
ה
נ
ה
 
ה
מ
צ
ב
ה
 
א
ש
ר
 
י
ר
א
ת
 
ב
י
נ
י
 
ו
ב
י
נ
ך
 
ע
ד
 
ה
ג
ל
 
ה
ז
ה
 
ו
ע
ד
ה
 
ה
מ
צ
ב
ה
 
א
ם
 
א
נ
י
 
ל
א
 
א
ע
ב
ר
 
א
ל
י
ך
 
א
ת
 
ה
ג
ל
 
ה
ז
ה
 
ו
א
ם
 
א
ת
ה
 
ל
א
 
ת
ע
ב
ר
 
א
ל
י
 
א
ת
 
ה
ג
ל
 
ה
ז
ה
 
ו
א
ת
 
ה
מ
צ
ב
ה
 
ה
ז
א
ת
 
ל
ר
ע
ה
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
א
ל
ה
י
 
נ
ח
ו
ר
 
י
ש
פ
ט
 
ב
י
נ
נ
ו
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
י
ש
ב
ע
 
י
ע
ק
ב
 
ב
פ
ח
ד
 
א
ב
י
ו
 
י
צ
ח
ק
 
ו
י
ז
ב
ח
 
י
ע
ק
ב
 
ז
ב
ח
 
ב
ה
ר
 
ו
י
ק
ר
א
 
ל
א
ח
י
ו
 
ל
א
כ
ל
 
ל
ח
ם
 
ו
י
א
כ
ל
ו
 
ל
ח
ם
 
ו
י
ל
י
נ
ו
 
ב
ה
ר
 
ו
י
ש
כ
ם
 
ל
ב
ן
 
ב
ב
ק
ר
 
ו
י
נ
ש
ק
 
ל
ב
נ
י
ו
 
ו
ל
ב
נ
ת
י
ו
 
ו
י
ב
ר
ך
 
א
ת
ם
 
ו
י
ל
ך
 
ו
י
ש
ב
 
ל
ב
ן
 
ל
מ
ק
ו
מ
ו
 
ו
י
ע
ק
ב
 
ה
ל
ך
 
ל
ד
ר
כ
ו
 
ו
י
פ
ג
ע
ו
 
ב
ו
 
מ
ל
א
כ
י
 
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
כ
א
ש
ר
 
ר
א
ם
 
מ
ח
נ
ה
 
א
ל
ה
י
ם
 
ז
ה
 
ו
י
ק
ר
א
 
ש
ם
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
מ
ח
נ
י
ם
 
ו
י
ש
ל
ח
 
י
ע
ק
ב
 
מ
ל
א
כ
י
ם
 
ל
פ
נ
י
ו
 
א
ל
 
ע
ש
ו
 
א
ח
י
ו
 
א
ר
ץ
 
ש
ע
י
ר
 
ש
ד
ה
 
א
ד
ו
ם
 
ו
י
צ
ו
 
א
ת
ם
 
ל
א
מ
ר
 
כ
ה
 
ת
א
מ
ר
ו
ן
 
ל
א
ד
נ
י
 
ל
ע
ש
ו
 
כ
ה
 
א
מ
ר
 
ע
ב
ד
ך
 
י
ע
ק
ב
 
ע
ם
 
ל
ב
ן
 
ג
ר
ת
י
 
ו
א
ח
ר
 
ע
ד
 
ע
ת
ה
 
ו
י
ה
י
 
ל
י
 
ש
ו
ר
 
ו
ח
מ
ו
ר
 
ו
צ
א
ן
 
ו
ע
ב
ד
 
ו
ש
פ
ח
ה
 
ו
א
ש
ל
ח
ה
 
ל
ה
ג
י
ד
 
ל
א
ד
נ
י
 
ל
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ו
י
ש
ב
ו
 
ה
מ
ל
א
כ
י
ם
 
א
ל
 
י
ע
ק
ב
 
ל
א
מ
ר
 
ב
א
נ
ו
 
א
ל
 
א
ח
י
ך
 
א
ל
 
ע
ש
ו
 
ו
ג
ם
 
ה
ל
ך
 
ל
ק
ר
א
ת
ך
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
א
י
ש
 
ע
מ
ו
 
ו
י
י
ר
א
 
י
ע
ק
ב
 
מ
א
ד
 
ו
י
צ
ר
 
ל
ו
 
ו
י
ח
ץ
 
א
ת
 
ה
ע
ם
 
א
ש
ר
 
א
ת
ו
 
ו
א
ת
 
ה
צ
א
ן
 
ו
א
ת
 
ה
ב
ק
ר
 
ו
ה
ג
מ
ל
י
ם
 
ל
ש
נ
י
 
מ
ח
נ
ו
ת
 
ו
י
א
מ
ר
 
א
ם
 
י
ב
ו
א
 
ע
ש
ו
 
א
ל
 
ה
מ
ח
נ
ה
 
ה
א
ח
ד
 
ו
ה
כ
ה
ו
 
ו
ה
י
ה
 
ה
מ
ח
נ
ה
 
ה
נ
ש
א
ר
 
ל
פ
ל
ט
ה
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
ה
י
 
א
ב
י
 
א
ב
ר
ה
ם
 
ו
א
ל
ה
י
 
א
ב
י
 
י
צ
ח
ק
 
י
ה
ו
ה
 
א
מ
ר
 
א
ל
י
 
ש
ו
ב
 
א
ל
 
א
ר
צ
ך
 
ו
א
ל
 
מ
ו
ל
ד
ת
ך
 
ו
א
ט
י
ב
 
ע
מ
ך
 
ק
ט
נ
ת
י
 
מ
כ
ל
 
ה
ח
ס
ד
י
ם
 
ו
מ
כ
ל
 
ה
א
מ
ת
 
א
ש
ר
 
ע
ש
י
ת
 
א
ת
 
ע
ב
ד
ך
 
כ
י
 
ב
מ
ק
ל
י
 
ע
ב
ר
ת
י
 
א
ת
 
ה
י
ר
ד
ן
 
ה
ז
ה
 
ו
ע
ת
ה
 
ה
י
י
ת
י
 
ל
ש
נ
י
 
מ
ח
נ
ו
ת
 
ה
צ
ל
נ
י
 
נ
א
 
מ
י
ד
 
א
ח
י
 
מ
י
ד
 
ע
ש
ו
 
כ
י
 
י
ר
א
 
א
נ
כ
י
 
א
ת
ו
 
פ
ן
 
י
ב
ו
א
 
ו
ה
כ
נ
י
 
ה
א
ם
 
ע
ל
 
ה
ב
נ
י
ם
 
ו
א
ת
ה
 
א
מ
ר
ת
 
ה
ט
י
ב
 
א
ט
י
ב
 
ע
מ
ך
 
ו
ש
מ
ת
י
 
א
ת
 
ז
ר
ע
ך
 
כ
ח
ו
ל
 
ה
י
ם
 
א
ש
ר
 
ל
א
 
י
ס
פ
ר
 
מ
ר
ב
 
ו
י
ל
ן
 
ש
ם
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ו
י
ק
ח
 
מ
ן
 
ה
ב
א
 
ב
י
ד
ו
 
מ
נ
ח
ה
 
ל
ע
ש
ו
 
א
ח
י
ו
 
ע
ז
י
ם
 
מ
א
ת
י
ם
 
ו
ת
י
ש
י
ם
 
ע
ש
ר
י
ם
 
ר
ח
ל
י
ם
 
מ
א
ת
י
ם
 
ו
א
י
ל
י
ם
 
ע
ש
ר
י
ם
 
ג
מ
ל
י
ם
 
מ
י
נ
ק
ו
ת
 
ו
ב
נ
י
ה
ם
 
ש
ל
ש
י
ם
 
פ
ר
ו
ת
 
א
ר
ב
ע
י
ם
 
ו
פ
ר
י
ם
 
ע
ש
ר
ה
 
א
ת
נ
ו
ת
 
ע
ש
ר
י
ם
 
ו
ע
י
ר
י
ם
 
ע
ש
ר
ה
 
ו
י
ת
ן
 
ב
י
ד
 
ע
ב
ד
י
ו
 
ע
ד
ר
 
ע
ד
ר
 
ל
ב
ד
ו
 
ו
י
א
מ
ר
 
א
ל
 
ע
ב
ד
י
ו
 
ע
ב
ר
ו
 
ל
פ
נ
י
 
ו
ר
ו
ח
 
ת
ש
י
מ
ו
 
ב
י
ן
 
ע
ד
ר
 
ו
ב
י
ן
 
ע
ד
ר
 
ו
י
צ
ו
 
א
ת
 
ה
ר
א
י
ש
ו
ן
 
ל
א
מ
ר
 
כ
י
 
י
פ
ג
ש
ך
 
ע
ש
ו
 
א
ח
י
 
ו
ש
א
ל
ך
 
ל
א
מ
ר
 
ל
מ
י
 
א
ת
ה
 
ו
א
נ
ה
 
ת
ל
ך
 
ו
ל
מ
י
 
א
ל
ה
 
ל
פ
נ
י
ך
 
ו
א
מ
ר
ת
 
ל
ע
ב
ד
ך
 
ל
י
ע
ק
ב
 
מ
נ
ח
ה
 
ה
י
א
 
ש
ל
ו
ח
ה
 
ל
א
ד
נ
י
 
ל
ע
ש
ו
 
ו
ה
נ
ה
 
ג
ם
 
ה
ו
א
 
א
ח
ר
י
נ
ו
 
ו
י
צ
ו
 
ג
ם
 
א
ת
 
ה
ש
נ
י
 
ו
ג
ם
 
א
ת
 
ה
ש
ל
י
ש
י
 
ו
ג
ם
 
א
ת
 
כ
ל
 
ה
ה
ל
כ
י
ם
 
א
ח
ר
י
 
ה
ע
ד
ר
י
ם
 
ל
א
מ
ר
 
כ
ד
ב
ר
 
ה
ז
ה
 
ת
ד
ב
ר
ו
ן
 
א
ל
 
ע
ש
ו
 
ב
מ
צ
א
כ
ם
 
א
ת
ו
 
ו
א
מ
ר
ת
ם
 
ג
ם
 
ה
נ
ה
 
ע
ב
ד
ך
 
י
ע
ק
ב
 
ב
א
 
א
ח
ר
י
נ
ו
 
כ
י
 
א
מ
ר
 
א
כ
פ
ר
ה
 
פ
נ
י
ו
 
ב
מ
נ
ח
ה
 
ה
ה
ל
כ
ת
 
ל
פ
נ
י
 
ו
א
ח
ר
י
 
כ
ן
 
א
ר
א
ה
 
פ
נ
י
ו
 
א
ו
ל
י
 
י
ש
א
 
פ
נ
י
 
ו
ת
ע
ב
ר
 
ה
מ
נ
ח
ה
 
ע
ל
 
פ
נ
י
ו
 
ו
ה
ו
א
 
ל
ן
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ב
מ
ח
נ
ה
 
ו
י
ק
ם
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ו
י
ק
ח
 
א
ת
 
ש
ת
י
 
נ
ש
י
ו
 
ו
א
ת
 
ש
ת
י
 
ש
פ
ח
ת
י
ו
 
ו
א
ת
 
א
ח
ד
 
ע
ש
ר
 
י
ל
י
ד
י
ו
 
ו
י
ע
ב
ר
 
א
ת
 
מ
ע
ב
ר
 
ה
י
ב
ק
 
ו
י
ק
ח
ם
 
ו
י
ע
ב
ר
ם
 
א
ת
 
ה
נ
ח
ל
 
ו
י
ע
ב
ר
 
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ו
י
ו
ת
ר
 
י
ע
ק
ב
 
ל
ב
ד
ו
 
ו
י
א
ב
ק
 
א
י
ש
 
ע
מ
ו
 
ע
ד
 
ע
ל
ו
ת
 
ה
ש
ח
ר
 
ו
י
ר
א
 
כ
י
 
ל
א
 
י
כ
ל
 
ל
ו
 
ו
י
ג
ע
 
ב
כ
ף
 
י
ר
כ
ו
 
ו
ת
ק
ע
 
כ
ף
 
י
ר
ך
 
י
ע
ק
ב
 
ב
ה
א
ב
ק
ו
 
ע
מ
ו
 
ו
י
א
מ
ר
 
ש
ל
ח
נ
י
 
כ
י
 
ע
ל
ה
 
ה
ש
ח
ר
 
ו
י
א
מ
ר
 
ל
א
 
א
ש
ל
ח
ך
 
כ
י
 
א
ם
 
ב
ר
כ
ת
נ
י
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
מ
ה
 
ש
מ
ך
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ל
א
 
י
ע
ק
ב
 
י
א
מ
ר
 
ע
ו
ד
 
ש
מ
ך
 
כ
י
 
א
ם
 
י
ש
ר
א
ל
 
כ
י
 
ש
ר
י
ת
 
ע
ם
 
א
ל
ה
י
ם
 
ו
ע
ם
 
א
נ
ש
י
ם
 
ו
ת
ו
כ
ל
 
ו
י
ש
א
ל
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ה
ג
י
ד
ה
 
נ
א
 
ש
מ
ך
 
ו
י
א
מ
ר
 
ל
מ
ה
 
ז
ה
 
ת
ש
א
ל
 
ל
ש
מ
י
 
ו
י
ב
ר
ך
 
א
ת
ו
 
ש
ם
 
ו
י
ק
ר
א
 
י
ע
ק
ב
 
ש
ם
 
ה
מ
ק
ו
ם
 
פ
נ
ו
א
ל
 
כ
י
 
ר
א
י
ת
י
 
א
ל
ה
י
ם
 
פ
נ
י
ם
 
א
ל
 
פ
נ
י
ם
 
ו
ת
נ
צ
ל
 
נ
פ
ש
י
 
ו
י
ז
ר
ח
 
ל
ו
 
ה
ש
מ
ש
 
כ
א
ש
ר
 
ע
ב
ר
 
א
ת
 
פ
נ
ו
א
ל
 
ו
ה
ו
א
 
צ
ל
ו
ע
 
ע
ל
 
י
ר
כ
ו
 
ע
ל
 
כ
ן
 
ל
א
 
י
א
כ
ל
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ג
י
ד
 
ה
נ
ש
א
 
א
ש
ר
 
ע
ל
 
כ
ף
 
ה
י
ר
ך
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
כ
י
 
נ
ג
ע
 
ב
כ
ף
 
י
ר
ך
 
י
ע
ק
ב
 
ב
ג
י
ד
 
ה
נ
ש
א
 
ו
י
ש
א
 
י
ע
ק
ב
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ע
ש
ו
 
ב
א
 
ו
ע
מ
ו
 
א
ר
ב
ע
 
מ
א
ו
ת
 
א
י
ש
 
ו
י
ח
ץ
 
א
ת
 
ה
י
ל
ד
י
ם
 
ע
ל
 
ל
א
ה
 
ו
ע
ל
 
ר
ח
ל
 
ו
ע
ל
 
ש
ת
י
 
ה
ש
פ
ח
ו
ת
 
ו
י
ש
ם
 
א
ת
 
ה
ש
פ
ח
ו
ת
 
ו
א
ת
 
י
ל
ד
י
ה
ן
 
ר
א
י
ש
ו
נ
ה
 
ו
א
ת
 
ל
א
ה
 
ו
י
ל
ד
י
ה
 
א
ח
ר
נ
י
ם
 
ו
א
ת
 
ר
ח
ל
 
ו
א
ת
 
י
ו
ס
ף
 
א
ח
ר
נ
י
ם
 
ו
ה
ו
א
 
ע
ב
ר
 
ל
פ
נ
י
ה
ם
 
ו
י
ש
ת
ח
ו
י
 
א
ר
צ
ה
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ע
ד
 
ג
ש
ת
ו
 
ע
ד
 
א
ח
י
ו
 
ו
י
ר
ץ
 
ע
ש
ו
 
ל
ק
ר
א
ת
ו
 
ו
י
ח
ב
ק
ה
ו
 
ו
י
פ
ל
 
ע
ל
 
צ
ו
א
ר
ו
 
ו
י
ש
ק
ה
ו
 
ו
י
ב
כ
ו
 
ו
י
ש
א
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
א
ת
 
ה
נ
ש
י
ם
 
ו
א
ת
 
ה
י
ל
ד
י
ם
 
ו
י
א
מ
ר
 
מ
י
 
א
ל
ה
 
ל
ך
 
ו
י
א
מ
ר
 
ה
י
ל
ד
י
ם
 
א
ש
ר
 
ח
נ
ן
 
א
ל
ה
י
ם
 
א
ת
 
ע
ב
ד
ך
 
ו
ת
ג
ש
נ
ה
 
ה
ש
פ
ח
ו
ת
 
ה
נ
ה
 
ו
י
ל
ד
י
ה
ן
 
ו
ת
ש
ת
ח
ו
י
נ
ה
 
ו
ת
ג
ש
 
ג
ם
 
ל
א
ה
 
ו
י
ל
ד
י
ה
 
ו
י
ש
ת
ח
ו
ו
 
ו
א
ח
ר
 
נ
ג
ש
 
י
ו
ס
ף
 
ו
ר
ח
ל
 
ו
י
ש
ת
ח
ו
ו
 
ו
י
א
מ
ר
 
מ
י
 
ל
ך
 
כ
ל
 
ה
מ
ח
נ
ה
 
ה
ז
ה
 
א
ש
ר
 
פ
ג
ש
ת
י
 
ו
י
א
מ
ר
 
ל
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
 
א
ד
נ
י
 
ו
י
א
מ
ר
 
ע
ש
ו
 
י
ש
 
ל
י
 
ר
ב
 
א
ח
י
 
ו
י
ה
י
 
ל
ך
 
א
ש
ר
 
ל
ך
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
נ
א
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ו
ל
ק
ח
ת
 
מ
נ
ח
ת
י
 
מ
י
ד
י
 
כ
י
 
ע
ל
 
כ
ן
 
ר
א
י
ת
י
 
פ
נ
י
ך
 
כ
ר
א
ו
ת
 
פ
נ
י
 
א
ל
ה
י
ם
 
ו
ת
ר
צ
נ
י
 
ק
ח
 
נ
א
 
א
ת
 
ב
ר
כ
ת
י
 
א
ש
ר
 
ה
ב
א
ת
י
 
ל
ך
 
כ
י
 
ח
נ
נ
י
 
א
ל
ה
י
ם
 
ו
כ
י
 
י
ש
 
ל
י
 
כ
ל
 
ו
י
פ
צ
ר
 
ב
ו
 
ו
י
ק
ח
 
ו
י
א
מ
ר
 
נ
ס
ע
ה
 
ו
נ
ל
כ
ה
 
ו
א
ל
כ
ה
 
ל
נ
ג
ד
ך
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ד
נ
י
 
י
ד
ע
 
כ
י
 
ה
י
ל
ד
י
ם
 
ר
כ
י
ם
 
ו
ה
צ
א
ן
 
ו
ה
ב
ק
ר
 
א
ע
ל
ת
 
ע
ל
י
 
ו
ד
פ
ק
ת
י
ם
 
י
ו
ם
 
א
ח
ד
 
ו
מ
ת
ו
 
כ
ל
 
ה
צ
א
ן
 
י
ע
ב
ר
 
נ
א
 
א
ד
נ
י
 
ל
פ
נ
י
 
ע
ב
ד
ו
 
ו
א
נ
י
 
א
ת
נ
ה
ל
ה
 
ל
א
ט
י
 
ל
ר
ג
ל
 
ה
מ
ל
א
כ
ה
 
א
ש
ר
 
ל
פ
נ
י
 
ו
ל
ר
ג
ל
 
ה
י
ל
ד
י
ם
 
ע
ד
 
א
ש
ר
 
א
ב
ו
א
 
א
ל
 
א
ד
נ
י
 
ש
ע
י
ר
ה
 
ו
י
א
מ
ר
 
ע
ש
ו
 
א
צ
י
ג
ה
 
נ
א
 
ע
מ
ך
 
מ
ן
 
ה
ע
ם
 
א
ש
ר
 
א
ת
י
 
ו
י
א
מ
ר
 
ל
מ
ה
 
ז
ה
 
א
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
 
א
ד
נ
י
 
ו
י
ש
ב
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ע
ש
ו
 
ל
ד
ר
כ
ו
 
ש
ע
י
ר
ה
 
ו
י
ע
ק
ב
 
נ
ס
ע
 
ס
כ
ו
ת
ה
 
ו
י
ב
ן
 
ל
ו
 
ב
י
ת
 
ו
ל
מ
ק
נ
ה
ו
 
ע
ש
ה
 
ס
כ
ו
ת
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
ם
 
ה
מ
ק
ו
ם
 
ס
כ
ו
ת
 
ו
י
ב
א
 
י
ע
ק
ב
 
ש
ל
ו
ם
 
ע
י
ר
 
ש
כ
ם
 
א
ש
ר
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ב
ב
א
ו
 
מ
פ
ד
ן
 
א
ר
ם
 
ו
י
ח
ן
 
א
ת
 
פ
נ
י
 
ה
ע
י
ר
 
ו
י
ק
ן
 
א
ת
 
ח
ל
ק
ת
 
ה
ש
ד
ה
 
א
ש
ר
 
נ
ט
ה
 
ש
ם
 
א
ה
ל
ו
 
מ
י
ד
 
ב
נ
י
 
ח
מ
ו
ר
 
א
ב
י
 
ש
כ
ם
 
ב
מ
א
ה
 
ק
ש
י
ט
ה
 
ו
י
צ
ב
 
ש
ם
 
מ
ז
ב
ח
 
ו
י
ק
ר
א
 
ל
ו
 
א
ל
 
א
ל
ה
י
 
י
ש
ר
א
ל
 
ו
ת
צ
א
 
ד
י
נ
ה
 
ב
ת
 
ל
א
ה
 
א
ש
ר
 
י
ל
ד
ה
 
ל
י
ע
ק
ב
 
ל
ה
ר
א
ו
ת
 
ב
ב
נ
ו
ת
 
ה
א
ר
ץ
 
ו
י
ר
א
 
א
ת
ה
 
ש
כ
ם
 
ב
ן
 
ח
מ
ו
ר
 
ה
ח
ו
י
 
נ
ש
י
א
 
ה
א
ר
ץ
 
ו
י
ק
ח
 
א
ת
ה
 
ו
י
ש
כ
ב
 
א
ת
ה
 
ו
י
ע
נ
ה
 
ו
ת
ד
ב
ק
 
נ
פ
ש
ו
 
ב
ד
י
נ
ה
 
ב
ת
 
י
ע
ק
ב
 
ו
י
א
ה
ב
 
א
ת
 
ה
נ
ע
ר
ה
 
ו
י
ד
ב
ר
 
א
ל
 
ל
ב
 
ה
נ
ע
ר
ה
 
ו
י
א
מ
ר
 
ש
כ
ם
 
א
ל
 
א
ב
י
ו
 
ל
א
מ
ר
 
ק
ח
 
ל
י
 
א
ת
 
ה
י
ל
ד
ה
 
ה
ז
א
ת
 
ל
א
ש
ה
 
ו
י
ע
ק
ב
 
ש
מ
ע
 
כ
י
 
ט
מ
א
 
א
ת
 
ד
י
נ
ה
 
ב
ת
ו
 
ו
ב
נ
י
ו
 
ה
י
ו
 
א
ת
 
מ
ק
נ
ה
ו
 
ב
ש
ד
ה
 
ו
ח
ר
י
ש
 
י
ע
ק
ב
 
ע
ד
 
ב
א
ם
 
ו
י
צ
א
 
ח
מ
ו
ר
 
א
ב
י
 
ש
כ
ם
 
א
ל
 
י
ע
ק
ב
 
ל
ד
ב
ר
 
א
ת
ו
 
ו
ב
נ
י
 
י
ע
ק
ב
 
ב
א
ו
 
מ
ן
 
ה
ש
ד
ה
 
כ
ש
מ
ע
ם
 
ו
י
ת
ע
צ
ב
ו
 
ה
א
נ
ש
י
ם
 
ו
י
ח
ר
 
ל
ה
ם
 
מ
א
ד
 
כ
י
 
נ
ב
ל
ה
 
ע
ש
ה
 
ב
י
ש
ר
א
ל
 
ל
ש
כ
ב
 
א
ת
 
ב
ת
 
י
ע
ק
ב
 
ו
כ
ן
 
ל
א
 
י
ע
ש
ה
 
ו
י
ד
ב
ר
 
ח
מ
ו
ר
 
א
ת
ם
 
ל
א
מ
ר
 
ש
כ
ם
 
ב
נ
י
 
ח
ש
ק
ה
 
נ
פ
ש
ו
 
ב
ב
ת
כ
ם
 
ת
נ
ו
 
נ
א
 
א
ת
ה
 
ל
ו
 
ל
א
ש
ה
 
ו
ה
ת
ח
ת
נ
ו
 
א
ת
נ
ו
 
ב
נ
ת
י
כ
ם
 
ת
ת
נ
ו
 
ל
נ
ו
 
ו
א
ת
 
ב
נ
ת
י
נ
ו
 
ת
ק
ח
ו
 
ל
כ
ם
 
ו
א
ת
נ
ו
 
ת
ש
ב
ו
 
ו
ה
א
ר
ץ
 
ת
ה
י
ה
 
ל
פ
נ
י
כ
ם
 
ש
ב
ו
 
ס
ח
ר
ו
 
ו
א
ח
ז
ו
 
ב
ה
 
ו
י
א
מ
ר
 
ש
כ
ם
 
א
ל
 
א
ב
י
ה
 
ו
א
ל
 
א
ח
י
ה
 
א
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
כ
ם
 
ו
א
ש
ר
 
ת
א
מ
ר
ו
 
א
ל
י
 
א
ת
ן
 
ה
ר
ב
ו
 
ע
ל
י
 
מ
ה
ר
 
מ
א
ד
 
ו
מ
ת
נ
ה
 
ו
א
ת
ן
 
כ
א
ש
ר
 
ת
א
מ
ר
ו
 
א
ל
י
 
ו
ת
נ
ו
 
ל
י
 
א
ת
 
ה
נ
ע
ר
ה
 
ל
א
ש
ה
 
ו
י
ע
נ
ו
 
ב
נ
י
 
י
ע
ק
ב
 
א
ת
 
ש
כ
ם
 
ו
א
ת
 
ח
מ
ו
ר
 
א
ב
י
ו
 
ב
מ
ר
מ
ה
 
ו
י
ד
ב
ר
ו
 
א
ש
ר
 
ט
מ
א
ו
 
א
ת
 
ד
י
נ
ה
 
א
ח
ו
ת
ם
 
ו
י
א
מ
ר
ו
 
א
ל
י
ה
ם
 
ל
א
 
נ
ו
כ
ל
 
ל
ע
ש
ו
ת
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ל
ת
ת
 
א
ת
 
א
ח
ו
ת
נ
ו
 
ל
א
י
ש
 
א
ש
ר
 
ל
ו
 
ע
ר
ל
ה
 
כ
י
 
ח
ר
פ
ה
 
ה
י
א
 
ל
נ
ו
 
א
ך
 
ב
ז
א
ת
 
נ
א
ו
ת
 
ל
כ
ם
 
א
ם
 
ת
ה
י
ו
 
כ
מ
ו
נ
ו
 
ל
ה
מ
ו
ל
 
ל
כ
ם
 
כ
ל
 
ז
כ
ר
 
ו
נ
ת
נ
ו
 
א
ת
 
ב
נ
ת
י
נ
ו
 
ל
כ
ם
 
ו
א
ת
 
ב
נ
ת
י
כ
ם
 
נ
ק
ח
 
ל
נ
ו
 
ו
י
ש
ב
נ
ו
 
א
ת
כ
ם
 
ו
ה
י
י
נ
ו
 
כ
ע
ם
 
א
ח
ד
 
ו
א
ם
 
ל
א
 
ת
ש
מ
ע
ו
 
א
ל
י
נ
ו
 
ל
ה
מ
ו
ל
 
ו
ל
ק
ח
נ
ו
 
א
ת
 
ב
ת
נ
ו
 
ו
ה
ל
כ
נ
ו
 
ו
י
י
ט
ב
ו
 
ד
ב
ר
י
ה
ם
 
ב
ע
י
נ
י
 
ח
מ
ו
ר
 
ו
ב
ע
י
נ
י
 
ש
כ
ם
 
ב
נ
ו
 
ו
ל
א
 
א
ח
ר
 
ה
נ
ע
ר
 
ל
ע
ש
ו
ת
 
ה
ד
ב
ר
 
כ
י
 
ח
פ
ץ
 
ב
ב
ת
 
י
ע
ק
ב
 
ו
ה
ו
א
 
נ
כ
ב
ד
 
מ
כ
ל
 
ב
י
ת
 
א
ב
י
ו
 
ו
י
ב
א
 
ח
מ
ו
ר
 
ו
ש
כ
ם
 
ב
נ
ו
 
א
ל
 
ש
ע
ר
 
ע
י
ר
ם
 
ו
י
ד
ב
ר
ו
 
א
ל
 
א
נ
ש
י
 
ע
י
ר
ם
 
ל
א
מ
ר
 
ה
א
נ
ש
י
ם
 
ה
א
ל
ה
 
ש
ל
מ
י
ם
 
ה
ם
 
א
ת
נ
ו
 
י
ש
ב
ו
 
ב
א
ר
ץ
 
ו
י
ס
ח
ר
ו
 
א
ת
ה
 
ו
ה
א
ר
ץ
 
ה
נ
ה
 
ר
ח
ב
ו
ת
 
י
ד
י
ם
 
ל
פ
נ
י
ה
ם
 
א
ת
 
ב
נ
ו
ת
ם
 
נ
ק
ח
 
ל
נ
ו
 
ל
נ
ש
י
ם
 
ו
א
ת
 
ב
נ
ת
י
נ
ו
 
נ
ת
ן
 
ל
ה
ם
 
א
ך
 
ב
ז
א
ת
 
י
א
ו
ת
ו
 
ל
נ
ו
 
ה
א
נ
ש
י
ם
 
ל
ש
ב
ת
 
א
ת
נ
ו
 
ל
ה
י
ו
ת
 
ל
ע
ם
 
א
ח
ד
 
ב
ה
מ
ו
ל
 
ל
נ
ו
 
כ
ל
 
ז
כ
ר
 
כ
א
ש
ר
 
ה
ם
 
נ
מ
ל
י
ם
 
מ
ק
נ
י
ה
ם
 
ו
ק
נ
י
נ
ם
 
ו
כ
ל
 
ב
ה
מ
ת
ם
 
ה
ל
ו
א
 
ל
נ
ו
 
ה
ם
 
א
ך
 
נ
א
ו
ת
 
ל
ה
ם
 
ו
י
ש
ב
ו
 
א
ת
נ
ו
 
ו
י
ש
מ
ע
ו
 
א
ל
 
ח
מ
ו
ר
 
ו
א
ל
 
ש
כ
ם
 
ב
נ
ו
 
כ
ל
 
י
צ
א
י
 
ש
ע
ר
 
ע
י
ר
ו
 
ו
י
מ
ל
ו
 
כ
ל
 
ז
כ
ר
 
כ
ל
 
י
צ
א
י
 
ש
ע
ר
 
ע
י
ר
ו
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ב
ה
י
ו
ת
ם
 
כ
א
ב
י
ם
 
ו
י
ק
ח
ו
 
ש
נ
י
 
ב
נ
י
 
י
ע
ק
ב
 
ש
מ
ע
ו
ן
 
ו
ל
ו
י
 
א
ח
י
 
ד
י
נ
ה
 
א
י
ש
 
ח
ר
ב
ו
 
ו
י
ב
א
ו
 
ע
ל
 
ה
ע
י
ר
 
ב
ט
ח
 
ו
י
ה
ר
ג
ו
 
כ
ל
 
ז
כ
ר
 
ו
א
ת
 
ח
מ
ו
ר
 
ו
א
ת
 
ש
כ
ם
 
ב
נ
ו
 
ה
ר
ג
ו
 
ל
פ
י
 
ח
ר
ב
 
ו
י
ק
ח
ו
 
א
ת
 
ד
י
נ
ה
 
מ
ב
י
ת
 
ש
כ
ם
 
ו
י
צ
א
ו
 
ו
ב
נ
י
 
י
ע
ק
ב
 
ב
א
ו
 
ע
ל
 
ה
ח
ל
ל
י
ם
 
ו
י
ב
ז
ו
 
ה
ע
י
ר
 
א
ש
ר
 
ט
מ
א
ו
 
א
ח
ו
ת
ם
 
א
ת
 
צ
א
נ
ם
 
ו
א
ת
 
ב
ק
ר
ם
 
ו
א
ת
 
ח
מ
ר
י
ה
ם
 
ו
א
ת
 
א
ש
ר
 
ב
ע
י
ר
 
ו
א
ת
 
א
ש
ר
 
ב
ש
ד
ה
 
ל
ק
ח
ו
 
ו
א
ת
 
כ
ל
 
ח
י
ל
ם
 
ו
א
ת
 
ט
פ
ם
 
ו
א
ת
 
נ
ש
י
ה
ם
 
ש
ב
ו
 
ו
י
ב
ז
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ב
י
ת
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
ש
מ
ע
ו
ן
 
ו
א
ל
 
ל
ו
י
 
ע
כ
ר
ת
ם
 
א
ת
י
 
ל
ה
ב
א
ש
נ
י
 
ב
י
ו
ש
ב
 
ה
א
ר
ץ
 
ב
כ
נ
ע
נ
י
 
ו
ב
פ
ר
ז
י
 
ו
א
נ
י
 
מ
ת
י
 
מ
ס
פ
ר
 
ו
נ
א
ס
פ
ו
 
ע
ל
י
 
ו
ה
כ
ו
נ
י
 
ו
נ
ש
מ
ד
ת
י
 
א
נ
י
 
ו
ב
י
ת
י
 
ו
י
א
מ
ר
ו
 
ה
ך
 
ז
ו
נ
ה
 
י
ע
ש
ו
 
א
ת
 
א
ח
ו
ת
נ
ו
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
י
ע
ק
ב
 
ק
ו
ם
 
ע
ל
ה
 
ב
י
ת
 
א
ל
 
ו
ש
ב
 
ש
ם
 
ו
ע
ש
ה
 
ש
ם
 
מ
ז
ב
ח
 
ל
א
ל
 
ה
נ
ר
א
ה
 
א
ל
י
ך
 
ב
ב
ר
ח
ך
 
מ
פ
נ
י
 
ע
ש
ו
 
א
ח
י
ך
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
ב
י
ת
ו
 
ו
א
ל
 
כ
ל
 
א
ש
ר
 
ע
מ
ו
 
ה
ס
י
ר
ו
 
א
ת
 
א
ל
ה
י
 
ה
נ
כ
ר
 
א
ש
ר
 
ב
ת
ו
כ
כ
ם
 
ו
ה
ט
ה
ר
ו
 
ו
ה
ח
ל
י
פ
ו
 
ש
מ
ל
ת
י
כ
ם
 
ו
נ
ק
ו
מ
ה
 
ו
נ
ע
ל
ה
 
ב
י
ת
 
א
ל
 
ו
א
ע
ש
ה
 
ש
ם
 
מ
ז
ב
ח
 
ל
א
ל
 
ה
ע
נ
ה
 
א
ת
י
 
ב
י
ו
ם
 
צ
ר
ת
י
 
ו
י
ה
י
 
ע
מ
ד
י
 
ב
ד
ר
ך
 
א
ש
ר
 
ה
ל
כ
ת
י
 
ו
י
ת
נ
ו
 
א
ל
 
י
ע
ק
ב
 
א
ת
 
כ
ל
 
א
ל
ה
י
 
ה
נ
כ
ר
 
א
ש
ר
 
ב
י
ד
ם
 
ו
א
ת
 
ה
נ
ז
מ
י
ם
 
א
ש
ר
 
ב
א
ז
נ
י
ה
ם
 
ו
י
ט
מ
ן
 
א
ת
ם
 
י
ע
ק
ב
 
ת
ח
ת
 
ה
א
י
ל
ה
 
א
ש
ר
 
ע
ם
 
ש
כ
ם
 
ו
י
ס
ע
ו
 
ו
י
ה
י
 
ח
ת
ת
 
א
ל
ה
י
ם
 
ע
ל
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ס
ב
י
ב
ת
י
ה
ם
 
ו
ל
א
 
ר
ד
פ
ו
 
א
ח
ר
י
 
ב
נ
י
 
י
ע
ק
ב
 
ו
י
ב
א
 
י
ע
ק
ב
 
ל
ו
ז
ה
 
א
ש
ר
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ה
ו
א
 
ב
י
ת
 
א
ל
 
ה
ו
א
 
ו
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
ע
מ
ו
 
ו
י
ב
ן
 
ש
ם
 
מ
ז
ב
ח
 
ו
י
ק
ר
א
 
ל
מ
ק
ו
ם
 
א
ל
 
ב
י
ת
 
א
ל
 
כ
י
 
ש
ם
 
נ
ג
ל
ה
 
א
ל
י
ו
 
ה
א
ל
ה
י
ם
 
ב
ב
ר
ח
ו
 
מ
פ
נ
י
 
א
ח
י
ו
 
ו
ת
מ
ת
 
ד
ב
ו
ר
ה
 
מ
י
נ
ק
ת
 
ר
ב
ק
ה
 
ו
ת
ק
ב
ר
 
מ
ת
ח
ת
 
ל
ב
י
ת
 
א
ל
 
ת
ח
ת
 
ה
א
ל
ו
ן
 
ו
י
ק
ר
א
 
ש
מ
ו
 
א
ל
ו
ן
 
ב
כ
י
ת
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
א
ל
 
י
ע
ק
ב
 
ע
ו
ד
 
ב
ב
א
ו
 
מ
פ
ד
ן
 
א
ר
ם
 
ו
י
ב
ר
ך
 
א
ת
ו
 
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
ל
ו
 
א
ל
ה
י
ם
 
ש
מ
ך
 
י
ע
ק
ב
 
ל
א
 
י
ק
ר
א
 
ע
ו
ד
 
ש
מ
ך
 
י
ע
ק
ב
 
כ
י
 
א
ם
 
י
ש
ר
א
ל
 
י
ה
י
ה
 
ש
מ
ך
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ו
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
ל
ו
 
א
ל
ה
י
ם
 
א
נ
י
 
א
ל
 
ש
ד
י
 
פ
ר
ה
 
ו
ר
ב
ה
 
ג
ו
י
 
ו
ק
ה
ל
 
ג
ו
י
ם
 
י
ה
י
ה
 
מ
מ
ך
 
ו
מ
ל
כ
י
ם
 
מ
ח
ל
צ
י
ך
 
י
צ
א
ו
 
ו
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ת
י
 
ל
א
ב
ר
ה
ם
 
ו
ל
י
צ
ח
ק
 
ל
ך
 
א
ת
נ
נ
ה
 
ו
ל
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
א
ת
ן
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ע
ל
 
מ
ע
ל
י
ו
 
א
ל
ה
י
ם
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ד
ב
ר
 
א
ת
ו
 
ו
י
צ
ב
 
י
ע
ק
ב
 
מ
צ
ב
ה
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ד
ב
ר
 
א
ת
ו
 
מ
צ
ב
ת
 
א
ב
ן
 
ו
י
ס
ך
 
ע
ל
י
ה
 
נ
ס
ך
 
ו
י
צ
ק
 
ע
ל
י
ה
 
ש
מ
ן
 
ו
י
ק
ר
א
 
י
ע
ק
ב
 
א
ת
 
ש
ם
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ד
ב
ר
 
א
ת
ו
 
ש
ם
 
א
ל
ה
י
ם
 
ב
י
ת
 
א
ל
 
ו
י
ס
ע
ו
 
מ
ב
י
ת
 
א
ל
 
ו
י
ה
י
 
ע
ו
ד
 
כ
ב
ר
ת
 
ה
א
ר
ץ
 
ל
ב
ו
א
 
א
פ
ר
ת
ה
 
ו
ת
ל
ד
 
ר
ח
ל
 
ו
ת
ק
ש
 
ב
ל
ד
ת
ה
 
ו
י
ה
י
 
ב
ה
ק
ש
ו
ת
ה
 
ב
ל
ד
ת
ה
 
ו
ת
א
מ
ר
 
ל
ה
 
ה
מ
י
ל
ד
ת
 
א
ל
 
ת
י
ר
א
י
 
כ
י
 
ג
ם
 
ז
ה
 
ל
י
ך
 
ב
ן
 
ו
י
ה
י
 
ב
צ
א
ת
 
נ
פ
ש
ה
 
כ
י
 
מ
ת
ה
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ב
נ
 
א
ו
נ
י
 
ו
א
ב
י
ו
 
ק
ר
א
 
ל
ו
 
ב
נ
י
מ
י
ם
 
ו
ת
מ
ת
 
ר
ח
ל
 
ו
ת
ק
ב
ר
 
ב
ד
ר
ך
 
א
פ
ר
ת
ה
 
ה
י
א
 
ב
י
ת
 
ל
ח
ם
 
ו
י
צ
ב
 
י
ע
ק
ב
 
מ
צ
ב
ה
 
ע
ל
 
ק
ב
ר
ת
ה
 
ה
י
א
 
מ
צ
ב
ת
 
ק
ב
ר
ת
 
ר
ח
ל
 
ע
ד
 
ה
י
ו
ם
 
ו
י
ס
ע
 
י
ש
ר
א
ל
 
ו
י
ט
 
א
ה
ל
ו
 
מ
ה
ל
א
ה
 
ל
מ
ג
ד
ל
 
ע
ד
ר
 
ו
י
ה
י
 
ב
ש
כ
ן
 
י
ש
ר
א
ל
 
ב
א
ר
ץ
 
ה
ה
י
א
 
ו
י
ל
ך
 
ר
א
ו
ב
ן
 
ו
י
ש
כ
ב
 
א
ת
 
ב
ל
ה
ה
 
פ
י
ל
ג
ש
 
א
ב
י
ו
 
ו
י
ש
מ
ע
 
י
ש
ר
א
ל
 
ו
י
ה
י
ו
 
ב
נ
י
 
י
ע
ק
ב
 
ש
נ
י
ם
 
ע
ש
ר
 
ב
נ
י
 
ל
א
ה
 
ב
כ
ו
ר
 
י
ע
ק
ב
 
ר
א
ו
ב
ן
 
ו
ש
מ
ע
ו
ן
 
ו
ל
ו
י
 
ו
י
ה
ו
ד
ה
 
ו
י
ש
ש
כ
ר
 
ו
ז
ב
ו
ל
ן
 
ו
ב
נ
י
 
ר
ח
ל
 
י
ו
ס
ף
 
ו
ב
נ
י
מ
י
ם
 
ו
ב
נ
י
 
ב
ל
ה
ה
 
ש
פ
ח
ת
 
ר
ח
ל
 
ד
ן
 
ו
נ
פ
ת
ל
י
 
ו
ב
נ
י
 
ז
ל
פ
ה
 
ש
פ
ח
ת
 
ל
א
ה
 
ג
ד
 
ו
א
ש
ר
 
א
ל
ה
 
ב
נ
י
 
י
ע
ק
ב
 
א
ש
ר
 
י
ל
ד
ו
 
ל
ו
 
ב
פ
ד
ן
 
א
ר
ם
 
ו
י
ב
א
 
י
ע
ק
ב
 
א
ל
 
י
צ
ח
ק
 
א
ב
י
ו
 
מ
מ
ר
א
 
ק
ר
י
ת
 
ה
א
ר
ב
ע
 
ה
י
א
 
ח
ב
ר
ו
ן
 
א
ש
ר
 
ג
ר
 
ש
ם
 
א
ב
ר
ה
ם
 
ו
י
צ
ח
ק
 
ו
י
ה
י
ו
 
י
מ
י
 
י
צ
ח
ק
 
מ
א
ת
 
ש
נ
ה
 
ו
ש
מ
נ
י
ם
 
ש
נ
ה
 
ו
י
ג
ו
ע
 
י
צ
ח
ק
 
ו
י
מ
ת
 
ו
י
א
ס
ף
 
א
ל
 
ע
מ
ו
 
ז
ק
ן
 
ו
ש
ב
ע
 
י
מ
י
ם
 
ו
י
ק
ב
ר
ו
 
א
ת
ו
 
ע
ש
ו
 
ו
י
ע
ק
ב
 
ב
נ
י
ו
 
ו
א
ל
ה
 
ת
ו
ל
ד
ת
 
ע
ש
ו
 
ה
ו
א
 
א
ד
ו
ם
 
ע
ש
ו
 
ל
ק
ח
 
א
ת
 
נ
ש
י
ו
 
מ
ב
נ
ו
ת
 
כ
נ
ע
ן
 
א
ת
 
ע
ד
ה
 
ב
ת
 
א
י
ל
ו
ן
 
ה
ח
ת
י
 
ו
א
ת
 
א
ה
ל
י
ב
מ
ה
 
ב
ת
 
ע
נ
ה
 
ב
ן
 
צ
ב
ע
ו
ן
 
ה
ח
ו
י
 
ו
א
ת
 
מ
ח
ל
ת
 
ב
ת
 
י
ש
מ
ע
א
ל
 
א
ח
ו
ת
 
נ
ב
א
ו
ת
 
ו
ת
ל
ד
 
ע
ד
ה
 
ל
ע
ש
ו
 
א
ת
 
א
ל
י
פ
ז
 
ו
מ
ח
ל
ת
 
י
ל
ד
ה
 
א
ת
 
ר
ע
ו
א
ל
 
ו
א
ה
ל
י
ב
מ
ה
 
י
ל
ד
ה
 
א
ת
 
י
ע
ו
ש
 
ו
א
ת
 
י
ע
ל
ם
 
ו
א
ת
 
ק
ר
ח
 
א
ל
ה
 
ב
נ
י
 
ע
ש
ו
 
א
ש
ר
 
י
ל
ד
ו
 
ל
ו
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ק
ח
 
ע
ש
ו
 
א
ת
 
נ
ש
י
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ו
א
ת
 
ב
נ
ת
י
ו
 
ו
א
ת
 
כ
ל
 
נ
פ
ש
ו
ת
 
ב
י
ת
ו
 
ו
א
ת
 
מ
ק
נ
ה
ו
 
ו
א
ת
 
כ
ל
 
ב
ה
מ
ת
ו
 
ו
א
ת
 
כ
ל
 
ק
נ
י
נ
ו
 
א
ש
ר
 
ר
כ
ש
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ל
ך
 
מ
א
ר
ץ
 
כ
נ
ע
ן
 
מ
פ
נ
י
 
י
ע
ק
ב
 
א
ח
י
ו
 
כ
י
 
ה
י
ה
 
ר
כ
ו
ש
ם
 
ר
ב
 
מ
ש
ב
ת
 
י
ח
ד
ו
 
ו
ל
א
 
י
כ
ל
ה
 
א
ר
ץ
 
מ
ג
ר
י
ה
ם
 
ל
ש
א
ת
 
א
ת
ם
 
מ
פ
נ
י
 
מ
ק
נ
י
ה
ם
 
ו
י
ש
ב
 
ע
ש
ו
 
ב
ה
ר
 
ש
ע
י
ר
 
ע
ש
ו
 
ה
ו
א
 
א
ד
ו
ם
 
ו
א
ל
ה
 
ת
ו
ל
ד
ת
 
ע
ש
ו
 
א
ב
י
 
א
ד
ו
ם
 
ב
ה
ר
 
ש
ע
י
ר
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
ע
ש
ו
 
א
ל
י
פ
ז
 
ב
ן
 
ע
ד
ה
 
א
ש
ת
 
ע
ש
ו
 
ר
ע
ו
א
ל
 
ב
ן
 
מ
ח
ל
ת
 
א
ש
ת
 
ע
ש
ו
 
ו
י
ה
י
ו
 
ב
נ
י
 
א
ל
י
פ
ז
 
ת
י
מ
ן
 
ו
א
מ
ר
 
ו
צ
פ
ו
 
ו
ג
ע
ת
ם
 
ו
ק
נ
ז
 
ו
ת
מ
נ
ע
 
ה
י
ת
ה
 
פ
י
ל
ג
ש
 
ל
א
ל
י
פ
ז
 
ב
ן
 
ע
ש
ו
 
ו
ת
ל
ד
 
ל
א
ל
י
פ
ז
 
א
ת
 
ע
מ
ל
ק
 
א
ל
ה
 
ב
נ
י
 
ע
ד
ה
 
א
ש
ת
 
ע
ש
ו
 
ו
א
ל
ה
 
ב
נ
י
 
ר
ע
ו
א
ל
 
נ
ח
ת
 
ו
ז
ר
ח
 
ש
מ
ח
 
ו
מ
ז
ה
 
א
ל
ה
 
ה
י
ו
 
ב
נ
י
 
מ
ח
ל
ת
 
א
ש
ת
 
ע
ש
ו
 
ו
א
ל
ה
 
ה
י
ו
 
ב
נ
י
 
א
ה
ל
י
ב
מ
ה
 
ב
ת
 
ע
נ
ה
 
ב
ן
 
צ
ב
ע
ו
ן
 
א
ש
ת
 
ע
ש
ו
 
ו
ת
ל
ד
 
ל
ע
ש
ו
 
א
ת
 
י
ע
ו
ש
 
ו
א
ת
 
י
ע
ל
ם
 
ו
א
ת
 
ק
ר
ח
 
א
ל
ה
 
א
ל
ו
פ
י
 
ב
נ
י
 
ע
ש
ו
 
ב
נ
י
 
א
ל
י
פ
ז
 
ב
כ
ו
ר
 
ע
ש
ו
 
א
ל
ו
ף
 
ת
י
מ
ן
 
א
ל
ו
ף
 
א
מ
ר
 
א
ל
ו
ף
 
צ
פ
ו
 
א
ל
ו
ף
 
ק
נ
ז
 
א
ל
ו
ף
 
ג
ע
ת
ם
 
א
ל
ו
ף
 
ע
מ
ל
ק
 
א
ל
ה
 
א
ל
ו
פ
י
 
א
ל
י
פ
ז
 
ב
א
ר
ץ
 
א
ד
ו
ם
 
א
ל
ה
 
ב
נ
י
 
ע
ד
ה
 
ו
א
ל
ה
 
ב
נ
י
 
ר
ע
ו
א
ל
 
ב
ן
 
ע
ש
ו
 
א
ל
ו
ף
 
נ
ח
ת
 
א
ל
ו
ף
 
ז
ר
ח
 
א
ל
ו
ף
 
ש
מ
ח
 
א
ל
ו
ף
 
מ
ז
ה
 
א
ל
ה
 
א
ל
ו
פ
י
 
ר
ע
ו
א
ל
 
ב
א
ר
ץ
 
א
ד
ו
ם
 
א
ל
ה
 
ב
נ
י
 
מ
ח
ל
ת
 
א
ש
ת
 
ע
ש
ו
 
ו
א
ל
ה
 
ב
נ
י
 
א
ה
ל
י
ב
מ
ה
 
א
ש
ת
 
ע
ש
ו
 
א
ל
ו
ף
 
י
ע
ו
ש
 
א
ל
ו
ף
 
י
ע
ל
ם
 
א
ל
ו
ף
 
ק
ר
ח
 
א
ל
ה
 
א
ל
ו
פ
י
 
א
ה
ל
י
ב
מ
ה
 
ב
ת
 
ע
נ
ה
 
א
ש
ת
 
ע
ש
ו
 
א
ל
ה
 
ב
נ
י
 
ע
ש
ו
 
ו
א
ל
ה
 
א
ל
ו
פ
י
ה
ם
 
ע
ש
ו
 
ה
ו
א
 
א
ד
ו
ם
 
ו
א
ל
ה
 
ב
נ
י
 
ש
ע
י
ר
 
ה
ח
ר
י
 
י
ש
ב
י
 
ה
א
ר
ץ
 
ל
ו
ט
ן
 
ו
ש
ו
ב
ל
 
ו
צ
ב
ע
ו
ן
 
ו
ע
נ
ה
 
ו
ד
י
ש
ו
ן
 
ו
א
צ
ר
 
ו
ד
י
ש
ן
 
א
ל
ה
 
א
ל
ו
פ
י
 
ה
ח
ר
י
 
ב
נ
י
 
ש
ע
י
ר
 
ב
א
ר
ץ
 
א
ד
ו
ם
 
ו
י
ה
י
ו
 
ב
נ
י
 
ל
ו
ט
ן
 
ח
ר
י
 
ו
א
י
מ
ם
 
ו
א
ח
ו
ת
 
ל
ו
ט
ן
 
ת
מ
נ
ע
 
ו
א
ל
ה
 
ב
נ
י
 
ש
ו
ב
ל
 
ע
ל
ו
ן
 
ו
מ
נ
ח
ת
 
ו
ע
י
ב
ל
 
ש
פ
ו
 
ו
א
ו
נ
ם
 
ו
א
ל
ה
 
ב
נ
י
 
צ
ב
ע
ו
ן
 
א
י
ה
 
ו
ע
נ
ה
 
ה
ו
א
 
ע
נ
ה
 
א
ש
ר
 
מ
צ
א
 
א
ת
 
ה
א
י
מ
י
ם
 
ב
מ
ד
ב
ר
 
ב
ר
ע
ת
ו
 
א
ת
 
ה
ח
מ
ר
י
ם
 
ל
צ
ב
ע
ו
ן
 
א
ב
י
ו
 
ו
א
ל
ה
 
ב
נ
י
 
ע
נ
ה
 
ד
י
ש
ו
ן
 
ו
א
ה
ל
י
ב
מ
ה
 
ב
ת
 
ע
נ
ה
 
ו
א
ל
ה
 
ב
נ
י
 
ד
י
ש
ו
ן
 
ח
מ
ד
ן
 
ו
א
ש
ב
ן
 
י
ת
ר
ן
 
ו
כ
ר
ן
 
ו
א
ל
ה
 
ב
נ
י
 
א
צ
ר
 
ב
ל
ה
ן
 
ו
ז
ו
ע
ן
 
ו
ע
ק
ן
 
ו
א
ל
ה
 
ב
נ
י
 
ד
י
ש
ן
 
ע
ו
ץ
 
ו
א
ד
ן
 
א
ל
ה
 
א
ל
ו
פ
י
 
ה
ח
ר
י
 
א
ל
ו
ף
 
ל
ו
ט
ן
 
א
ל
ו
ף
 
ש
ו
ב
ל
 
א
ל
ו
ף
 
צ
ב
ע
ו
ן
 
א
ל
ו
ף
 
ע
נ
ה
 
א
ל
ו
ף
 
ד
י
ש
ו
ן
 
א
ל
ו
ף
 
א
צ
ר
 
א
ל
ו
ף
 
ד
י
ש
ן
 
א
ל
ה
 
א
ל
ו
פ
י
 
ה
ח
ר
י
 
ל
א
ל
ו
פ
י
ה
ם
 
ב
א
ר
ץ
 
ש
ע
י
ר
 
ו
א
ל
ה
 
ה
מ
ל
כ
י
ם
 
א
ש
ר
 
מ
ל
כ
ו
 
ב
א
ר
ץ
 
א
ד
ו
ם
 
ל
פ
נ
י
 
מ
ל
ך
 
מ
ל
ך
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
מ
ל
ך
 
ב
א
ד
ו
ם
 
ב
ל
ע
 
ב
ן
 
ב
ע
ו
ר
 
ו
ש
ם
 
ע
י
ר
ו
 
ד
נ
ה
ב
ה
 
ו
י
מ
ת
 
ב
ל
ע
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
י
ו
ב
ב
 
ב
ן
 
ז
ר
ח
 
מ
ב
צ
ר
ה
 
ו
י
מ
ת
 
י
ו
ב
ב
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
ח
ש
ם
 
מ
א
ר
ץ
 
ה
ת
י
מ
נ
י
 
ו
י
מ
ת
 
ח
ש
ם
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
ה
ד
ד
 
ב
ן
 
ב
ד
ד
 
ה
מ
כ
ה
 
א
ת
 
ה
מ
ד
י
נ
י
 
ב
ש
ד
ה
 
מ
ו
א
ב
 
ו
ש
ם
 
ע
י
ר
ו
 
ע
ו
י
ת
 
ו
י
מ
ת
 
ה
ד
ד
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
ש
מ
ל
ה
 
מ
מ
ש
ר
ק
ה
 
ו
י
מ
ת
 
ש
מ
ל
ה
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
ש
א
ו
ל
 
מ
ר
ח
ב
ו
ת
 
ה
נ
ה
ר
 
ו
י
מ
ת
 
ש
א
ו
ל
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
ב
ע
ל
 
ח
נ
ן
 
ב
ן
 
ע
כ
ב
ו
ר
 
ו
י
מ
ת
 
ב
ע
ל
 
ח
נ
ן
 
ו
י
מ
ל
ך
 
ת
ח
ת
י
ו
 
ה
ד
ד
 
ו
ש
ם
 
ע
י
ר
ו
 
פ
ע
ו
 
ו
ש
ם
 
א
ש
ת
ו
 
מ
ה
ט
ב
א
ל
 
ב
ת
 
מ
ט
ר
ד
 
ב
ת
 
מ
י
 
ז
ה
ב
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
א
ל
ו
פ
י
 
ע
ש
ו
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
מ
ק
ו
מ
ו
ת
ם
 
ב
ש
מ
ו
ת
ם
 
א
ל
ו
ף
 
ת
מ
נ
ע
 
א
ל
ו
ף
 
ע
ל
ו
ה
 
א
ל
ו
ף
 
י
ת
ת
 
א
ל
ו
ף
 
א
ה
ל
י
ב
מ
ה
 
א
ל
ו
ף
 
א
ל
ה
 
א
ל
ו
ף
 
פ
י
נ
ן
 
א
ל
ו
ף
 
ק
נ
ז
 
א
ל
ו
ף
 
ת
י
מ
ן
 
א
ל
ו
ף
 
מ
ב
צ
ר
 
א
ל
ו
ף
 
מ
ג
ד
א
ל
 
א
ל
ו
ף
 
ע
י
ר
ם
 
א
ל
ה
 
א
ל
ו
פ
י
 
א
ד
ו
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ב
א
ר
ץ
 
א
ח
ז
ת
ם
 
ה
ו
א
 
ע
ש
ו
 
א
ב
י
 
א
ד
ו
ם
 
ו
י
ש
ב
 
י
ע
ק
ב
 
ב
א
ר
ץ
 
מ
ג
ר
י
 
א
ב
י
ו
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
א
ל
ה
 
ת
ו
ל
ד
ת
 
י
ע
ק
ב
 
י
ו
ס
ף
 
ב
ן
 
ש
ב
ע
 
ע
ש
ר
ה
 
ש
נ
ה
 
ה
י
ה
 
ר
ע
ה
 
א
ת
 
א
ח
י
ו
 
ב
צ
א
ן
 
ו
ה
ו
א
 
נ
ע
ר
 
א
ת
 
ב
נ
י
 
ב
ל
ה
ה
 
ו
א
ת
 
ב
נ
י
 
ז
ל
פ
ה
 
נ
ש
י
 
א
ב
י
ו
 
ו
י
ב
א
 
י
ו
ס
ף
 
א
ת
 
ד
ב
ת
ם
 
ר
ע
ה
 
א
ל
 
א
ב
י
ה
ם
 
ו
י
ש
ר
א
ל
 
א
ה
ב
 
א
ת
 
י
ו
ס
ף
 
מ
כ
ל
 
ב
נ
י
ו
 
כ
י
 
ב
ן
 
ז
ק
נ
י
ם
 
ה
ו
א
 
ל
ו
 
ו
י
ע
ש
 
ל
ו
 
כ
י
ת
נ
ת
 
פ
ס
י
ם
 
ו
י
ר
א
ו
 
א
ח
י
ו
 
כ
י
 
א
ת
ו
 
א
ה
ב
 
א
ב
י
ה
ם
 
מ
כ
ל
 
ב
נ
י
ו
 
ו
י
ש
נ
א
ו
 
א
ת
ו
 
ו
ל
א
 
י
כ
ל
ו
 
ד
ב
ר
י
ו
 
ל
ש
ל
ו
ם
 
ו
י
ח
ל
ם
 
י
ו
ס
ף
 
ח
ל
ו
ם
 
ו
י
ג
ד
 
ל
א
ח
י
ו
 
ו
י
ו
ס
י
פ
ו
 
ע
ו
ד
 
ש
נ
א
 
א
ת
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ש
מ
ע
ו
 
נ
א
 
ה
ח
ל
ו
ם
 
ה
ז
ה
 
א
ש
ר
 
ח
ל
מ
ת
י
 
ו
ה
נ
ה
 
א
נ
ח
נ
ו
 
מ
א
ל
מ
י
ם
 
א
ל
מ
י
ם
 
ב
ת
ו
ך
 
ה
ש
ד
ה
 
ו
ה
נ
ה
 
ק
מ
ה
 
א
ל
מ
ת
י
 
ו
ג
ם
 
נ
צ
ב
ה
 
ו
ה
נ
ה
 
ת
ס
ב
נ
ה
 
א
ל
מ
ת
י
כ
ם
 
ו
ת
ש
ת
ח
ו
י
נ
ה
 
ל
א
ל
מ
ת
י
 
ו
י
א
מ
ר
ו
 
ל
ו
 
א
ח
י
ו
 
ה
מ
ל
ו
ך
 
ת
מ
ל
ך
 
ע
ל
י
נ
ו
 
א
ם
 
מ
ש
ל
 
ת
מ
ש
ל
 
ב
נ
ו
 
ו
י
ו
ס
י
פ
ו
 
ע
ו
ד
 
ש
נ
א
 
א
ת
ו
 
ע
ל
 
ח
ל
מ
י
ו
 
ו
ע
ל
 
ד
ב
ר
י
ו
 
ו
י
ח
ל
ם
 
ע
ו
ד
 
ח
ל
ו
ם
 
א
ח
ר
 
ו
י
ס
פ
ר
 
א
ת
ו
 
ל
א
ח
י
ו
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ח
ל
מ
ת
י
 
ח
ל
ו
ם
 
ע
ו
ד
 
ו
ה
נ
ה
 
ה
ש
מ
ש
 
ו
ה
י
ר
ח
 
ו
א
ח
ד
 
ע
ש
ר
 
כ
ו
כ
ב
י
ם
 
מ
ש
ת
ח
ו
י
ם
 
ל
י
 
ו
י
ס
פ
ר
 
ל
א
ב
י
ו
 
ו
ל
א
ח
י
ו
 
ו
י
ג
ע
ר
 
ב
ו
 
א
ב
י
ו
 
ו
י
א
מ
ר
 
ל
ו
 
מ
ה
 
ה
ח
ל
ו
ם
 
ה
ז
ה
 
א
ש
ר
 
ח
ל
מ
ת
 
ה
ב
א
 
נ
ב
ו
א
 
א
נ
י
 
ו
א
מ
ך
 
ו
א
ח
י
ך
 
ל
ה
ש
ת
ח
ו
ת
 
ל
ך
 
א
ר
צ
ה
 
ו
י
ק
נ
א
ו
 
ב
ו
 
א
ח
י
ו
 
ו
א
ב
י
ו
 
ש
מ
ר
 
א
ת
 
ה
ד
ב
ר
 
ו
י
ל
כ
ו
 
א
ח
י
ו
 
ל
ר
ע
ו
ת
 
א
ת
 
צ
א
ן
 
א
ב
י
ה
ם
 
ב
ש
כ
ם
 
ו
י
א
מ
ר
 
י
ש
ר
א
ל
 
א
ל
 
י
ו
ס
ף
 
ה
ל
ו
א
 
א
ח
י
ך
 
ר
ע
י
ם
 
ב
ש
כ
ם
 
ל
ך
 
ו
א
ש
ל
ח
ך
 
א
ל
י
ה
ם
 
ו
י
א
מ
ר
 
ל
ו
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
ל
ו
 
ל
ך
 
נ
א
 
ו
ר
א
ה
 
א
ת
 
ש
ל
ו
ם
 
א
ח
י
ך
 
ו
א
ת
 
ש
ל
ו
ם
 
ה
צ
א
ן
 
ו
ה
ש
ב
נ
י
 
ד
ב
ר
 
ו
י
ש
ל
ח
ה
ו
 
מ
ע
מ
ק
 
ח
ב
ר
ו
ן
 
ו
י
ב
א
 
ש
כ
מ
ה
 
ו
י
מ
צ
א
ה
ו
 
ה
א
י
ש
 
ו
ה
נ
ה
 
ת
ע
ה
 
ב
ש
ד
ה
 
ו
י
ש
א
ל
ה
ו
 
ה
א
י
ש
 
ל
א
מ
ר
 
מ
ה
 
ת
ב
ק
ש
 
ו
י
א
מ
ר
 
א
ת
 
א
ח
י
 
א
נ
י
 
מ
ב
ק
ש
 
ה
ג
י
ד
ה
 
נ
א
 
ל
י
 
א
י
פ
ה
 
ה
ם
 
ר
ע
י
ם
 
ו
י
א
מ
ר
 
ה
א
י
ש
 
נ
ס
ע
ו
 
מ
ז
ה
 
כ
י
 
ש
מ
ע
ת
י
ם
 
א
מ
ר
י
ם
 
נ
ל
כ
ה
 
ד
ו
ת
י
נ
ה
 
ו
י
ל
ך
 
י
ו
ס
ף
 
א
ח
ר
י
 
א
ח
י
ו
 
ו
י
מ
צ
א
ם
 
ב
ד
ו
ת
י
ן
 
ו
י
ר
א
ו
 
א
ת
ו
 
מ
ר
ח
ק
 
ב
ט
ר
ם
 
י
ק
ר
ב
 
א
ל
י
ה
ם
 
ו
י
ת
נ
כ
ל
ו
 
א
ת
ו
 
ל
ה
מ
י
ת
ו
 
ו
י
א
מ
ר
ו
 
א
י
ש
 
א
ל
 
א
ח
י
ו
 
ה
נ
ה
 
ב
ע
ל
 
ה
ח
ל
מ
ו
ת
 
ה
ל
ז
 
ב
א
 
ו
ע
ת
ה
 
ל
כ
ו
 
ו
נ
ה
ר
ג
ה
ו
 
ו
נ
ש
ל
י
כ
ה
ו
 
ב
א
ח
ד
 
ה
ב
ו
ר
ו
ת
 
ו
א
מ
ר
נ
ו
 
ח
י
ה
 
ר
ע
ה
 
א
כ
ל
ת
ו
 
ו
נ
ר
א
ה
 
מ
ה
 
י
ה
י
ה
 
ח
ל
מ
ת
י
ו
 
ו
י
ש
מ
ע
 
ר
א
ו
ב
ן
 
ו
י
צ
ל
ו
 
מ
י
ד
ם
 
ו
י
א
מ
ר
 
ל
א
 
נ
כ
נ
ו
 
נ
פ
ש
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ר
א
ו
ב
ן
 
א
ל
 
ת
ש
פ
כ
ו
 
ד
ם
 
ה
ש
ל
י
כ
ו
 
א
ת
ו
 
א
ל
 
ה
ב
ו
ר
 
ה
ז
ה
 
א
ש
ר
 
ב
מ
ד
ב
ר
 
ו
י
ד
 
א
ל
 
ת
ש
ל
ח
ו
 
ב
ו
 
ל
מ
ע
ן
 
ה
צ
י
ל
 
א
ת
ו
 
מ
י
ד
ם
 
ל
ה
ש
י
ב
ו
 
א
ל
 
א
ב
י
ו
 
ו
י
ה
י
 
כ
א
ש
ר
 
ב
א
 
י
ו
ס
ף
 
א
ל
 
א
ח
י
ו
 
ו
י
פ
ש
ט
ו
 
א
ת
 
י
ו
ס
ף
 
א
ת
 
כ
י
ת
נ
ת
ו
 
א
ת
 
כ
י
ת
נ
ת
 
ה
פ
ס
י
ם
 
א
ש
ר
 
ע
ל
י
ו
 
ו
י
ק
ח
ו
 
ו
י
ש
ל
כ
ו
 
א
ת
ו
 
ה
ב
ו
ר
 
ו
ה
ב
ו
ר
 
ר
י
ק
 
א
י
ן
 
ב
ו
 
מ
י
ם
 
ו
י
ש
ב
ו
 
ל
א
כ
ל
 
ל
ח
ם
 
ו
י
ש
א
ו
 
ע
י
נ
י
ה
ם
 
ו
י
ר
א
ו
 
ו
ה
נ
ה
 
א
ר
ח
ת
 
י
ש
מ
ע
א
ל
י
ם
 
ב
א
ה
 
מ
ג
ל
ע
ד
 
ו
ג
מ
ל
י
ה
ם
 
נ
ש
א
י
ם
 
נ
כ
א
ת
 
ו
צ
ר
י
 
ו
ל
ו
ט
 
ה
ל
כ
י
ם
 
ל
ה
ו
ר
י
ד
 
מ
צ
ר
י
מ
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
א
ל
 
א
ח
י
ו
 
מ
ה
 
ב
צ
ע
 
כ
י
 
נ
ה
ר
ג
 
א
ת
 
א
ח
י
נ
ו
 
ו
כ
ס
י
נ
ו
 
א
ת
 
ד
מ
ו
 
ל
כ
ו
 
נ
מ
כ
ר
נ
ו
 
ל
י
ש
מ
ע
א
ל
י
ם
 
ו
י
ד
נ
ו
 
א
ל
 
ת
ה
י
ה
 
ב
ו
 
כ
י
 
א
ח
י
נ
ו
 
ו
ב
ש
ר
נ
ו
 
ה
ו
א
 
ו
י
ש
מ
ע
ו
 
א
ח
י
ו
 
ו
י
ע
ב
ר
ו
 
א
נ
ש
י
ם
 
מ
ד
י
נ
י
ם
 
ס
ח
ר
י
ם
 
ו
י
מ
ש
כ
ו
 
ו
י
ע
ל
ו
 
א
ת
 
י
ו
ס
ף
 
מ
ן
 
ה
ב
ו
ר
 
ו
י
מ
כ
ר
ו
 
א
ת
 
י
ו
ס
ף
 
ל
י
ש
מ
ע
א
ל
י
ם
 
ב
ע
ש
ר
י
ם
 
כ
ס
ף
 
ו
י
ב
י
א
ו
 
א
ת
 
י
ו
ס
ף
 
מ
צ
ר
י
מ
ה
 
ו
י
ש
ב
 
ר
א
ו
ב
ן
 
א
ל
 
ה
ב
ו
ר
 
ו
ה
נ
ה
 
א
י
ן
 
י
ו
ס
ף
 
ב
ב
ו
ר
 
ו
י
ק
ר
ע
 
א
ת
 
ב
ג
ד
י
ו
 
ו
י
ש
ב
 
א
ל
 
א
ח
י
ו
 
ו
י
א
מ
ר
 
ה
י
ל
ד
 
א
י
נ
נ
ו
 
ו
א
נ
י
 
ה
נ
ה
 
א
נ
י
 
ב
א
 
ו
י
ק
ח
ו
 
א
ת
 
כ
י
ת
נ
ת
 
י
ו
ס
ף
 
ו
י
ש
ח
ט
ו
 
ש
ע
י
ר
 
ע
ז
י
ם
 
ו
י
ט
ב
ל
ו
 
א
ת
 
ה
כ
י
ת
נ
ת
 
ב
ד
ם
 
ו
י
ש
ל
ח
ו
 
א
ת
 
כ
י
ת
נ
ת
 
ה
פ
ס
י
ם
 
ו
י
ב
י
א
ו
 
א
ל
 
א
ב
י
ה
ם
 
ו
י
א
מ
ר
ו
 
ז
א
ת
 
מ
צ
א
נ
ו
 
ה
כ
ר
 
נ
א
 
ה
כ
י
ת
נ
ת
 
ב
נ
ך
 
ה
י
א
 
א
ם
 
ל
א
 
ו
י
כ
ר
ה
 
ו
י
א
מ
ר
 
כ
י
ת
נ
ת
 
ב
נ
י
 
ה
י
א
 
ח
י
ה
 
ר
ע
ה
 
א
כ
ל
ת
ו
 
ט
ר
ף
 
ט
ר
ף
 
י
ו
ס
ף
 
ו
י
ק
ר
ע
 
י
ע
ק
ב
 
ש
מ
ל
ת
י
ו
 
ו
י
ש
ם
 
ש
ק
 
ב
מ
ת
נ
י
ו
 
ו
י
ת
א
ב
ל
 
ע
ל
 
ב
נ
ו
 
י
מ
י
ם
 
ר
ב
י
ם
 
ו
י
ק
מ
ו
 
כ
ל
 
ב
נ
י
ו
 
ו
כ
ל
 
ב
נ
ת
י
ו
 
ל
נ
ח
מ
ו
 
ו
י
מ
א
ן
 
ל
ה
ת
נ
ח
ם
 
ו
י
א
מ
ר
 
כ
י
 
א
ר
ד
 
ע
ל
 
ב
נ
י
 
א
ב
ל
 
ש
א
ל
ה
 
ו
י
ב
ך
 
א
ת
ו
 
א
ב
י
ו
 
ו
ה
מ
ד
י
נ
י
ם
 
מ
כ
ר
ו
 
א
ת
 
י
ו
ס
ף
 
מ
צ
ר
י
מ
ה
 
ל
פ
ו
ט
י
פ
ר
 
ס
ר
י
ס
 
פ
ר
ע
ה
 
ש
ר
 
ה
ט
ב
ח
י
ם
 
ו
י
ה
י
 
ב
ע
ת
 
ה
ה
י
א
 
ו
י
ר
ד
 
י
ה
ו
ד
ה
 
מ
א
ת
 
א
ח
י
ו
 
ו
י
ט
 
ע
ד
 
א
י
ש
 
ע
ד
ל
מ
י
 
ו
ש
מ
ו
 
ח
י
ר
ה
 
ו
י
ר
א
 
ש
ם
 
י
ה
ו
ד
ה
 
ב
ת
 
א
י
ש
 
כ
נ
ע
נ
י
 
ו
ש
מ
ו
 
ש
ו
ע
 
ו
י
ק
ח
ה
 
ו
י
ב
א
 
א
ל
י
ה
 
ו
ת
ה
ר
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ע
ר
 
ו
ת
ה
ר
 
ע
ו
ד
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
א
ו
נ
ן
 
ו
ת
ס
ף
 
ע
ו
ד
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ש
ל
ה
 
ו
י
ה
י
 
ב
כ
ז
ב
ה
 
ב
ל
ד
ת
ה
 
א
ת
ו
 
ו
י
ק
ח
 
י
ה
ו
ד
ה
 
א
ש
ה
 
ל
ע
ר
 
ב
כ
ו
ר
ו
 
ו
ש
מ
ה
 
ת
מ
ר
 
ו
י
ה
י
 
ע
ר
 
ב
כ
ו
ר
 
י
ה
ו
ד
ה
 
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ו
י
מ
ת
ה
ו
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
ל
א
ו
נ
ן
 
ב
א
 
א
ל
 
א
ש
ת
 
א
ח
י
ך
 
ו
י
ב
ם
 
א
ת
ה
 
ו
ה
ק
ם
 
ז
ר
ע
 
ל
א
ח
י
ך
 
ו
י
ד
ע
 
א
ו
נ
ן
 
כ
י
 
ל
א
 
ל
ו
 
י
ה
י
ה
 
ה
ז
ר
ע
 
ו
ה
י
ה
 
א
ם
 
ב
א
 
א
ל
 
א
ש
ת
 
א
ח
י
ו
 
ו
ש
ח
ת
 
א
ר
צ
ה
 
ל
ב
ל
ת
י
 
נ
ת
ן
 
ז
ר
ע
 
ל
א
ח
י
ו
 
ו
י
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
ו
י
מ
ת
 
ג
ם
 
א
ת
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
ל
ת
מ
ר
 
כ
ל
ת
ו
 
ש
ב
י
 
א
ל
מ
נ
ה
 
ב
י
ת
 
א
ב
י
ך
 
ע
ד
 
י
ג
ד
ל
 
ש
ל
ה
 
ב
נ
י
 
כ
י
 
א
מ
ר
 
פ
ן
 
י
מ
ו
ת
 
ג
ם
 
ה
ו
א
 
כ
א
ח
י
ו
 
ו
ת
ל
ך
 
ת
מ
ר
 
ו
ת
ש
ב
 
ב
י
ת
 
א
ב
י
ה
 
ו
י
ר
ב
ו
 
ה
י
מ
י
ם
 
ו
ת
מ
ת
 
ב
ת
 
ש
ו
ע
 
א
ש
ת
 
י
ה
ו
ד
ה
 
ו
י
נ
ח
ם
 
י
ה
ו
ד
ה
 
ו
י
ע
ל
 
א
ל
 
ג
ז
ז
י
 
צ
א
נ
ו
 
ה
ו
א
 
ו
ח
י
ר
ה
 
ר
ע
ה
ו
 
ה
ע
ד
ל
מ
י
 
ת
מ
נ
ת
ה
 
ו
י
ג
ד
 
ל
ת
מ
ר
 
כ
ל
ת
ו
 
ל
א
מ
ר
 
ה
נ
ה
 
ח
מ
י
ך
 
ע
ל
ה
 
ת
מ
נ
ת
ה
 
ל
ג
ו
ז
 
צ
א
נ
ו
 
ו
ת
ס
ר
 
ב
ג
ד
י
 
א
ל
מ
נ
ו
ת
ה
 
מ
ע
ל
י
ה
 
ו
ת
ת
כ
ס
 
ב
צ
ע
י
ף
 
ו
ת
ת
ע
ל
ף
 
ו
ת
ש
ב
 
ב
פ
ת
ע
 
ע
י
נ
י
ם
 
א
ש
ר
 
ע
ל
 
ד
ר
ך
 
ת
מ
נ
ת
ה
 
כ
י
 
ר
א
ת
ה
 
כ
י
 
ג
ד
ל
 
ש
ל
ה
 
ו
ה
י
א
 
ל
א
 
נ
ת
נ
ה
 
ל
ו
 
ל
א
ש
ה
 
ו
י
ר
א
ה
 
י
ה
ו
ד
ה
 
ו
י
ח
ש
ב
ה
 
ל
ז
ו
נ
ה
 
כ
י
 
כ
ס
ת
ה
 
פ
נ
י
ה
 
ו
י
ט
 
א
ל
י
ה
 
א
ל
 
ה
ד
ר
ך
 
ו
י
א
מ
ר
 
ה
ב
א
 
נ
א
 
א
ב
ו
א
 
א
ל
י
ך
 
כ
י
 
ל
א
 
י
ד
ע
 
כ
י
 
כ
ל
ת
ו
 
ה
י
א
 
ו
ת
א
מ
ר
 
מ
ה
 
ת
ת
ן
 
ל
י
 
כ
י
 
ת
ב
ו
א
 
א
ל
י
 
ו
י
א
מ
ר
 
א
נ
כ
י
 
א
ש
ל
ח
 
ג
ד
י
 
ע
ז
י
ם
 
מ
ן
 
ה
צ
א
ן
 
ו
ת
א
מ
ר
 
א
ם
 
ת
ת
ן
 
ע
ר
ב
ו
ן
 
ע
ד
 
ש
ל
ח
ך
 
ו
י
א
מ
ר
 
מ
ה
 
ה
ע
ר
ב
ו
ן
 
א
ש
ר
 
א
ת
ן
 
ל
י
ך
 
ו
ת
א
מ
ר
 
ח
ת
י
מ
ך
 
ו
פ
ת
י
ל
ך
 
ו
מ
ט
ך
 
א
ש
ר
 
ב
י
ד
ך
 
ו
י
ת
ן
 
ל
ה
 
ו
י
ב
א
 
א
ל
י
ה
 
ו
ת
ה
ר
 
ל
ו
 
ו
ת
ק
ם
 
ו
ת
ל
ך
 
ו
ת
ס
ר
 
צ
ע
י
פ
ה
 
מ
ע
ל
י
ה
 
ו
ת
ל
ב
ש
 
ב
ג
ד
י
 
א
ל
מ
נ
ו
ת
ה
 
ו
י
ש
ל
ח
 
י
ה
ו
ד
ה
 
א
ת
 
ג
ד
י
 
ה
ע
ז
י
ם
 
ב
י
ד
 
ר
ע
ה
ו
 
ה
ע
ד
ל
מ
י
 
ל
ק
ח
ת
 
ה
ע
ר
ב
ו
ן
 
מ
י
ד
 
ה
א
ש
ה
 
ו
ל
א
 
מ
צ
א
ה
 
ו
י
ש
א
ל
 
א
ת
 
א
נ
ש
י
 
ה
מ
ק
ו
ם
 
ל
א
מ
ר
 
א
י
ה
 
ה
ק
ד
ש
ה
 
ה
ה
י
א
 
ב
ע
י
נ
י
ם
 
ע
ל
 
ה
ד
ר
ך
 
ו
י
א
מ
ר
ו
 
ל
א
 
ה
י
ת
ה
 
ב
ז
ה
 
ק
ד
ש
ה
 
ו
י
ש
ב
 
א
ל
 
י
ה
ו
ד
ה
 
ו
י
א
מ
ר
 
ל
א
 
מ
צ
א
ת
י
ה
 
ו
ג
ם
 
א
נ
ש
י
 
ה
מ
ק
ו
ם
 
א
מ
ר
ו
 
ל
א
 
ה
י
ת
ה
 
ב
ז
ה
 
ק
ד
ש
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
ת
ק
ח
 
ל
ה
 
פ
ן
 
נ
ה
י
ה
 
ל
ב
ו
ז
 
ה
נ
ה
 
ש
ל
ח
ת
י
 
א
ת
 
ה
ג
ד
י
 
ה
ז
ה
 
ו
א
ת
ה
 
ל
א
 
מ
צ
א
ת
ה
 
ו
י
ה
י
 
כ
מ
ש
ל
ש
ת
 
ח
ד
ש
י
ם
 
ו
י
ג
ד
 
ל
י
ה
ו
ד
ה
 
ל
א
מ
ר
 
ז
נ
ת
ה
 
ת
מ
ר
 
כ
ל
ת
ך
 
ו
ג
ם
 
ה
נ
ה
 
ה
ר
ה
 
ל
ז
נ
י
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
ה
ו
צ
י
א
ה
 
ו
ת
ש
ר
ף
 
ה
י
א
 
מ
ו
צ
א
ת
 
ו
ה
י
א
 
ש
ל
ח
ה
 
א
ל
 
ח
מ
י
ה
 
ל
א
מ
ר
 
ל
א
י
ש
 
א
ש
ר
 
א
ל
ה
 
ל
ו
 
א
נ
כ
י
 
ה
ר
ה
 
ו
ת
א
מ
ר
 
ה
כ
ר
 
נ
א
 
ל
מ
י
 
ה
ח
ת
י
ם
 
ו
ה
פ
ת
י
ל
 
ו
ה
מ
ט
ה
 
ה
א
ל
ה
 
ו
י
כ
ר
 
י
ה
ו
ד
ה
 
ו
י
א
מ
ר
 
צ
ד
ק
ה
 
מ
מ
נ
י
 
כ
י
 
ע
ל
 
כ
ן
 
ל
א
 
נ
ת
ת
י
ה
 
ל
ש
ל
ה
 
ב
נ
י
 
ו
ל
א
 
י
ס
ף
 
ע
ו
ד
 
ל
ד
ע
ת
ה
 
ו
י
ה
י
 
ב
ע
ת
 
ל
ד
ת
ה
 
ו
ה
נ
ה
 
ת
א
מ
י
ם
 
ב
ב
ט
נ
ה
 
ו
י
ה
י
 
ב
ל
ד
ת
ה
 
ו
י
ת
ן
 
י
ד
 
ו
ת
ק
ח
 
ה
מ
י
ל
ד
ת
 
ו
ת
ק
ש
ר
 
ע
ל
 
י
ד
ו
 
ש
נ
י
 
ל
א
מ
ר
 
ז
ה
 
י
צ
א
 
ר
א
י
ש
ו
ן
 
ו
י
ה
י
 
כ
מ
ש
י
ב
 
י
ד
ו
 
ו
ה
נ
ה
 
י
צ
א
 
א
ח
י
ו
 
ו
ת
א
מ
ר
 
מ
ה
 
פ
ר
צ
ת
 
ע
ל
י
נ
ו
 
פ
ר
ץ
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
פ
ר
ץ
 
ו
א
ח
ר
י
 
כ
ן
 
י
צ
א
 
א
ח
י
ו
 
א
ש
ר
 
ע
ל
 
י
ד
ו
 
ה
ש
נ
י
 
ו
ת
ק
ר
א
 
ש
מ
ו
 
ז
ר
ח
 
ו
י
ו
ס
ף
 
ה
ו
ר
ד
 
מ
צ
ר
י
מ
ה
 
ו
י
ק
נ
ה
ו
 
פ
ו
ט
י
פ
ר
 
ס
ר
י
ס
 
פ
ר
ע
ה
 
ש
ר
 
ה
ט
ב
ח
י
ם
 
א
י
ש
 
מ
צ
ר
י
 
מ
י
ד
 
ה
י
ש
מ
ע
א
ל
י
ם
 
א
ש
ר
 
ה
ו
ר
י
ד
ה
ו
 
ש
מ
ה
 
ו
י
ה
י
 
י
ה
ו
ה
 
א
ת
 
י
ו
ס
ף
 
ו
י
ה
י
 
א
י
ש
 
מ
צ
ל
י
ח
 
ו
י
ה
י
 
ב
י
ת
 
א
ד
נ
י
ו
 
ה
מ
צ
ר
י
 
ו
י
ר
א
 
א
ד
נ
י
ו
 
כ
י
 
י
ה
ו
ה
 
א
ת
ו
 
ו
כ
ל
 
א
ש
ר
 
ה
ו
א
 
ע
ש
ה
 
י
ה
ו
ה
 
מ
צ
ל
י
ח
 
ב
י
ד
ו
 
ו
י
מ
צ
א
 
י
ו
ס
ף
 
ח
ן
 
ב
ע
י
נ
י
 
א
ד
נ
י
ו
 
ו
י
ש
ר
ת
 
א
ת
ו
 
ו
י
פ
ק
ד
ה
ו
 
ע
ל
 
ב
י
ת
ו
 
ו
כ
ל
 
א
ש
ר
 
י
ש
 
ל
ו
 
נ
ת
ן
 
ב
י
ד
ו
 
ו
י
ה
י
 
מ
א
ז
 
ה
פ
ק
י
ד
 
א
ת
ו
 
ב
ב
י
ת
ו
 
ו
ע
ל
 
כ
ל
 
א
ש
ר
 
י
ש
 
ל
ו
 
ו
י
ב
ר
ך
 
י
ה
ו
ה
 
א
ת
 
ב
י
ת
 
ה
מ
צ
ר
י
 
ב
ג
ל
ל
 
י
ו
ס
ף
 
ו
י
ה
י
 
ב
ר
כ
ת
 
י
ה
ו
ה
 
ב
כ
ל
 
א
ש
ר
 
י
ש
 
ל
ו
 
ב
ב
י
ת
 
ו
ב
ש
ד
ה
 
ו
י
ע
ז
ב
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ב
י
ד
 
י
ו
ס
ף
 
ו
ל
א
 
י
ד
ע
 
א
ת
ו
 
מ
א
ו
מ
ה
 
כ
י
 
א
ם
 
ה
ל
ח
ם
 
א
ש
ר
 
ה
ו
א
 
א
כ
ל
 
ו
י
ה
י
 
י
ו
ס
ף
 
י
פ
ה
 
ת
א
ר
 
ו
י
פ
ה
 
מ
ר
א
ה
 
ו
י
ה
י
 
א
ח
ר
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
ת
ש
א
 
א
ש
ת
 
א
ד
נ
י
ו
 
א
ת
 
ע
י
נ
י
ה
 
א
ל
 
י
ו
ס
ף
 
ו
ת
א
מ
ר
 
ש
כ
ב
ה
 
ע
מ
י
 
ו
י
מ
א
ן
 
ו
י
א
מ
ר
 
א
ל
 
א
ש
ת
 
א
ד
נ
י
ו
 
ה
ן
 
א
ד
נ
י
 
ל
א
 
י
ד
ע
 
א
ת
י
 
מ
א
ו
מ
ה
 
ב
ב
י
ת
ו
 
ו
כ
ל
 
א
ש
ר
 
י
ש
 
ל
ו
 
נ
ת
ן
 
ב
י
ד
י
 
א
י
נ
נ
ו
 
ג
ד
ו
ל
 
ב
ב
י
ת
 
ה
ז
ה
 
מ
מ
נ
י
 
ו
ל
א
 
ח
ש
ך
 
מ
מ
נ
י
 
מ
א
ו
מ
ה
 
כ
י
 
א
ם
 
א
ת
י
ך
 
ב
א
ש
ר
 
א
ת
י
 
א
ש
ת
ו
 
ו
א
י
ך
 
א
ע
ש
ה
 
ה
ר
ע
ה
 
ה
ג
ד
ל
ה
 
ה
ז
א
ת
 
ו
ח
ט
א
ת
י
 
ל
א
ל
ה
י
ם
 
ו
י
ה
י
 
כ
ד
ב
ר
ה
 
א
ל
 
י
ו
ס
ף
 
י
ו
ם
 
ו
י
ו
ם
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
ה
 
ל
ש
כ
ב
 
א
צ
ל
ה
 
ל
ה
י
ו
ת
 
ע
מ
ה
 
ו
י
ה
י
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
י
ב
א
 
י
ו
ס
ף
 
ה
ב
י
ת
ה
 
ל
ע
ש
ו
ת
 
מ
ל
א
כ
ת
ו
 
ב
ב
י
ת
 
ו
א
י
ן
 
א
י
ש
 
מ
א
נ
ש
י
 
ה
ב
י
ת
 
ש
ם
 
ב
ב
י
ת
 
ו
ת
ת
פ
ש
ה
ו
 
ב
ב
ג
ד
י
ו
 
ל
א
מ
ר
 
ש
כ
ב
ה
 
ע
מ
י
 
ו
י
ע
ז
ב
 
ב
ג
ד
י
ו
 
ב
י
ד
ה
 
ו
י
נ
ס
 
ו
י
צ
א
 
ה
ח
ו
צ
ה
 
ו
י
ה
י
 
כ
ר
א
ו
ת
ה
 
כ
י
 
ע
ז
ב
 
ב
ג
ד
י
ו
 
ב
י
ד
ה
 
ו
י
נ
ס
 
ו
י
צ
א
 
ה
ח
ו
צ
ה
 
ו
ת
ק
ר
א
 
ל
א
נ
ש
י
 
ב
י
ת
ה
 
ו
ת
א
מ
ר
 
ל
ה
ם
 
ל
א
מ
ר
 
ר
א
ו
 
ה
ב
י
א
 
ל
נ
ו
 
א
י
ש
 
ע
ב
ר
י
 
ל
צ
ח
ק
 
ב
נ
ו
 
ב
א
 
א
ל
י
 
ל
ש
כ
ב
 
ע
מ
י
 
ו
א
ק
ר
א
 
ב
ק
ו
ל
 
ג
ד
ו
ל
 
ו
י
ה
י
 
כ
ש
מ
ע
ו
 
כ
י
 
ה
ר
מ
י
 
ק
ו
ל
י
 
ו
א
ק
ר
א
 
ו
י
ע
ז
ב
 
ב
ג
ד
י
ו
 
ב
י
ד
י
 
ו
י
נ
ס
 
ו
י
צ
א
 
ה
ח
ו
צ
ה
 
ו
ת
נ
ח
 
ב
ג
ד
י
ו
 
א
צ
ל
ה
 
ע
ד
 
ב
א
 
א
ד
נ
י
ו
 
א
ל
 
ב
י
ת
ו
 
ו
ת
ד
ב
ר
 
א
ל
י
ו
 
כ
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ל
א
מ
ר
 
ב
א
 
א
ל
י
 
ה
ע
ב
ד
 
ה
ע
ב
ר
י
 
א
ש
ר
 
ה
ב
א
ת
 
ל
נ
ו
 
ל
צ
ח
ק
 
ב
י
 
ו
י
ה
י
 
כ
ה
ר
מ
י
 
ק
ו
ל
י
 
ו
א
ק
ר
א
 
ו
י
ע
ז
ב
 
ב
ג
ד
י
ו
 
א
צ
ל
י
 
ו
י
נ
ס
 
ה
ח
ו
צ
ה
 
ו
י
ה
י
 
כ
ש
מ
ע
 
א
ד
נ
י
ו
 
א
ת
 
ד
ב
ר
י
 
א
ש
ת
ו
 
א
ש
ר
 
ד
ב
ר
ה
 
א
ל
י
ו
 
ל
א
מ
ר
 
כ
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ע
ש
ה
 
ל
י
 
ע
ב
ד
ך
 
ו
י
ח
ר
 
א
פ
ו
 
ו
י
ק
ח
 
א
ד
נ
י
 
י
ו
ס
ף
 
א
ת
ו
 
ו
י
ת
נ
ה
ו
 
א
ל
 
ב
י
ת
 
ה
ס
ח
ר
 
מ
ק
ו
ם
 
א
ש
ר
 
א
ס
ו
ר
י
 
ה
מ
ל
ך
 
א
ס
ו
ר
י
ם
 
ו
י
ה
י
 
ש
ם
 
ב
ב
י
ת
 
ה
ס
ח
ר
 
ו
י
ה
י
 
י
ה
ו
ה
 
א
ת
 
י
ו
ס
ף
 
ו
י
ט
 
א
ל
י
ו
 
ח
ס
ד
 
ו
י
ת
ן
 
ח
נ
ו
 
ב
ע
י
נ
י
 
ש
ר
 
ב
י
ת
 
ה
ס
ח
ר
 
ו
י
ת
ן
 
ש
ר
 
ב
י
ת
 
ה
ס
ח
ר
 
ב
י
ד
 
י
ו
ס
ף
 
א
ת
 
כ
ל
 
ה
א
ס
ו
ר
י
ם
 
א
ש
ר
 
ב
ב
י
ת
 
ה
ס
ח
ר
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ע
ש
י
ם
 
ש
ם
 
ה
ו
א
 
ה
י
ה
 
ע
ש
ה
 
א
י
ן
 
ש
ר
 
ב
י
ת
 
ה
ס
ח
ר
 
ר
א
ה
 
א
ת
 
כ
ל
 
מ
א
ו
מ
ה
 
ב
י
ד
ו
 
ב
א
ש
ר
 
י
ה
ו
ה
 
א
ת
ו
 
ו
כ
ל
 
א
ש
ר
 
ה
ו
א
 
ע
ש
ה
 
י
ה
ו
ה
 
מ
צ
ל
י
ח
 
ו
י
ה
י
 
א
ח
ר
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ח
ט
א
ו
 
מ
ש
ק
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
ה
א
פ
ה
 
ל
א
ד
נ
י
ה
ם
 
ל
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
י
ק
צ
ף
 
פ
ר
ע
ה
 
ע
ל
 
ש
נ
י
 
ס
ר
י
ס
י
ו
 
ע
ל
 
ש
ר
 
ה
מ
ש
ק
י
ם
 
ו
ע
ל
 
ש
ר
 
ה
א
פ
י
ם
 
ו
י
ת
ן
 
א
ת
ם
 
ב
מ
ש
מ
ר
 
ב
י
ת
 
ש
ר
 
ה
ט
ב
ח
י
ם
 
א
ל
 
ב
י
ת
 
ה
ס
ח
ר
 
מ
ק
ו
ם
 
א
ש
ר
 
י
ו
ס
ף
 
א
ס
ו
ר
 
ש
ם
 
ו
י
פ
ק
ד
 
ש
ר
 
ה
ט
ב
ח
י
ם
 
א
ת
 
י
ו
ס
ף
 
א
ת
ם
 
ו
י
ש
ר
ת
 
א
ת
ם
 
ו
י
ה
י
ו
 
י
מ
י
ם
 
ב
מ
ש
מ
ר
 
ו
י
ח
ל
מ
ו
 
ח
ל
ו
ם
 
ש
נ
י
ה
ם
 
א
י
ש
 
ח
ל
מ
ו
 
ב
ל
י
ל
ה
 
א
ח
ד
 
א
י
ש
 
כ
פ
ת
ר
ו
ן
 
ח
ל
מ
ו
 
ה
מ
ש
ק
ה
 
ו
ה
א
פ
ה
 
א
ש
ר
 
ל
מ
ל
ך
 
מ
צ
ר
י
ם
 
א
ש
ר
 
א
ס
ו
ר
י
ם
 
ב
ב
י
ת
 
ה
ס
ח
ר
 
ו
י
ב
א
 
א
ל
י
ה
ם
 
י
ו
ס
ף
 
ב
ב
ק
ר
 
ו
י
ר
א
 
א
ת
ם
 
ו
ה
נ
ם
 
ז
ע
פ
י
ם
 
ו
י
ש
א
ל
 
א
ת
 
ס
ר
י
ס
י
 
פ
ר
ע
ה
 
א
ש
ר
 
א
ת
ו
 
ב
מ
ש
מ
ר
 
ב
י
ת
 
א
ד
נ
י
ו
 
ל
א
מ
ר
 
מ
ד
ו
ע
 
פ
נ
י
כ
ם
 
ר
ע
י
ם
 
ה
י
ו
ם
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
ח
ל
ו
ם
 
ח
ל
מ
נ
ו
 
ו
פ
ת
ר
 
א
י
ן
 
א
ת
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ו
ס
ף
 
ה
ל
ו
א
 
ל
א
ל
ה
י
ם
 
פ
ת
ר
נ
י
ם
 
ס
פ
ר
ו
 
נ
א
 
ל
י
 
ו
י
ס
פ
ר
 
ש
ר
 
ה
מ
ש
ק
י
ם
 
א
ת
 
ח
ל
מ
ו
 
ל
י
ו
ס
ף
 
ו
י
א
מ
ר
 
ל
ו
 
ב
ח
ל
מ
י
 
ו
ה
נ
ה
 
ג
פ
ן
 
ל
פ
נ
י
 
ו
ב
ג
פ
ן
 
ש
ל
ש
ה
 
ש
ר
ו
ג
י
ם
 
ו
ה
י
א
 
כ
א
פ
ר
ח
ת
 
ע
ל
ת
ה
 
נ
צ
ה
 
ה
ב
ש
י
ל
ו
 
א
ש
כ
ל
ת
י
ה
 
ע
נ
ב
י
ם
 
ו
כ
ו
ס
 
פ
ר
ע
ה
 
ב
י
ד
י
 
ו
א
ק
ח
 
א
ת
 
ה
ע
נ
ב
י
ם
 
ו
א
ש
ח
ט
 
א
ת
ם
 
ע
ל
 
כ
ו
ס
 
פ
ר
ע
ה
 
ו
א
ת
ן
 
א
ת
 
ה
כ
ו
ס
 
ע
ל
 
כ
ף
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
ל
ו
 
י
ו
ס
ף
 
ז
ה
 
פ
ת
ר
נ
ו
 
ש
ל
ש
ת
 
ה
ש
ר
ו
ג
י
ם
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ה
ם
 
ב
ע
ו
ד
 
ש
ל
ש
ת
 
י
מ
י
ם
 
י
ש
א
 
פ
ר
ע
ה
 
א
ת
 
ר
א
ש
ך
 
ו
ה
ש
י
ב
ך
 
ע
ל
 
כ
נ
ך
 
ו
נ
ת
ת
ה
 
כ
ו
ס
 
פ
ר
ע
ה
 
ב
י
ד
ו
 
כ
מ
ש
פ
ט
 
ה
ר
א
י
ש
ו
ן
 
א
ש
ר
 
ה
י
י
ת
 
מ
ש
ק
ה
ו
 
כ
י
 
א
ם
 
ז
כ
ר
ת
נ
י
 
א
ת
ך
 
כ
א
ש
ר
 
י
י
ט
ב
 
ל
ך
 
ו
ע
ש
י
ת
 
נ
א
 
ע
מ
ד
י
 
ח
ס
ד
 
ו
ה
ז
כ
ר
ת
נ
י
 
ל
פ
ר
ע
ה
 
ו
ה
ו
צ
א
ת
נ
י
 
מ
ן
 
ה
ב
י
ת
 
ה
ז
ה
 
כ
י
 
ג
נ
ו
ב
 
נ
ג
נ
ב
ת
י
 
מ
א
ר
ץ
 
ה
ע
ב
ר
י
ם
 
ו
ג
ם
 
פ
ה
 
ל
א
 
ע
ש
י
ת
י
 
מ
א
ו
מ
ה
 
כ
י
 
ש
מ
ו
 
א
ת
י
 
ב
ב
ו
ר
 
ו
י
ר
א
 
ש
ר
 
ה
א
פ
י
ם
 
כ
י
 
ט
ו
ב
 
פ
ת
ר
 
ו
י
א
מ
ר
 
א
ל
 
י
ו
ס
ף
 
א
ף
 
א
נ
י
 
ב
ח
ל
מ
י
 
ו
ה
נ
ה
 
ש
ל
ש
ה
 
ס
ל
י
 
ח
ר
י
 
ע
ל
 
ר
א
ש
י
 
ו
ב
ס
ל
 
ה
ע
ל
י
ו
ן
 
מ
כ
ל
 
מ
א
כ
ל
 
פ
ר
ע
ה
 
מ
ע
ש
ה
 
א
פ
ה
 
ו
ה
ע
ו
ף
 
א
כ
ל
 
א
ת
ם
 
מ
ע
ל
 
ה
ס
ל
 
מ
ע
ל
 
ר
א
ש
י
 
ו
י
ע
ן
 
י
ו
ס
ף
 
ו
י
א
מ
ר
 
ז
ה
 
פ
ת
ר
נ
ו
 
ש
ל
ש
ת
 
ה
ס
ל
י
ם
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ה
ם
 
ב
ע
ו
ד
 
ש
ל
ש
ת
 
י
מ
י
ם
 
י
ש
א
 
פ
ר
ע
ה
 
א
ת
 
ר
א
ש
ך
 
מ
ע
ל
י
ך
 
ו
ת
ל
א
 
א
ת
ך
 
ע
ל
 
ה
ע
ץ
 
ו
א
כ
ל
 
ה
ע
ו
ף
 
א
ת
 
ב
ש
ר
ך
 
מ
ע
ל
י
ך
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
י
ו
ם
 
ה
ו
ל
ד
ת
 
א
ת
 
פ
ר
ע
ה
 
ו
י
ע
ש
 
מ
ש
ת
ה
 
ל
כ
ל
 
ע
ב
ד
י
ו
 
ו
י
ש
א
 
א
ת
 
ר
א
ש
 
ש
ר
 
ה
מ
ש
ק
י
ם
 
ו
א
ת
 
ר
א
ש
 
ש
ר
 
ה
א
פ
י
ם
 
ב
ת
ו
ך
 
ע
ב
ד
י
ו
 
ו
י
ש
ב
 
א
ת
 
ש
ר
 
ה
מ
ש
ק
י
ם
 
ע
ל
 
מ
ש
ק
ה
ו
 
ו
י
ת
ן
 
א
ת
 
ה
כ
ו
ס
 
ע
ל
 
כ
ף
 
פ
ר
ע
ה
 
ו
א
ת
 
ש
ר
 
ה
א
פ
י
ם
 
ת
ל
א
 
כ
א
ש
ר
 
פ
ת
ר
 
ל
ה
ם
 
י
ו
ס
ף
 
ו
ל
א
 
ז
כ
ר
 
ש
ר
 
ה
מ
ש
ק
י
ם
 
א
ת
 
י
ו
ס
ף
 
ו
י
ש
כ
ח
ה
ו
 
ו
י
ה
י
 
מ
ק
ץ
 
ש
נ
ת
י
ם
 
י
מ
י
ם
 
ו
פ
ר
ע
ה
 
ח
ל
ם
 
ו
ה
נ
ה
 
ע
מ
ד
 
ע
ל
 
ה
י
א
ר
 
ו
ה
נ
ה
 
מ
ן
 
ה
י
א
ר
 
ע
ל
ו
ת
 
ש
ב
ע
 
פ
ר
ו
ת
 
י
פ
ו
ת
 
מ
ר
א
ה
 
ו
ב
ר
י
ו
ת
 
ב
ש
ר
 
ו
ת
ר
י
ע
נ
ה
 
ב
א
ח
ו
 
ו
ה
נ
ה
 
ש
ב
ע
 
פ
ר
ו
ת
 
א
ח
ר
ו
ת
 
ע
ל
ו
ת
 
א
ח
ר
י
ה
ן
 
מ
ן
 
ה
י
א
ר
 
ר
ע
ו
ת
 
מ
ר
א
ה
 
ו
ר
ק
ו
ת
 
ב
ש
ר
 
ו
ת
ע
מ
ד
נ
ה
 
א
צ
ל
 
ה
פ
ר
ו
ת
 
ע
ל
 
ש
פ
ת
 
ה
י
א
ר
 
ו
ת
א
כ
ל
נ
ה
 
ה
פ
ר
ו
ת
 
ר
ע
ו
ת
 
ה
מ
ר
א
ה
 
ו
ר
ק
ו
ת
 
ה
ב
ש
ר
 
א
ת
 
ש
ב
ע
 
ה
פ
ר
ו
ת
 
י
פ
ו
ת
 
ה
מ
ר
א
ה
 
ו
ה
ב
ר
י
ו
ת
 
ו
י
ק
ץ
 
פ
ר
ע
ה
 
ו
י
י
ש
ן
 
ו
י
ח
ל
ם
 
ש
נ
י
ת
 
ו
ה
נ
ה
 
ש
ב
ע
 
ש
ב
ל
י
ם
 
ע
ל
ו
ת
 
ב
ק
נ
ה
 
א
ח
ד
 
ב
ר
י
ו
ת
 
ו
ט
ו
ב
ו
ת
 
ו
ה
נ
ה
 
ש
ב
ע
 
ש
ב
ל
י
ם
 
ד
ק
ו
ת
 
ו
ש
ד
י
פ
ת
 
ק
ד
י
ם
 
צ
מ
ח
ו
ת
 
א
ח
ר
י
ה
ן
 
ו
ת
ב
ל
ע
נ
ה
 
ה
ש
ב
ל
י
ם
 
ה
ד
ק
ו
ת
 
א
ת
 
ש
ב
ע
 
ה
ש
ב
ל
י
ם
 
ה
ב
ר
י
ו
ת
 
ו
ה
מ
ל
י
ו
ת
 
ו
י
ק
ץ
 
פ
ר
ע
ה
 
ו
ה
נ
ה
 
ח
ל
ו
ם
 
ו
י
ה
י
 
ב
ב
ק
ר
 
ו
ת
פ
ע
ם
 
ר
ו
ח
ו
 
ו
י
ש
ל
ח
 
ו
י
ק
ר
א
 
א
ת
 
כ
ל
 
ח
ר
ט
מ
י
 
מ
צ
ר
י
ם
 
ו
א
ת
 
כ
ל
 
ח
כ
מ
י
ה
 
ו
י
ס
פ
ר
 
פ
ר
ע
ה
 
ל
ה
ם
 
א
ת
 
ח
ל
מ
י
ו
 
ו
א
י
ן
 
פ
ת
ר
 
א
ת
ם
 
ל
פ
ר
ע
ה
 
ו
י
ד
ב
ר
 
ש
ר
 
ה
מ
ש
ק
י
ם
 
א
ל
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
א
ת
 
ח
ט
א
י
 
א
נ
י
 
מ
ז
כ
י
ר
 
ה
י
ו
ם
 
פ
ר
ע
ה
 
ק
צ
ף
 
ע
ל
 
ע
ב
ד
י
ו
 
ו
י
ת
ן
 
א
ת
י
 
ב
מ
ש
מ
ר
 
ב
י
ת
 
ש
ר
 
ה
ט
ב
ח
י
ם
 
א
ת
י
 
ו
א
ת
 
ש
ר
 
ה
א
פ
י
ם
 
ו
נ
ח
ל
ם
 
ח
ל
ו
ם
 
ב
ל
י
ל
ה
 
א
ח
ד
 
א
נ
י
 
ו
ה
ו
א
 
א
י
ש
 
כ
פ
ת
ר
ו
ן
 
ח
ל
מ
ו
 
ח
ל
מ
נ
ו
 
ו
ש
ם
 
א
ת
נ
ו
 
נ
ע
ר
 
ע
ב
ר
י
 
ע
ב
ד
 
ל
ש
ר
 
ה
ט
ב
ח
י
ם
 
ו
נ
ס
פ
ר
 
ל
ו
 
ו
י
פ
ת
ר
 
ל
נ
ו
 
א
ת
 
ח
ל
מ
ת
י
נ
ו
 
א
י
ש
 
כ
ח
ל
מ
ו
 
פ
ת
ר
 
ו
י
ה
י
 
כ
א
ש
ר
 
פ
ת
ר
 
ל
נ
ו
 
כ
ן
 
ה
י
ה
 
א
ת
י
 
ה
ש
י
ב
 
ע
ל
 
כ
נ
י
 
ו
א
ת
ו
 
ת
ל
א
 
ו
י
ש
ל
ח
 
פ
ר
ע
ה
 
ו
י
ק
ר
א
 
א
ת
 
י
ו
ס
ף
 
ו
י
ר
י
צ
ה
ו
 
מ
ן
 
ה
ב
ו
ר
 
ו
י
ג
ל
ח
 
ו
י
ח
ל
ף
 
ש
מ
ל
ת
י
ו
 
ו
י
ב
א
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ו
ס
ף
 
ח
ל
ו
ם
 
ח
ל
מ
ת
י
 
ו
פ
ת
ר
 
א
י
ן
 
א
ת
ו
 
ו
א
נ
י
 
ש
מ
ע
ת
י
 
ע
ל
י
ך
 
ל
א
מ
ר
 
ה
ת
ש
מ
ע
 
ח
ל
ו
ם
 
ל
פ
ת
ר
 
א
ת
ו
 
ו
י
ע
ן
 
י
ו
ס
ף
 
א
ת
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
ב
ל
ע
ד
י
 
א
ל
ה
י
ם
 
ל
א
 
י
ע
נ
ה
 
א
ת
 
ש
ל
ו
ם
 
פ
ר
ע
ה
 
ו
י
ד
ב
ר
 
פ
ר
ע
ה
 
א
ת
 
י
ו
ס
ף
 
ב
ח
ל
מ
י
 
ו
ה
נ
נ
י
 
ע
מ
ד
 
ע
ל
 
ש
פ
ת
 
ה
י
א
ר
 
ו
ה
נ
ה
 
מ
ן
 
ה
י
א
ר
 
ע
ל
ו
ת
 
ש
ב
ע
 
פ
ר
ו
ת
 
ב
ר
י
ו
ת
 
ב
ש
ר
 
ו
י
פ
ו
ת
 
ת
א
ר
 
ו
ת
ר
י
ע
נ
ה
 
ב
א
ח
ו
 
ו
ה
נ
ה
 
ש
ב
ע
 
פ
ר
ו
ת
 
א
ח
ר
ו
ת
 
ע
ל
ו
ת
 
א
ח
ר
י
ה
ן
 
ד
ל
ו
ת
 
ו
ר
ע
ו
ת
 
ת
א
ר
 
מ
א
ד
 
ו
ר
ק
ו
ת
 
ב
ש
ר
 
ל
א
 
ר
א
י
ת
י
 
כ
ה
ן
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ר
ע
 
ו
ת
א
כ
ל
נ
ה
 
ה
פ
ר
ו
ת
 
ה
ר
ק
ו
ת
 
ו
ה
ר
ע
ו
ת
 
א
ת
 
ש
ב
ע
 
ה
פ
ר
ו
ת
 
ה
ר
א
י
ש
ו
נ
ו
ת
 
ו
ה
ב
ר
י
ו
ת
 
ו
ת
ב
א
נ
ה
 
א
ל
 
ק
ר
ב
ה
ן
 
ו
ל
א
 
נ
ו
ד
ע
 
כ
י
 
ב
א
ו
 
א
ל
 
ק
ר
ב
ה
ן
 
ו
מ
ר
א
ה
ן
 
ר
ע
 
כ
א
ש
ר
 
ב
ת
ח
ל
ה
 
ו
א
ק
ץ
 
ו
א
ר
א
ה
 
ב
ח
ל
מ
י
 
ו
ה
נ
ה
 
ש
ב
ע
 
ש
ב
ל
י
ם
 
ע
ל
ו
ת
 
ב
ק
נ
ה
 
א
ח
ד
 
מ
ל
י
ו
ת
 
ו
ט
ו
ב
ו
ת
 
ו
ה
נ
ה
 
ש
ב
ע
 
ש
ב
ל
י
ם
 
צ
נ
מ
ו
ת
 
ד
ק
ו
ת
 
ו
ש
ד
י
פ
ו
ת
 
ק
ד
י
ם
 
צ
מ
ח
ו
ת
 
א
ח
ר
י
ה
ן
 
ו
ת
ב
ל
ע
נ
ה
 
ה
ש
ב
ל
י
ם
 
ה
ד
ק
ו
ת
 
א
ת
 
ש
ב
ע
 
ה
ש
ב
ל
י
ם
 
ה
ט
ו
ב
ו
ת
 
ו
א
מ
ר
 
א
ל
 
ה
ח
ר
ט
מ
י
ם
 
ו
א
י
ן
 
מ
ג
י
ד
 
ל
י
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
פ
ר
ע
ה
 
ח
ל
ו
ם
 
פ
ר
ע
ה
 
א
ח
ד
 
ה
ו
א
 
א
ת
 
א
ש
ר
 
ה
א
ל
ה
י
ם
 
ע
ש
ה
 
א
ג
י
ד
 
ל
פ
ר
ע
ה
 
ש
ב
ע
 
ה
פ
ר
ו
ת
 
ה
ט
ו
ב
ו
ת
 
ש
ב
ע
 
ש
נ
י
ם
 
ה
נ
ה
 
ו
ש
ב
ע
 
ה
ש
ב
ל
י
ם
 
ה
ט
ו
ב
ו
ת
 
ש
ב
ע
 
ש
נ
י
ם
 
ה
נ
ה
 
ח
ל
ו
ם
 
א
ח
ד
 
ה
ו
א
 
ו
ש
ב
ע
 
ה
פ
ר
ו
ת
 
ה
ר
ק
ו
ת
 
ו
ה
ר
ע
ו
ת
 
ה
ע
ל
ו
ת
 
א
ח
ר
י
ה
ן
 
ש
ב
ע
 
ש
נ
י
ם
 
ה
נ
ה
 
ו
ש
ב
ע
 
ה
ש
ב
ל
י
ם
 
ה
ד
ק
ו
ת
 
ו
ש
ד
י
פ
ת
 
ה
ק
ד
י
ם
 
י
ה
י
ו
 
ש
ב
ע
 
ש
נ
י
 
ר
ע
ב
 
ה
ו
א
 
ה
ד
ב
ר
 
א
ש
ר
 
ד
ב
ר
ת
י
 
א
ל
 
פ
ר
ע
ה
 
א
ת
 
א
ש
ר
 
ה
א
ל
ה
י
ם
 
ע
ש
ה
 
ה
ר
א
ה
 
א
ת
 
פ
ר
ע
ה
 
ה
נ
ה
 
ש
ב
ע
 
ש
נ
י
ם
 
ב
א
ו
ת
 
ש
ב
ע
 
ג
ד
ו
ל
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ק
מ
ו
 
ש
ב
ע
 
ש
נ
י
 
ר
ע
ב
 
א
ח
ר
י
ה
ן
 
ו
נ
ש
כ
ח
 
כ
ל
 
ה
ש
ב
ע
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
כ
ל
ה
 
ה
ר
ע
ב
 
א
ת
 
ה
א
ר
ץ
 
ו
ל
א
 
י
ו
ד
ע
 
ה
ש
ב
ע
 
ב
א
ר
ץ
 
מ
פ
נ
י
 
ה
ר
ע
ב
 
ה
ה
ו
א
 
ו
א
ח
ר
י
 
כ
ן
 
כ
י
 
כ
ב
ד
 
ה
ו
א
 
מ
א
ד
 
ו
ע
ל
ה
 
ש
נ
י
ת
 
ה
ח
ל
ו
ם
 
א
ל
 
פ
ר
ע
ה
 
פ
ע
מ
י
ם
 
כ
י
 
נ
כ
ו
ן
 
ה
ד
ב
ר
 
מ
ע
ם
 
ה
א
ל
ה
י
ם
 
ו
מ
מ
ה
ר
 
ה
א
ל
ה
י
ם
 
ל
ע
ש
ו
ת
ו
 
ו
ע
ת
ה
 
י
ר
א
ה
 
ל
ו
 
פ
ר
ע
ה
 
א
י
ש
 
נ
ב
ו
ן
 
ו
ח
כ
ו
ם
 
ו
י
ש
ת
ה
ו
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ע
ש
 
פ
ר
ע
ה
 
ו
י
פ
ק
ד
 
פ
ק
ד
י
ם
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ח
מ
ש
 
א
ת
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
ש
ב
ע
 
ש
נ
י
 
ה
ש
ב
ע
 
ו
י
ק
ב
ץ
 
א
ת
 
כ
ל
 
ה
א
כ
ל
 
ש
ב
ע
 
ה
ש
נ
י
ם
 
ה
ט
ו
ב
ו
ת
 
ה
ב
א
ו
ת
 
ה
א
ל
ה
 
ו
י
צ
ב
ר
ו
 
ב
ר
 
ת
ח
ת
 
י
ד
 
פ
ר
ע
ה
 
א
כ
ל
 
ב
ע
ר
י
ם
 
ו
י
ש
מ
ר
ו
 
ו
ה
י
ה
 
ה
א
כ
ל
 
ל
פ
ק
ד
ו
ן
 
ל
א
ר
ץ
 
ל
ש
ב
ע
 
ש
נ
י
 
ה
ר
ע
ב
 
א
ש
ר
 
ת
ה
י
נ
ה
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ל
א
 
ת
כ
ר
ת
 
ה
א
ר
ץ
 
ב
ר
ע
ב
 
ו
י
י
ט
ב
 
ה
ד
ב
ר
 
ב
ע
י
נ
י
 
פ
ר
ע
ה
 
ו
ב
ע
י
נ
י
 
כ
ל
 
ע
ב
ד
י
ו
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
ע
ב
ד
י
ו
 
ה
נ
מ
צ
א
 
כ
ז
ה
 
א
י
ש
 
א
ש
ר
 
ר
ו
ח
 
א
ל
ה
י
ם
 
ב
ו
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ו
ס
ף
 
א
ח
ר
י
 
ה
ו
ד
י
ע
 
א
ל
ה
י
ם
 
א
ת
ך
 
א
ת
 
כ
ל
 
ז
א
ת
 
א
י
ן
 
נ
ב
ו
ן
 
ו
ח
כ
ו
ם
 
כ
מ
ו
ך
 
א
ת
ה
 
ת
ה
י
ה
 
ע
ל
 
ב
י
ת
י
 
ו
ע
ל
 
פ
י
ך
 
י
ש
ק
 
כ
ל
 
ע
מ
י
 
ר
ק
 
ה
כ
ס
א
 
א
ג
ד
ל
 
מ
מ
ך
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ו
ס
ף
 
ר
א
ה
 
נ
ת
ת
י
 
א
ת
ך
 
ע
ל
 
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ס
ר
 
פ
ר
ע
ה
 
א
ת
 
ט
ב
ע
ת
ו
 
מ
ע
ל
 
י
ד
ו
 
ו
י
ת
ן
 
א
ת
ה
 
ע
ל
 
י
ד
 
י
ו
ס
ף
 
ו
י
ל
ב
ש
 
א
ת
ו
 
ב
ג
ד
י
 
ש
ש
 
ו
י
ש
ם
 
ר
ב
י
ד
 
ז
ה
ב
 
ע
ל
 
צ
ו
א
ר
ו
 
ו
י
ר
כ
ב
 
א
ת
ו
 
ב
מ
ר
כ
ב
ת
 
ה
מ
ש
נ
ה
 
א
ש
ר
 
ל
ו
 
ו
י
ק
ר
א
 
ל
פ
נ
י
ו
 
א
ב
ר
ך
 
ו
נ
ת
ן
 
א
ת
ו
 
ע
ל
 
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ו
ס
ף
 
א
נ
י
 
פ
ר
ע
ה
 
ו
ב
ל
ע
ד
י
ך
 
ל
א
 
י
ר
י
ם
 
א
י
ש
 
א
ת
 
י
ד
ו
 
ו
א
ת
 
ר
ג
ל
ו
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ק
ר
א
 
פ
ר
ע
ה
 
ש
ם
 
י
ו
ס
ף
 
צ
פ
י
נ
ת
י
 
פ
ע
נ
ה
 
ו
י
ת
ן
 
ל
ו
 
א
ת
 
א
ס
נ
ת
 
ב
ת
 
פ
ו
ט
י
פ
ר
ע
 
כ
ה
ן
 
א
ן
 
ל
א
ש
ה
 
ו
י
צ
א
 
י
ו
ס
ף
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ו
ס
ף
 
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ב
ע
מ
ד
ו
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
י
צ
א
 
י
ו
ס
ף
 
מ
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ע
ב
ר
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ת
ע
ש
 
ה
א
ר
ץ
 
ב
ש
ב
ע
 
ש
נ
י
 
ה
ש
ב
ע
 
ל
ק
מ
צ
י
ם
 
ו
י
ק
ב
ץ
 
א
ת
 
כ
ל
 
ה
א
כ
ל
 
ש
ב
ע
 
ה
ש
נ
י
ם
 
א
ש
ר
 
ה
י
ה
 
ה
ש
ב
ע
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ת
ן
 
א
כ
ל
 
ב
ע
ר
י
ם
 
א
כ
ל
 
ש
ד
ה
 
ה
ע
י
ר
 
א
ש
ר
 
ס
ב
י
ב
ת
י
ה
 
נ
ת
ן
 
ב
ת
ו
כ
ה
 
ו
י
צ
ב
ר
 
י
ו
ס
ף
 
ב
ר
 
כ
ח
ו
ל
 
ה
י
ם
 
ה
ר
ב
ה
 
מ
א
ד
 
ע
ד
 
כ
י
 
ח
ד
ל
 
ל
ס
פ
ר
 
כ
י
 
א
י
ן
 
מ
ס
פ
ר
 
ו
ל
י
ו
ס
ף
 
י
ל
ד
ו
 
ש
נ
י
 
ב
נ
י
ם
 
ב
ט
ר
ם
 
ת
ב
ו
א
 
ש
נ
ת
 
ה
ר
ע
ב
 
א
ש
ר
 
י
ל
ד
ה
 
ל
ו
 
א
ס
נ
ת
 
ב
ת
 
פ
ו
ט
י
פ
ר
ע
 
כ
ה
נ
א
ן
 
ו
י
ק
ר
א
 
י
ו
ס
ף
 
ש
ם
 
ה
ב
כ
ו
ר
 
מ
נ
ש
ה
 
כ
י
 
נ
ש
נ
י
 
א
ל
ה
י
ם
 
א
ת
 
ע
מ
ל
י
 
ו
א
ת
 
כ
ל
 
ב
י
ת
 
א
ב
י
 
ו
א
ת
 
ש
ם
 
ה
ש
נ
י
 
ק
ר
א
 
א
פ
ר
י
ם
 
כ
י
 
ה
פ
ר
נ
י
 
א
ל
ה
י
ם
 
ב
א
ר
ץ
 
ע
נ
י
י
 
ו
ת
כ
ל
נ
ה
 
ש
ב
ע
 
ש
נ
י
 
ה
ש
ב
ע
 
א
ש
ר
 
ה
י
ו
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ת
ח
ל
נ
ה
 
ש
ב
ע
 
ש
נ
י
 
ה
ר
ע
ב
 
ל
ב
ו
א
 
כ
א
ש
ר
 
א
מ
ר
 
י
ו
ס
ף
 
ו
י
ה
י
 
ה
ר
ע
ב
 
ב
כ
ל
 
ה
א
ר
צ
ו
ת
 
ו
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ה
י
ה
 
ל
ח
ם
 
ו
ת
ר
ע
ב
 
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
צ
ע
ק
 
ה
ע
ם
 
א
ל
 
פ
ר
ע
ה
 
ל
ל
ח
ם
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
ל
כ
ל
 
מ
צ
ר
י
ם
 
ל
כ
ו
 
א
ל
 
י
ו
ס
ף
 
ו
א
ש
ר
 
י
א
מ
ר
 
ל
כ
ם
 
ת
ע
ש
ו
ן
 
ו
ה
ר
ע
ב
 
ה
י
ה
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
ו
י
פ
ת
ח
 
י
ו
ס
ף
 
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ה
ם
 
ב
ר
 
ו
י
ש
ב
ר
 
ל
מ
צ
ר
י
ם
 
ו
י
ח
ז
ק
 
ה
ר
ע
ב
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
כ
ל
 
ה
א
ר
צ
ו
ת
 
ב
א
ו
 
מ
צ
ר
י
מ
ה
 
ל
ש
ב
ר
 
א
ל
 
י
ו
ס
ף
 
כ
י
 
ח
ז
ק
 
ה
ר
ע
ב
 
ב
כ
ל
 
ה
א
ר
ץ
 
ו
י
ר
א
 
י
ע
ק
ב
 
כ
י
 
י
ש
 
ש
ב
ר
 
ב
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
ב
נ
י
ו
 
ל
מ
ה
 
ת
ת
י
ר
א
ו
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ש
מ
ע
ת
י
 
כ
י
 
י
ש
 
ש
ב
ר
 
ב
מ
צ
ר
י
ם
 
ר
ד
ו
 
ש
ם
 
ו
ש
ב
ר
ו
 
ל
נ
ו
 
מ
ש
ם
 
ו
נ
ח
י
ה
 
ו
ל
א
 
נ
מ
ו
ת
 
ו
י
ר
ד
ו
 
א
ח
י
 
י
ו
ס
ף
 
ע
ש
ר
ה
 
ל
ש
ב
ר
 
ב
ר
 
מ
מ
צ
ר
י
ם
 
ו
א
ת
 
ב
נ
י
מ
י
ם
 
א
ח
י
 
י
ו
ס
ף
 
ל
א
 
ש
ל
ח
 
י
ע
ק
ב
 
א
ת
 
א
ח
י
ו
 
כ
י
 
א
מ
ר
 
פ
ן
 
י
ק
ר
א
נ
ו
 
א
ס
ו
ן
 
ו
י
ב
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ש
ב
ר
 
ב
ת
ו
ך
 
ה
ב
א
י
ם
 
כ
י
 
ה
י
ה
 
ה
ר
ע
ב
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ו
ס
ף
 
ה
ו
א
 
ה
ש
ל
י
ט
 
ע
ל
 
ה
א
ר
ץ
 
ו
ה
ו
א
 
ה
מ
ש
ב
י
ר
 
ל
כ
ל
 
ע
ם
 
ה
א
ר
ץ
 
ו
י
ב
א
ו
 
א
ח
י
 
י
ו
ס
ף
 
ו
י
ש
ת
ח
ו
ו
 
ל
ו
 
א
פ
י
ם
 
א
ר
צ
ה
 
ו
י
ר
א
 
י
ו
ס
ף
 
א
ת
 
א
ח
י
ו
 
ו
י
כ
ר
ם
 
ו
י
ת
נ
כ
ר
 
א
ל
י
ה
ם
 
ו
י
ד
ב
ר
 
א
ת
ם
 
ק
ש
ו
ת
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
א
י
ן
 
ב
א
ת
ם
 
ו
י
א
מ
ר
ו
 
מ
א
ר
ץ
 
כ
נ
ע
ן
 
ל
ש
ב
ר
 
א
כ
ל
 
ו
י
כ
ר
 
י
ו
ס
ף
 
א
ת
 
א
ח
י
ו
 
ו
ה
ם
 
ל
א
 
ה
כ
ר
ה
ו
 
ו
י
ז
כ
ר
 
י
ו
ס
ף
 
א
ת
 
ה
ח
ל
מ
ו
ת
 
א
ש
ר
 
ח
ל
ם
 
ל
ה
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
ר
ג
ל
י
ם
 
א
ת
ם
 
ל
ר
א
ו
ת
 
א
ת
 
ע
ר
ו
ת
 
ה
א
ר
ץ
 
ב
א
ת
ם
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
ל
א
 
א
ד
נ
י
 
ו
ע
ב
ד
י
ך
 
ב
א
ו
 
ל
ש
ב
ר
 
א
כ
ל
 
כ
ל
נ
ו
 
ב
נ
י
 
א
י
ש
 
א
ח
ד
 
א
נ
ח
נ
ו
 
כ
נ
י
ם
 
א
נ
ח
נ
ו
 
ל
א
 
ה
י
ו
 
ע
ב
ד
י
ך
 
מ
ר
ג
ל
י
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ל
א
 
כ
י
 
ע
ר
ו
ת
 
ה
א
ר
ץ
 
ב
א
ת
ם
 
ל
ר
א
ו
ת
 
ו
י
א
מ
ר
ו
 
ש
נ
י
ם
 
ע
ש
ר
 
ע
ב
ד
י
ך
 
א
ח
י
ם
 
א
נ
ח
נ
ו
 
ב
נ
י
 
א
י
ש
 
א
ח
ד
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ה
נ
ה
 
ה
ק
ט
ן
 
א
ת
 
א
ב
י
נ
ו
 
ה
י
ו
ם
 
ו
ה
א
ח
ד
 
א
י
נ
נ
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ו
ס
ף
 
ה
ו
א
 
א
ש
ר
 
ד
ב
ר
ת
י
 
א
ל
י
כ
ם
 
ל
א
מ
ר
 
מ
ר
ג
ל
י
ם
 
א
ת
ם
 
ב
ז
א
ת
 
ת
ב
ח
נ
ו
 
ח
י
 
פ
ר
ע
ה
 
א
ם
 
ת
צ
א
ו
 
מ
ז
ה
 
כ
י
 
א
ם
 
ב
ב
ו
א
 
א
ח
י
כ
ם
 
ה
ק
ט
ן
 
ה
נ
ה
 
ש
ל
ח
ו
 
מ
כ
ם
 
א
ח
ד
 
ו
י
ק
ח
 
א
ת
 
א
ח
י
כ
ם
 
ו
א
ת
ם
 
ה
א
ס
ר
ו
 
ו
י
ב
ח
נ
ו
 
ד
ב
ר
י
כ
ם
 
ה
א
מ
ת
 
א
ת
כ
ם
 
ו
א
ם
 
ל
א
 
ח
י
 
פ
ר
ע
ה
 
כ
י
 
מ
ר
ג
ל
י
ם
 
א
ת
ם
 
ו
י
א
מ
ר
ו
 
ל
א
 
י
ו
כ
ל
 
ה
נ
ע
ר
 
ל
ע
ז
ב
 
א
ת
 
א
ב
י
ו
 
ו
ע
ז
ב
 
א
ת
 
א
ב
י
ו
 
ו
מ
ת
 
ו
י
א
ס
ף
 
א
ת
ם
 
א
ל
 
מ
ש
מ
ר
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ו
ס
ף
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ז
א
ת
 
ע
ש
ו
 
ו
ח
י
ו
 
א
ת
 
ה
א
ל
ה
י
ם
 
א
נ
י
 
י
ר
א
 
א
ם
 
כ
נ
י
ם
 
א
ת
ם
 
א
ח
י
כ
ם
 
ה
א
ח
ד
 
י
א
ס
ר
 
ב
ב
י
ת
 
מ
ש
מ
ר
כ
ם
 
ו
א
ת
ם
 
ל
כ
ו
 
ו
ה
ב
י
א
ו
 
א
ת
 
ש
ב
ר
 
ר
ע
ב
ו
ן
 
ב
ת
י
כ
ם
 
ו
א
ת
 
א
ח
י
כ
ם
 
ה
ק
ט
ן
 
ת
ב
י
א
ו
ן
 
א
ל
י
 
ו
י
א
מ
נ
ו
 
ד
ב
ר
י
כ
ם
 
ו
ל
א
 
ת
מ
ו
ת
ו
ן
 
ו
י
ע
ש
ו
 
כ
ן
 
ו
י
א
מ
ר
ו
 
א
י
ש
 
א
ל
 
א
ח
י
ו
 
א
ב
ל
 
א
ש
מ
י
ם
 
א
נ
ח
נ
ו
 
ע
ל
 
א
ח
י
נ
ו
 
א
ש
ר
 
ר
א
י
נ
ו
 
ב
צ
ר
ת
 
נ
פ
ש
ו
 
ב
ה
ת
ח
נ
נ
ו
 
א
ל
י
נ
ו
 
ו
ל
א
 
ש
מ
ע
נ
ו
 
ע
ל
 
כ
ן
 
ב
א
ה
 
ע
ל
י
נ
ו
 
כ
ל
 
ה
צ
ר
ה
 
ה
ז
א
ת
 
ו
י
ע
ן
 
ר
א
ו
ב
ן
 
א
ת
ם
 
ל
א
מ
ר
 
ה
ל
ו
א
 
ד
ב
ר
ת
י
 
א
ל
י
כ
ם
 
ל
א
מ
ר
 
א
ל
 
ת
ח
ט
א
ו
 
ב
י
ל
ד
 
ו
ל
א
 
ש
מ
ע
ת
י
ם
 
ו
ג
ם
 
ד
מ
ו
 
ה
נ
ה
 
נ
ד
ר
ש
 
ו
ה
ם
 
ל
א
 
י
ד
ע
ו
 
כ
י
 
ש
מ
ע
 
י
ו
ס
ף
 
כ
י
 
ה
מ
ל
י
ץ
 
ב
י
נ
ת
ם
 
ו
י
ס
ב
 
מ
ע
ל
י
ה
ם
 
ו
י
ב
ך
 
ו
י
ש
ב
 
א
ל
י
ה
ם
 
ו
י
ד
ב
ר
 
א
ל
י
ה
ם
 
ו
י
ק
ח
 
מ
א
ת
ם
 
א
ת
 
ש
מ
ע
ו
ן
 
ו
י
א
ס
ר
 
א
ת
ו
 
ל
ע
י
נ
י
ה
ם
 
ו
י
צ
ו
 
י
ו
ס
ף
 
ו
י
מ
ל
א
ו
 
א
ת
 
כ
ל
י
ה
ם
 
ב
ר
 
ו
ל
ה
ש
י
ב
 
א
ת
 
כ
ס
פ
י
ה
ם
 
א
י
ש
 
ע
ל
 
ש
ק
ו
 
ו
ל
ת
ת
 
ל
ה
ם
 
צ
ד
ה
 
ל
ד
ר
ך
 
ו
י
ע
ש
 
ל
ה
ם
 
כ
ן
 
ו
י
ש
א
ו
 
א
ת
 
ש
ב
ר
ם
 
ע
ל
 
ח
מ
ר
י
ה
ם
 
ו
י
ל
כ
ו
 
מ
ש
ם
 
ו
י
פ
ת
ח
 
א
ח
ד
 
א
ת
 
ש
ק
ו
 
ל
ת
ת
 
מ
ס
פ
ה
 
ל
ח
מ
ר
ו
 
ב
מ
ל
ו
ן
 
ו
י
ר
א
 
א
ת
 
כ
ס
פ
ו
 
ו
ה
נ
ה
 
ה
ו
א
 
ב
פ
י
 
א
מ
ת
ח
ת
ו
 
ו
י
א
מ
ר
 
א
ל
 
א
ח
י
ו
 
ה
ו
ש
ב
 
כ
ס
פ
י
 
ו
ג
ם
 
ה
נ
ה
 
ה
ו
א
 
ב
א
מ
ת
ח
ת
י
 
ו
י
צ
א
 
ל
ב
ם
 
ו
י
ח
ר
ד
ו
 
א
י
ש
 
ע
ל
 
א
ח
י
ו
 
ל
א
מ
ר
 
מ
ה
 
ז
א
ת
 
ע
ש
ה
 
א
ל
ה
י
ם
 
ל
נ
ו
 
ו
י
ב
א
ו
 
א
ל
 
י
ע
ק
ב
 
א
ב
י
ה
ם
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
י
ג
ד
ו
 
ל
ו
 
א
ת
 
כ
ל
 
ה
ק
ר
ו
ת
 
א
ת
ם
 
ל
א
מ
ר
 
ד
ב
ר
 
ה
א
י
ש
 
א
ד
נ
י
 
ה
א
ר
ץ
 
א
ת
נ
ו
 
ק
ש
ו
ת
 
ו
י
ת
ן
 
א
ת
נ
ו
 
כ
מ
ר
ג
ל
י
ם
 
א
ת
 
ה
א
ר
ץ
 
ו
נ
א
מ
ר
 
א
ל
י
ו
 
כ
נ
י
ם
 
א
נ
ח
נ
ו
 
ל
א
 
ה
י
י
נ
ו
 
מ
ר
ג
ל
י
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
א
ח
י
ם
 
א
נ
ח
נ
ו
 
ב
נ
י
 
א
ב
י
נ
ו
 
ו
ה
א
ח
ד
 
א
י
נ
נ
ו
 
ו
ה
ק
ט
ן
 
ה
י
ו
ם
 
א
ת
 
א
ב
י
נ
ו
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
א
מ
ר
 
א
ל
י
נ
ו
 
ה
א
י
ש
 
א
ד
נ
י
 
ה
א
ר
ץ
 
ב
ז
א
ת
 
א
ד
ע
 
כ
י
 
כ
נ
י
ם
 
א
ת
ם
 
א
ח
י
כ
ם
 
ה
א
ח
ד
 
ה
נ
י
ח
ו
 
א
ת
י
 
ו
א
ת
 
ר
ע
ב
ו
ן
 
ב
ת
י
כ
ם
 
ק
ח
ו
 
ו
ל
כ
ו
 
ו
ה
ב
י
א
ו
 
א
ת
 
א
ח
י
כ
ם
 
ה
ק
ט
ן
 
א
ל
י
 
ו
א
ד
ע
ה
 
כ
י
 
ל
א
 
מ
ר
ג
ל
י
ם
 
א
ת
ם
 
כ
י
 
כ
נ
י
ם
 
א
ת
ם
 
א
ת
 
א
ח
י
כ
ם
 
א
ת
ן
 
ל
כ
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
ת
ס
ח
ר
ו
 
ו
י
ה
י
ו
 
ה
ם
 
מ
ר
י
ק
י
ם
 
ש
ק
י
ה
ם
 
ו
ה
נ
ה
 
א
י
ש
 
צ
ר
ו
ר
 
כ
ס
פ
ו
 
ב
ש
ק
ו
 
ו
י
ר
א
ו
 
א
ת
 
צ
ר
ר
ו
ת
 
כ
ס
פ
י
ה
ם
 
ה
ם
 
ו
א
ב
י
ה
ם
 
ו
י
י
ר
א
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ע
ק
ב
 
א
ב
י
ה
ם
 
א
ת
י
 
ש
כ
ל
ת
ם
 
י
ו
ס
ף
 
א
י
נ
נ
ו
 
ו
ש
מ
ע
ו
ן
 
א
י
נ
נ
ו
 
ו
א
ת
 
ב
נ
י
מ
י
ם
 
ת
ק
ח
ו
 
ע
ל
י
 
ה
י
ו
 
כ
ל
נ
ה
 
ו
י
א
מ
ר
 
ר
א
ו
ב
ן
 
א
ל
 
א
ב
י
ו
 
ל
א
מ
ר
 
א
ת
 
ש
נ
י
 
ב
נ
י
 
ת
מ
י
ת
 
א
ם
 
ל
א
 
א
ב
י
א
נ
ו
 
א
ל
י
ך
 
ת
נ
ה
 
א
ת
ו
 
ע
ל
 
י
ד
י
 
ו
א
נ
י
 
א
ש
י
ב
נ
ו
 
א
ל
י
ך
 
ו
י
א
מ
ר
 
ל
א
 
י
ר
ד
 
ב
נ
י
 
ע
מ
כ
ם
 
כ
י
 
א
ח
י
ו
 
מ
ת
 
ו
ה
ו
א
 
ל
ב
ד
ו
 
נ
ש
א
ר
 
ו
ק
ר
א
ה
ו
 
א
ס
ו
ן
 
ב
ד
ר
ך
 
א
ש
ר
 
ת
ל
כ
ו
 
ב
ה
 
ו
ה
ו
ר
ד
ת
ם
 
א
ת
 
ש
י
ב
ת
י
 
ב
י
ג
ו
ן
 
ש
א
ל
ה
 
ו
ה
ר
ע
ב
 
כ
ב
ד
 
ב
א
ר
ץ
 
ו
י
ה
י
 
כ
א
ש
ר
 
כ
ל
ו
 
ל
א
כ
ל
 
א
ת
 
ה
ש
ב
ר
 
א
ש
ר
 
ה
ב
י
א
ו
 
מ
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
ב
י
ה
ם
 
ש
ו
ב
ו
 
ו
ש
ב
ר
ו
 
ל
נ
ו
 
מ
ע
ט
 
א
כ
ל
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
י
ה
ו
ד
ה
 
ל
א
מ
ר
 
ה
ע
ד
 
ה
ע
ד
 
ב
נ
ו
 
ה
א
י
ש
 
ל
א
מ
ר
 
ל
א
 
ת
ר
א
ו
 
פ
נ
י
 
ב
ל
ת
י
 
א
ח
י
כ
ם
 
א
ת
כ
ם
 
א
ם
 
י
ש
ך
 
מ
ש
ל
ח
 
א
ת
 
א
ח
י
נ
ו
 
א
ת
נ
ו
 
נ
ר
ד
ה
 
ו
נ
ש
ב
ר
ה
 
ל
ך
 
א
כ
ל
 
ו
א
ם
 
א
י
נ
ך
 
מ
ש
ל
ח
 
ל
א
 
נ
ר
ד
 
כ
י
 
ה
א
י
ש
 
א
מ
ר
 
א
ל
י
נ
ו
 
ל
א
 
ת
ר
א
ו
 
פ
נ
י
 
ב
ל
ת
י
 
א
ח
י
כ
ם
 
א
ת
כ
ם
 
ו
י
א
מ
ר
 
י
ש
ר
א
ל
 
ל
מ
ה
 
ה
ר
ע
ת
ם
 
ל
י
 
ל
ה
ג
י
ד
 
ל
א
י
ש
 
ה
ע
ו
ד
 
ל
כ
ם
 
א
ח
 
ו
י
א
מ
ר
ו
 
ש
א
ל
 
ש
א
ל
 
ה
א
י
ש
 
ל
נ
ו
 
ו
ל
מ
ו
ל
ד
ת
נ
ו
 
ל
א
מ
ר
 
ה
ע
ו
ד
 
א
ב
י
כ
ם
 
ח
י
 
ה
י
ש
 
ל
כ
ם
 
א
ח
 
ו
נ
ג
י
ד
 
ל
ו
 
ע
ל
 
פ
י
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ה
י
ו
ד
ע
 
נ
ד
ע
 
כ
י
 
י
א
מ
ר
 
ה
ו
ר
י
ד
ו
 
א
ת
 
א
ח
י
כ
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
א
ל
 
י
ש
ר
א
ל
 
א
ב
י
ו
 
ש
ל
ח
 
ה
נ
ע
ר
 
א
ת
י
 
ו
נ
ק
ו
מ
ה
 
ו
נ
ל
כ
ה
 
ו
נ
ח
י
ה
 
ו
ל
א
 
נ
מ
ו
ת
 
ג
ם
 
א
נ
ח
נ
ו
 
ג
ם
 
א
ת
ה
 
ג
ם
 
ט
פ
נ
ו
 
א
נ
כ
י
 
א
ע
ר
ב
נ
ו
 
מ
י
ד
י
 
ת
ב
ק
ש
נ
ו
 
א
ם
 
ל
א
 
ה
ב
א
ת
י
ו
 
א
ל
י
ך
 
ו
ה
צ
ג
ת
י
ו
 
ל
פ
נ
י
ך
 
ו
ח
ט
א
ת
י
 
ל
ך
 
כ
ל
 
ה
י
מ
י
ם
 
כ
י
 
ל
ו
 
ל
א
 
ה
ת
מ
ה
מ
נ
ו
 
כ
י
 
ע
ת
ה
 
ש
ב
נ
ו
 
ז
ה
 
פ
ע
מ
י
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ש
ר
א
ל
 
א
ב
י
ה
ם
 
א
ם
 
כ
ן
 
א
פ
ו
א
 
ז
א
ת
 
ע
ש
ו
 
ק
ח
ו
 
מ
ז
מ
ר
ת
 
ה
א
ר
ץ
 
ב
כ
ל
י
כ
ם
 
ו
ה
ו
ר
י
ד
ו
 
ל
א
י
ש
 
מ
נ
ח
ה
 
מ
ע
ט
 
צ
ר
י
 
ו
מ
ע
ט
 
ד
ב
ש
 
נ
כ
א
ת
 
ו
ל
ו
ט
 
ב
ט
נ
י
ם
 
ו
ש
ק
י
ד
י
ם
 
ו
כ
ס
ף
 
מ
ש
נ
ה
 
ק
ח
ו
 
ב
י
ד
כ
ם
 
ו
א
ת
 
ה
כ
ס
ף
 
ה
מ
ו
ש
ב
 
ב
פ
י
 
א
מ
ת
ח
ת
י
כ
ם
 
ת
ש
י
ב
ו
 
ב
י
ד
י
כ
ם
 
א
ו
ל
י
 
מ
ש
ג
ה
 
ה
י
א
 
ו
א
ת
 
א
ח
י
כ
ם
 
ק
ח
ו
 
ו
ק
ו
מ
ו
 
ו
ש
ו
ב
ו
 
א
ל
 
ה
א
י
ש
 
ו
א
ל
 
ש
ד
י
 
י
ת
ן
 
ל
כ
ם
 
ר
ח
מ
י
ם
 
ל
פ
נ
י
 
ה
א
י
ש
 
ו
ש
ל
ח
 
ל
כ
ם
 
א
ת
 
א
ח
י
כ
ם
 
ה
א
ח
ד
 
ו
א
ת
 
ב
נ
י
מ
י
ם
 
ו
א
נ
י
 
כ
א
ש
ר
 
ש
כ
ל
ת
י
 
ש
כ
ל
ת
י
 
ו
י
ק
ח
ו
 
ה
א
נ
ש
י
ם
 
א
ת
 
ה
מ
נ
ח
ה
 
ה
ז
א
ת
 
ו
מ
ש
נ
ה
 
כ
ס
ף
 
ל
ק
ח
ו
 
ב
י
ד
ם
 
ו
א
ת
 
ב
נ
י
מ
י
ם
 
ו
י
ק
מ
ו
 
ו
י
ר
ד
ו
 
מ
צ
ר
י
מ
ה
 
ו
י
ע
מ
ד
ו
 
ל
פ
נ
י
 
י
ו
ס
ף
 
ו
י
ר
א
 
י
ו
ס
ף
 
א
ת
ם
 
ו
א
ת
 
ב
נ
י
מ
י
ם
 
ו
י
א
מ
ר
 
ל
א
ש
ר
 
ע
ל
 
ב
י
ת
ו
 
ה
ב
א
 
א
ת
 
ה
א
נ
ש
י
ם
 
ה
ב
י
ת
ה
 
ו
ט
ב
ח
 
ט
ב
ח
 
ו
ה
כ
ן
 
כ
י
 
א
ת
י
 
י
א
כ
ל
ו
 
ה
א
נ
ש
י
ם
 
ב
צ
ה
ר
י
ם
 
ו
י
ע
ש
 
ה
א
י
ש
 
כ
א
ש
ר
 
א
מ
ר
 
י
ו
ס
ף
 
ו
י
ב
א
 
ה
א
י
ש
 
א
ת
 
ה
א
נ
ש
י
ם
 
ב
י
ת
ה
 
י
ו
ס
ף
 
ו
י
י
ר
א
ו
 
ה
א
נ
ש
י
ם
 
כ
י
 
ה
ו
ב
א
ו
 
ב
י
ת
ה
 
י
ו
ס
ף
 
ו
י
א
מ
ר
ו
 
ע
ל
 
ד
ב
ר
 
ה
כ
ס
ף
 
ה
מ
ו
ש
ב
 
ב
א
מ
ת
ח
ת
י
נ
ו
 
ב
ת
ח
ל
ה
 
א
נ
ח
נ
ו
 
מ
ו
ב
א
י
ם
 
ל
ה
ת
ג
ל
ל
 
ע
ל
י
נ
ו
 
ו
ל
ה
ת
נ
פ
ל
 
ע
ל
י
נ
ו
 
ל
ק
ח
ת
 
א
ת
נ
ו
 
ל
ע
ב
ד
י
ם
 
ו
א
ת
 
ח
מ
ר
י
נ
ו
 
ו
י
ג
ש
ו
 
א
ל
 
ה
א
י
ש
 
א
ש
ר
 
ע
ל
 
ב
י
ת
 
י
ו
ס
ף
 
ו
י
ד
ב
ר
ו
 
א
ל
י
ו
 
פ
ת
ח
 
ה
ב
י
ת
 
ו
י
א
מ
ר
ו
 
ב
י
 
א
ד
נ
י
 
י
ר
ד
 
י
ר
ד
נ
ו
 
ב
ת
ח
ל
ה
 
ל
ש
ב
ר
 
א
כ
ל
 
ו
י
ה
י
 
כ
י
 
ב
א
נ
ו
 
א
ל
 
ה
מ
ל
ו
ן
 
ו
נ
פ
ת
ח
 
א
ת
 
א
מ
ת
ח
ת
י
נ
ו
 
ו
ה
נ
ה
 
כ
ס
ף
 
א
י
ש
 
ב
פ
י
 
א
מ
ת
ח
ת
ו
 
כ
ס
פ
נ
ו
 
ב
מ
ש
ק
ל
ו
 
ו
נ
ש
י
ב
 
א
ת
ו
 
ב
י
ד
נ
ו
 
ו
כ
ס
ף
 
א
ח
ר
 
ל
ק
ח
נ
ו
 
ב
י
ד
נ
ו
 
ל
ש
ב
ר
 
א
כ
ל
 
ל
א
 
י
ד
ע
נ
ו
 
מ
י
 
ש
ם
 
כ
ס
פ
נ
ו
 
ב
א
מ
ת
ח
ת
י
נ
ו
 
ו
י
א
מ
ר
 
ש
ל
ו
ם
 
ל
כ
ם
 
א
ל
 
ת
י
ר
א
ו
 
א
ל
ה
י
כ
ם
 
ו
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
נ
ת
ן
 
ל
כ
ם
 
מ
ט
מ
ו
ן
 
ב
א
מ
ת
ח
ת
י
כ
ם
 
כ
ס
פ
כ
ם
 
ב
א
 
א
ל
י
 
ו
י
ו
צ
א
 
א
ל
י
ה
ם
 
א
ת
 
ש
מ
ע
ו
ן
 
ו
י
ב
א
 
ה
א
י
ש
 
א
ת
 
ה
א
נ
ש
י
ם
 
ב
י
ת
ה
 
י
ו
ס
ף
 
ו
י
ת
ן
 
מ
י
ם
 
ו
י
ר
ח
צ
ו
 
ר
ג
ל
י
ה
ם
 
ו
י
ת
ן
 
מ
ס
פ
ה
 
ל
ח
מ
ר
י
ה
ם
 
ו
י
כ
י
נ
ו
 
א
ת
 
ה
מ
נ
ח
ה
 
ע
ד
 
ב
א
 
י
ו
ס
ף
 
ב
צ
ה
ר
י
ם
 
כ
י
 
ש
מ
ע
ו
 
כ
י
 
ש
ם
 
י
א
כ
ל
ו
 
ל
ח
ם
 
ו
י
ב
א
 
י
ו
ס
ף
 
ה
ב
י
ת
ה
 
ו
י
ב
י
א
ו
 
ל
ו
 
א
ת
 
ה
מ
נ
ח
ה
 
א
ש
ר
 
ב
י
ד
ם
 
ה
ב
י
ת
ה
 
ו
י
ש
ת
ח
ו
ו
 
ל
ו
 
א
ר
צ
ה
 
ו
י
ש
א
ל
 
ל
ה
ם
 
ל
ש
ל
ו
ם
 
ו
י
א
מ
ר
 
ה
ש
ל
ו
ם
 
א
ב
י
כ
ם
 
ה
ז
ק
ן
 
א
ש
ר
 
א
מ
ר
ת
ם
 
ע
ו
ד
נ
ו
 
ח
י
 
ו
י
א
מ
ר
ו
 
ש
ל
ו
ם
 
ל
ע
ב
ד
ך
 
ל
א
ב
י
נ
ו
 
ע
ו
ד
נ
ו
 
ח
י
 
ו
י
א
מ
ר
 
ב
ר
ו
ך
 
ה
א
י
ש
 
ה
ה
ו
א
 
ל
א
ל
ה
י
ם
 
ו
י
ק
ד
ו
 
ו
י
ש
ת
ח
ו
ו
 
ו
י
ש
א
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
א
ת
 
ב
נ
י
מ
י
ם
 
א
ח
י
ו
 
ב
ן
 
א
מ
ו
 
ו
י
א
מ
ר
 
ה
ז
ה
 
א
ח
י
כ
ם
 
ה
ק
ט
ן
 
א
ש
ר
 
א
מ
ר
ת
ם
 
א
ל
י
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
י
ח
נ
ך
 
ב
נ
י
 
ו
י
מ
ה
ר
 
י
ו
ס
ף
 
כ
י
 
נ
כ
מ
ר
ו
 
ר
ח
מ
י
ו
 
ע
ל
 
א
ח
י
ו
 
ו
י
ב
ק
ש
 
ל
ב
כ
ו
ת
 
ו
י
ב
א
 
ה
ח
ד
ר
ה
 
ו
י
ב
ך
 
ש
ם
 
ו
י
ר
ח
ץ
 
פ
נ
י
ו
 
ו
י
צ
א
 
ו
י
ת
א
פ
ק
 
ו
י
א
מ
ר
 
ש
י
מ
ו
 
ל
ח
ם
 
ו
י
ש
מ
ו
 
ל
ו
 
ל
ב
ד
ו
 
ו
ל
ה
ם
 
ל
ב
ד
ם
 
ו
ל
מ
צ
ר
י
ם
 
ה
א
כ
ל
י
ם
 
א
ת
ו
 
ל
ב
ד
ם
 
כ
י
 
ל
א
 
י
ו
כ
ל
ו
ן
 
ה
מ
צ
ר
י
ם
 
ל
א
כ
ל
 
א
ת
 
ה
ע
ב
ר
י
ם
 
ל
ח
ם
 
כ
י
 
ת
ו
ע
ב
ה
 
ה
י
א
 
ל
מ
צ
ר
י
ם
 
ו
י
ש
ב
ו
 
ל
פ
נ
י
ו
 
ה
ב
כ
ו
ר
 
כ
ב
כ
י
ר
ת
ו
 
ו
ה
צ
ע
י
ר
 
כ
צ
ע
י
ר
ת
ו
 
ו
י
ת
מ
ה
ו
 
ה
א
נ
ש
י
ם
 
א
י
ש
 
ע
ל
 
ר
ע
ה
ו
 
ו
י
ש
א
 
מ
ש
א
ת
 
מ
א
ת
 
פ
נ
י
ו
 
א
ל
י
ה
ם
 
ו
ת
ר
ב
 
מ
ש
א
ת
 
ב
נ
י
מ
י
ם
 
מ
מ
ש
א
ת
 
כ
ל
ם
 
ח
מ
ש
 
י
ד
ו
ת
 
ו
י
ש
ת
ו
 
ו
י
ש
כ
ר
ו
 
ע
מ
ו
 
ו
י
צ
ו
 
א
ת
 
א
ש
ר
 
ע
ל
 
ב
י
ת
ו
 
ל
א
מ
ר
 
מ
ל
א
 
א
ת
 
א
מ
ת
ח
ת
 
ה
א
נ
ש
י
ם
 
א
כ
ל
 
כ
א
ש
ר
 
י
ו
כ
ל
ו
ן
 
ש
א
ת
 
ו
ש
י
ם
 
כ
ס
ף
 
א
י
ש
 
ב
פ
י
 
א
מ
ת
ח
ת
ו
 
ו
א
ת
 
ג
ב
י
ע
 
ג
ב
י
ע
 
ה
כ
ס
ף
 
ת
ש
י
ם
 
ב
פ
י
 
א
מ
ת
ח
ת
 
ה
ק
ט
ן
 
ו
א
ת
 
כ
ס
ף
 
ש
ב
ר
ו
 
ו
י
ע
ש
 
כ
ד
ב
ר
 
י
ו
ס
ף
 
א
ש
ר
 
ד
ב
ר
 
ה
ב
ק
ר
 
א
ו
ר
 
ו
ה
א
נ
ש
י
ם
 
ש
ל
ח
ו
 
ה
ם
 
ו
ח
מ
ר
י
ה
ם
 
ה
ם
 
י
צ
א
ו
 
א
ת
 
ה
ע
י
ר
 
ל
א
 
ה
ר
ח
י
ק
ו
 
ו
י
ו
ס
ף
 
א
מ
ר
 
ל
א
ש
ר
 
ע
ל
 
ב
י
ת
ו
 
ק
ו
ם
 
ר
ד
ף
 
א
ח
ר
י
 
ה
א
נ
ש
י
ם
 
ו
ה
ש
ג
ת
ם
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ל
מ
ה
 
ש
ל
מ
ת
ם
 
ר
ע
ה
 
ת
ח
ת
 
ט
ו
ב
ה
 
ה
ל
ו
א
 
ז
ה
 
א
ש
ר
 
י
ש
ת
ה
 
א
ד
נ
י
 
ב
ו
 
ו
ה
ו
א
 
נ
ח
ש
 
י
נ
ח
ש
 
ב
ו
 
ה
ר
ע
ת
ם
 
א
ש
ר
 
ע
ש
י
ת
ם
 
ו
י
ש
ג
ם
 
ו
י
ד
ב
ר
 
א
ל
י
ה
ם
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
י
א
מ
ר
ו
 
ל
מ
ה
 
י
ד
ב
ר
 
א
ד
נ
י
 
כ
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ח
ל
י
ל
ה
 
ל
ע
ב
ד
י
ך
 
מ
ע
ש
ו
ת
 
כ
ד
ב
ר
 
ה
ז
ה
 
ה
ן
 
ה
כ
ס
ף
 
א
ש
ר
 
מ
צ
א
נ
ו
 
ב
פ
י
 
א
מ
ת
ח
ת
י
נ
ו
 
ה
ו
ש
ב
נ
ו
 
א
ל
י
ך
 
מ
א
ר
ץ
 
כ
נ
ע
ן
 
ו
א
י
ך
 
נ
ג
נ
ב
 
מ
ב
י
ת
 
א
ד
נ
י
ך
 
כ
ס
ף
 
א
ו
 
ז
ה
ב
 
א
ש
ר
 
י
מ
צ
א
 
א
ת
ו
 
מ
ע
ב
ד
י
ך
 
י
ו
מ
ת
 
ו
ג
ם
 
א
נ
ח
נ
ו
 
נ
ה
י
ה
 
ל
א
ד
נ
י
 
ל
ע
ב
ד
י
ם
 
ו
י
א
מ
ר
 
ג
ם
 
ע
ת
ה
 
כ
ד
ב
ר
י
כ
ם
 
כ
ן
 
ה
ו
א
 
א
ש
ר
 
י
מ
צ
א
 
א
ת
ו
 
י
ה
י
ה
 
ל
י
 
ע
ב
ד
 
ו
א
ת
ם
 
ת
ה
י
ו
 
נ
ק
ו
א
י
ם
 
ו
י
מ
ה
ר
ו
 
ו
י
ו
ר
י
ד
ו
 
א
י
ש
 
א
מ
ת
ח
ת
ו
 
א
ר
צ
ה
 
ו
י
פ
ת
ח
ו
 
א
י
ש
 
א
מ
ת
ח
ת
ו
 
ו
י
ח
פ
ש
 
ב
ג
ד
ו
ל
 
ה
ח
ל
 
ו
ב
ק
ט
ן
 
כ
ל
ה
 
ו
י
מ
צ
א
 
ה
ג
ב
י
ע
 
ב
א
מ
ת
ח
ת
 
ב
נ
י
מ
י
ם
 
ו
י
ק
ר
ע
ו
 
ש
מ
ל
ו
ת
ם
 
ו
י
ע
מ
ס
ו
 
א
י
ש
 
ע
ל
 
ח
מ
ו
ר
ו
 
ו
י
ש
ב
ו
 
ה
ע
י
ר
ה
 
ו
י
ב
א
 
י
ה
ו
ד
ה
 
ו
א
ח
י
ו
 
ב
י
ת
ה
 
י
ו
ס
ף
 
ו
ה
ו
א
 
ע
ו
ד
נ
ו
 
ש
ם
 
ו
י
פ
ל
ו
 
ל
פ
נ
י
ו
 
א
ר
צ
ה
 
ו
י
א
מ
ר
 
ל
ה
ם
 
י
ו
ס
ף
 
מ
ה
 
ה
מ
ע
ש
ה
 
ה
ז
ה
 
א
ש
ר
 
ע
ש
י
ת
ם
 
ה
ל
ו
א
 
י
ד
ע
ת
ם
 
כ
י
 
נ
ח
ש
 
י
נ
ח
ש
 
א
י
ש
 
א
ש
ר
 
כ
מ
ו
נ
י
 
ו
י
א
מ
ר
 
י
ה
ו
ד
ה
 
מ
ה
 
נ
א
מ
ר
 
ל
א
ד
נ
י
 
ו
מ
ה
 
נ
ד
ב
ר
 
ו
מ
ה
 
נ
צ
ט
ד
ק
 
ו
ה
א
ל
ה
י
ם
 
מ
צ
א
 
א
ת
 
ע
ו
ן
 
ע
ב
ד
י
ך
 
ה
נ
נ
ו
 
ע
ב
ד
י
ם
 
ל
א
ד
נ
י
 
ג
ם
 
א
נ
ח
נ
ו
 
ג
ם
 
א
ש
ר
 
נ
מ
צ
א
 
ה
ג
ב
י
ע
 
ב
י
ד
ו
 
ו
י
א
מ
ר
 
ח
ל
י
ל
ה
 
ל
י
 
מ
ע
ש
ו
ת
 
ז
א
ת
 
ה
א
י
ש
 
א
ש
ר
 
נ
מ
צ
א
 
ה
ג
ב
י
ע
 
ב
י
ד
ו
 
ה
ו
א
 
י
ה
י
ה
 
ל
י
 
ע
ב
ד
 
ו
א
ת
ם
 
ע
ל
ו
 
ל
ש
ל
ו
ם
 
א
ל
 
א
ב
י
כ
ם
 
ו
י
ג
ש
 
א
ל
י
ו
 
י
ה
ו
ד
ה
 
ו
י
א
מ
ר
 
ב
י
 
א
ד
נ
י
 
י
ד
ב
ר
 
נ
א
 
ע
ב
ד
ך
 
ד
ב
ר
 
ב
א
ז
נ
י
 
א
ד
נ
י
 
ו
א
ל
 
י
ח
ר
 
א
פ
ך
 
ב
ע
ב
ד
ך
 
כ
י
 
כ
מ
ו
ך
 
כ
פ
ר
ע
ה
 
א
ד
נ
י
 
ש
א
ל
 
א
ת
 
ע
ב
ד
י
ו
 
ל
א
מ
ר
 
ה
י
ש
 
ל
כ
ם
 
א
ב
 
א
ו
 
א
ח
 
ו
נ
א
מ
ר
 
א
ל
 
א
ד
נ
י
 
י
ש
 
ל
נ
ו
 
א
ב
 
ז
ק
ן
 
ו
י
ו
ל
ד
 
ז
ק
נ
י
ם
 
ק
ט
ן
 
א
ח
י
ו
 
מ
ת
 
ו
י
ו
ת
ר
 
ה
ו
א
 
ל
ב
ד
ו
 
ל
א
מ
ו
 
ו
א
ב
י
ו
 
א
ה
ב
ו
 
ו
ת
א
מ
ר
 
א
ל
 
ע
ב
ד
י
ך
 
ה
ו
ר
י
ד
ה
ו
 
א
ל
י
 
ו
א
ש
י
מ
ה
 
ע
י
נ
י
 
ע
ל
י
ו
 
ו
נ
א
מ
ר
 
א
ל
 
א
ד
נ
י
 
ל
א
 
י
ו
כ
ל
 
ה
נ
ע
ר
 
ל
ע
ז
ב
 
א
ת
 
א
ב
י
ו
 
ו
ע
ז
ב
 
א
ת
 
א
ב
י
ו
 
ו
מ
ת
 
ו
ת
א
מ
ר
 
א
ל
 
ע
ב
ד
י
ך
 
א
ם
 
ל
א
 
י
ר
ד
 
א
ח
י
כ
ם
 
ה
ק
ט
ן
 
א
ת
כ
ם
 
ל
א
 
ת
ו
ס
י
פ
ו
ן
 
ל
ר
א
ו
ת
 
פ
נ
י
 
ו
י
ה
י
 
כ
י
 
ע
ל
י
נ
ו
 
א
ל
 
ע
ב
ד
ך
 
א
ב
י
נ
ו
 
ו
נ
ג
י
ד
 
ל
ו
 
א
ת
 
ד
ב
ר
י
 
א
ד
נ
י
 
ו
י
א
מ
ר
 
א
ב
י
נ
ו
 
ש
ו
ב
ו
 
ו
ש
ב
ר
ו
 
ל
נ
ו
 
מ
ע
ט
 
א
כ
ל
 
ו
נ
א
מ
ר
 
ל
א
 
נ
ו
כ
ל
 
ל
ר
ד
ת
 
א
ם
 
י
ש
 
א
ח
י
נ
ו
 
ה
ק
ט
ן
 
א
ת
נ
ו
 
ו
י
ר
ד
נ
ו
 
כ
י
 
ל
א
 
נ
ו
כ
ל
 
ל
ר
א
ו
ת
 
א
ת
 
פ
נ
י
 
ה
א
י
ש
 
ו
א
ח
י
נ
ו
 
ה
ק
ט
ן
 
א
י
נ
נ
ו
 
א
ת
נ
ו
 
ו
י
א
מ
ר
 
ע
ב
ד
ך
 
א
ב
י
 
א
ל
י
נ
ו
 
א
ת
ם
 
י
ד
ע
ת
ם
 
כ
י
 
ש
נ
י
ם
 
י
ל
ד
ה
 
ל
י
 
א
ש
ת
י
 
ו
י
צ
א
 
ה
א
ח
ד
 
מ
א
ת
י
 
ו
א
מ
ר
 
ה
ך
 
ט
ר
ף
 
ט
ר
ף
 
ו
ל
א
 
ר
א
י
ת
י
ו
 
ע
ד
 
ה
נ
ה
 
ו
ל
ק
ח
ת
ם
 
ג
ם
 
א
ת
 
ז
ה
 
מ
ע
ם
 
פ
נ
י
 
ו
ק
ר
א
ה
ו
 
א
ס
ו
ן
 
ו
ה
ו
ר
ד
ת
ם
 
א
ת
 
ש
י
ב
ת
י
 
ב
ר
ע
ה
 
ש
א
ל
ה
 
ו
ע
ת
ה
 
כ
ב
א
י
 
א
ל
 
ע
ב
ד
ך
 
א
ב
י
 
ו
ה
נ
ע
ר
 
א
י
נ
נ
ו
 
א
ת
י
 
ו
נ
פ
ש
ו
 
ק
ש
ו
ר
ה
 
ב
נ
פ
ש
ו
 
ו
ה
י
ה
 
כ
ר
א
ו
ת
ו
 
כ
י
 
א
י
ן
 
ה
נ
ע
ר
 
א
ת
נ
ו
 
ו
מ
ת
 
ו
ה
ו
ר
י
ד
ו
 
ע
ב
ד
י
ך
 
א
ת
 
ש
י
ב
ת
 
ע
ב
ד
ך
 
א
ב
י
נ
ו
 
ב
י
ג
ו
ן
 
ש
א
ל
ה
 
כ
י
 
ע
ב
ד
ך
 
ע
ר
ב
 
א
ת
 
ה
נ
ע
ר
 
מ
ע
ם
 
א
ב
י
ו
 
ל
א
מ
ר
 
א
ם
 
ל
א
 
א
ב
י
א
נ
ו
 
א
ל
י
ך
 
ו
ח
ט
א
ת
י
 
ל
א
ב
י
 
כ
ל
 
ה
י
מ
י
ם
 
ו
ע
ת
ה
 
י
ש
ב
 
נ
א
 
ע
ב
ד
ך
 
ת
ח
ת
 
ה
נ
ע
ר
 
ע
ב
ד
 
ל
א
ד
נ
י
 
ו
ה
נ
ע
ר
 
י
ע
ל
ה
 
ע
ם
 
א
ח
י
ו
 
כ
י
 
א
י
ך
 
א
ע
ל
ה
 
א
ל
 
א
ב
י
 
ו
ה
נ
ע
ר
 
א
י
נ
נ
ו
 
א
ת
י
 
פ
ן
 
א
ר
א
ה
 
ב
ר
ע
ה
 
א
ש
ר
 
י
מ
צ
א
 
א
ת
 
א
ב
י
 
ו
ל
א
 
י
כ
ל
 
י
ו
ס
ף
 
ל
ה
ת
א
פ
ק
 
ל
כ
ל
 
ה
נ
צ
ב
י
ם
 
ע
ל
י
ו
 
ו
י
ק
ר
א
 
ו
ה
ו
צ
י
א
ו
 
כ
ל
 
א
י
ש
 
מ
ע
ל
י
ו
 
ו
ל
א
 
ע
מ
ד
 
א
י
ש
 
א
ת
ו
 
ב
ה
ת
ו
ד
ע
 
י
ו
ס
ף
 
א
ל
 
א
ח
י
ו
 
ו
י
ת
ן
 
א
ת
 
ק
ו
ל
ו
 
ב
ב
כ
י
 
ו
י
ש
מ
ע
ו
 
מ
צ
ר
י
ם
 
ו
י
ש
מ
ע
ו
 
ב
י
ת
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
א
ח
י
ו
 
א
נ
י
 
י
ו
ס
ף
 
ה
ע
ו
ד
 
א
ב
י
 
ח
י
 
ו
ל
א
 
י
כ
ל
ו
 
א
ח
י
ו
 
ל
ע
נ
ו
ת
 
א
ת
ו
 
כ
י
 
נ
ב
ה
ל
ו
 
מ
פ
נ
י
ו
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
א
ח
י
ו
 
ג
ש
ו
 
נ
א
 
א
ל
י
 
ו
י
ג
ש
ו
 
ו
י
א
מ
ר
 
א
נ
י
 
י
ו
ס
ף
 
א
ח
י
כ
ם
 
א
ש
ר
 
מ
כ
ר
ת
ם
 
א
ת
י
 
מ
צ
ר
י
מ
ה
 
ו
ע
ת
ה
 
א
ל
 
ת
ע
צ
ב
ו
 
ו
א
ל
 
י
ח
ר
 
ב
ע
י
נ
י
כ
ם
 
כ
י
 
מ
כ
ר
ת
ם
 
א
ת
י
 
ה
נ
ה
 
כ
י
 
ל
מ
ח
י
ה
 
ש
ל
ח
נ
י
 
א
ל
ה
י
ם
 
ל
פ
נ
י
כ
ם
 
כ
י
 
ז
ה
 
ש
נ
ת
י
ם
 
ר
ע
ב
 
ב
ק
ר
ב
 
ה
א
ר
ץ
 
ו
ע
ו
ד
 
ח
מ
ש
 
ש
נ
י
ם
 
א
ש
ר
 
א
י
ן
 
ח
ר
י
ש
 
ו
ק
צ
י
ר
 
ו
י
ש
ל
ח
נ
י
 
א
ל
ה
י
ם
 
ל
פ
נ
י
כ
ם
 
ל
ש
י
ם
 
ל
כ
ם
 
ש
א
ר
ו
ת
 
ב
א
ר
ץ
 
ו
ל
ה
ח
י
ו
ת
 
ל
כ
ם
 
פ
ל
ט
ה
 
ג
ד
ל
ה
 
ו
ע
ת
ה
 
ל
א
 
א
ת
ם
 
ש
ל
ח
ת
ם
 
א
ת
י
 
ה
נ
ה
 
כ
י
 
ה
א
ל
ה
י
ם
 
ו
י
ש
מ
נ
י
 
ל
א
ב
 
ל
פ
ר
ע
ה
 
ו
ל
א
ד
ו
ן
 
ל
כ
ל
 
ב
י
ת
ו
 
ו
מ
ש
ל
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ה
ר
ו
 
ו
ע
ל
ו
 
א
ל
 
א
ב
י
 
ו
א
מ
ר
ת
ם
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
ב
נ
ך
 
י
ו
ס
ף
 
ש
מ
נ
י
 
א
ל
ה
י
ם
 
ל
א
ד
ו
ן
 
ל
כ
ל
 
מ
צ
ר
י
ם
 
ר
ד
ה
 
א
ל
י
 
א
ל
 
ת
ע
מ
ד
 
ו
י
ש
ב
ת
 
ב
א
ר
ץ
 
ג
ש
ן
 
ו
ה
י
י
ת
 
ק
ר
ו
ב
 
א
ל
י
 
א
ת
ה
 
ו
ב
נ
י
ך
 
ו
ב
נ
י
 
ב
נ
י
ך
 
צ
א
נ
ך
 
ו
ב
ק
ר
ך
 
ו
כ
ל
 
א
ש
ר
 
ל
ך
 
ו
כ
ל
כ
ל
ת
י
 
א
ת
ך
 
ש
ם
 
כ
י
 
ע
ו
ד
 
ח
מ
ש
 
ש
נ
י
ם
 
ר
ע
ב
 
פ
ן
 
ת
ו
ר
ש
 
א
ת
ה
 
ו
ב
י
ת
ך
 
ו
כ
ל
 
א
ש
ר
 
ל
ך
 
ו
ה
נ
ה
 
ע
י
נ
י
כ
ם
 
ר
א
ו
ת
 
ו
ע
י
נ
י
 
א
ח
י
 
ב
נ
י
מ
י
ם
 
כ
י
 
פ
י
י
 
ה
מ
ד
ב
ר
 
א
ל
י
כ
ם
 
ו
ה
ג
ד
ת
ם
 
ל
א
ב
י
 
א
ת
 
כ
ל
 
כ
ב
ו
ד
י
 
ב
מ
צ
ר
י
ם
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ר
א
י
ת
ם
 
ו
מ
ה
ר
ת
ם
 
ו
ה
ו
ר
ד
ת
ם
 
א
ת
 
א
ב
י
 
ה
נ
ה
 
ו
י
פ
ל
 
ע
ל
 
צ
ו
א
ר
 
ב
נ
י
מ
י
ם
 
א
ח
י
ו
 
ו
י
ב
ך
 
ו
ב
נ
י
מ
י
ם
 
ב
כ
ה
 
ע
ל
 
צ
ו
א
ר
ו
 
ו
י
נ
ש
ק
 
ל
כ
ל
 
א
ח
י
ו
 
ו
י
ב
ך
 
ע
ל
י
ה
ם
 
ו
א
ח
ר
י
 
כ
ן
 
ד
ב
ר
ו
 
א
ח
י
ו
 
א
ת
ו
 
ו
ה
ק
ו
ל
 
נ
ש
מ
ע
 
ב
י
ת
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
ב
א
ו
 
א
ח
י
 
י
ו
ס
ף
 
ו
י
י
ט
ב
 
ב
ע
י
נ
י
 
פ
ר
ע
ה
 
ו
ב
ע
י
נ
י
 
ע
ב
ד
י
ו
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ו
ס
ף
 
א
מ
ר
 
א
ל
 
א
ח
י
ך
 
ז
א
ת
 
ע
ש
ו
 
ט
ע
נ
ו
 
א
ת
 
ב
ע
י
ר
כ
ם
 
ו
ל
כ
ו
 
ו
ב
א
ו
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
ק
ח
ו
 
א
ת
 
א
ב
י
כ
ם
 
ו
א
ת
 
ב
ת
י
כ
ם
 
ו
ב
א
ו
 
א
ל
י
 
ו
א
ת
ן
 
ל
כ
ם
 
א
ת
 
ט
ו
ב
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
א
כ
ל
ו
 
א
ת
 
ח
ל
ב
 
ה
א
ר
ץ
 
ו
א
ת
ה
 
צ
ו
י
ת
י
 
ז
א
ת
 
ע
ש
ו
 
ק
ח
ו
 
ל
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ג
ל
ו
ת
 
ל
ט
פ
כ
ם
 
ו
ל
נ
ש
י
כ
ם
 
ו
נ
ש
א
ת
ם
 
א
ת
 
א
ב
י
כ
ם
 
ו
ב
א
ת
ם
 
ו
ע
י
נ
י
כ
ם
 
א
ל
 
ת
ח
ו
ס
 
ע
ל
 
כ
ל
י
כ
ם
 
כ
י
 
ט
ו
ב
 
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
כ
ם
 
ה
ו
א
 
ו
י
ע
ש
ו
 
כ
ן
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ת
ן
 
ל
ה
ם
 
י
ו
ס
ף
 
ע
ג
ל
ו
ת
 
ע
ל
 
פ
י
 
פ
ר
ע
ה
 
ו
י
ת
ן
 
ל
ה
ם
 
צ
ד
ה
 
ל
ד
ר
ך
 
ל
כ
ל
ם
 
נ
ת
ן
 
ל
א
י
ש
 
ח
ל
י
פ
ו
ת
 
ש
מ
ל
ו
ת
 
ו
ל
ב
נ
י
מ
י
ם
 
נ
ת
ן
 
ש
ל
ש
 
מ
א
ו
ת
 
כ
ס
ף
 
ו
ח
מ
ש
 
ח
ל
י
פ
ו
ת
 
ש
מ
ל
ו
ת
 
ו
ל
א
ב
י
ו
 
ש
ל
ח
 
כ
ז
א
ת
 
ע
ש
ר
ה
 
ח
מ
ר
י
ם
 
נ
ש
א
י
ם
 
מ
ט
ו
ב
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ע
ש
ר
 
א
ת
נ
ו
ת
 
נ
ש
א
ו
ת
 
ב
ר
 
ו
ל
ח
ם
 
ו
מ
ז
ו
ן
 
ל
א
ב
י
ו
 
ל
ד
ר
ך
 
ו
י
ש
ל
ח
 
א
ת
 
א
ח
י
ו
 
ו
י
ל
כ
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
ל
 
ת
ת
ר
ג
ז
ו
 
ב
ד
ר
ך
 
ו
י
ע
ל
ו
 
מ
מ
צ
ר
י
ם
 
ו
י
ב
א
ו
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
א
ל
 
י
ע
ק
ב
 
א
ב
י
ה
ם
 
ו
י
ג
ד
ו
 
ל
ו
 
ל
א
מ
ר
 
ע
ו
ד
 
י
ו
ס
ף
 
ח
י
 
ו
כ
י
 
ה
ו
א
 
מ
ש
ל
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
פ
ג
 
ל
ב
ו
 
כ
י
 
ל
א
 
ה
א
מ
ן
 
ל
ה
ם
 
ו
י
ד
ב
ר
ו
 
א
ל
י
ו
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
י
ו
ס
ף
 
א
ש
ר
 
ד
ב
ר
 
א
ל
י
ה
ם
 
ו
י
ר
א
 
א
ת
 
ה
ע
ג
ל
ו
ת
 
א
ש
ר
 
ש
ל
ח
 
י
ו
ס
ף
 
ל
ש
א
ת
 
א
ת
ו
 
ו
ת
ח
י
 
ר
ו
ח
 
י
ע
ק
ב
 
א
ב
י
ה
ם
 
ו
י
א
מ
ר
 
י
ש
ר
א
ל
 
ר
ב
 
ע
ו
ד
 
י
ו
ס
ף
 
ב
נ
י
 
ח
י
 
א
ל
כ
ה
 
ו
א
ר
א
נ
ו
 
ב
ט
ר
ם
 
א
מ
ו
ת
 
ו
י
ס
ע
 
י
ש
ר
א
ל
 
ו
כ
ל
 
א
ש
ר
 
ל
ו
 
ו
י
ב
א
 
ב
א
ר
 
ש
ב
ע
 
ו
י
ז
ב
ח
 
ז
ב
ח
י
ם
 
ל
א
ל
ה
י
 
א
ב
י
ו
 
י
צ
ח
ק
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
ל
י
ש
ר
א
ל
 
ב
מ
ר
א
ו
ת
 
ה
ל
י
ל
ה
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
א
נ
כ
י
 
ה
א
ל
 
א
ל
ה
י
 
א
ב
י
ך
 
א
ל
 
ת
י
ר
א
 
מ
ר
ד
ת
 
מ
צ
ר
י
מ
ה
 
כ
י
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
א
ש
י
מ
ך
 
ש
ם
 
א
נ
כ
י
 
א
ר
ד
 
ע
מ
ך
 
מ
צ
ר
י
מ
ה
 
ו
א
נ
כ
י
 
א
ע
ל
ך
 
ג
ם
 
ע
ל
ה
 
ו
י
ו
ס
ף
 
י
ש
י
ת
 
י
ד
י
ו
 
ע
ל
 
ע
י
נ
י
ך
 
ו
י
ק
ם
 
י
ע
ק
ב
 
מ
ב
א
ר
 
ש
ב
ע
 
ו
י
ש
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
י
ע
ק
ב
 
א
ב
י
ה
ם
 
ו
א
ת
 
ט
פ
ם
 
ו
א
ת
 
נ
ש
י
ה
ם
 
ב
ע
ג
ל
ו
ת
 
א
ש
ר
 
ש
ל
ח
 
פ
ר
ע
ה
 
ל
ש
א
ת
 
א
ת
ו
 
ו
י
ק
ח
ו
 
א
ת
 
מ
ק
נ
י
ה
ם
 
ו
א
ת
 
ר
כ
ו
ש
ם
 
א
ש
ר
 
ר
כ
ש
ו
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ב
א
ו
 
מ
צ
ר
י
מ
ה
 
י
ע
ק
ב
 
ו
כ
ל
 
ז
ר
ע
ו
 
א
ת
ו
 
ב
נ
י
ו
 
ו
ב
נ
י
 
ב
נ
י
ו
 
א
ת
ו
 
ב
נ
ת
י
ו
 
ו
ב
נ
ו
ת
 
ב
נ
י
ו
 
ו
כ
ל
 
ז
ר
ע
ו
 
ה
ב
י
א
 
א
ת
ו
 
מ
צ
ר
י
מ
ה
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ה
ב
א
י
ם
 
מ
צ
ר
י
מ
ה
 
י
ע
ק
ב
 
ו
ב
נ
י
ו
 
ב
כ
ו
ר
 
י
ע
ק
ב
 
ר
א
ו
ב
ן
 
ו
ב
נ
י
 
ר
א
ו
ב
ן
 
ח
נ
ו
ך
 
ו
פ
ל
ו
א
 
ח
צ
ר
ו
ן
 
ו
כ
ר
מ
י
 
ו
ב
נ
י
 
ש
מ
ע
ו
ן
 
י
מ
ו
א
ל
 
ו
י
מ
י
ן
 
ו
א
ח
ד
 
ו
י
כ
י
ן
 
ו
צ
ה
ר
 
ו
ש
א
ו
ל
 
ב
ן
 
ה
כ
נ
ע
נ
י
ת
 
ו
ב
נ
י
 
ל
ו
י
 
ג
ר
ש
ו
ן
 
ק
ה
ת
 
ו
מ
ר
ר
י
 
ו
ב
נ
י
 
י
ה
ו
ד
ה
 
ע
ר
 
ו
א
ו
נ
ן
 
ש
ל
ה
 
פ
ר
ץ
 
ו
ז
ר
ח
 
ו
י
מ
ת
 
ע
ר
 
ו
א
ו
נ
ן
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ה
י
ו
 
ב
נ
י
 
פ
ר
ץ
 
ח
צ
ר
ו
ן
 
ו
ח
מ
ו
א
ל
 
ו
ב
נ
י
 
י
ש
ש
כ
ר
 
ת
ו
ל
ע
 
ו
פ
ו
א
ה
 
י
ש
ו
ב
 
ו
ש
מ
ר
ו
ן
 
ו
ב
נ
י
 
ז
ב
ו
ל
ן
 
ס
ר
ד
 
ו
א
ל
ו
ן
 
ו
י
ח
ל
א
ל
 
א
ל
ה
 
ב
נ
י
 
ל
א
ה
 
א
ש
ר
 
י
ל
ד
ה
 
ל
י
ע
ק
ב
 
ב
פ
ד
ן
 
א
ר
ם
 
ו
א
ת
 
ד
י
נ
ה
 
ב
ת
ו
 
כ
ל
 
נ
פ
ש
 
ב
נ
י
ו
 
ו
ב
נ
ת
י
ו
 
ש
ל
ש
י
ם
 
ו
ש
ל
ש
 
ו
ב
נ
י
 
ג
ד
 
צ
פ
ו
ן
 
ו
ח
ג
י
 
ו
ש
ו
נ
י
 
ו
א
צ
ב
ע
ו
ן
 
ע
ד
י
 
ו
א
ר
ו
ד
י
 
ו
א
ר
ו
ל
י
 
ו
ב
נ
י
 
א
ש
ר
 
י
מ
נ
ה
 
ו
י
ש
ו
ה
 
ו
י
ש
ו
י
 
ו
ב
ר
י
ע
ה
 
ו
ש
ר
ח
 
א
ח
ו
ת
ם
 
ו
ב
נ
י
 
ב
ר
י
ע
ה
 
ח
ב
ר
 
ו
מ
ל
כ
י
א
ל
 
א
ל
ה
 
ב
נ
י
 
ז
ל
פ
ה
 
א
ש
ר
 
נ
ת
ן
 
ל
ב
ן
 
ל
ל
א
ה
 
ב
ת
ו
 
ו
ת
ל
ד
 
א
ת
 
א
ל
ה
 
ל
י
ע
ק
ב
 
ש
ש
 
ע
ש
ר
ה
 
נ
פ
ש
 
ב
נ
י
 
ר
ח
ל
 
א
ש
ת
 
י
ע
ק
ב
 
י
ו
ס
ף
 
ו
ב
נ
י
מ
י
ם
 
ו
י
ו
ל
ד
 
ל
י
ו
ס
ף
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
ש
ר
 
י
ל
ד
ה
 
ל
ו
 
א
ס
נ
ת
 
ב
ת
 
פ
ו
ט
י
פ
ר
ע
 
כ
ה
נ
א
ן
 
א
ת
 
מ
נ
ש
ה
 
ו
א
ת
 
א
פ
ר
י
ם
 
ו
ב
נ
י
 
ב
נ
י
מ
י
ם
 
ב
ל
ע
 
ו
ב
כ
ר
 
ו
א
ש
ב
א
ל
 
ג
ר
ה
 
ו
נ
ע
מ
ן
 
א
ח
י
ם
 
ו
ר
א
ש
 
מ
א
פ
י
ם
 
ו
א
פ
י
ם
 
ו
א
ר
ד
 
א
ל
ה
 
ב
נ
י
 
ר
ח
ל
 
א
ש
ר
 
י
ל
ד
ה
 
ל
י
ע
ק
ב
 
כ
ל
 
נ
פ
ש
 
א
ר
ב
ע
 
ע
ש
ר
ה
 
ו
ב
נ
י
 
ד
ן
 
ח
ש
י
ם
 
ו
ב
נ
י
 
נ
פ
ת
ל
י
 
י
ח
צ
א
ל
 
ו
ג
ו
נ
י
 
י
צ
ר
 
ו
ש
ל
ו
ם
 
א
ל
ה
 
ב
נ
י
 
ב
ל
ה
ה
 
א
ש
ר
 
נ
ת
ן
 
ל
ב
ן
 
ל
ר
ח
ל
 
ב
ת
ו
 
ו
ת
ל
ד
 
א
ת
 
א
ל
ה
 
ל
י
ע
ק
ב
 
כ
ל
 
נ
פ
ש
 
ש
ב
ע
 
כ
ל
 
ה
נ
פ
ש
 
ה
ב
א
ה
 
ל
י
ע
ק
ב
 
מ
צ
ר
י
מ
ה
 
י
צ
א
י
 
י
ר
כ
ו
 
מ
ל
ב
ד
 
נ
ש
י
 
ב
נ
י
 
י
ע
ק
ב
 
כ
ל
 
נ
פ
ש
 
ש
ש
י
ם
 
ו
ש
ש
 
ו
ב
נ
י
 
י
ו
ס
ף
 
א
ש
ר
 
י
ל
ד
ו
 
ל
ו
 
ב
מ
צ
ר
י
ם
 
נ
פ
ש
 
ש
נ
י
ם
 
כ
ל
 
ה
נ
פ
ש
 
ל
ב
י
ת
 
י
ע
ק
ב
 
ה
ב
א
ה
 
מ
צ
ר
י
מ
ה
 
ש
ב
ע
י
ם
 
ו
א
ת
 
י
ה
ו
ד
ה
 
ש
ל
ח
 
ל
פ
נ
י
ו
 
א
ל
 
י
ו
ס
ף
 
ל
ה
ר
א
ו
ת
 
ל
פ
נ
י
ו
 
ג
ש
נ
ה
 
ו
י
ב
א
 
א
ר
ץ
 
ג
ש
ן
 
ו
י
א
ס
ר
 
י
ו
ס
ף
 
מ
ר
כ
ב
ת
ו
 
ו
י
ע
ל
 
ל
ק
ר
א
ת
 
י
ש
ר
א
ל
 
א
ב
י
ו
 
ג
ש
נ
ה
 
ו
י
ר
א
 
א
ל
י
ו
 
ו
י
פ
ל
 
ע
ל
 
צ
ו
א
ר
ו
 
ו
י
ב
ך
 
ע
ל
 
צ
ו
א
ר
ו
 
ע
ו
ד
 
ו
י
א
מ
ר
 
י
ש
ר
א
ל
 
א
ל
 
י
ו
ס
ף
 
א
מ
ו
ת
ה
 
ה
פ
ע
ם
 
א
ח
ר
י
 
ר
א
י
ת
י
 
פ
נ
י
ך
 
כ
י
 
ע
ו
ד
ך
 
ח
י
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
א
ח
י
ו
 
ו
א
ל
 
ב
י
ת
 
א
ב
י
ו
 
א
ע
ל
ה
 
ו
א
ג
י
ד
ה
 
ל
פ
ר
ע
ה
 
ו
א
מ
ר
 
א
ל
י
ו
 
א
ח
י
 
ו
ב
י
ת
 
א
ב
י
 
א
ש
ר
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ב
א
ו
 
א
ל
י
 
ו
ה
א
נ
ש
י
ם
 
ר
ע
י
 
צ
א
ן
 
כ
י
 
א
נ
ש
י
 
מ
ק
נ
ה
 
ה
י
ו
 
ו
צ
א
נ
ם
 
ו
ב
ק
ר
ם
 
ו
כ
ל
 
א
ש
ר
 
ל
ה
ם
 
ה
ב
י
א
ו
 
ו
ה
י
ה
 
כ
י
 
י
ק
ר
א
 
ל
כ
ם
 
פ
ר
ע
ה
 
ו
א
מ
ר
 
מ
ה
 
מ
ע
ש
י
כ
ם
 
ו
א
מ
ר
ת
ם
 
א
נ
ש
י
 
מ
ק
נ
ה
 
ה
י
ו
 
ע
ב
ד
י
ך
 
מ
נ
ע
ר
י
נ
ו
 
ו
ע
ד
 
ע
ת
ה
 
ג
ם
 
א
נ
ח
נ
ו
 
ג
ם
 
א
ב
ת
י
נ
ו
 
ב
ע
ב
ו
ר
 
ת
ש
ב
ו
 
ב
א
ר
ץ
 
ג
ש
ן
 
כ
י
 
ת
ו
ע
ב
ת
 
מ
צ
ר
י
ם
 
כ
ל
 
ר
ע
י
 
צ
א
ן
 
ו
י
ב
א
 
י
ו
ס
ף
 
ו
י
ג
ד
 
ל
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ב
י
 
ו
א
ח
י
 
ו
צ
א
נ
ם
 
ו
ב
ק
ר
ם
 
ו
כ
ל
 
א
ש
ר
 
ל
ה
ם
 
ב
א
ו
 
מ
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ה
נ
ם
 
ב
א
ר
ץ
 
ג
ש
ן
 
ו
מ
ק
צ
ה
 
א
ח
י
ו
 
ל
ק
ח
 
ע
מ
ו
 
ח
מ
ש
ה
 
א
נ
ש
י
ם
 
ו
י
צ
ג
ם
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
א
ח
י
 
י
ו
ס
ף
 
מ
ה
 
מ
ע
ש
י
כ
ם
 
ו
י
א
מ
ר
ו
 
א
ל
 
פ
ר
ע
ה
 
ר
ע
י
 
צ
א
ן
 
ע
ב
ד
י
ך
 
ג
ם
 
א
נ
ח
נ
ו
 
ג
ם
 
א
ב
ת
י
נ
ו
 
ו
י
א
מ
ר
ו
 
א
ל
 
פ
ר
ע
ה
 
ל
ג
ו
ר
 
ב
א
ר
ץ
 
ב
א
נ
ו
 
כ
י
 
א
י
ן
 
מ
ר
ע
ה
 
ל
צ
א
ן
 
א
ש
ר
 
ל
ע
ב
ד
י
ך
 
כ
י
 
כ
ב
ד
 
ה
ר
ע
ב
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ע
ת
ה
 
י
ש
ב
ו
 
נ
א
 
ע
ב
ד
י
ך
 
ב
א
ר
ץ
 
ג
ש
ן
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ו
ס
ף
 
ל
א
מ
ר
 
א
ב
י
ך
 
ו
א
ח
י
ך
 
ב
א
ו
 
א
ל
י
ך
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
פ
נ
י
ך
 
ה
י
א
 
ב
מ
י
ט
ב
 
ה
א
ר
ץ
 
ה
ו
ש
ב
 
א
ת
 
א
ב
י
ך
 
ו
א
ת
 
א
ח
י
ך
 
י
ש
ב
ו
 
ב
א
ר
ץ
 
ג
ש
ן
 
ו
א
ם
 
י
ד
ע
ת
 
ה
י
ש
 
ב
ם
 
א
נ
ש
י
 
ח
י
ל
 
ו
ש
מ
ת
ם
 
ש
ר
י
 
מ
ק
נ
ה
 
ע
ל
 
א
ש
ר
 
ל
י
 
ו
י
ב
א
 
י
ו
ס
ף
 
א
ת
 
י
ע
ק
ב
 
א
ב
י
ו
 
ו
י
ע
מ
ד
ה
ו
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ב
ר
ך
 
י
ע
ק
ב
 
א
ת
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
ל
 
י
ע
ק
ב
 
כ
מ
ה
 
י
מ
י
 
ש
נ
י
 
ח
י
י
ך
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
פ
ר
ע
ה
 
י
מ
י
 
ש
נ
י
 
מ
ג
ר
י
 
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
מ
ע
ט
 
ו
ר
ע
י
ם
 
ה
י
ו
 
י
מ
י
 
ש
נ
י
 
ח
י
י
 
ו
ל
א
 
ה
ש
י
ג
ו
 
א
ת
 
י
מ
י
 
ש
נ
י
 
ח
י
י
 
א
ב
ו
ת
י
 
ב
י
מ
י
 
מ
ג
ר
י
ה
ם
 
ו
י
ב
ר
ך
 
י
ע
ק
ב
 
א
ת
 
פ
ר
ע
ה
 
ו
י
צ
א
 
מ
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ו
ש
ב
 
י
ו
ס
ף
 
א
ת
 
א
ב
י
ו
 
ו
א
ת
 
א
ח
י
ו
 
ו
י
ת
ן
 
ל
ה
ם
 
א
ח
ז
ה
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
מ
י
ט
ב
 
ה
א
ר
ץ
 
ב
א
ר
ץ
 
ר
ע
מ
ס
ס
 
כ
א
ש
ר
 
צ
ו
ה
 
פ
ר
ע
ה
 
ו
י
כ
ל
כ
ל
 
י
ו
ס
ף
 
א
ת
 
א
ב
י
ו
 
ו
א
ת
 
א
ח
י
ו
 
ו
א
ת
 
כ
ל
 
ב
י
ת
 
א
ב
י
ו
 
ל
ח
ם
 
ל
פ
י
 
ה
ט
ף
 
ו
ל
ח
ם
 
א
י
ן
 
ב
כ
ל
 
ה
א
ר
ץ
 
כ
י
 
כ
ב
ד
 
ה
ר
ע
ב
 
מ
א
ד
 
ו
ת
ל
א
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
א
ר
ץ
 
כ
נ
ע
ן
 
מ
פ
נ
י
 
ה
ר
ע
ב
 
ו
י
ל
ק
ט
 
י
ו
ס
ף
 
א
ת
 
כ
ל
 
ה
כ
ס
ף
 
ה
נ
מ
צ
א
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ב
ש
ב
ר
 
א
ש
ר
 
ה
ם
 
ש
ב
ר
י
ם
 
ו
י
ב
א
 
י
ו
ס
ף
 
א
ת
 
ה
כ
ס
ף
 
ב
י
ת
ה
 
פ
ר
ע
ה
 
ו
י
ת
ם
 
ה
כ
ס
ף
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
מ
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ב
א
ו
 
כ
ל
 
מ
צ
ר
י
ם
 
א
ל
 
י
ו
ס
ף
 
ל
א
מ
ר
 
ה
ב
ה
 
ל
נ
ו
 
ל
ח
ם
 
ו
ל
מ
ה
 
נ
מ
ו
ת
 
נ
ג
ד
ך
 
כ
י
 
א
פ
ס
 
ה
כ
ס
ף
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
ה
ב
ו
 
מ
ק
נ
י
כ
ם
 
ו
א
ת
ן
 
ל
כ
ם
 
ל
ח
ם
 
ב
מ
ק
נ
י
כ
ם
 
א
ם
 
א
פ
ס
 
ה
כ
ס
ף
 
ו
י
ב
י
א
ו
 
א
ת
 
מ
ק
נ
י
ה
ם
 
א
ל
 
י
ו
ס
ף
 
ו
י
ת
ן
 
ל
ה
ם
 
י
ו
ס
ף
 
ל
ח
ם
 
ב
ס
ו
ס
י
ם
 
ו
ב
מ
ק
נ
ה
 
ה
צ
א
ן
 
ו
ב
מ
ק
נ
ה
 
ה
ב
ק
ר
 
ו
ב
ח
מ
ר
י
ם
 
ו
י
נ
ח
ל
ם
 
ב
ל
ח
ם
 
ב
כ
ל
 
מ
ק
נ
י
ה
ם
 
ב
ש
נ
ה
 
ה
ה
י
א
 
ו
ת
ת
ם
 
ה
ש
נ
ה
 
ה
ה
י
א
 
ו
י
ב
א
ו
 
א
ל
י
ו
 
ב
ש
נ
ה
 
ה
ש
נ
י
ת
 
ו
י
א
מ
ר
ו
 
ל
ו
 
ל
א
 
נ
כ
ח
ד
 
מ
א
ד
נ
י
 
כ
י
 
א
ם
 
ת
ם
 
ה
כ
ס
ף
 
ו
מ
ק
נ
ה
 
ה
ב
ה
מ
ה
 
א
ל
 
א
ד
נ
י
 
ל
א
 
נ
ש
א
ר
 
ל
פ
נ
י
 
א
ד
נ
י
 
ב
ל
ת
י
 
א
ם
 
ג
ו
י
ת
י
נ
ו
 
ו
א
ד
מ
ת
נ
ו
 
ל
מ
ה
 
נ
מ
ו
ת
 
ל
ע
י
נ
י
ך
 
ג
ם
 
א
נ
ח
נ
ו
 
ג
ם
 
א
ד
מ
ת
נ
ו
 
ק
נ
ה
 
א
ת
נ
ו
 
ו
א
ת
 
א
ד
מ
ת
נ
ו
 
ב
ל
ח
ם
 
ו
נ
ה
י
ה
 
א
נ
ח
נ
ו
 
ו
א
ד
מ
ת
נ
ו
 
ע
ב
ד
י
ם
 
ל
פ
ר
ע
ה
 
ו
ת
ן
 
ז
ר
ע
 
ו
נ
ח
י
ה
 
ו
ל
א
 
נ
מ
ו
ת
 
ו
ה
א
ד
מ
ה
 
ל
א
 
ת
ש
ם
 
ו
י
ק
ן
 
י
ו
ס
ף
 
א
ת
 
כ
ל
 
א
ד
מ
ת
 
מ
צ
ר
י
ם
 
ל
פ
ר
ע
ה
 
כ
י
 
מ
כ
ר
ו
 
מ
צ
ר
י
ם
 
א
י
ש
 
ש
ד
ה
ו
 
כ
י
 
ח
ז
ק
 
ע
ל
י
ה
ם
 
ה
ר
ע
ב
 
ו
ת
ה
י
 
ה
א
ר
ץ
 
ל
פ
ר
ע
ה
 
ו
א
ת
 
ה
ע
ם
 
ה
ע
ב
י
ד
 
א
ת
ו
 
ל
ע
ב
ד
י
ם
 
מ
ק
צ
ה
 
ג
ב
ו
ל
 
מ
צ
ר
י
ם
 
ע
ד
 
ק
צ
ה
ו
 
ר
ק
 
א
ד
מ
ת
 
ה
כ
ה
נ
י
ם
 
ל
א
 
ק
נ
ה
 
כ
י
 
ח
ק
 
ל
כ
ה
נ
י
ם
 
מ
א
ת
 
פ
ר
ע
ה
 
ו
א
כ
ל
ו
 
א
ת
 
ח
ק
ם
 
א
ש
ר
 
נ
ת
ן
 
ל
ה
ם
 
פ
ר
ע
ה
 
ע
ל
 
כ
ן
 
ל
א
 
מ
כ
ר
ו
 
א
ת
 
א
ד
מ
ת
ם
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
ה
ע
ם
 
ה
ן
 
ק
נ
י
ת
י
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ו
א
ת
 
א
ד
מ
ת
י
כ
ם
 
ל
פ
ר
ע
ה
 
ה
א
 
ל
כ
ם
 
ז
ר
ע
 
ו
ז
ר
ע
ת
ם
 
א
ת
 
ה
א
ד
מ
ה
 
ו
ה
י
ה
 
ב
ת
ב
ו
א
ת
ה
 
ו
נ
ת
ת
ם
 
ח
מ
י
ש
ת
 
ל
פ
ר
ע
ה
 
ו
א
ר
ב
ע
 
ה
י
ד
ו
ת
 
י
ה
י
ה
 
ל
כ
ם
 
ל
ז
ר
ע
 
ה
ש
ד
ה
 
ו
ל
א
כ
ל
כ
ם
 
ו
ל
א
ש
ר
 
ב
ב
ת
י
כ
ם
 
ו
ל
א
כ
ל
 
ל
ט
פ
כ
ם
 
ו
י
א
מ
ר
ו
 
ה
ח
י
ת
נ
ו
 
נ
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
 
א
ד
נ
י
 
ו
ה
י
י
נ
ו
 
ע
ב
ד
י
ם
 
ל
פ
ר
ע
ה
 
ו
י
ש
ם
 
א
ת
ה
 
י
ו
ס
ף
 
ל
ח
ק
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ע
ל
 
א
ד
מ
ת
 
מ
צ
ר
י
ם
 
ל
פ
ר
ע
ה
 
ל
ח
מ
ו
ש
 
ר
ק
 
א
ד
מ
ת
 
ה
כ
ה
נ
י
ם
 
ל
ב
ד
ה
 
ל
א
 
ה
י
ת
ה
 
ל
פ
ר
ע
ה
 
ו
י
ש
ב
 
י
ש
ר
א
ל
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
א
ר
ץ
 
ג
ש
ן
 
ו
י
א
ח
ז
ו
 
ב
ה
 
ו
י
פ
ר
ו
 
ו
י
ר
ב
ו
 
מ
א
ד
 
ו
י
ח
י
 
י
ע
ק
ב
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ש
ב
ע
 
ע
ש
ר
ה
 
ש
נ
ה
 
ו
י
ה
י
ו
 
י
מ
י
 
י
ע
ק
ב
 
ש
נ
י
 
ח
י
י
ו
 
ש
ב
ע
 
ש
נ
י
ם
 
ו
א
ר
ב
ע
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
י
ק
ר
ב
ו
 
י
מ
י
 
י
ש
ר
א
ל
 
ל
מ
ו
ת
 
ו
י
ק
ר
א
 
ל
ב
נ
ו
 
ל
י
ו
ס
ף
 
ו
י
א
מ
ר
 
ל
ו
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ש
י
ם
 
נ
א
 
י
ד
ך
 
ת
ח
ת
 
י
ר
כ
י
 
ו
ע
ש
י
ת
 
נ
א
 
ע
מ
ד
י
 
ח
ס
ד
 
ו
א
מ
ת
 
א
ל
 
נ
א
 
ת
ק
ב
ר
נ
י
 
ב
מ
צ
ר
י
ם
 
ו
ש
כ
ב
ת
י
 
ע
ם
 
א
ב
ת
י
 
ו
נ
ש
א
ת
נ
י
 
מ
מ
צ
ר
י
ם
 
ו
ק
ב
ר
ת
נ
י
 
ב
ק
ב
ר
ת
ם
 
ו
י
א
מ
ר
 
א
נ
כ
י
 
א
ע
ש
ה
 
כ
ד
ב
ר
י
ך
 
ו
י
א
מ
ר
 
ה
ש
ב
ע
 
ל
י
 
ו
י
ש
ב
ע
 
ל
ו
 
ו
י
ש
ת
ח
ו
י
 
י
ש
ר
א
ל
 
ע
ל
 
ר
א
ש
 
ה
מ
ט
ה
 
ו
י
ה
י
 
א
ח
ר
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
י
א
מ
ר
 
ל
י
ו
ס
ף
 
ה
נ
ה
 
א
ב
י
ך
 
ח
ל
ה
 
ו
י
ק
ח
 
א
ת
 
ש
נ
י
 
ב
נ
י
ו
 
ע
מ
ו
 
א
ת
 
מ
נ
ש
ה
 
ו
א
ת
 
א
פ
ר
י
ם
 
ו
י
ג
ד
 
ל
י
ע
ק
ב
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ב
נ
ך
 
י
ו
ס
ף
 
ב
א
 
א
ל
י
ך
 
ו
י
ת
ח
ז
ק
 
י
ש
ר
א
ל
 
ו
י
ש
ב
 
ע
ל
 
ה
מ
ט
ה
 
ו
י
א
מ
ר
 
י
ע
ק
ב
 
א
ל
 
י
ו
ס
ף
 
א
ל
 
ש
ד
י
 
נ
ר
א
ה
 
א
ל
י
 
ב
ל
ו
ז
ה
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ב
ר
ך
 
א
ת
י
 
ו
י
א
מ
ר
 
א
ל
י
 
ה
נ
נ
י
 
מ
פ
ר
י
ך
 
ו
ה
ר
ב
י
ת
י
ך
 
ו
נ
ת
ת
י
ך
 
ל
ק
ה
ל
 
ע
מ
י
ם
 
ו
נ
ת
ת
י
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ל
ז
ר
ע
ך
 
א
ח
ר
י
ך
 
א
ח
ז
ת
 
ע
ו
ל
ם
 
ו
ע
ת
ה
 
ש
נ
י
 
ב
נ
י
ך
 
ה
נ
ו
ל
ד
י
ם
 
ל
ך
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ד
 
ב
א
י
 
א
ל
י
ך
 
מ
צ
ר
י
מ
ה
 
ל
י
 
ה
ם
 
א
פ
ר
י
ם
 
ו
מ
נ
ש
ה
 
כ
ר
א
ו
ב
ן
 
ו
כ
ש
מ
ע
ו
ן
 
י
ה
י
ו
 
ל
י
 
ו
מ
ו
ל
ד
ת
ך
 
א
ש
ר
 
ה
ו
ל
ד
ת
 
א
ח
ר
י
ה
ם
 
ל
ך
 
י
ה
י
ו
 
ע
ל
 
ש
ם
 
א
ח
י
ה
ם
 
י
ק
ר
א
ו
 
ב
נ
ח
ל
ת
ם
 
ו
א
נ
י
 
ב
ב
א
י
 
מ
פ
ד
ן
 
א
ר
ם
 
מ
ת
ה
 
ע
ל
י
 
ר
ח
ל
 
א
מ
ך
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ב
ד
ר
ך
 
ב
ע
ו
ד
 
כ
ב
ר
ת
 
ה
א
ר
ץ
 
ל
ב
ו
א
 
א
פ
ר
ת
ה
 
ו
א
ק
ב
ר
ה
 
ש
ם
 
ב
ד
ר
ך
 
א
פ
ר
ת
ה
 
ה
י
א
 
ב
י
ת
 
ל
ח
ם
 
ו
י
ר
א
 
י
ש
ר
א
ל
 
א
ת
 
ב
נ
י
 
י
ו
ס
ף
 
ו
י
א
מ
ר
 
מ
י
 
א
ל
ה
 
ל
ך
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
א
ב
י
ו
 
ב
נ
י
 
ה
ם
 
א
ש
ר
 
נ
ת
ן
 
ל
י
 
א
ל
ה
י
ם
 
ב
ז
ה
 
ו
י
א
מ
ר
 
ק
ח
ם
 
נ
א
 
א
ל
י
 
ו
א
ב
ר
כ
ם
 
ו
ע
י
נ
י
 
י
ש
ר
א
ל
 
כ
ב
ד
ה
 
מ
ז
ק
נ
ה
 
ל
א
 
י
כ
ל
 
ל
ר
א
ו
ת
 
ו
י
ג
ש
 
א
ת
ם
 
א
ל
י
ו
 
ו
י
ש
ק
 
ל
ה
ם
 
ו
י
ח
ב
ק
 
ל
ה
ם
 
ו
י
א
מ
ר
 
י
ש
ר
א
ל
 
א
ל
 
י
ו
ס
ף
 
ר
א
ה
 
פ
נ
י
ך
 
ל
א
 
פ
ל
ל
ת
י
 
ו
ה
נ
ה
 
ה
ר
א
ה
 
א
ת
י
 
א
ל
ה
י
ם
 
ג
ם
 
א
ת
 
ז
ר
ע
ך
 
ו
י
ו
צ
א
 
י
ו
ס
ף
 
א
ת
ם
 
מ
ע
ם
 
ב
ר
כ
י
ו
 
ו
י
ש
ת
ח
ו
ו
 
ל
א
פ
י
ו
 
א
ר
צ
ה
 
ו
י
ק
ח
 
י
ו
ס
ף
 
א
ת
 
ש
נ
י
ה
ם
 
א
ת
 
א
פ
ר
י
ם
 
ב
י
מ
י
נ
ו
 
מ
ש
מ
א
ל
 
י
ש
ר
א
ל
 
ו
א
ת
 
מ
נ
ש
ה
 
ב
ש
מ
א
ל
ו
 
מ
י
מ
י
ן
 
י
ש
ר
א
ל
 
ו
י
ג
ש
 
א
ל
י
ו
 
ו
י
ש
ל
ח
 
י
ש
ר
א
ל
 
א
ת
 
י
ד
 
י
מ
י
נ
ו
 
ו
י
ש
ת
ה
 
ע
ל
 
ר
א
ש
 
א
פ
ר
י
ם
 
ו
ה
ו
א
 
ה
צ
ע
י
ר
 
ו
א
ת
 
ש
מ
א
ל
ו
 
ע
ל
 
ר
א
ש
 
מ
נ
ש
ה
 
ש
כ
ל
 
א
ת
 
י
ד
י
ו
 
כ
י
 
מ
נ
ש
ה
 
ה
ב
כ
ו
ר
 
ו
י
ב
ר
ך
 
א
ת
 
י
ו
ס
ף
 
ו
י
א
מ
ר
 
ה
א
ל
ה
י
ם
 
א
ש
ר
 
ה
ת
ה
ל
כ
ו
 
א
ב
ו
ת
י
 
ל
פ
נ
י
ו
 
א
ב
ר
ה
ם
 
ו
י
צ
ח
ק
 
ה
א
ל
ה
י
ם
 
ה
ר
ע
ה
 
א
ת
י
 
מ
ע
ו
ד
נ
י
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ה
מ
ל
ך
 
ה
ג
א
ל
 
א
ת
י
 
מ
כ
ל
 
ר
ע
 
י
ב
ר
ך
 
א
ת
 
ה
נ
ע
ר
י
ם
 
ה
א
ל
ה
 
ו
י
ק
ר
א
 
ב
ה
ם
 
ש
מ
י
 
ו
ש
ם
 
א
ב
ו
ת
י
 
א
ב
ר
ה
ם
 
ו
י
צ
ח
ק
 
ו
י
ד
ג
ו
 
ל
ר
ב
 
ב
ק
ר
ב
 
ה
א
ר
ץ
 
ו
י
ר
א
 
י
ו
ס
ף
 
כ
י
 
י
ש
י
ת
 
א
ב
י
ו
 
א
ת
 
י
ד
 
י
מ
י
נ
ו
 
ע
ל
 
ר
א
ש
 
א
פ
ר
י
ם
 
ו
י
ר
ע
 
ב
ע
י
נ
י
ו
 
ו
י
ת
מ
ך
 
י
ד
 
א
ב
י
ו
 
ל
ה
ס
י
ר
 
א
ת
ה
 
מ
ע
ל
 
ר
א
ש
 
א
פ
ר
י
ם
 
ע
ל
 
ר
א
ש
 
מ
נ
ש
ה
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
א
ב
י
ו
 
ל
א
 
כ
ן
 
א
ב
י
 
כ
י
 
ז
ה
 
ה
ב
כ
ו
ר
 
ש
י
ם
 
י
מ
י
נ
ך
 
ע
ל
 
ר
א
ש
ו
 
ו
י
מ
א
ן
 
א
ב
י
ו
 
ו
י
א
מ
ר
 
י
ד
ע
ת
י
 
ב
נ
י
 
י
ד
ע
ת
י
 
ג
ם
 
ה
ו
א
 
י
ה
י
ה
 
ל
ע
ם
 
ו
ג
ם
 
ה
ו
א
 
י
ג
ד
ל
 
ו
א
ו
ל
ם
 
א
ח
י
ו
 
ה
ק
ט
ן
 
י
ג
ד
ל
 
מ
מ
נ
ו
 
ו
ז
ר
ע
ו
 
י
ה
י
ה
 
מ
ל
א
 
ה
ג
ו
י
ם
 
ו
י
ב
ר
כ
ם
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ל
א
מ
ר
 
ב
ך
 
י
ב
ר
ך
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
י
ש
י
מ
ך
 
א
ל
ה
י
ם
 
כ
א
פ
ר
י
ם
 
ו
כ
מ
נ
ש
ה
 
ו
י
ש
ם
 
א
ת
 
א
פ
ר
י
ם
 
ל
פ
נ
י
 
מ
נ
ש
ה
 
ו
י
א
מ
ר
 
י
ש
ר
א
ל
 
א
ל
 
י
ו
ס
ף
 
ה
נ
ה
 
א
נ
כ
י
 
מ
ת
 
ו
ה
י
ה
 
א
ל
ה
י
ם
 
ע
מ
כ
ם
 
ו
ה
ש
י
ב
 
א
ת
כ
ם
 
א
ל
 
א
ר
ץ
 
א
ב
ת
י
כ
ם
 
ו
א
נ
י
 
נ
ת
ת
י
 
ל
ך
 
ש
כ
ם
 
א
ח
ת
 
ע
ל
 
א
ח
י
ך
 
א
ש
ר
 
ל
ק
ח
ת
י
 
מ
י
ד
 
ה
א
מ
ר
י
 
ב
ח
ר
ב
י
 
ו
ב
ק
ש
ת
י
 
ו
י
ק
ר
א
 
י
ע
ק
ב
 
א
ל
 
ב
נ
י
ו
 
ו
י
א
מ
ר
 
ה
א
ס
פ
ו
 
ו
א
ג
י
ד
ה
 
ל
כ
ם
 
א
ת
 
א
ש
ר
 
י
ק
ר
א
 
א
ת
כ
ם
 
ב
א
ח
ר
י
ת
 
ה
י
מ
י
ם
 
ה
ק
ב
צ
ו
 
ו
ש
מ
ע
ו
 
ב
נ
י
 
י
ע
ק
ב
 
ו
ש
מ
ע
ו
 
א
ל
 
י
ש
ר
א
ל
 
א
ב
י
כ
ם
 
ר
א
ו
ב
ן
 
ב
כ
ו
ר
י
 
א
ת
ה
 
כ
ח
י
 
ו
ר
א
ש
י
ת
 
א
ו
נ
י
 
י
ת
ר
 
ש
א
ת
 
ו
י
ת
ר
 
ע
ז
 
פ
ח
ז
ת
 
כ
מ
י
ם
 
א
ל
 
ת
ו
ת
י
ר
 
כ
י
 
ע
ל
י
ת
 
מ
ש
כ
ב
י
 
א
ב
י
ך
 
א
ז
 
ח
ל
ל
ת
 
י
צ
ו
ע
י
 
ע
ל
ה
 
ש
מ
ע
ו
ן
 
ו
ל
ו
י
 
א
ח
י
ם
 
כ
ל
ו
 
ח
מ
ס
 
מ
כ
ר
ת
י
ה
ם
 
ב
ס
ו
ד
ם
 
א
ל
 
ת
ב
ו
א
 
נ
פ
ש
י
 
ו
ב
ק
ה
ל
ם
 
א
ל
 
י
ח
ר
 
כ
ב
ו
ד
י
 
כ
י
 
ב
א
פ
ם
 
ה
ר
ג
ו
 
א
י
ש
 
ו
ב
ר
צ
ו
נ
ם
 
ע
ק
ר
ו
 
ש
ו
ר
 
א
ד
י
ר
 
א
פ
ם
 
כ
י
 
ע
ז
 
ו
ח
ב
ר
ת
ם
 
כ
י
 
ק
ש
ת
ה
 
א
ח
ל
ק
ם
 
ב
י
ע
ק
ב
 
ו
א
פ
י
צ
ם
 
ב
י
ש
ר
א
ל
 
י
ה
ו
ד
ה
 
א
ת
ה
 
י
ו
ד
ך
 
א
ח
י
ך
 
י
ד
י
ך
 
ב
ע
ר
ף
 
א
י
ב
י
ך
 
י
ש
ת
ח
ו
ו
 
ל
ך
 
ב
נ
י
 
א
ב
י
ך
 
ג
ו
ר
 
א
ר
י
ה
 
י
ה
ו
ד
ה
 
מ
ט
ר
ף
 
ב
נ
י
 
ע
ל
י
ת
 
כ
ר
ע
 
ר
ב
ץ
 
כ
א
ר
י
ה
 
ו
כ
ל
ב
י
ה
 
מ
י
 
י
ק
י
מ
נ
ו
 
ל
א
 
י
ס
ו
ר
 
ש
ב
ט
 
מ
י
ה
ו
ד
ה
 
ו
מ
ח
ק
ק
 
מ
ב
י
ן
 
ד
ג
ל
י
ו
 
ע
ד
 
כ
י
 
י
ב
ו
א
 
ש
ל
ה
 
ו
ל
ו
 
י
ק
ח
ת
ו
 
ע
מ
י
ם
 
א
ס
ו
ר
י
 
ל
ג
פ
ן
 
ע
י
ר
ו
 
ו
ל
ש
ר
ק
ה
 
ב
נ
י
 
א
י
ת
נ
ו
 
כ
ב
ס
 
ב
י
י
ן
 
ל
ב
ו
ש
ו
 
ו
ב
ד
ם
 
ע
נ
ב
י
ם
 
כ
ס
ו
ת
ו
 
ח
כ
ל
י
ל
ו
 
ע
י
נ
י
ם
 
מ
י
י
ן
 
ו
ל
ב
ן
 
ש
נ
י
ם
 
מ
ח
ל
ב
 
ז
ב
ו
ל
ן
 
ל
ח
ו
ף
 
י
מ
י
ם
 
י
ש
כ
ן
 
ו
ה
ו
א
 
ל
ח
ו
ף
 
א
נ
י
ו
ת
 
ו
י
ר
כ
ת
ו
 
ע
ד
 
צ
י
ד
ן
 
י
ש
ש
כ
ר
 
ח
מ
ו
ר
 
ג
ר
י
ם
 
ר
ב
ץ
 
ב
י
ן
 
ה
מ
ש
פ
ת
י
ם
 
ו
י
ר
א
 
מ
נ
ו
ח
ה
 
כ
י
 
ט
ו
ב
ה
 
ו
א
ת
 
ה
א
ר
ץ
 
כ
י
 
נ
ע
מ
ה
 
ו
י
ט
 
ש
כ
מ
ו
 
ל
ס
ב
ל
 
ו
י
ה
י
 
ל
מ
ו
ס
 
ע
ב
ד
 
ד
ן
 
י
ד
י
ן
 
ע
מ
ו
 
כ
א
ח
ד
 
ש
ב
ט
י
 
י
ש
ר
א
ל
 
י
ה
י
ה
 
ד
ן
 
נ
ח
ש
 
ע
ל
ה
 
ד
ר
ך
 
ש
פ
פ
ו
ן
 
ע
ל
י
 
א
ר
ח
 
ה
נ
ש
ך
 
ע
ק
ב
י
 
ס
ו
ס
 
ו
י
פ
ל
 
ר
כ
ב
ו
 
א
ח
ו
ר
 
ל
י
ש
ו
ע
ת
ך
 
ק
ו
י
ת
י
 
י
ה
ו
ה
 
ג
ד
 
ג
ד
ו
ד
 
י
ג
י
ד
נ
ו
 
ו
ה
ו
א
 
י
ג
י
ד
 
ע
ק
ב
 
מ
א
ש
ר
 
ש
מ
ן
 
ל
ח
מ
ו
 
ו
ה
ו
א
 
י
ת
ן
 
מ
ע
ד
נ
י
 
מ
ל
ך
 
נ
פ
ת
ל
י
 
א
י
ל
ה
 
ש
ל
ו
ח
ה
 
ה
נ
ת
ן
 
א
מ
ר
י
 
ש
פ
ר
 
ב
ן
 
פ
ר
ת
 
י
ו
ס
ף
 
ב
ן
 
פ
ר
ת
 
ע
ל
י
 
ע
י
ן
 
ב
נ
י
 
צ
ע
י
ר
י
 
ע
ל
י
 
ש
ו
ר
 
ו
י
מ
ר
ר
ה
ו
 
ו
י
ר
י
ב
ה
ו
 
ו
י
ש
ט
מ
ה
ו
 
ב
ע
ל
י
 
ח
צ
י
ם
 
ו
ת
ש
ב
 
ב
א
י
ת
ן
 
ק
ש
ת
ו
 
ו
י
פ
ז
ו
 
ז
ר
ו
ע
י
 
י
ד
י
ו
 
מ
י
ד
י
 
א
ב
י
ר
 
י
ע
ק
ב
 
מ
ש
ם
 
ר
ע
י
 
א
ב
ן
 
י
ש
ר
א
ל
 
מ
א
ל
 
א
ב
י
ך
 
ו
י
ע
ז
ר
ך
 
א
ל
 
ש
ד
י
 
ו
י
ב
ר
כ
ך
 
ב
ר
כ
ת
 
ש
מ
י
ם
 
מ
מ
ע
ל
 
ב
ר
כ
ת
 
ת
ה
ו
ם
 
ר
ב
צ
ת
 
ת
ח
ת
 
ב
ר
כ
ת
 
ש
ד
י
ם
 
ו
ר
ח
ם
 
ב
ר
כ
ת
 
א
ב
י
ך
 
ו
א
מ
ך
 
ג
ב
ר
ו
 
ע
ל
 
ב
ר
כ
ת
 
ה
ר
י
 
ע
ד
 
ת
א
ו
ת
 
ג
ב
ע
ת
 
ע
ו
ל
ם
 
ת
ה
י
נ
ה
 
ל
ר
א
ש
 
י
ו
ס
ף
 
ו
ל
ק
ד
ק
ד
 
נ
ז
י
ר
 
א
ח
י
ו
 
ב
נ
י
מ
י
ם
 
ז
א
ב
 
י
ט
ר
ף
 
ב
ב
ק
ר
 
י
א
כ
ל
 
ע
ד
י
 
ו
ל
ע
ר
ב
 
י
ח
ל
ק
 
ש
ל
ל
 
כ
ל
 
א
ל
ה
 
ש
ב
ט
י
 
י
ש
ר
א
ל
 
ש
נ
י
ם
 
ע
ש
ר
 
ו
ז
א
ת
 
א
ש
ר
 
ד
ב
ר
 
ל
ה
ם
 
א
ב
י
ה
ם
 
ו
י
ב
ר
ך
 
א
ת
ם
 
א
י
ש
 
כ
ב
ר
כ
ת
ו
 
ב
ר
ך
 
א
ת
ם
 
ו
י
צ
ו
 
א
ת
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
נ
י
 
נ
א
ס
ף
 
א
ל
 
ע
מ
י
 
ק
ב
ר
ו
 
א
ת
י
 
א
ל
 
א
ב
ו
ת
י
 
א
ל
 
ה
מ
ע
ר
ה
 
א
ש
ר
 
ב
ש
ד
ה
 
ע
פ
ר
ו
ן
 
ה
ח
ת
י
 
ב
מ
ע
ר
ה
 
א
ש
ר
 
ב
ש
ד
ה
 
ה
מ
כ
פ
ל
ה
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
מ
מ
ר
א
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
א
ש
ר
 
ק
נ
ה
 
א
ב
ר
ה
ם
 
א
ת
 
ה
ש
ד
ה
 
מ
א
ת
 
ע
פ
ר
ו
ן
 
ה
ח
ת
י
 
ל
א
ח
ז
ת
 
ק
ב
ר
 
ש
ם
 
ק
ב
ר
ו
 
א
ת
 
א
ב
ר
ה
ם
 
ו
א
ת
 
ש
ר
ה
 
א
ש
ת
ו
 
ו
ש
ם
 
ק
ב
ר
ו
 
א
ת
 
י
צ
ח
ק
 
ו
א
ת
 
ר
ב
ק
ה
 
א
ש
ת
ו
 
ו
ש
ם
 
ק
ב
ר
ת
י
 
א
ת
 
ל
א
ה
 
מ
ק
נ
ה
 
ה
ש
ד
ה
 
ו
ה
מ
ע
ר
ה
 
א
ש
ר
 
ב
ו
 
מ
א
ת
 
ב
נ
י
 
ח
ת
 
ו
י
כ
ל
 
י
ע
ק
ב
 
ל
צ
ו
ת
 
א
ת
 
ב
נ
י
ו
 
ו
י
א
ס
ף
 
ר
ג
ל
י
ו
 
א
ל
 
ה
מ
ט
ה
 
ו
י
ג
ו
ע
 
ו
י
א
ס
ף
 
א
ל
 
ע
מ
ו
 
ו
י
פ
ל
 
י
ו
ס
ף
 
ע
ל
 
פ
נ
י
 
א
ב
י
ו
 
ו
י
ב
ך
 
ע
ל
י
ו
 
ו
י
ש
ק
 
ל
ו
 
ו
י
צ
ו
 
י
ו
ס
ף
 
א
ת
 
ע
ב
ד
י
ו
 
א
ת
 
ה
ר
פ
א
י
ם
 
ל
ח
נ
ט
 
א
ת
 
א
ב
י
ו
 
ו
י
ח
נ
ט
ו
 
ה
ר
פ
א
י
ם
 
א
ת
 
י
ש
ר
א
ל
 
ו
י
מ
ל
א
ו
 
ל
ו
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
כ
י
 
כ
ן
 
י
מ
ל
א
ו
 
י
מ
י
 
ה
ח
נ
ט
י
ם
 
ו
י
ב
כ
ו
 
א
ת
ו
 
מ
צ
ר
י
מ
ה
 
ש
ב
ע
י
ם
 
י
ו
ם
 
ו
י
ע
ב
ר
ו
 
י
מ
י
 
ב
כ
י
ת
ו
 
ו
י
ד
ב
ר
 
י
ו
ס
ף
 
א
ל
 
ב
י
ת
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
כ
ם
 
ד
ב
ר
ו
 
נ
א
 
ב
א
ז
נ
י
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
א
ב
י
 
ה
ש
ב
י
ע
נ
י
 
ל
פ
נ
י
 
מ
ו
ת
ו
 
ל
א
מ
ר
 
ה
נ
ה
 
א
נ
כ
י
 
מ
ת
 
ב
ק
ב
ר
י
 
א
ש
ר
 
כ
ר
ת
י
 
ל
י
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ש
ם
 
ת
ק
ב
ר
נ
י
 
ו
ע
ת
ה
 
א
ע
ל
ה
 
נ
א
 
ו
א
ק
ב
ר
ה
 
א
ת
 
א
ב
י
 
כ
א
ש
ר
 
ה
ש
ב
י
ע
נ
י
 
ו
א
ש
ו
ב
ה
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
ע
ל
ה
 
ו
ק
ב
ר
 
א
ת
 
א
ב
י
ך
 
כ
א
ש
ר
 
ה
ש
ב
י
ע
ך
 
ו
י
ע
ל
 
י
ו
ס
ף
 
ל
ק
ב
ר
 
א
ת
 
א
ב
י
ו
 
ו
י
ע
ל
ו
 
א
ת
ו
 
כ
ל
 
ע
ב
ד
י
 
פ
ר
ע
ה
 
ז
ק
נ
י
 
ב
י
ת
ו
 
ו
כ
ל
 
ז
ק
נ
י
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
כ
ל
 
ב
י
ת
 
י
ו
ס
ף
 
א
ח
י
ו
 
ו
ב
י
ת
 
א
ב
י
ו
 
ר
ק
 
ט
פ
ם
 
ו
צ
א
נ
ם
 
ו
ב
ק
ר
ם
 
ע
ז
ב
ו
 
ב
א
ר
ץ
 
ג
ש
ן
 
ו
י
ע
ל
 
ע
מ
ו
 
ג
ם
 
ר
כ
ב
 
ג
ם
 
פ
ר
ש
י
ם
 
ו
י
ה
י
 
ה
מ
ח
נ
ה
 
כ
ב
ד
 
מ
א
ד
 
ו
י
ב
א
ו
 
ע
ד
 
ג
ר
ן
 
ה
א
ט
ד
 
א
ש
ר
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ו
י
ס
פ
ד
ו
 
ש
ם
 
מ
ס
פ
ד
 
ג
ד
ו
ל
 
ו
כ
ב
ד
 
מ
א
ד
 
ו
י
ע
ש
 
ל
א
ב
י
ו
 
א
ב
ל
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
י
ר
א
 
י
ו
ש
ב
 
ה
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
א
ת
 
ה
א
ב
ל
 
ב
ג
ר
ן
 
ה
א
ט
ד
 
ו
י
א
מ
ר
ו
 
א
ב
ל
 
כ
ב
ד
 
ז
ה
 
ל
מ
צ
ר
י
ם
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
מ
ו
 
א
ב
ל
 
מ
צ
ר
י
ם
 
א
ש
ר
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ו
י
ע
ש
ו
 
ל
ו
 
ב
נ
י
ו
 
כ
ן
 
כ
א
ש
ר
 
צ
ו
ם
 
ו
י
ש
א
ו
 
א
ת
ו
 
ב
נ
י
ו
 
א
ר
צ
ה
 
כ
נ
ע
ן
 
ו
י
ק
ב
ר
ו
 
א
ת
ו
 
ב
מ
ע
ר
ת
 
ש
ד
ה
 
ה
מ
כ
פ
ל
ה
 
א
ש
ר
 
ק
נ
ה
 
א
ב
ר
ה
ם
 
א
ת
 
ה
ש
ד
ה
 
ל
א
ח
ז
ת
 
ק
ב
ר
 
מ
א
ת
 
ע
פ
ר
ו
ן
 
ה
ח
ת
י
 
ע
ל
 
פ
נ
י
 
מ
מ
ר
א
 
ו
י
ש
ב
 
י
ו
ס
ף
 
מ
צ
ר
י
מ
ה
 
ה
ו
א
 
ו
א
ח
י
ו
 
ו
כ
ל
 
ה
ע
ל
י
ם
 
א
ת
ו
 
ל
ק
ב
ר
 
א
ת
 
א
ב
י
ו
 
א
ח
ר
י
 
ק
ב
ר
ו
 
א
ת
 
א
ב
י
ו
 
ו
י
ר
א
ו
 
א
ח
י
 
י
ו
ס
ף
 
כ
י
 
מ
ת
 
א
ב
י
ה
ם
 
ו
י
א
מ
ר
ו
 
ל
א
 
י
ש
ט
מ
נ
ו
 
י
ו
ס
ף
 
ה
ש
ב
 
י
ש
י
ב
 
ל
נ
ו
 
א
ת
 
כ
ל
 
ה
ר
ע
ה
 
א
ש
ר
 
ג
מ
ל
נ
ו
 
א
ת
ו
 
ו
י
צ
ו
ו
 
ע
ל
 
י
ו
ס
ף
 
ל
א
מ
ר
 
א
ב
י
ך
 
צ
ו
ה
 
ל
פ
נ
י
 
מ
ו
ת
ו
 
ל
א
מ
ר
 
כ
ה
 
ת
א
מ
ר
ו
ן
 
ל
י
ו
ס
ף
 
א
נ
ה
 
ש
א
 
נ
א
 
פ
ש
ע
 
א
ח
י
ך
 
ו
ח
ט
א
ת
ם
 
כ
י
 
ר
ע
ה
 
ג
מ
ל
ו
ך
 
ו
ע
ת
ה
 
ש
א
 
נ
א
 
ל
פ
ש
ע
 
ע
ב
ד
י
 
א
ל
ה
י
 
א
ב
י
ך
 
ו
י
ב
ך
 
י
ו
ס
ף
 
ב
ד
ב
ר
ם
 
א
ל
י
ו
 
ו
י
ל
כ
ו
 
ג
ם
 
א
ח
י
ו
 
ו
י
פ
ל
ו
 
ל
פ
נ
י
ו
 
ו
י
א
מ
ר
ו
 
ה
נ
נ
ו
 
ל
ך
 
ל
ע
ב
ד
י
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ו
ס
ף
 
א
ל
 
ת
י
ר
א
ו
 
ה
ת
ח
ת
 
א
ל
ה
י
ם
 
א
נ
י
 
א
ת
ם
 
ח
ש
ב
ת
ם
 
ע
ל
י
 
ר
ע
ה
 
ו
ה
א
ל
ה
י
ם
 
ח
ש
ב
ה
 
ל
ט
ו
ב
ה
 
ל
מ
ע
ן
 
ע
ש
ו
ת
 
כ
י
ו
ם
 
ה
ז
ה
 
ל
ה
ח
י
ו
ת
 
ע
ם
 
ר
ב
 
ו
ע
ת
ה
 
א
ל
 
ת
י
ר
א
ו
 
א
נ
כ
י
 
א
כ
ל
כ
ל
 
א
ת
כ
ם
 
ו
א
ת
 
ט
פ
כ
ם
 
ו
י
נ
ח
ם
 
א
ת
ם
 
ו
י
ד
ב
ר
 
א
ל
 
ל
ב
ם
 
ו
י
ש
ב
 
י
ו
ס
ף
 
ב
מ
צ
ר
י
ם
 
ה
ו
א
 
ו
ב
י
ת
 
א
ב
י
ו
 
ו
י
ח
י
 
י
ו
ס
ף
 
מ
א
ה
 
ו
ע
ש
ר
 
ש
נ
י
ם
 
ו
י
ר
א
 
י
ו
ס
ף
 
ל
א
פ
ר
י
ם
 
ב
נ
י
ם
 
ש
ל
י
ש
י
ם
 
ג
ם
 
ב
נ
י
 
מ
כ
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
י
ל
ד
ו
 
ב
י
מ
י
 
י
ו
ס
ף
 
ו
י
א
מ
ר
 
י
ו
ס
ף
 
א
ל
 
א
ח
י
ו
 
א
נ
כ
י
 
מ
ת
 
ו
ה
א
ל
ה
י
ם
 
פ
ק
ד
 
י
פ
ק
ד
 
א
ת
כ
ם
 
ו
ה
ע
ל
ה
 
א
ת
כ
ם
 
מ
ן
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ו
י
ש
ב
י
ע
 
י
ו
ס
ף
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
פ
ק
ד
 
י
פ
ק
ד
 
א
ל
ה
י
ם
 
א
ת
כ
ם
 
ו
ה
ע
ל
י
ת
ם
 
א
ת
 
ע
צ
מ
ת
י
 
מ
ז
ה
 
א
ת
כ
ם
 
ו
י
מ
ת
 
י
ו
ס
ף
 
ב
ן
 
מ
א
ה
 
ו
ע
ש
ר
 
ש
נ
י
ם
 
ו
י
ח
נ
ט
ו
 
א
ת
ו
 
ו
י
ו
ש
ם
 
ב
א
ר
ן
 
ב
מ
צ
ר
י
ם
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ה
ב
א
י
ם
 
מ
צ
ר
י
מ
ה
 
א
ת
 
י
ע
ק
ב
 
א
י
ש
 
ו
ב
י
ת
ו
 
ב
א
ו
 
ר
א
ו
ב
ן
 
ו
ש
מ
ע
ו
ן
 
ו
ל
ו
י
 
ו
י
ה
ו
ד
ה
 
ו
י
ש
ש
כ
ר
 
ו
ז
ב
ו
ל
ן
 
ו
ב
נ
י
מ
י
ם
 
ד
ן
 
ו
נ
פ
ת
ל
י
 
ג
ד
 
ו
א
ש
ר
 
ו
י
ה
י
ו
 
כ
ל
 
נ
פ
ש
 
י
צ
א
י
 
י
ר
ך
 
י
ע
ק
ב
 
ש
ב
ע
י
ם
 
נ
פ
ש
 
ו
י
ו
ס
ף
 
ה
י
ה
 
ב
מ
צ
ר
י
ם
 
ו
י
מ
ת
 
י
ו
ס
ף
 
ו
כ
ל
 
א
ח
י
ו
 
ו
כ
ל
 
ה
ד
ו
ר
 
ה
ה
ו
א
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
פ
ר
ו
 
ו
י
ש
ר
צ
ו
 
ו
י
ר
ב
ו
 
ו
י
ע
צ
מ
ו
 
ב
מ
א
ד
 
מ
א
ד
 
ו
ת
מ
ל
א
 
ה
א
ר
ץ
 
א
ת
ם
 
ו
י
ק
ם
 
מ
ל
ך
 
ח
ד
ש
 
ע
ל
 
מ
צ
ר
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
 
א
ת
 
י
ו
ס
ף
 
ו
י
א
מ
ר
 
א
ל
 
ע
מ
ו
 
ה
ן
 
ע
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
ר
ב
 
ו
ע
צ
ו
ם
 
מ
מ
נ
ו
 
ה
ב
ה
 
נ
ת
ח
כ
ם
 
ל
ו
 
פ
ן
 
י
ר
ב
ה
 
ו
ה
י
ה
 
כ
י
 
ת
ק
ר
א
נ
ו
 
מ
ל
ח
מ
ה
 
ו
נ
ו
ס
ף
 
ג
ם
 
ה
ו
א
 
ע
ל
 
ש
נ
א
י
נ
ו
 
ו
נ
ל
ח
ם
 
ב
נ
ו
 
ו
ע
ל
ה
 
מ
ן
 
ה
א
ר
ץ
 
ו
י
ש
מ
ו
 
ע
ל
י
ו
 
ש
ר
י
 
מ
ס
י
ם
 
ל
מ
ע
ן
 
ע
נ
ו
ת
ם
 
ב
ס
ב
ל
ו
ת
ם
 
ו
י
ב
נ
ו
 
ע
ר
י
 
מ
ס
כ
נ
ת
 
ל
פ
ר
ע
ה
 
א
ת
 
פ
י
ת
ו
ן
 
ו
א
ת
 
ר
ע
מ
ס
ס
 
ו
כ
א
ש
ר
 
י
ע
נ
ו
 
א
ת
ו
 
כ
ן
 
י
פ
ר
ה
 
ו
כ
ן
 
י
פ
ר
ץ
 
ו
י
ק
צ
ו
 
מ
פ
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ע
ב
ד
ו
 
מ
צ
ר
י
ם
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
פ
ר
ך
 
ו
י
מ
ר
ר
ו
 
א
ת
 
ח
י
י
ה
ם
 
ב
ע
ב
ד
ה
 
ק
ש
ה
 
ב
ח
י
מ
ר
 
ו
ב
ל
ב
נ
י
ם
 
ו
ב
כ
ל
 
ע
ב
ד
ה
 
ב
ש
ד
ה
 
א
ת
 
כ
ל
 
ע
ב
ד
ת
ם
 
א
ש
ר
 
ע
ב
ד
ו
 
ב
ה
ם
 
ב
פ
ר
ך
 
ו
י
א
מ
ר
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ל
מ
י
ל
ד
ו
ת
 
ה
ע
ב
ר
י
ו
ת
 
א
ש
ר
 
ש
ם
 
ה
א
ח
ת
 
ש
פ
ר
ה
 
ו
ש
ם
 
ה
ש
נ
י
ת
 
פ
ו
ע
ה
 
ו
י
א
מ
ר
 
ב
י
ל
ד
כ
ן
 
א
ת
 
ה
ע
ב
ר
י
ו
ת
 
ו
ר
א
י
ת
ן
 
ע
ל
 
ה
א
ב
נ
י
ם
 
א
ם
 
ב
ן
 
ה
ו
א
 
ו
ה
מ
ת
ן
 
א
ת
ו
 
ו
א
ם
 
ב
ת
 
ה
י
א
 
ו
ח
י
ת
ה
 
ו
ת
י
ר
א
נ
ה
 
ה
מ
י
ל
ד
ו
ת
 
א
ת
 
ה
א
ל
ה
י
ם
 
ו
ל
א
 
ע
ש
ו
 
כ
א
ש
ר
 
ד
ב
ר
 
א
ל
י
ה
ן
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
ת
ח
י
נ
ה
 
א
ת
 
ה
י
ל
ד
י
ם
 
ו
י
ק
ר
א
 
פ
ר
ע
ה
 
ל
מ
י
ל
ד
ו
ת
 
ו
י
א
מ
ר
 
ל
ה
ן
 
מ
ד
ו
ע
 
ע
ש
י
ת
ן
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
ת
ח
י
נ
ה
 
א
ת
 
ה
י
ל
ד
י
ם
 
ו
ת
א
מ
ר
נ
ה
 
ה
מ
י
ל
ד
ו
ת
 
א
ל
 
פ
ר
ע
ה
 
כ
י
 
ל
א
 
כ
נ
ש
י
ם
 
ה
מ
צ
ר
י
ו
ת
 
ה
ע
ב
ר
י
ו
ת
 
כ
י
 
ח
י
ו
ת
 
ה
נ
ה
 
ב
ט
ר
ם
 
ת
ב
ו
א
 
א
ל
י
ה
ן
 
ה
מ
י
ל
ד
ו
ת
 
ו
י
ל
ד
ו
 
ו
י
י
ט
ב
 
א
ל
ה
י
ם
 
ל
מ
י
ל
ד
ו
ת
 
ו
י
ר
ב
ו
 
ה
ע
ם
 
ו
י
ע
צ
מ
ו
 
מ
א
ד
 
ו
י
ה
י
 
כ
י
 
י
ר
א
ו
 
ה
מ
י
ל
ד
ו
ת
 
א
ת
 
ה
א
ל
ה
י
ם
 
ו
י
ע
ש
 
ל
ה
ם
 
ב
ת
י
ם
 
ו
י
צ
ו
 
פ
ר
ע
ה
 
ל
כ
ל
 
ע
מ
ו
 
ל
א
מ
ר
 
כ
ל
 
ה
ב
ן
 
ה
י
ל
ד
 
ל
ע
ב
ר
י
ם
 
ה
י
א
ר
 
ת
ש
ל
י
כ
ו
ן
 
ו
כ
ל
 
ה
ב
ת
 
ת
ח
י
ו
ן
 
ו
י
ל
ך
 
א
י
ש
 
מ
ב
י
ת
 
ל
ו
י
 
ו
י
ק
ח
 
א
ת
 
ב
ת
 
ל
ו
י
 
ו
ת
ה
ר
 
ה
א
ש
ה
 
ו
ת
ל
ד
 
ב
ן
 
ו
ת
ר
א
 
א
ת
ו
 
כ
י
 
ט
ו
ב
 
ה
ו
א
 
ו
ת
צ
פ
נ
ה
ו
 
ש
ל
ש
ה
 
י
ר
ח
י
ם
 
ו
ל
א
 
י
כ
ל
ה
 
ע
ו
ד
 
ה
צ
פ
נ
ה
ו
 
ו
ת
ק
ח
 
ל
ו
 
א
מ
ו
 
ת
ב
ת
 
ג
מ
א
 
ו
ת
ח
מ
ר
ה
 
ב
ח
י
מ
ר
 
ו
ב
ז
פ
ת
 
ו
ת
ש
ם
 
ב
ה
 
א
ת
 
ה
י
ל
ד
 
ו
ת
ש
ם
 
ב
ס
ף
 
ע
ל
 
ש
פ
ת
 
ה
י
א
ר
 
ו
ת
ת
י
צ
ב
 
א
ח
ו
ת
ו
 
מ
ר
ח
ק
 
ל
ד
ע
ת
 
מ
ה
 
י
ע
ש
ה
 
ל
ו
 
ו
ת
ר
ד
 
ב
ת
 
פ
ר
ע
ה
 
ל
ר
ח
ץ
 
ע
ל
 
ה
י
א
ר
 
ו
נ
ע
ר
ת
י
ה
 
ה
ל
כ
ת
 
ע
ל
 
י
ד
 
ה
י
א
ר
 
ו
ת
ר
א
 
א
ת
 
ה
ת
ב
ה
 
ב
ת
ו
ך
 
ה
ס
ף
 
ו
ת
ש
ל
ח
 
א
ת
 
א
מ
ת
ה
 
ו
ת
ק
ח
ה
 
ו
ת
פ
ת
ח
ה
 
ו
ת
ר
א
 
א
ת
 
ה
י
ל
ד
 
ו
ה
נ
ה
 
נ
ע
ר
 
ב
כ
ה
 
ו
ת
ח
מ
ל
 
ע
ל
י
ו
 
ב
ת
 
פ
ר
ע
ה
 
ו
ת
א
מ
ר
 
מ
י
ל
ד
י
 
ה
ע
ב
ר
י
ם
 
ז
ה
 
ו
ת
א
מ
ר
 
א
ח
ו
ת
ו
 
א
ל
 
ב
ת
 
פ
ר
ע
ה
 
ה
א
ל
ך
 
ו
ק
ר
א
ת
י
 
ל
י
ך
 
א
ש
ה
 
מ
י
נ
ק
ו
ת
 
מ
ן
 
ה
ע
ב
ר
י
ו
ת
 
ו
ת
י
נ
ק
 
ל
י
ך
 
א
ת
 
ה
י
ל
ד
 
ו
ת
א
מ
ר
 
ל
ה
 
ב
ת
 
פ
ר
ע
ה
 
ל
כ
י
 
ו
ת
ל
ך
 
ה
ע
ל
מ
ה
 
ו
ת
ק
ר
א
 
א
ת
 
א
ם
 
ה
י
ל
ד
 
ו
ת
א
מ
ר
 
ל
ה
 
ב
ת
 
פ
ר
ע
ה
 
ה
ל
כ
י
 
א
ת
 
ה
י
ל
ד
 
ה
ז
ה
 
ו
ה
נ
ק
ה
ו
 
ל
י
 
ו
א
נ
י
 
א
ת
ן
 
א
ת
 
ש
כ
ר
י
ך
 
ו
ת
ק
ח
 
ה
א
ש
ה
 
א
ת
 
ה
י
ל
ד
 
ו
ת
י
נ
ק
ה
ו
 
ו
י
ג
ד
ל
 
ה
נ
ע
ר
 
ו
ת
ב
א
ה
ו
 
א
ל
 
ב
ת
 
פ
ר
ע
ה
 
ו
י
ה
י
 
ל
ה
 
ל
ב
ן
 
ו
ת
ק
ר
א
 
א
ת
 
ש
מ
ו
 
מ
ש
ה
 
ו
ת
א
מ
ר
 
כ
י
 
מ
ן
 
ה
מ
י
ם
 
מ
ש
י
ת
י
ו
 
ו
י
ה
י
 
ב
י
מ
י
ם
 
ה
ה
ם
 
ו
י
ג
ד
ל
 
מ
ש
ה
 
ו
י
צ
א
 
א
ל
 
א
ח
י
ו
 
ו
י
ר
א
 
ב
ס
ב
ל
ו
ת
ם
 
ו
י
ר
א
 
א
י
ש
 
מ
צ
ר
י
 
מ
כ
ה
 
א
י
ש
 
ע
ב
ר
י
 
מ
א
ח
י
ו
 
ו
י
פ
ן
 
כ
ה
 
ו
כ
ה
 
ו
י
ר
א
 
כ
י
 
א
י
ן
 
א
י
ש
 
ו
י
ך
 
א
ת
 
ה
מ
צ
ר
י
 
ו
י
ט
מ
נ
ה
ו
 
ב
ח
ו
ל
 
ו
י
צ
א
 
ב
י
ו
ם
 
ה
ש
נ
י
 
ו
ה
נ
ה
 
ש
נ
י
 
א
נ
ש
י
ם
 
ע
ב
ר
י
ם
 
נ
צ
י
ם
 
ו
י
א
מ
ר
 
ל
ר
ש
ע
 
ל
מ
ה
 
ת
כ
ה
 
ר
ע
ך
 
ו
י
א
מ
ר
 
מ
י
 
ש
מ
ך
 
ל
א
י
ש
 
ש
ר
 
ו
ל
ש
ו
פ
ט
 
ע
ל
י
נ
ו
 
ה
ל
ה
ר
ג
נ
י
 
א
ת
ה
 
א
מ
ר
 
כ
א
ש
ר
 
ה
ר
ג
ת
 
א
ת
 
ה
מ
צ
ר
י
 
ו
י
י
ר
א
 
מ
ש
ה
 
ו
י
א
מ
ר
 
א
כ
ן
 
נ
ו
ד
ע
 
ה
ד
ב
ר
 
ו
י
ש
מ
ע
 
פ
ר
ע
ה
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
י
ב
ק
ש
 
ל
ה
ר
ג
 
א
ת
 
מ
ש
ה
 
ו
י
ב
ר
ח
 
מ
ש
ה
 
מ
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ש
ב
 
ב
א
ר
ץ
 
מ
ד
י
ן
 
ו
י
ש
ב
 
ע
ל
 
ה
ב
א
ר
 
ו
ל
כ
ה
ן
 
מ
ד
י
ן
 
ש
ב
ע
 
ב
נ
ו
ת
 
ו
ת
ב
א
נ
ה
 
ו
ת
ד
ל
א
נ
ה
 
ו
ת
מ
ל
א
נ
ה
 
א
ת
 
ה
ר
ח
ט
י
ם
 
ל
ה
ש
ק
ו
ת
 
א
ת
 
צ
א
ן
 
א
ב
י
ה
ן
 
ו
י
ב
א
ו
 
ה
ר
ע
י
ם
 
ו
י
ג
ר
ש
ו
ם
 
ו
י
ק
ם
 
מ
ש
ה
 
ו
י
ו
ש
י
ע
נ
ה
 
ו
י
ש
ק
 
א
ת
 
צ
א
נ
ם
 
ו
ת
ב
א
נ
ה
 
א
ל
 
ר
ע
ו
א
ל
 
א
ב
י
ה
ן
 
ו
י
א
מ
ר
 
מ
ד
ו
ע
 
מ
ה
ר
ת
ן
 
ב
א
 
ה
י
ו
ם
 
ו
ת
א
מ
ר
נ
ה
 
א
י
ש
 
מ
צ
ר
י
 
ה
צ
י
ל
נ
ו
 
מ
י
ד
 
ה
ר
ע
י
ם
 
ו
ג
ם
 
ד
ל
א
 
ד
ל
א
 
ל
נ
ו
 
ו
י
ש
ק
 
א
ת
 
ה
צ
א
ן
 
ו
י
א
מ
ר
 
א
ל
 
ב
נ
ת
י
ו
 
ו
א
י
ה
 
ל
מ
ה
 
ז
ה
 
ע
ז
ב
ת
ן
 
א
ת
 
ה
א
י
ש
 
ק
ר
א
ן
 
ל
ו
 
ו
י
א
כ
ל
 
ל
ח
ם
 
ו
י
א
ל
 
מ
ש
ה
 
ל
ש
ב
ת
 
א
ת
 
ה
א
י
ש
 
ו
י
ת
ן
 
א
ת
 
צ
פ
ו
ר
ה
 
ב
ת
ו
 
ל
מ
ש
ה
 
ל
א
ש
ה
 
ו
ת
ל
ד
 
ב
ן
 
ו
י
ק
ר
א
 
א
ת
 
ש
מ
ו
 
ג
ר
ש
ם
 
כ
י
 
א
מ
ר
 
ג
ר
 
ה
י
י
ת
י
 
ב
א
ר
ץ
 
נ
כ
ר
י
ה
 
ו
י
ה
י
 
ב
י
מ
י
ם
 
ה
ר
ב
י
ם
 
ה
ה
ם
 
ו
י
מ
ת
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
י
נ
ח
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ן
 
ה
ע
ב
ד
ה
 
ו
י
צ
ע
ק
ו
 
ו
ת
ע
ל
 
ש
ו
ע
ת
ם
 
א
ל
 
ה
א
ל
ה
י
ם
 
מ
ן
 
ה
ע
ב
ד
ה
 
ו
י
ש
מ
ע
 
א
ל
ה
י
ם
 
א
ת
 
נ
ק
א
ת
ם
 
ו
י
ז
כ
ר
 
א
ל
ה
י
ם
 
א
ת
 
ב
ר
י
ת
ו
 
א
ת
 
א
ב
ר
ה
ם
 
ו
א
ת
 
י
צ
ח
ק
 
ו
א
ת
 
י
ע
ק
ב
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ד
ע
 
א
ל
ה
י
ם
 
ו
מ
ש
ה
 
ה
י
ה
 
ר
ע
ה
 
א
ת
 
צ
א
ן
 
י
ת
ר
ו
 
ח
ת
נ
ו
 
כ
ה
ן
 
מ
ד
י
ן
 
ו
י
נ
ה
ג
 
א
ת
 
ה
צ
א
ן
 
א
ח
ר
 
ה
מ
ד
ב
ר
 
ו
י
ב
א
 
א
ל
 
ה
ר
 
ה
א
ל
ה
י
ם
 
ח
ו
ר
ב
ה
 
ו
י
ר
א
 
א
ל
י
ו
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ב
ל
ה
ב
ת
 
א
ש
 
מ
ת
ו
ך
 
ה
ס
נ
ה
 
ו
י
ר
א
 
ו
ה
נ
ה
 
ה
ס
נ
ה
 
ב
ע
ר
 
ב
א
ש
 
ו
ה
ס
נ
ה
 
א
י
נ
נ
ו
 
א
כ
ל
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ס
ו
ר
 
נ
א
 
ו
א
ר
א
ה
 
א
ת
 
ה
מ
ר
א
ה
 
ה
ג
ד
ו
ל
 
ה
ז
ה
 
מ
ד
ו
ע
 
ל
א
 
י
ב
ע
ר
 
ה
ס
נ
ה
 
ו
י
ר
א
 
א
ל
ה
י
ם
 
כ
י
 
ס
ר
 
ל
ר
א
ו
ת
 
ו
י
ק
ר
א
 
א
ל
י
ו
 
א
ל
ה
י
ם
 
מ
ת
ו
ך
 
ה
ס
נ
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
מ
ש
ה
 
ו
י
א
מ
ר
 
ה
נ
נ
י
 
ו
י
א
מ
ר
 
א
ל
 
ת
ק
ר
ב
 
ה
ל
ם
 
ש
ל
 
נ
ע
ל
י
ך
 
מ
ע
ל
 
ר
ג
ל
י
ך
 
כ
י
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
א
ת
ה
 
ע
מ
ד
 
ע
ל
י
ו
 
א
ד
מ
ת
 
ק
ד
ש
 
ה
י
א
 
ו
י
א
מ
ר
 
א
נ
כ
י
 
א
ל
ה
י
 
א
ב
ת
י
ך
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
א
ל
ה
י
 
י
צ
ח
ק
 
ו
א
ל
ה
י
 
י
ע
ק
ב
 
ו
י
ס
ת
ר
 
מ
ש
ה
 
פ
נ
י
ו
 
כ
י
 
י
ר
א
 
מ
ה
ב
י
ט
 
א
ל
 
ה
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ר
א
ו
 
ר
א
י
ת
י
 
א
ת
 
ע
נ
י
 
ע
מ
י
 
א
ש
ר
 
ב
מ
צ
ר
י
ם
 
ו
א
ת
 
צ
ע
ק
ת
ם
 
ש
מ
ע
ת
י
 
מ
פ
נ
י
 
נ
ג
ש
י
ו
 
כ
י
 
י
ד
ע
ת
י
 
א
ת
 
מ
כ
א
ב
ו
 
ו
א
ר
ד
ה
 
ל
ה
צ
י
ל
ו
 
מ
י
ד
 
מ
צ
ר
י
ם
 
ו
ל
ה
ע
ל
ו
ת
ו
 
מ
ן
 
ה
א
ר
ץ
 
ה
ה
י
א
 
א
ל
 
א
ר
ץ
 
ט
ו
ב
ה
 
ו
ר
ח
ב
ה
 
א
ל
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
א
ל
 
מ
ק
ו
ם
 
ה
כ
נ
ע
נ
י
 
ה
ח
ת
י
 
ו
ה
א
מ
ר
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
ו
ע
ת
ה
 
ה
נ
ה
 
צ
ע
ק
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ה
 
א
ל
י
 
ו
ג
ם
 
ר
א
י
ת
י
 
א
ת
 
ה
ל
ח
ץ
 
א
ש
ר
 
מ
צ
ר
י
ם
 
ל
ח
צ
י
ם
 
א
ת
ם
 
ו
ע
ת
ה
 
ל
ך
 
ו
א
ש
ל
ח
ך
 
א
ל
 
פ
ר
ע
ה
 
ו
ה
ו
צ
א
ת
 
א
ת
 
ע
מ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
א
ל
ה
י
ם
 
מ
י
 
א
נ
כ
י
 
כ
י
 
א
ל
ך
 
א
ל
 
פ
ר
ע
ה
 
ו
כ
י
 
א
ו
צ
י
א
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
כ
י
 
א
ה
י
ה
 
ע
מ
ך
 
ו
ז
ה
 
ל
ך
 
ה
א
ו
ת
 
כ
י
 
א
נ
כ
י
 
ש
ל
ח
ת
י
ך
 
ב
ה
ו
צ
י
א
ך
 
א
ת
 
ה
ע
ם
 
מ
מ
צ
ר
י
ם
 
ת
ע
ב
ד
ו
ן
 
א
ת
 
ה
א
ל
ה
י
ם
 
ע
ל
 
ה
ה
ר
 
ה
ז
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
א
ל
ה
י
ם
 
ה
נ
ה
 
א
נ
כ
י
 
ב
א
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
י
 
ל
ה
ם
 
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
ש
ל
ח
נ
י
 
א
ל
י
כ
ם
 
ו
א
מ
ר
ו
 
ל
י
 
מ
ה
 
ש
מ
ו
 
מ
ה
 
א
מ
ר
 
א
ל
י
ה
ם
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
מ
ש
ה
 
א
ה
י
ה
 
א
ש
ר
 
א
ה
י
ה
 
ו
י
א
מ
ר
 
כ
ה
 
ת
א
מ
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ה
י
ה
 
ש
ל
ח
נ
י
 
א
ל
י
כ
ם
 
ו
י
א
מ
ר
 
ע
ו
ד
 
א
ל
ה
י
ם
 
א
ל
 
מ
ש
ה
 
כ
ה
 
ת
א
מ
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
א
ל
ה
י
 
י
צ
ח
ק
 
ו
א
ל
ה
י
 
י
ע
ק
ב
 
ש
ל
ח
נ
י
 
א
ל
י
כ
ם
 
ז
ה
 
ש
מ
י
 
ל
ע
ו
ל
ם
 
ו
ז
ה
 
ז
כ
ר
י
 
ל
ד
ר
 
ו
ד
ר
 
ל
ך
 
ו
א
ס
פ
ת
 
א
ת
 
ז
ק
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
נ
ר
א
ה
 
א
ל
י
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
י
צ
ח
ק
 
ו
י
ע
ק
ב
 
ל
א
מ
ר
 
פ
ק
ד
 
פ
ק
ד
ת
י
 
א
ת
כ
ם
 
ו
א
ת
 
ה
ע
ש
ו
י
 
ל
כ
ם
 
ב
מ
צ
ר
י
ם
 
ו
א
מ
ר
ה
 
א
ע
ל
ה
 
א
ת
כ
ם
 
מ
ע
נ
י
 
מ
צ
ר
י
ם
 
א
ל
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ה
ח
ת
י
 
ו
ה
א
מ
ר
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
א
ל
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ו
ש
מ
ע
ו
 
ל
ק
ו
ל
ך
 
ו
ב
א
ת
 
א
ת
ה
 
ו
ז
ק
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
א
מ
ר
ת
ם
 
א
ל
י
ו
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
נ
ק
ר
א
 
ע
ל
י
נ
ו
 
נ
ל
כ
ה
 
נ
א
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ב
מ
ד
ב
ר
 
ו
נ
ז
ב
ח
ה
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
א
נ
י
 
י
ד
ע
ת
י
 
כ
י
 
ל
א
 
י
ת
ן
 
א
ת
כ
ם
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ל
ה
ל
ך
 
ה
ל
ו
א
 
ב
י
ד
 
ח
ז
ק
ה
 
ו
ש
ל
ח
ת
י
 
א
ת
 
י
ד
י
 
ו
ה
כ
י
ת
י
 
א
ת
 
מ
צ
ר
י
ם
 
ב
כ
ל
 
נ
פ
ל
א
ו
ת
י
 
א
ש
ר
 
א
ע
ש
ה
 
ב
ק
ר
ב
ו
 
ו
א
ח
ר
י
 
כ
ן
 
י
ש
ל
ח
 
א
ת
כ
ם
 
ו
נ
ת
ת
י
 
א
ת
 
ח
ן
 
ה
ע
ם
 
ה
ז
ה
 
ב
ע
י
נ
י
 
מ
צ
ר
י
ם
 
ו
ה
י
ה
 
כ
י
 
ת
ל
כ
ו
ן
 
ל
א
 
ת
ל
כ
ו
ן
 
ר
ק
י
ם
 
ו
ש
א
ל
 
א
י
ש
 
מ
א
ת
 
ר
ע
ה
ו
 
ו
א
ש
ה
 
מ
א
ת
 
ר
ע
ו
ת
ה
 
מ
ש
כ
י
נ
ת
ה
 
ו
מ
ג
י
ר
ת
 
ב
י
ת
ה
 
כ
ל
י
 
כ
ס
ף
 
ו
כ
ל
י
 
ז
ה
ב
 
ו
ש
מ
ל
ו
ת
 
ו
ש
מ
ת
ם
 
ע
ל
 
ב
נ
י
כ
ם
 
ו
ע
ל
 
ב
נ
ת
י
כ
ם
 
ו
נ
צ
ל
ת
ם
 
א
ת
 
מ
צ
ר
י
ם
 
ו
י
ע
ן
 
מ
ש
ה
 
ו
י
א
מ
ר
 
ו
ה
ן
 
ל
א
 
י
א
מ
נ
ו
 
ל
י
 
ו
ל
א
 
י
ש
מ
ע
ו
 
ל
ק
ו
ל
י
 
כ
י
 
י
א
מ
ר
ו
 
ל
א
 
נ
ר
א
ה
 
א
ל
י
ך
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
י
ה
ו
ה
 
מ
ה
 
ז
ה
 
ב
י
ד
ך
 
ו
י
א
מ
ר
 
מ
ט
ה
 
ו
י
א
מ
ר
 
ה
ש
ל
י
כ
ה
ו
 
א
ר
צ
ה
 
ו
י
ש
ל
כ
ה
ו
 
א
ר
צ
ה
 
ו
י
ה
י
 
ל
נ
ח
ש
 
ו
י
נ
ס
 
מ
ש
ה
 
מ
פ
נ
י
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ש
ל
ח
 
י
ד
ך
 
ו
א
ח
ז
 
ב
ז
נ
ב
ו
 
ו
י
ש
ל
ח
 
י
ד
ו
 
ו
י
ח
ז
ק
 
ב
ו
 
ו
י
ה
י
 
ל
מ
ט
ה
 
ב
כ
פ
ו
 
ל
מ
ע
ן
 
י
א
מ
נ
ו
 
כ
י
 
נ
ר
א
ה
 
א
ל
י
ך
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ו
ת
ם
 
א
ל
ה
י
 
א
ב
ר
ה
ם
 
ו
א
ל
ה
י
 
י
צ
ח
ק
 
ו
א
ל
ה
י
 
י
ע
ק
ב
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ל
ו
 
ע
ו
ד
 
ה
ב
א
 
נ
א
 
י
ד
ך
 
ב
ח
י
ק
ך
 
ו
י
ב
א
 
י
ד
ו
 
ב
ח
י
ק
ו
 
ו
י
ו
צ
י
א
ה
 
מ
ח
י
ק
ו
 
ו
ה
נ
ה
 
י
ד
ו
 
מ
צ
ר
ע
ת
 
כ
ש
ל
ג
 
ו
י
א
מ
ר
 
ה
ש
ב
 
י
ד
ך
 
א
ל
 
ח
י
ק
ך
 
ו
י
ש
ב
 
י
ד
ו
 
א
ל
 
ח
י
ק
ו
 
ו
י
ו
צ
י
א
ה
 
מ
ח
י
ק
ו
 
ו
ה
נ
ה
 
ש
ב
ה
 
כ
ב
ש
ר
ו
 
ו
ה
י
ה
 
א
ם
 
ל
א
 
י
א
מ
נ
ו
 
ל
ך
 
ו
ל
א
 
י
ש
מ
ע
ו
 
ל
ק
ו
ל
 
ה
א
ו
ת
 
ה
ר
א
י
ש
ו
ן
 
ו
ה
א
מ
נ
ו
 
ל
ק
ו
ל
 
ה
א
ו
ת
 
ה
א
ח
ר
ו
ן
 
ו
ה
י
ה
 
א
ם
 
ל
א
 
י
א
מ
נ
ו
 
ג
ם
 
ל
ש
נ
י
 
ה
א
ת
ו
ת
 
ה
א
ל
ה
 
ו
ל
א
 
י
ש
מ
ע
ו
 
ל
ק
ו
ל
ך
 
ו
ל
ק
ח
ת
 
מ
מ
י
מ
י
 
ה
י
א
ר
 
ו
ש
פ
כ
ת
 
ה
י
ב
ש
ה
 
ו
ה
י
ו
 
ה
מ
י
ם
 
א
ש
ר
 
ת
ק
ח
 
מ
ן
 
ה
י
א
ר
 
י
ה
י
ו
 
ל
ד
ם
 
ב
י
ב
ש
ת
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ב
י
 
א
ד
נ
י
 
ל
א
 
א
י
ש
 
ד
ב
ר
י
ם
 
א
נ
כ
י
 
ג
ם
 
מ
ת
מ
ו
ל
 
ג
ם
 
מ
ש
ל
ש
ו
ם
 
ג
ם
 
מ
א
ז
 
ד
ב
ר
ך
 
א
ל
 
ע
ב
ד
ך
 
כ
י
 
כ
ב
ד
 
פ
ה
 
ו
כ
ב
ד
 
ל
ש
ו
ן
 
א
נ
כ
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
ו
 
מ
י
 
ש
ם
 
פ
ה
 
ל
א
ד
ם
 
א
ו
 
מ
י
 
י
ש
י
ם
 
א
ל
ם
 
א
ו
 
ח
ר
ש
 
א
ו
 
פ
ק
ח
 
א
ו
 
ע
ו
ר
 
ה
ל
ו
א
 
א
נ
כ
י
 
י
ה
ו
ה
 
ו
ע
ת
ה
 
ל
ך
 
ו
א
נ
כ
י
 
א
ה
י
ה
 
ע
ם
 
פ
י
ך
 
ו
ה
ו
ר
י
ת
י
ך
 
א
ש
ר
 
ת
ד
ב
ר
 
ו
י
א
מ
ר
 
ב
י
 
א
ד
נ
י
 
ש
ל
ח
 
נ
א
 
ב
י
ד
 
ת
ש
ל
ח
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ב
מ
ש
ה
 
ו
י
א
מ
ר
 
ה
ל
ו
א
 
א
ה
ר
ן
 
א
ח
י
ך
 
ה
ל
ו
י
 
י
ד
ע
ת
י
 
כ
י
 
ד
ב
ר
 
י
ד
ב
ר
 
ה
ו
א
 
ו
ג
ם
 
ה
נ
ה
 
ה
ו
א
 
י
צ
א
 
ל
ק
ר
א
ת
ך
 
ו
ר
א
ך
 
ו
ש
מ
ח
 
ב
ל
ב
ב
ו
 
ו
ד
ב
ר
ת
 
א
ל
י
ו
 
ו
ש
מ
ת
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ב
פ
י
ו
 
ו
א
נ
כ
י
 
א
ה
י
ה
 
ע
ם
 
פ
י
ך
 
ו
ע
ם
 
פ
י
ו
 
ו
ה
ו
ר
י
ת
י
 
א
ת
כ
ם
 
א
ת
 
א
ש
ר
 
ת
ע
ש
ו
ן
 
ו
ד
ב
ר
 
ה
ו
א
 
ל
ך
 
א
ל
 
ה
ע
ם
 
ו
ה
י
ה
 
ה
ו
א
 
י
ה
י
ה
 
ל
ך
 
ל
פ
ה
 
ו
א
ת
ה
 
ת
ה
י
ה
 
ל
ו
 
ל
א
ל
ה
י
ם
 
ו
א
ת
 
ה
מ
ט
ה
 
ה
ז
ה
 
ת
ק
ח
 
ב
י
ד
ך
 
א
ש
ר
 
ת
ע
ש
ה
 
ב
ו
 
א
ת
 
ה
א
ת
ו
ת
 
ו
י
ל
ך
 
מ
ש
ה
 
ו
י
ש
ב
 
א
ל
 
י
ת
ר
ו
 
ח
ת
נ
ו
 
ו
י
א
מ
ר
 
ל
ו
 
א
ל
כ
ה
 
נ
א
 
ו
א
ש
ו
ב
ה
 
א
ל
 
א
ח
י
 
א
ש
ר
 
ב
מ
צ
ר
י
ם
 
ו
א
ר
א
ה
 
ה
ע
ו
ד
ם
 
ח
י
י
ם
 
ו
י
א
מ
ר
 
י
ת
ר
ו
 
ל
מ
ש
ה
 
ל
ך
 
ל
ש
ל
ו
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
מ
ד
י
ן
 
ל
ך
 
ש
ו
ב
 
מ
צ
ר
י
מ
ה
 
כ
י
 
מ
ת
ו
 
כ
ל
 
ה
א
נ
ש
י
ם
 
ה
מ
ב
ק
ש
י
ם
 
א
ת
 
נ
פ
ש
ך
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
א
ש
ת
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ו
י
ר
כ
ב
ם
 
ע
ל
 
ה
ח
מ
ו
ר
 
ו
י
ש
ב
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
מ
ט
ה
 
ה
א
ל
ה
י
ם
 
ב
י
ד
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
ל
כ
ת
ך
 
ל
ש
ו
ב
 
מ
צ
ר
י
מ
ה
 
ר
א
ה
 
א
ת
 
כ
ל
 
ה
מ
ו
פ
ת
י
ם
 
א
ש
ר
 
ש
מ
ת
י
 
ב
י
ד
ך
 
ו
ע
ש
י
ת
ם
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
א
נ
י
 
א
ח
ז
י
ק
 
א
ת
 
ל
ב
ו
 
ו
ל
א
 
י
ש
ל
ח
 
א
ת
 
ה
ע
ם
 
ו
א
מ
ר
ת
 
א
ל
 
פ
ר
ע
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ב
נ
י
 
ב
כ
ו
ר
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
 
א
ל
י
ך
 
ש
ל
ח
 
א
ת
 
ב
נ
י
 
ו
י
ע
ב
ד
נ
י
 
ו
ת
מ
א
ן
 
ל
ש
ל
ח
ו
 
ה
נ
ה
 
א
נ
כ
י
 
ה
ר
ג
 
א
ת
 
ב
נ
ך
 
ב
כ
ו
ר
ך
 
ו
י
ה
י
 
ב
ד
ר
ך
 
ב
מ
ל
ו
ן
 
ו
י
פ
ג
ש
ה
ו
 
י
ה
ו
ה
 
ו
י
ב
ק
ש
 
ה
מ
י
ת
ו
 
ו
ת
ק
ח
 
צ
פ
ו
ר
ה
 
צ
ר
 
ו
ת
כ
ר
ת
 
א
ת
 
ע
ר
ל
ת
 
ב
נ
ה
 
ו
ת
ג
י
ע
 
ל
ר
ג
ל
י
ו
 
ו
ת
א
מ
ר
 
כ
י
 
ח
ת
ן
 
ד
מ
י
ם
 
א
ת
ה
 
ל
י
 
ו
י
ר
ף
 
מ
מ
נ
ה
 
א
ז
 
א
מ
ר
ה
 
ח
ת
ן
 
ד
מ
י
ם
 
ל
מ
ל
ו
ת
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
א
ה
ר
ן
 
ל
ך
 
ל
ק
ר
א
ת
 
מ
ש
ה
 
ה
מ
ד
ב
ר
ה
 
ו
י
ל
ך
 
ו
י
פ
ג
ש
ה
ו
 
ב
ה
ר
 
ה
א
ל
ה
י
ם
 
ו
י
ש
ק
 
ל
ו
 
ו
י
ג
ד
 
מ
ש
ה
 
ל
א
ה
ר
ן
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
י
ה
ו
ה
 
א
ש
ר
 
ש
ל
ח
ו
 
ו
א
ת
 
כ
ל
 
ה
א
ת
ו
ת
 
א
ש
ר
 
צ
ו
ה
ו
 
ו
י
ל
כ
ו
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
י
א
ס
פ
ו
 
א
ת
 
כ
ל
 
ז
ק
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ד
ב
ר
 
א
ה
ר
ן
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
י
ע
ש
 
ה
א
ת
ו
ת
 
ל
ע
י
נ
י
 
ה
ע
ם
 
ו
י
א
מ
נ
ו
 
ה
ע
ם
 
ו
י
ש
מ
ע
ו
 
כ
י
 
פ
ק
ד
 
י
ה
ו
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
כ
י
 
ר
א
ה
 
א
ת
 
ע
נ
י
ם
 
ו
י
ק
ד
ו
 
ו
י
ש
ת
ח
ו
ו
 
ו
א
ח
ר
 
ב
א
ו
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
י
א
מ
ר
ו
 
א
ל
 
פ
ר
ע
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
י
ש
ר
א
ל
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ח
ג
ו
 
ל
י
 
ב
מ
ד
ב
ר
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
מ
י
 
י
ה
ו
ה
 
א
ש
ר
 
א
ש
מ
ע
 
ב
ק
ו
ל
ו
 
ל
ש
ל
ח
 
א
ת
 
י
ש
ר
א
ל
 
ל
א
 
י
ד
ע
ת
י
 
א
ת
 
י
ה
ו
ה
 
ו
ג
ם
 
א
ת
 
י
ש
ר
א
ל
 
ל
א
 
א
ש
ל
ח
 
ו
י
א
מ
ר
ו
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
נ
ק
ר
א
 
ע
ל
י
נ
ו
 
נ
ל
כ
ה
 
נ
א
 
ה
מ
ד
ב
ר
ה
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ו
נ
ז
ב
ח
ה
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
פ
ן
 
י
פ
ג
ע
נ
ו
 
ב
ד
ב
ר
 
א
ו
 
ב
ח
ר
ב
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ל
מ
ה
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ת
פ
ר
י
ד
ו
 
א
ת
 
ה
ע
ם
 
מ
מ
ע
ש
י
ו
 
ל
כ
ו
 
ל
ס
ב
ל
ת
י
כ
ם
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
ה
ן
 
ר
ב
י
ם
 
ע
ת
ה
 
מ
ע
ם
 
ה
א
ר
ץ
 
ו
ה
ש
ב
ת
ם
 
א
ת
ם
 
מ
ס
ב
ל
ו
ת
ם
 
ו
י
צ
ו
 
פ
ר
ע
ה
 
ב
י
ו
ם
 
ה
ה
ו
א
 
א
ת
 
ה
נ
ג
ש
י
ם
 
ב
ע
ם
 
ו
א
ת
 
ש
ו
ט
ר
י
ו
 
ל
א
מ
ר
 
ל
א
 
ת
ו
ס
י
פ
ו
ן
 
ל
ת
ת
 
ת
ב
ן
 
ל
ע
ם
 
ל
ל
ב
ן
 
ל
ב
נ
י
ם
 
כ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ה
ם
 
י
ל
כ
ו
 
י
ק
ש
ש
ו
 
ל
ה
ם
 
ת
ב
ן
 
ו
א
ת
 
מ
ת
כ
נ
ת
 
ה
ל
ב
נ
י
ם
 
א
ש
ר
 
ה
ם
 
ע
ש
י
ם
 
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ת
ש
י
מ
ו
 
ע
ל
י
ה
ם
 
ל
א
 
ת
ג
ר
ע
ו
 
מ
מ
נ
ו
 
כ
י
 
נ
ר
פ
י
ם
 
ה
ם
 
ע
ל
 
כ
ן
 
ה
ם
 
צ
ע
ק
י
ם
 
ל
א
מ
ר
 
נ
ל
כ
ה
 
נ
ז
ב
ח
ה
 
ל
א
ל
ה
י
נ
ו
 
ת
כ
ב
ד
 
ה
ע
ב
ד
ה
 
ע
ל
 
ה
א
נ
ש
י
ם
 
ו
י
ש
ע
ו
 
ב
ה
 
ו
ל
א
 
י
ש
ע
ו
 
ב
ד
ב
ר
י
 
ש
ק
ר
 
ו
י
צ
א
ו
 
נ
ג
ש
י
 
ה
ע
ם
 
ו
ש
ו
ט
ר
י
ו
 
ו
י
ד
ב
ר
ו
 
א
ל
 
ה
ע
ם
 
ל
א
מ
ר
 
כ
ה
 
א
מ
ר
 
פ
ר
ע
ה
 
א
י
נ
נ
י
 
נ
ת
ן
 
ל
כ
ם
 
ת
ב
ן
 
א
ת
ם
 
ל
כ
ו
 
ק
ח
ו
 
ל
כ
ם
 
ת
ב
ן
 
מ
א
ש
ר
 
ת
מ
צ
א
ו
 
כ
י
 
א
י
ן
 
נ
ג
ר
ע
 
מ
ע
ב
ד
ת
כ
ם
 
ד
ב
ר
 
ו
י
פ
ץ
 
ה
ע
ם
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ק
ש
ש
 
ק
ש
 
ל
ת
ב
ן
 
ו
ה
נ
ג
ש
י
ם
 
א
צ
ו
י
ם
 
ב
ע
ם
 
ל
א
מ
ר
 
כ
ל
ו
 
מ
ע
ש
י
כ
ם
 
ד
ב
ר
 
י
ו
ם
 
ב
י
ו
מ
ו
 
כ
א
ש
ר
 
ב
ה
י
ו
ת
 
ה
ת
ב
ן
 
נ
ת
ן
 
ל
כ
ם
 
ו
י
כ
ו
 
ש
ו
ט
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
ש
מ
ו
 
ע
ל
י
ה
ם
 
נ
ג
ש
י
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
מ
ד
ו
ע
 
ל
א
 
כ
ל
י
ת
ם
 
ח
ק
כ
ם
 
ל
ל
ב
ן
 
כ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ג
ם
 
ת
מ
ו
ל
 
ג
ם
 
ה
י
ו
ם
 
ו
י
ב
א
ו
 
ש
ו
ט
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
צ
ע
ק
ו
 
א
ל
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
ל
מ
ה
 
ת
ע
ש
ה
 
כ
ה
 
ל
ע
ב
ד
י
ך
 
ת
ב
ן
 
א
י
ן
 
נ
ת
ן
 
ל
ע
ב
ד
י
ך
 
ו
ל
ב
נ
י
ם
 
א
מ
ר
י
ם
 
ל
נ
ו
 
ע
ש
ו
 
ו
ה
נ
ה
 
ע
ב
ד
י
ך
 
מ
כ
י
ם
 
ו
ח
ט
א
ת
 
ע
מ
ך
 
ו
י
א
מ
ר
 
נ
ר
פ
י
ם
 
א
ת
ם
 
נ
ר
פ
י
ם
 
ע
ל
 
כ
ן
 
א
ת
ם
 
א
מ
ר
י
ם
 
נ
ל
כ
ה
 
נ
ז
ב
ח
ה
 
ל
י
ה
ו
ה
 
ו
ע
ת
ה
 
ל
כ
ו
 
ע
ב
ד
ו
 
ו
ת
ב
ן
 
ל
א
 
י
נ
ת
ן
 
ל
כ
ם
 
ו
ת
כ
ן
 
ה
ל
ב
נ
י
ם
 
ת
ת
נ
ו
 
ו
י
ר
א
ו
 
ש
ו
ט
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
ם
 
ב
ר
ע
 
ל
א
מ
ר
 
ל
א
 
י
ג
ר
ע
 
מ
ל
ב
נ
י
כ
ם
 
ד
ב
ר
 
י
ו
ם
 
ב
י
ו
מ
ו
 
ו
י
פ
ג
ע
ו
 
א
ת
 
מ
ש
ה
 
ו
א
ת
 
א
ה
ר
ן
 
נ
צ
ב
י
ם
 
ל
ק
ר
א
ת
ם
 
ב
צ
א
ת
ם
 
מ
א
ת
 
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
א
ל
י
ה
ם
 
י
ר
א
ה
 
י
ה
ו
ה
 
ע
ל
י
כ
ם
 
ו
י
ש
פ
ט
 
א
ש
ר
 
ה
ב
א
ש
ת
ם
 
א
ת
 
ר
י
ח
נ
ו
 
ב
ע
י
נ
י
 
פ
ר
ע
ה
 
ו
ב
ע
י
נ
י
 
ע
ב
ד
י
ו
 
ל
ת
ת
 
ח
ר
ב
 
ב
י
ד
ו
 
ל
ה
ר
ג
נ
ו
 
ו
י
ש
ב
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
א
ד
נ
י
 
ל
מ
ה
 
ה
ר
ע
ת
 
ל
ע
ם
 
ה
ז
ה
 
ו
ל
מ
ה
 
ז
ה
 
ש
ל
ח
ת
נ
י
 
ו
מ
א
ז
 
ב
א
ת
י
 
א
ל
 
פ
ר
ע
ה
 
ל
ד
ב
ר
 
ב
ש
מ
ך
 
ה
ר
ע
 
ל
ע
ם
 
ה
ז
ה
 
ו
ה
צ
ל
 
ל
א
 
ה
צ
ל
ת
 
א
ת
 
ע
מ
ך
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ת
ה
 
ת
ר
א
ה
 
א
ת
 
א
ש
ר
 
א
ע
ש
ה
 
ל
פ
ר
ע
ה
 
כ
י
 
ב
י
ד
 
ח
ז
ק
ה
 
י
ש
ל
ח
ם
 
ו
ב
י
ד
 
ח
ז
ק
ה
 
י
ג
ר
ש
ם
 
מ
א
ר
צ
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
נ
י
 
י
ה
ו
ה
 
ו
א
ר
א
ה
 
א
ל
 
א
ב
ר
ה
ם
 
ו
א
ל
 
י
צ
ח
ק
 
ו
א
ל
 
י
ע
ק
ב
 
ב
א
ל
 
ש
ד
י
 
ו
ש
מ
י
 
י
ה
ו
ה
 
ל
א
 
נ
ו
ד
ע
ת
י
 
ל
ה
ם
 
ו
ג
ם
 
ה
ק
מ
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
א
ת
ם
 
ל
ת
ת
 
ל
ה
ם
 
א
ת
 
א
ר
ץ
 
כ
נ
ע
ן
 
א
ת
 
א
ר
ץ
 
מ
ג
ר
י
ה
ם
 
א
ש
ר
 
ג
ר
ו
 
ב
ה
 
ו
ג
ם
 
א
נ
י
 
ש
מ
ע
ת
י
 
א
ת
 
נ
ק
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
מ
צ
ר
י
ם
 
מ
ע
ב
ד
י
ם
 
א
ת
ם
 
ו
א
ז
כ
ר
ה
 
א
ת
 
ב
ר
י
ת
י
 
ל
כ
ן
 
א
מ
ר
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
א
נ
י
 
י
ה
ו
ה
 
ו
ה
ו
צ
א
ת
י
 
א
ת
כ
ם
 
מ
ת
ח
ת
 
ס
ב
ל
ו
ת
 
מ
צ
ר
י
ם
 
ו
ה
צ
ל
ת
י
 
א
ת
כ
ם
 
מ
ע
ב
ד
ת
ם
 
ו
ג
א
ל
ת
י
 
א
ת
כ
ם
 
ב
ז
ר
ו
ע
 
נ
ט
ו
י
ה
 
ו
ב
מ
ש
פ
ט
י
ם
 
ג
ד
ל
י
ם
 
ו
ל
ק
ח
ת
י
 
א
ת
כ
ם
 
ל
י
 
ל
ע
ם
 
ו
ה
י
י
ת
י
 
ל
כ
ם
 
ל
א
ל
ה
י
ם
 
ו
י
ד
ע
ת
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
מ
ו
צ
א
 
א
ת
כ
ם
 
מ
ת
ח
ת
 
ס
ב
ל
ו
ת
 
מ
צ
ר
י
ם
 
ו
ה
ב
א
ת
י
 
א
ת
כ
ם
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
א
ת
י
 
א
ת
 
י
ד
י
 
ל
ת
ת
 
א
ת
ה
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ו
נ
ת
ת
י
 
א
ת
ה
 
ל
כ
ם
 
מ
ו
ר
ש
ה
 
א
נ
י
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
כ
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
א
 
ש
מ
ע
ו
 
א
ל
 
מ
ש
ה
 
מ
ק
צ
ר
 
ר
ו
ח
 
ו
מ
ע
ב
ד
ה
 
ק
ש
ה
 
ו
י
א
מ
ר
ו
 
א
ל
 
מ
ש
ה
 
ח
ד
ל
 
נ
א
 
מ
מ
נ
ו
 
ו
נ
ע
ב
ד
ה
 
א
ת
 
מ
צ
ר
י
ם
 
כ
י
 
ט
ו
ב
 
ל
נ
ו
 
ע
ב
ד
 
א
ת
 
מ
צ
ר
י
ם
 
מ
מ
ו
ת
נ
ו
 
ב
מ
ד
ב
ר
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ב
א
 
ד
ב
ר
 
א
ל
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
י
ש
ל
ח
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
צ
ו
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
א
מ
ר
 
ה
ן
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
ש
מ
ע
ו
 
א
ל
י
 
ו
א
י
ך
 
י
ש
מ
ע
נ
י
 
פ
ר
ע
ה
 
ו
א
נ
י
 
ע
ר
ל
 
ש
פ
ת
י
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ו
י
צ
ו
ם
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ל
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ל
ה
ו
צ
י
א
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
א
ל
ה
 
ר
א
ש
י
 
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
נ
י
 
ר
א
ו
ב
ן
 
ב
כ
ו
ר
 
י
ש
ר
א
ל
 
ח
נ
ו
ך
 
ו
פ
ל
ו
א
 
ח
צ
ר
ו
ן
 
ו
כ
ר
מ
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ר
א
ו
ב
ן
 
ו
ב
נ
י
 
ש
מ
ע
ו
ן
 
י
מ
ו
א
ל
 
ו
י
מ
י
ן
 
ו
א
ח
ד
 
ו
י
כ
י
ן
 
ו
צ
ה
ר
 
ו
ש
א
ו
ל
 
ב
ן
 
ה
כ
נ
ע
נ
י
ת
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ש
מ
ע
ו
ן
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
ל
ו
י
 
ל
ת
ו
ל
ד
ת
ם
 
ג
ר
ש
ו
ן
 
ק
ה
ת
 
ו
מ
ר
ר
י
 
ו
ש
נ
י
 
ח
י
י
 
ל
ו
י
 
ש
ב
ע
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
ב
נ
י
 
ג
ר
ש
ו
ן
 
ל
ב
נ
י
 
ו
ש
מ
ע
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ו
ב
נ
י
 
ק
ה
ת
 
ע
מ
ר
ם
 
ו
י
צ
ה
ר
 
ח
ב
ר
ו
ן
 
ו
ע
ז
י
א
ל
 
ו
ש
נ
י
 
ח
י
י
 
ק
ה
ת
 
ש
ל
ש
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
ב
נ
י
 
מ
ר
ר
י
 
מ
ח
ל
י
 
ו
מ
ו
ש
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ה
ל
ו
י
 
ל
ת
ו
ל
ד
ת
ם
 
ו
י
ק
ח
 
ע
מ
ר
ם
 
א
ת
 
י
ו
כ
ב
ד
 
ד
ד
ת
ו
 
ל
ו
 
ל
א
ש
ה
 
ו
ת
ל
ד
 
ל
ו
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
מ
ש
ה
 
ו
א
ת
 
מ
ר
י
ם
 
א
ח
ו
ת
ם
 
ו
ש
נ
י
 
ח
י
י
 
ע
מ
ר
ם
 
ש
ש
 
ו
ש
ל
ש
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ו
ב
נ
י
 
י
צ
ה
ר
 
ק
ר
ח
 
ו
נ
פ
ג
 
ו
ז
כ
ר
י
 
ו
ב
נ
י
 
ע
ז
י
א
ל
 
מ
י
ש
א
ל
 
ו
א
ל
י
צ
פ
ן
 
ו
ס
ת
ר
י
 
ו
י
ק
ח
 
א
ה
ר
ן
 
א
ת
 
א
ל
י
ש
ב
ע
 
ב
ת
 
ע
מ
י
נ
ד
ב
 
א
ח
ו
ת
 
נ
ח
ש
ו
ן
 
ל
ו
 
ל
א
ש
ה
 
ו
ת
ל
ד
 
ל
ו
 
א
ת
 
נ
ד
ב
 
ו
א
ת
 
א
ב
י
ה
ו
א
 
א
ת
 
א
ל
ע
ז
ר
 
ו
א
ת
 
א
י
ת
מ
ר
 
ו
ב
נ
י
 
ק
ר
ח
 
א
ס
ו
ר
 
ו
א
ל
ק
נ
ה
 
ו
א
ב
י
ס
ף
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ה
ק
ר
ח
י
 
ו
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ל
ק
ח
 
ל
ו
 
מ
ב
נ
ו
ת
 
פ
ו
ט
א
ל
 
ל
ו
 
ל
א
ש
ה
 
ו
ת
ל
ד
 
ל
ו
 
א
ת
 
פ
י
נ
ח
ס
 
א
ל
ה
 
ר
א
ש
י
 
א
ב
ו
ת
 
ה
ל
ו
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ה
ו
א
 
א
ה
ר
ן
 
ו
מ
ש
ה
 
א
ש
ר
 
א
מ
ר
 
י
ה
ו
ה
 
ל
ה
ם
 
ה
ו
צ
י
א
ו
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ל
 
צ
ב
א
ת
ם
 
ה
ם
 
ה
מ
ד
ב
ר
י
ם
 
א
ל
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ל
ה
ו
צ
י
א
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ה
ו
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
י
ה
י
 
ב
י
ו
ם
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
א
נ
י
 
י
ה
ו
ה
 
ד
ב
ר
 
א
ל
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
נ
י
 
ד
ב
ר
 
א
ל
י
ך
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ה
ן
 
א
נ
י
 
ע
ר
ל
 
ש
פ
ת
י
ם
 
ו
א
י
ך
 
י
ש
מ
ע
נ
י
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ר
א
ה
 
נ
ת
ת
י
ך
 
א
ל
ה
י
ם
 
ל
פ
ר
ע
ה
 
ו
א
ה
ר
ן
 
א
ח
י
ך
 
י
ה
י
ה
 
נ
ב
י
א
ך
 
א
ת
ה
 
ת
ד
ב
ר
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
צ
ו
ך
 
ו
א
ה
ר
ן
 
א
ח
י
ך
 
י
ד
ב
ר
 
א
ל
 
פ
ר
ע
ה
 
ו
ש
ל
ח
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
צ
ו
 
ו
א
נ
י
 
א
ק
ש
ה
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
ו
ה
ר
ב
י
ת
י
 
א
ת
 
א
ת
ו
ת
י
 
ו
א
ת
 
מ
ו
פ
ת
י
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ל
א
 
י
ש
מ
ע
 
א
ל
י
כ
ם
 
פ
ר
ע
ה
 
ו
נ
ת
ת
י
 
א
ת
 
י
ד
י
 
ב
מ
צ
ר
י
ם
 
ו
ה
ו
צ
א
ת
י
 
א
ת
 
צ
ב
א
ת
י
 
א
ת
 
ע
מ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
מ
ש
פ
ט
י
ם
 
ג
ד
ל
י
ם
 
ו
י
ד
ע
ו
 
כ
ל
 
מ
צ
ר
י
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ב
נ
ט
ת
י
 
א
ת
 
י
ד
י
 
ע
ל
 
מ
צ
ר
י
ם
 
ו
ה
ו
צ
א
ת
י
 
א
ת
 
ע
מ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ת
ו
כ
ם
 
ו
י
ע
ש
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ם
 
כ
ן
 
ע
ש
ו
 
ו
מ
ש
ה
 
ב
ן
 
ש
מ
נ
י
ם
 
ש
נ
ה
 
ו
א
ה
ר
ן
 
ב
ן
 
ש
ל
ש
 
ו
ש
מ
נ
י
ם
 
ש
נ
ה
 
ב
ד
ב
ר
ם
 
א
ל
 
פ
ר
ע
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
כ
י
 
י
ד
ב
ר
 
א
ל
י
כ
ם
 
פ
ר
ע
ה
 
ל
א
מ
ר
 
ת
נ
ו
 
ל
כ
ם
 
א
ו
ת
 
א
ו
 
מ
ו
פ
ת
 
ו
א
מ
ר
ת
 
א
ל
 
א
ה
ר
ן
 
ק
ח
 
א
ת
 
מ
ט
ך
 
ו
ה
ש
ל
י
ך
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ה
י
 
ל
ת
נ
י
ן
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ע
ש
ו
 
כ
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
י
ש
ל
י
ך
 
א
ה
ר
ן
 
א
ת
 
מ
ט
ה
ו
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
ל
פ
נ
י
 
ע
ב
ד
י
ו
 
ו
י
ה
י
 
ל
ת
נ
י
ן
 
ו
י
ק
ר
א
 
ג
ם
 
פ
ר
ע
ה
 
ל
ח
כ
מ
י
ם
 
ו
ל
מ
כ
ש
פ
י
ם
 
ו
י
ע
ש
ו
 
ג
ם
 
ה
ם
 
ח
ר
ט
מ
י
 
מ
צ
ר
י
ם
 
ב
ל
ח
ט
י
ה
ם
 
כ
ן
 
ו
י
ש
ל
כ
ו
 
א
י
ש
 
מ
ט
ה
ו
 
ו
י
ה
י
ו
 
ל
ת
נ
י
נ
י
ם
 
ו
י
ב
ל
ע
 
מ
ט
ה
 
א
ה
ר
ן
 
א
ת
 
מ
ט
ו
ת
ם
 
ו
י
ח
ז
ק
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
ה
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
כ
ב
ד
 
ל
ב
 
פ
ר
ע
ה
 
מ
א
ן
 
ל
ש
ל
ח
 
א
ת
 
ה
ע
ם
 
ל
ך
 
א
ל
 
פ
ר
ע
ה
 
ב
ב
ק
ר
 
ה
נ
ה
 
ה
ו
א
 
י
צ
א
 
ה
מ
י
ם
 
ו
נ
צ
ב
ת
 
ל
ק
ר
א
ת
ו
 
ע
ל
 
ש
פ
ת
 
ה
י
א
ר
 
ו
ה
מ
ט
ה
 
א
ש
ר
 
נ
ה
פ
ך
 
ל
נ
ח
ש
 
ת
ק
ח
 
ב
י
ד
ך
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ש
ל
ח
נ
י
 
א
ל
י
ך
 
ל
א
מ
ר
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
ב
מ
ד
ב
ר
 
ו
ה
נ
ה
 
ל
א
 
ש
מ
ע
ת
 
ע
ד
 
כ
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ב
ז
א
ת
 
ת
ד
ע
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ה
נ
ה
 
א
נ
כ
י
 
מ
כ
ה
 
ב
מ
ט
ה
 
א
ש
ר
 
ב
י
ד
י
 
ע
ל
 
ה
מ
י
ם
 
א
ש
ר
 
ב
י
א
ר
 
ו
נ
ה
פ
כ
ו
 
ל
ד
ם
 
ו
ה
ד
ג
ה
 
א
ש
ר
 
ב
י
א
ר
 
ת
מ
ו
ת
 
ו
ב
א
ש
 
ה
י
א
ר
 
ו
נ
ל
א
ו
 
מ
צ
ר
י
ם
 
ל
ש
ת
ו
ת
 
מ
י
ם
 
מ
ן
 
ה
י
א
ר
 
ו
י
ל
ך
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ש
ל
ח
נ
ו
 
א
ל
י
ך
 
ל
א
מ
ר
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
ב
מ
ד
ב
ר
 
ו
ה
נ
ה
 
ל
א
 
ש
מ
ע
ת
 
ע
ד
 
כ
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ב
ז
א
ת
 
ת
ד
ע
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ה
נ
ה
 
א
נ
כ
י
 
מ
כ
ה
 
ב
מ
ט
ה
 
א
ש
ר
 
ב
י
ד
י
 
ע
ל
 
ה
מ
י
ם
 
א
ש
ר
 
ב
י
א
ר
 
ו
נ
ה
פ
כ
ו
 
ל
ד
ם
 
ו
ה
ד
ג
ה
 
א
ש
ר
 
ב
י
א
ר
 
ת
מ
ו
ת
 
ו
ב
א
ש
 
ה
י
א
ר
 
ו
נ
ל
א
ו
 
מ
צ
ר
י
ם
 
ל
ש
ת
ו
ת
 
מ
י
ם
 
מ
ן
 
ה
י
א
ר
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
א
ל
 
א
ה
ר
ן
 
ק
ח
 
א
ת
 
מ
ט
ך
 
ו
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ע
ל
 
מ
י
מ
י
 
מ
צ
ר
י
ם
 
ע
ל
 
נ
ה
ר
ו
ת
ם
 
ו
ע
ל
 
י
א
ר
י
ה
ם
 
ו
ע
ל
 
א
ג
מ
י
ה
ם
 
ו
ע
ל
 
כ
ל
 
מ
ק
ו
ה
 
מ
י
מ
י
ה
ם
 
ו
י
ה
י
ו
 
ד
ם
 
ו
י
ה
י
 
ה
ד
ם
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ב
ע
צ
י
ם
 
ו
ב
א
ב
נ
י
ם
 
ו
י
ע
ש
ו
 
כ
ן
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
י
ר
ם
 
ב
מ
ט
ה
ו
 
ו
י
ך
 
א
ת
 
ה
מ
י
ם
 
א
ש
ר
 
ב
י
א
ר
 
ל
ע
י
נ
י
 
פ
ר
ע
ה
 
ו
ל
ע
י
נ
י
 
ע
ב
ד
י
ו
 
ו
י
ה
פ
כ
ו
 
כ
ל
 
ה
מ
י
ם
 
א
ש
ר
 
ב
י
א
ר
 
ל
ד
ם
 
ו
ה
ד
ג
ה
 
א
ש
ר
 
ב
י
א
ר
 
מ
ת
ה
 
ו
י
ב
א
ש
 
ה
י
א
ר
 
ו
ל
א
 
י
כ
ל
ו
 
מ
צ
ר
י
ם
 
ל
ש
ת
ו
ת
 
מ
י
ם
 
מ
ן
 
ה
י
א
ר
 
ו
י
ה
י
 
ה
ד
ם
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ע
ש
ו
 
כ
ן
 
ח
ר
ט
מ
י
 
מ
צ
ר
י
ם
 
ב
ל
ח
ט
י
ה
ם
 
ו
י
ח
ז
ק
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
ה
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
פ
ן
 
פ
ר
ע
ה
 
ו
י
ב
א
 
א
ל
 
ב
י
ת
ו
 
ו
ל
א
 
ש
ת
 
ל
ב
ו
 
ג
ם
 
ל
ז
א
ת
 
ו
י
ח
פ
ר
ו
 
כ
ל
 
מ
צ
ר
י
ם
 
ס
ב
י
ב
ת
 
ה
י
א
ר
 
מ
י
ם
 
ל
ש
ת
ו
ת
 
כ
י
 
ל
א
 
י
כ
ל
ו
 
ל
ש
ת
ו
ת
 
מ
מ
י
מ
י
 
ה
י
א
ר
 
ו
י
מ
ל
א
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
א
ח
ר
י
 
ה
כ
ו
ת
 
י
ה
ו
ה
 
א
ת
 
ה
י
א
ר
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
א
 
א
ל
 
פ
ר
ע
ה
 
ו
ד
ב
ר
ת
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
ו
א
ם
 
מ
א
ן
 
א
ת
ה
 
ל
ש
ל
ח
 
ה
נ
ה
 
א
נ
כ
י
 
נ
ג
ף
 
א
ת
 
כ
ל
 
ג
ב
ו
ל
ך
 
ב
צ
פ
ר
ד
ע
י
ם
 
ו
ש
ר
ץ
 
ה
י
א
ר
 
צ
פ
ר
ד
ע
י
ם
 
ו
ע
ל
ו
 
ו
ב
א
ו
 
ב
ב
ת
י
ך
 
ו
ב
ח
ד
ר
י
 
מ
ש
כ
ב
י
ך
 
ו
ע
ל
 
מ
ט
ת
י
ך
 
ו
ב
ב
ת
י
 
ע
ב
ד
י
ך
 
ו
ב
ע
מ
ך
 
ו
ב
ת
נ
ו
ר
י
ך
 
ו
ב
מ
ש
א
ר
ת
י
ך
 
ו
ב
ך
 
ו
ב
ע
מ
ך
 
ו
ב
כ
ל
 
ע
ב
ד
י
ך
 
י
ע
ל
ו
 
ה
צ
פ
ר
ד
ע
י
ם
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
ד
ב
ר
ו
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
ו
א
ם
 
מ
א
ן
 
א
ת
ה
 
ל
ש
ל
ח
 
ה
נ
ה
 
א
נ
כ
י
 
נ
ג
ף
 
א
ת
 
כ
ל
 
ג
ב
ו
ל
ך
 
ב
צ
פ
ר
ד
ע
י
ם
 
ו
ש
ר
ץ
 
ה
י
א
ר
 
צ
פ
ר
ד
ע
י
ם
 
ו
ע
ל
ו
 
ו
ב
א
ו
 
ב
ב
ת
י
ך
 
ו
ב
ח
ד
ר
י
 
מ
ש
כ
ב
י
ך
 
ו
ע
ל
 
מ
ט
ת
י
ך
 
ו
ב
ב
ת
י
 
ע
ב
ד
י
ך
 
ו
ב
ע
מ
ך
 
ו
ב
ת
נ
ו
ר
י
ך
 
ו
ב
מ
ש
א
ר
ת
י
ך
 
ו
ב
ך
 
ו
ב
ע
מ
ך
 
ו
ב
כ
ל
 
ע
ב
ד
י
ך
 
י
ע
ל
ו
 
ה
צ
פ
ר
ד
ע
י
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
א
ל
 
א
ה
ר
ן
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ב
מ
ט
ך
 
ע
ל
 
ה
נ
ה
ר
ו
ת
 
ו
ע
ל
 
ה
י
א
ר
י
ם
 
ו
ע
ל
 
ה
א
ג
מ
י
ם
 
ו
ה
ע
ל
 
א
ת
 
ה
צ
פ
ר
ד
ע
י
ם
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ב
מ
ט
ך
 
ו
ת
ע
ל
 
ה
צ
פ
ר
ד
ע
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ט
 
א
ה
ר
ן
 
א
ת
 
י
ד
ו
 
ע
ל
 
מ
י
מ
י
 
מ
צ
ר
י
ם
 
ו
ת
ע
ל
 
ה
צ
פ
ר
ד
ע
 
ו
ת
כ
ס
 
א
ת
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ע
ש
ו
 
כ
ן
 
ח
ר
ט
מ
י
 
מ
צ
ר
י
ם
 
ב
ל
ח
ט
י
ה
ם
 
ו
י
ע
ל
ו
 
ה
צ
פ
ר
ד
ע
י
ם
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ק
ר
א
 
פ
ר
ע
ה
 
ל
מ
ש
ה
 
ו
ל
א
ה
ר
ן
 
ו
י
א
מ
ר
 
ה
ע
ת
י
ר
ו
 
א
ל
 
י
ה
ו
ה
 
ו
י
ס
ר
 
ה
צ
פ
ר
ד
ע
י
ם
 
מ
מ
נ
י
 
ו
מ
ע
מ
י
 
ו
א
ש
ל
ח
 
א
ת
 
ה
ע
ם
 
ו
י
ז
ב
ח
ו
 
ל
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
פ
ר
ע
ה
 
ה
ת
פ
א
ר
 
ע
ל
י
 
ל
מ
ת
י
 
א
ע
ת
י
ר
 
ל
ך
 
ו
ל
ע
ב
ד
י
ך
 
ו
ל
ע
מ
ך
 
ל
ה
כ
ר
י
ת
 
ה
צ
פ
ר
ד
ע
י
ם
 
מ
מ
ך
 
ו
מ
ב
ת
י
ך
 
ו
מ
ע
ב
ד
י
ך
 
ו
מ
ע
מ
ך
 
ר
ק
 
ב
י
א
ר
 
ת
ש
א
ר
נ
ה
 
ו
י
א
מ
ר
 
ל
מ
ח
ר
 
ו
י
א
מ
ר
 
כ
ד
ב
ר
י
ך
 
ל
מ
ע
ן
 
ת
ד
ע
 
כ
י
 
א
י
ן
 
כ
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
ס
ר
ו
 
ה
צ
פ
ר
ד
ע
י
ם
 
מ
מ
ך
 
ו
מ
ב
ת
י
ך
 
ו
מ
ע
ב
ד
י
ך
 
ו
מ
ע
מ
ך
 
ר
ק
 
ב
י
א
ר
 
ת
ש
א
ר
נ
ה
 
ו
י
צ
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
מ
ע
ם
 
פ
ר
ע
ה
 
ו
י
צ
ע
ק
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ע
ל
 
ד
ב
ר
 
ה
צ
פ
ר
ד
ע
י
ם
 
א
ש
ר
 
ש
ם
 
ל
פ
ר
ע
ה
 
ו
י
ע
ש
 
י
ה
ו
ה
 
כ
ד
ב
ר
 
מ
ש
ה
 
ו
י
מ
ת
ו
 
ה
צ
פ
ר
ד
ע
י
ם
 
מ
ן
 
ה
ב
ת
י
ם
 
ו
מ
ן
 
ה
ח
צ
ר
ו
ת
 
ו
מ
ן
 
ה
ש
ד
ו
ת
 
ו
י
צ
ב
ר
ו
 
א
ת
ם
 
ח
מ
ר
י
ם
 
ח
מ
ר
י
ם
 
ו
ת
ב
א
ש
 
ה
א
ר
ץ
 
ו
י
ר
א
 
פ
ר
ע
ה
 
כ
י
 
ה
י
ת
ה
 
ה
ר
ו
ח
ה
 
ו
י
כ
ב
ד
 
א
ת
 
ל
ב
ו
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
ה
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
א
ל
 
א
ה
ר
ן
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ב
מ
ט
ך
 
ו
ה
ך
 
א
ת
 
ע
פ
ר
 
ה
א
ר
ץ
 
ו
י
ה
י
 
ל
כ
נ
י
ם
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ע
ש
ו
 
כ
ן
 
ו
י
ט
 
א
ה
ר
ן
 
א
ת
 
י
ד
ו
 
ב
מ
ט
ה
ו
 
ו
י
ך
 
א
ת
 
ע
פ
ר
 
ה
א
ר
ץ
 
ו
ת
ה
י
 
ה
כ
נ
י
ם
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
כ
ל
 
ע
פ
ר
 
ה
א
ר
ץ
 
ה
י
ה
 
כ
נ
י
ם
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ע
ש
ו
 
כ
ן
 
ה
ח
ר
ט
מ
י
ם
 
ב
ל
ח
ט
י
ה
ם
 
ל
ה
ו
צ
י
א
 
א
ת
 
ה
כ
נ
י
ם
 
ו
ל
א
 
י
כ
ל
ו
 
ו
ת
ה
י
 
ה
כ
נ
י
ם
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
ו
י
א
מ
ר
ו
 
ה
ח
ר
ט
מ
י
ם
 
א
ל
 
פ
ר
ע
ה
 
א
צ
ב
ע
 
א
ל
ה
י
ם
 
ה
י
א
 
ו
י
ח
ז
ק
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
ה
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
ש
כ
ם
 
ב
ב
ק
ר
 
ו
ה
ת
י
צ
ב
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ה
נ
ה
 
ה
ו
א
 
י
צ
א
 
ה
מ
י
ם
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
א
ם
 
א
י
נ
ך
 
מ
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ה
נ
נ
י
 
מ
ש
ל
ח
 
ב
ך
 
ו
ב
ע
ב
ד
י
ך
 
ו
ב
ע
מ
ך
 
ו
ב
ב
ת
י
ך
 
א
ת
 
ה
ע
ר
ב
 
ו
מ
ל
א
ו
 
ב
ת
י
 
מ
צ
ר
י
ם
 
א
ת
 
ה
ע
ר
ב
 
ו
ג
ם
 
ה
א
ד
מ
ה
 
א
ש
ר
 
ה
ם
 
ע
ל
י
ה
 
ו
ה
פ
ל
י
ת
י
 
ב
י
ו
ם
 
ה
ה
ו
א
 
א
ת
 
א
ר
ץ
 
ג
ש
ן
 
א
ש
ר
 
ע
מ
י
 
ע
מ
ד
 
ע
ל
י
ה
 
ל
ב
ל
ת
י
 
ה
י
ו
ת
 
ש
ם
 
ע
ר
ב
 
ל
מ
ע
ן
 
ת
ד
ע
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ב
ק
ר
ב
 
ה
א
ר
ץ
 
ו
ש
מ
ת
י
 
פ
ד
ו
ת
 
ב
י
ן
 
ע
מ
י
 
ו
ב
י
ן
 
ע
מ
ך
 
ל
מ
ח
ר
 
י
ה
י
ה
 
ה
א
ו
ת
 
ה
ז
ה
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
א
ם
 
א
י
נ
ך
 
מ
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ה
נ
נ
י
 
מ
ש
ל
ח
 
ב
ך
 
ו
ב
ע
ב
ד
י
ך
 
ו
ב
ע
מ
ך
 
ו
ב
ב
ת
י
ך
 
א
ת
 
ה
ע
ר
ב
 
ו
מ
ל
א
ו
 
ב
ת
י
 
מ
צ
ר
י
ם
 
א
ת
 
ה
ע
ר
ב
 
ו
ג
ם
 
ה
א
ד
מ
ה
 
א
ש
ר
 
ה
ם
 
ע
ל
י
ה
 
ו
ה
פ
ל
י
ת
י
 
ב
י
ו
ם
 
ה
ה
ו
א
 
א
ת
 
א
ר
ץ
 
ג
ש
ן
 
א
ש
ר
 
ע
מ
י
 
ע
מ
ד
 
ע
ל
י
ה
 
ל
ב
ל
ת
י
 
ה
י
ו
ת
 
ש
ם
 
ע
ר
ב
 
ל
מ
ע
ן
 
ת
ד
ע
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ב
ק
ר
ב
 
ה
א
ר
ץ
 
ו
ש
מ
ת
י
 
פ
ד
ו
ת
 
ב
י
ן
 
ע
מ
י
 
ו
ב
י
ן
 
ע
מ
ך
 
ל
מ
ח
ר
 
י
ה
י
ה
 
ה
א
ו
ת
 
ה
ז
ה
 
ו
י
ע
ש
 
י
ה
ו
ה
 
כ
ן
 
ו
י
ב
א
 
ע
ר
ב
 
כ
ב
ד
 
מ
א
ד
 
ב
י
ת
ה
 
פ
ר
ע
ה
 
ו
ב
י
ת
 
ע
ב
ד
י
ו
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ת
ש
ח
ת
 
ה
א
ר
ץ
 
מ
פ
נ
י
 
ה
ע
ר
ב
 
ו
י
ק
ר
א
 
פ
ר
ע
ה
 
ל
מ
ש
ה
 
ו
ל
א
ה
ר
ן
 
ו
י
א
מ
ר
 
ל
כ
ו
 
ז
ב
ח
ו
 
ל
א
ל
ה
י
כ
ם
 
ב
א
ר
ץ
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
א
 
נ
כ
ו
ן
 
ל
ע
ש
ו
ת
 
כ
ן
 
כ
י
 
ת
ו
ע
ב
ת
 
מ
צ
ר
י
ם
 
נ
ז
ב
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ה
ן
 
נ
ז
ב
ח
 
א
ת
 
ת
ו
ע
ב
ת
 
מ
צ
ר
י
ם
 
ל
ע
י
נ
י
ה
ם
 
ו
ל
א
 
י
ס
ק
ל
נ
ו
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
נ
ל
כ
ה
 
ב
מ
ד
ב
ר
 
ו
נ
ז
ב
ח
ה
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
כ
א
ש
ר
 
י
א
מ
ר
 
א
ל
י
נ
ו
 
ו
י
א
מ
ר
 
פ
ר
ע
ה
 
א
נ
כ
י
 
א
ש
ל
ח
 
א
ת
כ
ם
 
ו
ז
ב
ח
ת
ם
 
ל
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ב
מ
ד
ב
ר
 
ר
ק
 
ה
ר
ח
י
ק
 
ל
א
 
ת
ר
ח
י
ק
ו
 
ל
ל
כ
ת
 
ה
ע
ת
י
ר
ו
 
ב
ע
ד
י
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ה
נ
ה
 
א
נ
כ
י
 
י
צ
א
 
מ
ע
מ
ך
 
ו
ה
ע
ת
ר
ת
י
 
א
ל
 
י
ה
ו
ה
 
ו
ס
ר
 
ה
ע
ר
ב
 
מ
פ
ר
ע
ה
 
ו
מ
ע
ב
ד
י
ו
 
ו
מ
ע
מ
ו
 
מ
ח
ר
 
ר
ק
 
א
ל
 
י
ס
ף
 
פ
ר
ע
ה
 
ה
ת
ל
 
ל
ב
ל
ת
י
 
ש
ל
ח
 
א
ת
 
ה
ע
ם
 
ל
ז
ב
ח
 
ל
י
ה
ו
ה
 
ו
י
צ
א
 
מ
ש
ה
 
מ
ע
ם
 
פ
ר
ע
ה
 
ו
י
ע
ת
ר
 
א
ל
 
י
ה
ו
ה
 
ו
י
ע
ש
 
י
ה
ו
ה
 
כ
ד
ב
ר
 
מ
ש
ה
 
ו
י
ס
ר
 
ה
ע
ר
ב
 
מ
פ
ר
ע
ה
 
ו
מ
ע
ב
ד
י
ו
 
ו
מ
ע
מ
ו
 
ל
א
 
נ
ש
א
ר
 
א
ח
ד
 
ו
י
כ
ב
ד
 
פ
ר
ע
ה
 
א
ת
 
ל
ב
ו
 
ג
ם
 
ב
פ
ע
ם
 
ה
ז
א
ת
 
ו
ל
א
 
ש
ל
ח
 
א
ת
 
ה
ע
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
א
 
א
ל
 
פ
ר
ע
ה
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
א
ם
 
מ
א
ן
 
א
ת
ה
 
ל
ש
ל
ח
 
ו
ע
ו
ד
ך
 
מ
ח
ז
ק
 
ב
ם
 
ה
נ
ה
 
י
ד
 
י
ה
ו
ה
 
ה
י
ה
 
ב
מ
ק
נ
י
ך
 
א
ש
ר
 
ב
ש
ד
ה
 
ב
ס
ו
ס
י
ם
 
ו
ב
ח
מ
ר
י
ם
 
ו
ב
ג
מ
ל
י
ם
 
ב
ב
ק
ר
 
ו
ב
צ
א
ן
 
ד
ב
ר
 
כ
ב
ד
 
מ
א
ד
 
ו
ה
פ
ל
א
 
י
ה
ו
ה
 
ב
י
ן
 
מ
ק
נ
ה
 
י
ש
ר
א
ל
 
ו
ב
י
ן
 
מ
ק
נ
ה
 
מ
צ
ר
י
ם
 
ו
ל
א
 
י
מ
ו
ת
 
מ
כ
ל
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ד
ב
ר
 
ו
י
ש
ם
 
י
ה
ו
ה
 
מ
ו
ע
ד
 
ל
א
מ
ר
 
מ
ח
ר
 
י
ע
ש
ה
 
י
ה
ו
ה
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ב
א
ר
ץ
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
א
ם
 
מ
א
ן
 
א
ת
ה
 
ל
ש
ל
ח
 
ו
ע
ו
ד
ך
 
מ
ח
ז
ק
 
ב
ם
 
ה
נ
ה
 
י
ד
 
י
ה
ו
ה
 
ה
י
ה
 
ב
מ
ק
נ
י
ך
 
א
ש
ר
 
ב
ש
ד
ה
 
ב
ס
ו
ס
י
ם
 
ו
ב
ח
מ
ר
י
ם
 
ו
ב
ג
מ
ל
י
ם
 
ב
ב
ק
ר
 
ו
ב
צ
א
ן
 
ד
ב
ר
 
כ
ב
ד
 
מ
א
ד
 
ו
ה
פ
ל
א
 
י
ה
ו
ה
 
ב
י
ן
 
מ
ק
נ
ה
 
י
ש
ר
א
ל
 
ו
ב
י
ן
 
מ
ק
נ
ה
 
מ
צ
ר
י
ם
 
ו
ל
א
 
י
מ
ו
ת
 
מ
כ
ל
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ד
ב
ר
 
מ
ח
ר
 
י
ע
ש
ה
 
י
ה
ו
ה
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ב
א
ר
ץ
 
ו
י
ע
ש
 
י
ה
ו
ה
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
מ
מ
ח
ר
ת
 
ו
י
מ
ת
 
כ
ל
 
מ
ק
נ
ה
 
מ
צ
ר
י
ם
 
ו
מ
מ
ק
נ
ה
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
מ
ת
 
א
ח
ד
 
ו
י
ש
ל
ח
 
פ
ר
ע
ה
 
ו
ה
נ
ה
 
ל
א
 
מ
ת
 
מ
מ
ק
נ
ה
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ד
 
א
ח
ד
 
ו
י
כ
ב
ד
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
ל
ח
 
א
ת
 
ה
ע
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ק
ח
ו
 
ל
כ
ם
 
מ
ל
ו
א
 
ח
פ
נ
י
כ
ם
 
פ
י
ח
 
כ
ב
ש
ן
 
ו
ז
ר
ק
ו
 
מ
ש
ה
 
ה
ש
מ
י
ם
 
ל
ע
י
נ
י
 
פ
ר
ע
ה
 
ו
ה
י
ה
 
ל
א
ב
ק
 
ע
ל
 
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ה
י
ה
 
ע
ל
 
ה
א
ד
ם
 
ו
ע
ל
 
ה
ב
ה
מ
ה
 
ל
ש
ח
י
ן
 
פ
ר
ח
 
א
ב
ע
ב
ע
ו
ת
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ק
ח
ו
 
א
ת
 
פ
י
ח
 
ה
כ
ב
ש
ן
 
ו
י
ע
מ
ד
ו
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ז
ר
ק
 
א
ת
ו
 
מ
ש
ה
 
ה
ש
מ
י
ם
 
ו
י
ה
י
 
ש
ח
י
ן
 
א
ב
ע
ב
ע
ו
ת
 
פ
ר
ח
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
ו
ל
א
 
י
כ
ל
ו
 
ה
ח
ר
ט
מ
י
ם
 
ל
ע
מ
ד
 
ל
פ
נ
י
 
מ
ש
ה
 
מ
פ
נ
י
 
ה
ש
ח
י
ן
 
כ
י
 
ה
י
ה
 
ה
ש
ח
י
ן
 
ב
ח
ר
ט
מ
י
ם
 
ו
ב
כ
ל
 
מ
צ
ר
י
ם
 
ו
י
ח
ז
ק
 
י
ה
ו
ה
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
ה
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
ש
כ
ם
 
ב
ב
ק
ר
 
ו
ה
ת
י
צ
ב
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
ב
פ
ע
ם
 
ה
ז
א
ת
 
א
נ
י
 
ש
ל
ח
 
א
ת
 
כ
ל
 
מ
ג
פ
ת
י
 
ע
ל
 
ל
ב
ך
 
ו
ב
ע
ב
ד
י
ך
 
ו
ב
ע
מ
ך
 
ב
ע
ב
ו
ר
 
ת
ד
ע
 
כ
י
 
א
י
ן
 
כ
מ
ו
נ
י
 
ב
כ
ל
 
ה
א
ר
ץ
 
כ
י
 
ע
ת
ה
 
ש
ל
ח
ת
י
 
א
ת
 
י
ד
י
 
ו
א
כ
ה
 
א
ת
ך
 
ו
א
ת
 
ע
מ
ך
 
ב
ד
ב
ר
 
ו
ת
כ
ח
ד
 
מ
ן
 
ה
א
ר
ץ
 
ו
א
ו
ל
ם
 
ב
ע
ב
ו
ר
 
ז
א
ת
 
ה
ע
מ
ד
ת
י
ך
 
ב
ע
ב
ו
ר
 
ה
ר
א
ת
י
ך
 
א
ת
 
כ
ח
י
 
ו
ל
מ
ע
ן
 
ס
פ
ר
 
ש
מ
י
 
ב
כ
ל
 
ה
א
ר
ץ
 
ע
ו
ד
ך
 
מ
ס
ת
ו
ל
ל
 
ב
ע
מ
י
 
ל
ב
ל
ת
י
 
ש
ל
ח
ם
 
ה
נ
נ
י
 
מ
מ
ט
י
ר
 
כ
ע
ת
 
מ
ח
ר
 
ב
ר
ד
 
כ
ב
ד
 
מ
א
ד
 
א
ש
ר
 
ל
א
 
ה
י
ה
 
כ
מ
ה
ו
 
ב
מ
צ
ר
י
ם
 
ל
מ
י
ו
ם
 
ה
י
ס
ד
ה
 
ו
ע
ד
 
ע
ת
ה
 
ו
ע
ת
ה
 
ש
ל
ח
 
ה
ע
ז
 
א
ת
 
מ
ק
נ
י
ך
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ך
 
ב
ש
ד
ה
 
כ
ל
 
ה
א
ד
ם
 
ו
ה
ב
ה
מ
ה
 
א
ש
ר
 
י
מ
צ
א
 
ב
ש
ד
ה
 
ו
ל
א
 
י
א
ס
ף
 
ה
ב
י
ת
ה
 
ו
י
ר
ד
 
ע
ל
י
ה
ם
 
ה
ב
ר
ד
 
ו
מ
ת
ו
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
ב
פ
ע
ם
 
ה
ז
א
ת
 
א
נ
י
 
ש
ל
ח
 
א
ת
 
כ
ל
 
מ
ג
פ
ת
י
 
ע
ל
 
ל
ב
ך
 
ו
ב
ע
ב
ד
י
ך
 
ו
ב
ע
מ
ך
 
ב
ע
ב
ו
ר
 
ת
ד
ע
 
כ
י
 
א
י
ן
 
כ
מ
ו
נ
י
 
ב
כ
ל
 
ה
א
ר
ץ
 
כ
י
 
ע
ת
ה
 
ש
ל
ח
ת
י
 
א
ת
 
י
ד
י
 
ו
א
כ
ה
 
א
ת
ך
 
ו
א
ת
 
ע
מ
ך
 
ב
ד
ב
ר
 
ו
ת
כ
ח
ד
 
מ
ן
 
ה
א
ר
ץ
 
ו
א
ו
ל
ם
 
ב
ע
ב
ו
ר
 
ז
א
ת
 
ה
ע
מ
ד
ת
י
ך
 
ב
ע
ב
ו
ר
 
ה
ר
א
ת
י
ך
 
א
ת
 
כ
ח
י
 
ו
ל
מ
ע
ן
 
ס
פ
ר
 
ש
מ
י
 
ב
כ
ל
 
ה
א
ר
ץ
 
ע
ו
ד
ך
 
מ
ס
ת
ו
ל
ל
 
ב
ע
מ
י
 
ל
ב
ל
ת
י
 
ש
ל
ח
ם
 
ה
נ
נ
י
 
מ
מ
ט
י
ר
 
כ
ע
ת
 
מ
ח
ר
 
ב
ר
ד
 
כ
ב
ד
 
מ
א
ד
 
א
ש
ר
 
ל
א
 
ה
י
ה
 
כ
מ
ה
ו
 
ב
מ
צ
ר
י
ם
 
ל
מ
י
ו
ם
 
ה
י
ס
ד
ה
 
ו
ע
ד
 
ע
ת
ה
 
ו
ע
ת
ה
 
ש
ל
ח
 
ה
ע
ז
 
א
ת
 
מ
ק
נ
י
ך
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ך
 
ב
ש
ד
ה
 
כ
ל
 
ה
א
ד
ם
 
ו
ה
ב
ה
מ
ה
 
א
ש
ר
 
י
מ
צ
א
 
ב
ש
ד
ה
 
ו
ל
א
 
י
א
ס
ף
 
ה
ב
י
ת
ה
 
ו
י
ר
ד
 
ע
ל
י
ה
ם
 
ה
ב
ר
ד
 
ו
מ
ת
ו
 
ה
י
ר
א
 
א
ת
 
ד
ב
ר
 
י
ה
ו
ה
 
מ
ע
ב
ד
י
 
פ
ר
ע
ה
 
ה
נ
י
ס
 
א
ת
 
ע
ב
ד
י
ו
 
ו
א
ת
 
מ
ק
נ
ה
ו
 
א
ל
 
ה
ב
ת
י
ם
 
ו
א
ש
ר
 
ל
א
 
ש
ם
 
ל
ב
ו
 
ע
ל
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
ע
ז
ב
 
א
ת
 
ע
ב
ד
י
ו
 
ו
א
ת
 
מ
ק
נ
ה
ו
 
ב
ש
ד
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ע
ל
 
ה
ש
מ
י
ם
 
ו
י
ה
י
 
ב
ר
ד
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ל
 
ה
א
ד
ם
 
ו
ע
ל
 
ה
ב
ה
מ
ה
 
ו
ע
ל
 
כ
ל
 
ע
ש
ב
 
ה
ש
ד
ה
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ט
 
מ
ש
ה
 
א
ת
 
מ
ט
ה
ו
 
ע
ל
 
ה
ש
מ
י
ם
 
ו
י
ה
ו
ה
 
נ
ת
ן
 
ק
ו
ל
ו
ת
 
ו
ב
ר
ד
 
ו
ת
ה
ל
ך
 
א
ש
 
א
ר
צ
ה
 
ו
י
מ
ט
י
ר
 
י
ה
ו
ה
 
ב
ר
ד
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ה
י
 
ה
ב
ר
ד
 
ו
א
ש
 
מ
ת
ל
ק
ח
ת
 
ב
ת
ו
ך
 
ה
ב
ר
ד
 
כ
ב
ד
 
מ
א
ד
 
א
ש
ר
 
ל
א
 
ה
י
ה
 
כ
מ
ה
ו
 
ב
מ
צ
ר
י
ם
 
מ
א
ז
 
ה
י
ת
ה
 
ל
ג
ו
י
 
ו
י
ך
 
ה
ב
ר
ד
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ש
ד
ה
 
מ
א
ד
ם
 
ע
ד
 
ב
ה
מ
ה
 
ו
א
ת
 
כ
ל
 
ע
ש
ב
 
ה
ש
ד
ה
 
ה
כ
ה
 
ה
ב
ר
ד
 
ו
א
ת
 
כ
ל
 
ע
ץ
 
ה
ש
ד
ה
 
ש
ב
ר
 
ר
ק
 
ב
א
ר
ץ
 
ג
ש
ן
 
א
ש
ר
 
ש
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
ה
י
ה
 
ב
ר
ד
 
ו
י
ש
ל
ח
 
פ
ר
ע
ה
 
ו
י
ק
ר
א
 
ל
מ
ש
ה
 
ו
ל
א
ה
ר
ן
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ח
ט
א
ת
י
 
ה
פ
ע
ם
 
י
ה
ו
ה
 
ה
צ
ד
י
ק
 
ו
א
נ
י
 
ו
ע
מ
י
 
ה
ר
ש
ע
י
ם
 
ה
ע
ת
י
ר
ו
 
א
ל
 
י
ה
ו
ה
 
ו
ר
ב
 
מ
ה
י
ו
ת
 
ק
ו
ל
ו
ת
 
א
ל
ה
י
ם
 
ו
ב
ר
ד
 
ו
א
ש
ל
ח
 
א
ת
כ
ם
 
ו
ל
א
 
ת
ו
ס
י
פ
ו
ן
 
ל
ע
מ
ד
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
מ
ש
ה
 
כ
צ
א
ת
י
 
א
ת
 
ה
ע
י
ר
 
א
פ
ר
ש
 
כ
פ
י
 
א
ל
 
י
ה
ו
ה
 
ו
ה
ק
ו
ל
ו
ת
 
י
ח
ד
ל
ו
ן
 
ו
ה
ב
ר
ד
 
ל
א
 
י
ה
י
ה
 
ע
ו
ד
 
ל
מ
ע
ן
 
ת
ד
ע
 
כ
י
 
ל
י
ה
ו
ה
 
ה
א
ר
ץ
 
ו
א
ת
ה
 
ו
ע
ב
ד
י
ך
 
י
ד
ע
ת
י
 
כ
י
 
ט
ר
ם
 
ת
י
ר
א
ו
ן
 
מ
פ
נ
י
 
א
ד
נ
י
 
י
ה
ו
ה
 
ו
ה
פ
ש
ת
ה
 
ו
ה
ש
ע
ר
ה
 
נ
כ
ו
 
כ
י
 
ה
ש
ע
ר
ה
 
א
ב
י
ב
 
ו
ה
פ
ש
ת
ה
 
ג
ב
ע
ל
 
ו
ה
ח
ט
ה
 
ו
ה
כ
ס
מ
ת
 
ל
א
 
נ
כ
ו
 
כ
י
 
א
פ
ל
ו
ת
 
ה
נ
ה
 
ו
י
צ
א
 
מ
ש
ה
 
מ
ע
ם
 
פ
ר
ע
ה
 
א
ת
 
ה
ע
י
ר
 
ו
י
פ
ר
ש
 
כ
פ
י
ו
 
א
ל
 
י
ה
ו
ה
 
ו
י
ח
ד
ל
ו
 
ה
ק
ו
ל
ו
ת
 
ו
ה
ב
ר
ד
 
ו
ה
מ
ט
ר
 
ל
א
 
נ
ת
ך
 
א
ר
צ
ה
 
ו
י
ר
א
 
פ
ר
ע
ה
 
כ
י
 
ח
ד
ל
 
ה
ב
ר
ד
 
ו
ה
מ
ט
ר
 
ו
ה
ק
ו
ל
ו
ת
 
ו
י
ס
ף
 
ל
ח
ט
א
 
ו
י
כ
ב
ד
 
ל
ב
ו
 
ה
ו
א
 
ו
ע
ב
ד
י
ו
 
ו
י
ח
ז
ק
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
ל
ח
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
א
 
א
ל
 
פ
ר
ע
ה
 
כ
י
 
א
נ
י
 
ה
כ
ב
ד
ת
י
 
א
ת
 
ל
ב
ו
 
ו
א
ת
 
ל
ב
 
ע
ב
ד
י
ו
 
ל
מ
ע
ן
 
ש
ת
י
 
א
ת
ו
ת
י
 
א
ל
ה
 
ב
ק
ר
ב
ו
 
ו
ל
מ
ע
ן
 
ת
ס
פ
ר
 
ב
א
ז
נ
י
 
ב
נ
ך
 
ו
ב
ן
 
ב
נ
ך
 
א
ת
 
א
ש
ר
 
ה
ת
ע
ל
ל
ת
י
 
ב
מ
צ
ר
י
ם
 
ו
א
ת
 
א
ת
ו
ת
י
 
א
ש
ר
 
ש
מ
ת
י
 
ב
ם
 
ו
י
ד
ע
ת
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
א
מ
ר
ת
 
א
ל
 
פ
ר
ע
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ע
ד
 
מ
ת
י
 
מ
א
נ
ת
 
ל
ע
נ
ו
ת
 
מ
פ
נ
י
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
א
ם
 
מ
א
ן
 
א
ת
ה
 
ל
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ה
נ
נ
י
 
מ
ב
י
א
 
מ
ח
ר
 
א
ר
ב
ה
 
ב
ג
ב
ו
ל
ך
 
ו
כ
ס
ה
 
א
ת
 
ע
י
ן
 
ה
א
ר
ץ
 
ו
ל
א
 
י
כ
ל
 
ל
ר
א
ו
ת
 
א
ת
 
ה
א
ר
ץ
 
ו
א
כ
ל
 
א
ת
 
י
ת
ר
 
ה
פ
ל
ט
ה
 
ה
נ
ש
א
ר
ת
 
ל
כ
ם
 
מ
ן
 
ה
ב
ר
ד
 
ו
א
כ
ל
 
א
ת
 
כ
ל
 
ע
ש
ב
 
ה
א
ר
ץ
 
ו
א
ת
 
כ
ל
 
פ
ר
י
 
ה
ע
ץ
 
ה
צ
מ
ח
 
ל
כ
ם
 
מ
ן
 
ה
ש
ד
ה
 
ו
מ
ל
א
ו
 
ב
ת
י
ך
 
ו
ב
ת
י
 
כ
ל
 
ע
ב
ד
י
ך
 
ו
ב
ת
י
 
כ
ל
 
מ
צ
ר
י
ם
 
א
ש
ר
 
ל
א
 
ר
א
ו
 
א
ב
ת
י
ך
 
ו
א
ב
ו
ת
 
א
ב
ת
י
ך
 
מ
י
ו
ם
 
ה
י
ו
ת
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ע
ב
ר
י
ם
 
ע
ד
 
מ
ת
י
 
מ
א
נ
ת
 
ל
ע
נ
ו
ת
 
מ
פ
נ
י
 
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ו
י
ע
ב
ד
נ
י
 
כ
י
 
א
ם
 
מ
א
ן
 
א
ת
ה
 
ל
ש
ל
ח
 
א
ת
 
ע
מ
י
 
ה
נ
נ
י
 
מ
ב
י
א
 
מ
ח
ר
 
א
ר
ב
ה
 
ב
ג
ב
ו
ל
ך
 
ו
כ
ס
ה
 
א
ת
 
ע
י
ן
 
ה
א
ר
ץ
 
ו
ל
א
 
י
כ
ל
 
ל
ר
א
ו
ת
 
א
ת
 
ה
א
ר
ץ
 
ו
א
כ
ל
 
א
ת
 
י
ת
ר
 
ה
פ
ל
ט
ה
 
ה
נ
ש
א
ר
ת
 
ל
כ
ם
 
מ
ן
 
ה
ב
ר
ד
 
ו
א
כ
ל
 
א
ת
 
כ
ל
 
ע
ש
ב
 
ה
א
ר
ץ
 
ו
א
ת
 
כ
ל
 
פ
ר
י
 
ה
ע
ץ
 
ה
צ
מ
ח
 
ל
כ
ם
 
מ
ן
 
ה
ש
ד
ה
 
ו
מ
ל
א
ו
 
ב
ת
י
ך
 
ו
ב
ת
י
 
כ
ל
 
ע
ב
ד
י
ך
 
ו
ב
ת
י
 
כ
ל
 
מ
צ
ר
י
ם
 
א
ש
ר
 
ל
א
 
ר
א
ו
 
א
ב
ת
י
ך
 
ו
א
ב
ו
ת
 
א
ב
ת
י
ך
 
מ
י
ו
ם
 
ה
י
ו
ת
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
י
פ
ן
 
ו
י
צ
א
 
מ
ע
ם
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
ו
 
ע
ב
ד
י
 
פ
ר
ע
ה
 
א
ל
י
ו
 
ע
ד
 
מ
ת
י
 
י
ה
י
ה
 
ז
ה
 
ל
נ
ו
 
ל
מ
ו
ק
ש
 
ש
ל
ח
 
א
ת
 
ה
א
נ
ש
י
ם
 
ו
י
ע
ב
ד
ו
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ה
ם
 
ה
ט
ר
ם
 
ת
ד
ע
 
כ
י
 
א
ב
ד
ה
 
מ
צ
ר
י
ם
 
ו
י
ש
ב
 
א
ת
 
מ
ש
ה
 
ו
א
ת
 
א
ה
ר
ן
 
א
ל
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ל
כ
ו
 
ע
ב
ד
ו
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
מ
י
 
ו
מ
י
 
ה
ה
ל
כ
י
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ב
נ
ע
ר
י
נ
ו
 
ו
ב
ז
ק
נ
י
נ
ו
 
נ
ל
ך
 
ב
ב
נ
י
נ
ו
 
ו
ב
ב
נ
ת
י
נ
ו
 
ב
צ
א
נ
נ
ו
 
ו
ב
ב
ק
ר
נ
ו
 
נ
ל
ך
 
כ
י
 
ח
ג
 
י
ה
ו
ה
 
ל
נ
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
י
ה
י
ה
 
כ
ן
 
י
ה
ו
ה
 
ע
מ
כ
ם
 
כ
א
ש
ר
 
א
ש
ל
ח
 
א
ת
כ
ם
 
ו
א
ת
 
ט
פ
כ
ם
 
ר
א
ו
 
כ
י
 
ר
ע
ה
 
נ
ג
ד
 
פ
נ
י
כ
ם
 
ל
כ
ן
 
ל
כ
ו
 
נ
א
 
ה
ג
ב
ר
י
ם
 
ו
ע
ב
ד
ו
 
א
ת
 
י
ה
ו
ה
 
כ
י
 
א
ת
ה
 
א
ת
ם
 
מ
ב
ק
ש
י
ם
 
ו
י
ג
ר
ש
ו
 
א
ת
ם
 
מ
א
ת
 
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
א
ר
ב
ה
 
ו
י
ע
ל
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
א
כ
ל
 
א
ת
 
כ
ל
 
ע
ש
ב
 
ה
א
ר
ץ
 
ו
א
ת
 
כ
ל
 
פ
ר
י
 
ה
ע
ץ
 
א
ש
ר
 
ה
ש
א
י
ר
 
ה
ב
ר
ד
 
ו
י
ט
 
מ
ש
ה
 
א
ת
 
י
ד
ו
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ה
ו
ה
 
נ
ה
ג
 
ר
ו
ח
 
ק
ד
י
ם
 
ב
א
ר
ץ
 
כ
ל
 
ה
י
ו
ם
 
ה
ה
ו
א
 
ו
כ
ל
 
ה
ל
י
ל
ה
 
ה
ב
ק
ר
 
ה
י
ה
 
ו
ר
ו
ח
 
ה
ק
ד
י
ם
 
נ
ש
א
 
א
ת
 
ה
א
ר
ב
ה
 
ו
י
ע
ל
 
ה
א
ר
ב
ה
 
ע
ל
 
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
נ
ח
 
ב
כ
ל
 
ג
ב
ו
ל
 
מ
צ
ר
י
ם
 
כ
ב
ד
 
מ
א
ד
 
ל
פ
נ
י
ו
 
ל
א
 
ה
י
ה
 
כ
ן
 
א
ר
ב
ה
 
כ
מ
ה
ו
 
ו
א
ח
ר
י
ו
 
ל
א
 
י
ה
י
ה
 
כ
ן
 
ו
י
כ
ס
 
א
ת
 
ע
י
ן
 
כ
ל
 
ה
א
ר
ץ
 
ו
ת
ח
ש
ך
 
ה
א
ר
ץ
 
ו
י
א
כ
ל
 
א
ת
 
כ
ל
 
ע
ש
ב
 
ה
א
ר
ץ
 
ו
א
ת
 
כ
ל
 
פ
ר
י
 
ה
ע
ץ
 
א
ש
ר
 
ה
ו
ת
י
ר
 
ה
ב
ר
ד
 
ו
ל
א
 
נ
ו
ת
ר
 
כ
ל
 
י
ר
ק
 
ב
ע
ץ
 
ו
ב
ע
ש
ב
 
ה
ש
ד
ה
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
מ
ה
ר
 
פ
ר
ע
ה
 
ל
ק
ר
א
 
ל
מ
ש
ה
 
ו
ל
א
ה
ר
ן
 
ו
י
א
מ
ר
 
ח
ט
א
ת
י
 
ל
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ל
כ
ם
 
ו
ע
ת
ה
 
ש
א
ו
 
נ
א
 
ח
ט
א
ת
י
 
א
ך
 
ה
פ
ע
ם
 
ה
ע
ת
י
ר
ו
 
א
ל
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ס
ר
 
מ
ע
ל
י
 
ר
ק
 
א
ת
 
ה
מ
ו
ת
 
ה
ז
ה
 
ו
י
צ
א
 
מ
ע
ם
 
פ
ר
ע
ה
 
ו
י
ע
ת
ר
 
א
ל
 
י
ה
ו
ה
 
ו
י
ה
פ
ך
 
י
ה
ו
ה
 
ר
ו
ח
 
י
ם
 
ח
ז
ק
 
מ
א
ד
 
ו
י
ש
א
 
א
ת
 
ה
א
ר
ב
ה
 
ו
י
ת
ק
ע
ה
ו
 
י
ם
 
ס
ו
ף
 
ל
א
 
נ
ש
א
ר
 
א
ר
ב
ה
 
א
ח
ד
 
ב
כ
ל
 
ג
ב
ו
ל
 
מ
צ
ר
י
ם
 
ו
י
ח
ז
ק
 
י
ה
ו
ה
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
ל
ח
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ע
ל
 
ה
ש
מ
י
ם
 
ו
י
ה
י
 
ח
ש
ך
 
ע
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
מ
ש
 
ה
ח
ש
ך
 
ו
י
ט
 
מ
ש
ה
 
א
ת
 
י
ד
ו
 
ע
ל
 
ה
ש
מ
י
ם
 
ו
י
ה
י
 
ח
ש
ך
 
א
פ
ל
ה
 
ב
כ
ל
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ל
א
 
ר
א
ו
 
א
י
ש
 
א
ת
 
א
ח
י
ו
 
ו
ל
א
 
ק
מ
ו
 
א
י
ש
 
מ
ת
ח
ת
י
ו
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ו
ל
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ה
י
ה
 
א
ו
ר
 
ב
מ
ו
ש
ב
ת
ם
 
ו
י
ק
ר
א
 
פ
ר
ע
ה
 
ל
מ
ש
ה
 
ו
ל
א
ה
ר
ן
 
ו
י
א
מ
ר
 
ל
כ
ו
 
ע
ב
ד
ו
 
א
ת
 
י
ה
ו
ה
 
ר
ק
 
צ
א
נ
כ
ם
 
ו
ב
ק
ר
כ
ם
 
י
צ
ג
 
ג
ם
 
ט
פ
כ
ם
 
י
ל
ך
 
ע
מ
כ
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ג
ם
 
א
ת
ה
 
ת
ת
ן
 
ב
י
ד
נ
ו
 
ז
ב
ח
י
ם
 
ו
ע
ל
ו
ת
 
ו
ע
ש
י
נ
ו
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
ג
ם
 
מ
ק
נ
י
נ
ו
 
י
ל
ך
 
ע
מ
נ
ו
 
ל
א
 
ת
ש
א
ר
 
פ
ר
ס
ה
 
כ
י
 
מ
מ
נ
ו
 
נ
ק
ח
 
ל
ע
ב
ד
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
א
נ
ח
נ
ו
 
ל
א
 
נ
ד
ע
 
מ
ה
 
נ
ע
ב
ד
 
א
ת
 
י
ה
ו
ה
 
ע
ד
 
ב
א
נ
ו
 
ש
מ
ה
 
ו
י
ח
ז
ק
 
י
ה
ו
ה
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
א
ב
ה
 
ל
ש
ל
ח
ם
 
ו
י
א
מ
ר
 
ל
ו
 
פ
ר
ע
ה
 
ל
ך
 
ל
ך
 
מ
ע
ל
י
 
ה
ש
מ
ר
 
ל
ך
 
א
ל
 
ת
ו
ס
י
ף
 
ר
א
ו
ת
 
פ
נ
י
 
כ
י
 
ב
י
ו
ם
 
ר
א
ו
ת
ך
 
פ
נ
י
 
ת
מ
ו
ת
 
ו
י
א
מ
ר
 
מ
ש
ה
 
כ
ן
 
ד
ב
ר
ת
 
ל
א
 
א
ו
ס
י
ף
 
ע
ו
ד
 
ר
א
ו
ת
 
פ
נ
י
ך
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ע
ו
ד
 
נ
ג
ע
 
א
ח
ד
 
א
ב
י
א
 
ע
ל
 
פ
ר
ע
ה
 
ו
ע
ל
 
מ
צ
ר
י
ם
 
ו
א
ח
ר
י
 
כ
ן
 
י
ש
ל
ח
 
א
ת
כ
ם
 
מ
ז
ה
 
כ
ש
ל
ח
ו
 
כ
ל
ה
 
ג
ר
ש
 
י
ג
ר
ש
 
א
ת
כ
ם
 
מ
ז
ה
 
ד
ב
ר
ו
 
נ
א
 
ב
א
ז
נ
י
 
ה
ע
ם
 
ו
י
ש
א
ל
ו
 
א
י
ש
 
מ
א
ת
 
ר
ע
ה
ו
 
ו
א
ש
ה
 
מ
א
ת
 
ר
ע
ו
ת
ה
 
כ
ל
י
 
כ
ס
ף
 
ו
כ
ל
י
 
ז
ה
ב
 
ו
ש
מ
ל
ו
ת
 
ו
נ
ת
ת
י
 
א
ת
 
ח
ן
 
ה
ע
ם
 
ה
ז
ה
 
ב
ע
י
נ
י
 
מ
צ
ר
י
ם
 
ו
ה
ש
א
ל
ו
ם
 
ו
כ
ח
צ
י
ת
 
ה
ל
י
ל
ה
 
א
נ
י
 
י
צ
א
 
ב
ת
ו
ך
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
מ
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
כ
ו
ר
 
פ
ר
ע
ה
 
ה
י
ש
ב
 
ע
ל
 
כ
ס
א
ו
 
ו
ע
ד
 
ב
כ
ו
ר
 
ה
ש
פ
ח
ה
 
א
ש
ר
 
א
ח
ר
 
ה
ר
ח
י
ם
 
ו
ע
ד
 
ב
כ
ו
ר
 
כ
ל
 
ב
ה
מ
ה
 
ו
ה
י
ת
ה
 
צ
ע
ק
ה
 
ג
ד
ל
ה
 
ב
מ
צ
ר
י
ם
 
א
ש
ר
 
כ
מ
ו
ה
 
ל
א
 
נ
ה
י
ת
ה
 
ו
כ
מ
ו
ה
 
ל
א
 
ת
ו
ס
י
ף
 
ו
ל
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
י
ח
ר
ץ
 
כ
ל
ב
 
ל
ש
נ
ו
 
ל
מ
א
י
ש
 
ו
ע
ד
 
ב
ה
מ
ה
 
ל
מ
ע
ן
 
ת
ד
ע
 
א
ש
ר
 
י
פ
ל
א
 
י
ה
ו
ה
 
ב
י
ן
 
מ
צ
ר
י
ם
 
ו
ב
י
ן
 
י
ש
ר
א
ל
 
ו
ג
ם
 
ה
א
י
ש
 
מ
ש
ה
 
ג
ד
ל
 
מ
א
ד
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
ע
י
נ
י
 
ע
ב
ד
י
 
פ
ר
ע
ה
 
ו
ב
ע
י
נ
י
 
ה
ע
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
פ
ר
ע
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
ב
נ
י
 
ב
כ
ו
ר
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
 
א
ל
י
ך
 
ש
ל
ח
 
א
ת
 
ב
נ
י
 
ו
י
ע
ב
ד
נ
י
 
ו
ת
מ
א
ן
 
ל
ש
ל
ח
ו
 
ה
נ
ה
 
י
ה
ו
ה
 
ה
ר
ג
 
א
ת
 
ב
נ
ך
 
ב
כ
ו
ר
ך
 
ו
י
א
מ
ר
 
מ
ש
ה
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
כ
ח
צ
י
ת
 
ה
ל
י
ל
ה
 
א
נ
י
 
י
צ
א
 
ב
ת
ו
ך
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
מ
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
כ
ו
ר
 
פ
ר
ע
ה
 
ה
י
ש
ב
 
ע
ל
 
כ
ס
א
ו
 
ו
ע
ד
 
ב
כ
ו
ר
 
ה
ש
פ
ח
ה
 
א
ש
ר
 
א
ח
ר
 
ה
ר
ח
י
ם
 
ו
ע
ד
 
ב
כ
ו
ר
 
כ
ל
 
ב
ה
מ
ה
 
ו
ה
י
ת
ה
 
צ
ע
ק
ה
 
ג
ד
ל
ה
 
ב
מ
צ
ר
י
ם
 
א
ש
ר
 
כ
מ
ו
ה
 
ל
א
 
נ
ה
י
ת
ה
 
ו
כ
מ
ו
ה
 
ל
א
 
ת
ו
ס
י
ף
 
ו
ל
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
י
ח
ר
ץ
 
כ
ל
ב
 
ל
ש
נ
ו
 
ל
מ
א
י
ש
 
ו
ע
ד
 
ב
ה
מ
ה
 
ל
מ
ע
ן
 
ת
ד
ע
 
א
ש
ר
 
י
פ
ל
א
 
י
ה
ו
ה
 
ב
י
ן
 
מ
צ
ר
י
ם
 
ו
ב
י
ן
 
י
ש
ר
א
ל
 
ו
י
ר
ד
ו
 
כ
ל
 
ע
ב
ד
י
ך
 
א
ל
ה
 
א
ל
י
 
ו
י
ש
ת
ח
ו
ו
 
ל
י
 
ל
א
מ
ר
 
צ
א
 
א
ת
ה
 
ו
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
ב
ר
ג
ל
י
ך
 
ו
א
ח
ר
י
 
כ
ן
 
א
צ
א
 
ו
י
צ
א
 
מ
ע
ם
 
פ
ר
ע
ה
 
ב
ח
ר
י
 
א
ף
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
 
י
ש
מ
ע
 
א
ל
י
כ
ם
 
פ
ר
ע
ה
 
ל
מ
ע
ן
 
ר
ב
ו
ת
 
מ
ו
פ
ת
י
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
מ
ש
ה
 
ו
א
ה
ר
ן
 
ע
ש
ו
 
א
ת
 
כ
ל
 
ה
מ
ו
פ
ת
י
ם
 
ה
א
ל
ה
 
ל
פ
נ
י
 
פ
ר
ע
ה
 
ו
י
ח
ז
ק
 
י
ה
ו
ה
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
ו
ל
א
 
ש
ל
ח
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
צ
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
א
מ
ר
 
ה
ח
ד
ש
 
ה
ז
ה
 
ל
כ
ם
 
ר
א
ש
 
ה
ח
ד
ש
י
ם
 
ר
א
י
ש
ו
ן
 
ה
ו
א
 
ל
כ
ם
 
ל
ח
ד
ש
י
 
ה
ש
נ
ה
 
ד
ב
ר
ו
 
נ
א
 
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ב
ע
ש
ו
ר
 
ל
ח
ד
ש
 
ה
ז
ה
 
ו
י
ק
ח
ו
 
ל
ה
ם
 
א
י
ש
 
ש
ה
 
ל
ב
י
ת
 
א
ב
ו
ת
 
ש
ה
 
ל
ב
י
ת
 
ו
א
ם
 
י
מ
ע
ט
 
ה
ב
י
ת
 
מ
ה
י
ו
ת
 
מ
ש
ה
 
ו
ל
ק
ח
 
ה
ו
א
 
ו
ש
כ
י
נ
ו
 
ה
ק
ר
ו
ב
 
א
ל
 
ב
י
ת
ו
 
ב
מ
כ
ס
ו
ת
 
נ
פ
ש
ו
ת
 
א
י
ש
 
ל
פ
י
 
א
כ
ל
ו
 
ת
כ
ס
ו
 
ע
ל
 
ה
ש
ה
 
ש
ה
 
ת
מ
י
ם
 
ז
כ
ר
 
ב
ן
 
ש
נ
ה
 
י
ה
י
ה
 
ל
כ
ם
 
מ
ן
 
ה
כ
ש
ב
י
ם
 
ו
מ
ן
 
ה
ע
ז
י
ם
 
ת
ק
ח
ו
 
ו
ה
י
ה
 
ל
כ
ם
 
ל
מ
ש
מ
ר
ת
 
ע
ד
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ז
ה
 
ו
ש
ח
ט
ו
 
א
ת
ו
 
כ
ל
 
ק
ה
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ו
ל
ק
ח
ו
 
מ
ן
 
ה
ד
ם
 
ו
נ
ת
נ
ו
 
ע
ל
 
ש
ת
י
 
ה
מ
ז
ז
ו
ת
 
ו
ע
ל
 
ה
מ
ש
ק
ו
ף
 
ע
ל
 
ה
ב
ת
י
ם
 
א
ש
ר
 
י
א
כ
ל
ו
 
א
ת
ו
 
ב
ה
ם
 
ו
א
כ
ל
ו
 
א
ת
 
ה
ב
ש
ר
 
ב
ל
י
ל
ה
 
ה
ז
ה
 
צ
ל
י
 
א
ש
 
ו
מ
צ
ו
ת
 
ע
ל
 
מ
ר
ר
י
ם
 
י
א
כ
ל
ה
ו
 
א
ל
 
ת
א
כ
ל
ו
 
מ
מ
נ
ו
 
נ
א
 
ו
ב
ש
ל
 
מ
ב
ש
ל
 
ב
מ
י
ם
 
כ
י
 
א
ם
 
צ
ל
י
 
א
ש
 
ר
א
ש
ו
 
ע
ל
 
כ
ר
ע
י
ו
 
ו
ע
ל
 
ק
ר
ב
ו
 
ו
ל
א
 
ת
ו
ת
י
ר
ו
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
ו
ה
נ
ו
ת
ר
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
ב
א
ש
 
ת
ש
ר
פ
ו
 
ו
כ
כ
ה
 
ת
א
כ
ל
ו
 
א
ת
ו
 
מ
ת
נ
י
כ
ם
 
ח
ג
ר
י
ם
 
נ
ע
ל
י
כ
ם
 
ב
ר
ג
ל
י
כ
ם
 
ו
מ
ק
ל
י
כ
ם
 
ב
י
ד
י
כ
ם
 
ו
א
כ
ל
ת
ם
 
א
ת
ו
 
ב
ח
פ
ז
ו
ן
 
פ
ס
ח
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ו
ע
ב
ר
ת
י
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
ל
י
ל
ה
 
ה
ז
ה
 
ו
ה
כ
י
ת
י
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
א
ד
ם
 
ע
ד
 
ב
ה
מ
ה
 
ו
ב
כ
ל
 
א
ל
ה
י
 
מ
צ
ר
י
ם
 
א
ע
ש
ה
 
ש
פ
ט
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
ו
ה
י
ה
 
ה
ד
ם
 
ל
כ
ם
 
ל
א
ו
ת
 
ע
ל
 
ה
ב
ת
י
ם
 
א
ש
ר
 
א
ת
ם
 
ש
ם
 
ו
ר
א
י
ת
י
 
א
ת
 
ה
ד
ם
 
ו
פ
ס
ח
ת
י
 
ע
ל
י
כ
ם
 
ו
ל
א
 
י
ה
י
ה
 
ב
כ
ם
 
נ
ג
ף
 
ל
מ
ש
ח
י
ת
 
ב
ה
כ
ו
ת
י
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ה
י
ה
 
ה
י
ו
ם
 
ה
ז
ה
 
ל
כ
ם
 
ל
ז
כ
ר
ו
ן
 
ו
ח
ג
ת
ם
 
א
ת
ו
 
ח
ג
 
ל
י
ה
ו
ה
 
ל
ד
ר
ת
י
כ
ם
 
ח
ק
ת
 
ע
ו
ל
ם
 
ת
ח
ג
ה
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
מ
צ
ו
ת
 
ת
א
כ
ל
ו
 
א
ך
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
ת
ש
ב
י
ת
ו
 
ש
א
ר
 
מ
ב
ת
י
כ
ם
 
כ
י
 
כ
ל
 
א
כ
ל
 
ח
מ
ץ
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
י
ש
ר
א
ל
 
מ
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
ו
ע
ד
 
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
מ
ק
ר
א
 
ק
ד
ש
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ה
 
ל
א
 
י
ע
ש
ה
 
ב
ה
ם
 
א
ך
 
א
ש
ר
 
י
א
כ
ל
 
ל
כ
ל
 
נ
פ
ש
 
ה
ו
א
 
ל
ב
ד
ו
 
י
ע
ש
ה
 
ל
כ
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ה
מ
צ
ו
ה
 
כ
י
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ה
ו
צ
א
ת
י
 
א
ת
 
צ
ב
א
ת
י
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ש
מ
ר
ת
ם
 
ו
ע
ש
י
ת
ם
 
א
ת
 
ה
י
ו
ם
 
ה
ז
ה
 
ל
ד
ר
ת
י
כ
ם
 
ח
ק
ת
 
ע
ו
ל
ם
 
ב
ר
א
י
ש
ו
ן
 
ב
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ב
ע
ר
ב
 
ת
א
כ
ל
ו
 
מ
צ
ו
ת
 
ע
ד
 
י
ו
ם
 
א
ח
ד
 
ו
ע
ש
ר
י
ם
 
ל
ח
ד
ש
 
ב
ע
ר
ב
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ש
א
ר
 
ל
א
 
י
מ
צ
א
 
ב
ב
ת
י
כ
ם
 
כ
י
 
כ
ל
 
א
כ
ל
 
מ
ח
מ
צ
ת
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
ד
ת
 
י
ש
ר
א
ל
 
ב
ג
ר
 
ו
ב
א
ז
ר
ח
 
ה
א
ר
ץ
 
כ
ל
 
מ
ח
מ
צ
ת
 
ל
א
 
ת
א
כ
ל
ו
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ת
א
כ
ל
ו
 
מ
צ
ו
ת
 
ו
י
ק
ר
א
 
מ
ש
ה
 
ל
כ
ל
 
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
ש
כ
ו
 
ק
ח
ו
 
ל
כ
ם
 
צ
א
ן
 
ל
מ
ש
פ
ח
ו
ת
י
כ
ם
 
ו
ש
ח
ט
ו
 
ה
פ
ס
ח
 
ו
ל
ק
ח
ת
ם
 
א
ג
ד
ת
 
א
ז
ו
ב
 
ו
ט
ב
ל
ת
ם
 
ב
ד
ם
 
א
ש
ר
 
ב
ס
ף
 
ו
ה
ג
ע
ת
ם
 
ע
ל
 
ה
מ
ש
ק
ף
 
ו
ע
ל
 
ש
ת
י
 
ה
מ
ז
ז
ו
ת
 
מ
ן
 
ה
ד
ם
 
א
ש
ר
 
ב
ס
ף
 
ו
א
ת
ם
 
א
ל
 
ת
צ
א
ו
 
א
י
ש
 
מ
פ
ת
ח
 
ב
י
ת
ו
 
ע
ד
 
ב
ק
ר
 
ו
ע
ב
ר
 
י
ה
ו
ה
 
ל
נ
ג
ף
 
א
ת
 
מ
צ
ר
י
ם
 
ו
ר
א
ה
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ש
ק
ף
 
ו
ע
ל
 
ש
ת
י
 
ה
מ
ז
ז
ו
ת
 
ו
פ
ס
ח
 
י
ה
ו
ה
 
ע
ל
 
ה
פ
ת
ח
 
ו
ל
א
 
י
ת
ן
 
ה
מ
ש
ח
י
ת
 
ל
ב
ו
א
 
א
ל
 
ב
ת
י
כ
ם
 
ל
נ
ג
ף
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ל
ח
ק
 
ל
ך
 
ו
ל
ב
נ
י
ך
 
ע
ד
 
ע
ו
ל
ם
 
ו
ה
י
ה
 
כ
י
 
ת
ב
א
ו
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ת
ן
 
י
ה
ו
ה
 
ל
כ
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ה
ע
ב
ד
ה
 
ה
ז
א
ת
 
ב
ח
ד
ש
 
ה
ז
ה
 
ו
ה
י
ה
 
כ
י
 
י
א
מ
ר
ו
 
א
ל
י
כ
ם
 
ב
נ
י
כ
ם
 
מ
ה
 
ה
ע
ב
ד
ה
 
ה
ז
א
ת
 
ל
כ
ם
 
ו
א
מ
ר
ת
ם
 
ז
ב
ח
 
פ
ס
ח
 
ה
ו
א
 
ל
י
ה
ו
ה
 
א
ש
ר
 
פ
ס
ח
 
ע
ל
 
ב
ת
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
מ
צ
ר
י
ם
 
ב
נ
ג
פ
ו
 
א
ת
 
מ
צ
ר
י
ם
 
ו
א
ת
 
ב
ת
י
נ
ו
 
ה
צ
י
ל
 
ו
י
ק
ד
ו
 
ה
ע
ם
 
ו
י
ש
ת
ח
ו
ו
 
ו
י
ל
כ
ו
 
ו
י
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
א
ת
 
א
ה
ר
ן
 
כ
ן
 
ע
ש
ו
 
ו
י
ה
י
 
ב
ח
צ
י
 
ה
ל
י
ל
ה
 
ו
י
ה
ו
ה
 
ה
כ
ה
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
כ
ו
ר
 
פ
ר
ע
ה
 
ה
י
ש
ב
 
ע
ל
 
כ
ס
א
ו
 
ו
ע
ד
 
ב
כ
ו
ר
 
ה
ש
ב
י
 
א
ש
ר
 
ב
ב
י
ת
 
ה
ב
ו
ר
 
ו
כ
ל
 
ב
כ
ו
ר
 
ב
ה
מ
ה
 
ו
י
ק
ם
 
פ
ר
ע
ה
 
ל
י
ל
ה
 
ה
ו
א
 
ו
כ
ל
 
ע
ב
ד
י
ו
 
ו
כ
ל
 
מ
צ
ר
י
ם
 
ו
ת
ה
י
 
צ
ע
ק
ה
 
ג
ד
ל
ה
 
ב
מ
צ
ר
י
ם
 
כ
י
 
א
י
ן
 
ב
י
ת
 
א
ש
ר
 
א
י
ן
 
ש
ם
 
מ
ת
 
ו
י
ק
ר
א
 
ל
מ
ש
ה
 
ו
ל
א
ה
ר
ן
 
ל
י
ל
ה
 
ו
י
א
מ
ר
 
ק
ו
מ
ו
 
צ
א
ו
 
מ
ת
ו
ך
 
ע
מ
י
 
ג
ם
 
א
ת
ם
 
ג
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
כ
ו
 
ע
ב
ד
ו
 
א
ת
 
י
ה
ו
ה
 
כ
ד
ב
ר
י
כ
ם
 
ג
ם
 
צ
א
נ
כ
ם
 
ג
ם
 
ב
ק
ר
כ
ם
 
ק
ח
ו
 
כ
א
ש
ר
 
ד
ב
ר
ת
ם
 
ו
ל
כ
ו
 
ו
ב
ר
כ
ת
ם
 
ג
ם
 
א
ת
י
 
ו
ת
ח
ז
ק
 
מ
צ
ר
י
ם
 
ע
ל
 
ה
ע
ם
 
ל
מ
ה
ר
 
ל
ש
ל
ח
ם
 
מ
ן
 
ה
א
ר
ץ
 
כ
י
 
א
מ
ר
ו
 
כ
ל
נ
ו
 
מ
י
ת
י
ם
 
ו
י
ש
א
 
ה
ע
ם
 
א
ת
 
ב
צ
ק
ו
 
ט
ר
ם
 
י
ח
מ
ץ
 
מ
ש
א
ר
ת
ם
 
צ
ר
ר
ו
ת
 
ב
ש
מ
ל
ו
ת
ם
 
ע
ל
 
ש
כ
מ
ם
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ש
ו
 
כ
ד
ב
ר
 
מ
ש
ה
 
ו
י
ש
א
ל
ו
 
מ
מ
צ
ר
י
ם
 
כ
ל
י
 
כ
ס
ף
 
ו
כ
ל
י
 
ז
ה
ב
 
ו
ש
מ
ל
ו
ת
 
ו
י
ה
ו
ה
 
נ
ת
ן
 
א
ת
 
ח
ן
 
ה
ע
ם
 
ב
ע
י
נ
י
 
מ
צ
ר
י
ם
 
ו
י
ש
א
י
ל
ו
ם
 
ו
י
נ
צ
ל
ו
 
א
ת
 
מ
צ
ר
י
ם
 
ו
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ר
ע
מ
ס
ס
 
ס
כ
ו
ת
ה
 
כ
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ר
ג
ל
א
י
 
ה
ג
ב
ר
י
ם
 
ל
ב
ד
 
מ
ט
ף
 
ו
ג
ם
 
ע
ר
ב
 
ר
ב
 
ע
ל
ה
 
א
ת
ם
 
ו
צ
א
ן
 
ו
ב
ק
ר
 
מ
ק
נ
ה
 
כ
ב
ד
 
מ
א
ד
 
ו
י
א
פ
ו
 
א
ת
 
ה
ב
צ
ק
 
א
ש
ר
 
ה
ו
צ
י
א
ו
 
מ
מ
צ
ר
י
ם
 
ע
ג
ו
ת
 
מ
צ
ו
ת
 
כ
י
 
ל
א
 
ח
מ
ץ
 
כ
י
 
ג
ר
ש
ו
ם
 
מ
צ
ר
י
ם
 
ו
ל
א
 
י
כ
ל
ו
 
ל
ה
ת
מ
ה
מ
ה
 
ו
ג
ם
 
צ
ד
ה
 
ל
א
 
ע
ש
ו
 
ל
ה
ם
 
ו
מ
ו
ש
ב
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ב
ו
ת
ם
 
א
ש
ר
 
י
ש
ב
ו
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ה
י
 
מ
ק
ץ
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
נ
ה
 
ו
י
ה
י
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
י
צ
א
ו
 
כ
ל
 
צ
ב
א
ו
ת
 
י
ה
ו
ה
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
י
ל
ה
 
ש
מ
ר
י
ם
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ל
ה
ו
צ
י
א
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ה
ו
א
 
ה
ל
י
ל
ה
 
ה
ז
ה
 
ל
י
ה
ו
ה
 
ש
מ
ר
י
ם
 
ל
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ד
ר
ו
ת
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ז
א
ת
 
ח
ק
ת
 
ה
פ
ס
ח
 
כ
ל
 
ב
ן
 
נ
כ
ר
 
ל
א
 
י
א
כ
ל
 
ב
ו
 
ו
כ
ל
 
ע
ב
ד
 
א
י
ש
 
מ
ק
נ
ת
 
כ
ס
פ
ו
 
ו
מ
ל
ת
 
א
ת
ו
 
א
ז
 
י
א
כ
ל
 
ב
ו
 
ת
ו
ש
ב
 
ו
ש
כ
י
ר
 
ל
א
 
י
א
כ
ל
 
ב
ו
 
ב
ב
י
ת
 
א
ח
ד
 
י
א
כ
ל
 
ל
א
 
ת
ו
צ
י
א
ו
 
מ
ן
 
ה
ב
י
ת
 
מ
ן
 
ה
ב
ש
ר
 
ה
ח
ו
צ
ה
 
ו
ע
צ
ם
 
ל
א
 
ת
ש
ב
ר
ו
 
ב
ו
 
כ
ל
 
ע
ד
ת
 
י
ש
ר
א
ל
 
י
ע
ש
ו
 
א
ת
ו
 
ו
כ
י
 
י
ג
ו
ר
 
א
ת
כ
ם
 
ג
ר
 
ו
ע
ש
ה
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
ה
מ
ו
ל
 
ל
ו
 
כ
ל
 
ז
כ
ר
 
ו
א
ז
 
י
ק
ר
ב
 
ל
ע
ש
ו
ת
ו
 
ו
ה
י
ה
 
כ
א
ז
ר
ח
 
ה
א
ר
ץ
 
ו
כ
ל
 
ע
ר
ל
 
ל
א
 
י
א
כ
ל
 
ב
ו
 
ת
ו
ר
ה
 
א
ח
ת
 
י
ה
י
ה
 
ל
א
ז
ר
ח
 
ו
ל
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
כ
ם
 
ו
י
ע
ש
ו
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
א
ת
 
א
ה
ר
ן
 
כ
ן
 
ע
ש
ו
 
ו
י
ה
י
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ה
ו
צ
י
א
 
י
ה
ו
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ל
 
צ
ב
א
ת
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ד
ש
 
ל
י
 
כ
ל
 
ב
כ
ו
ר
 
פ
ט
ר
 
כ
ל
 
ר
ח
ם
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
ל
י
 
ה
ו
א
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ם
 
ז
כ
ר
ו
 
א
ת
 
ה
י
ו
ם
 
ה
ז
ה
 
א
ש
ר
 
י
צ
א
ת
ם
 
ב
ו
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
כ
י
 
ב
ח
ז
ק
 
י
ד
 
ה
ו
צ
י
א
 
י
ה
ו
ה
 
א
ת
כ
ם
 
מ
ז
ה
 
ו
ל
א
 
י
א
כ
ל
 
ח
מ
ץ
 
ה
י
ו
ם
 
ו
א
ת
ם
 
י
ו
צ
א
י
ם
 
ב
ח
ד
ש
 
ה
א
ב
י
ב
 
ו
ה
י
ה
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ה
ח
ת
י
 
ו
ה
א
מ
ר
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
ל
ת
ת
 
ל
ך
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ו
ע
ב
ד
ת
 
א
ת
 
ה
ע
ב
ד
ה
 
ה
ז
א
ת
 
ב
ח
ד
ש
 
ה
ז
ה
 
ש
ש
ת
 
י
מ
י
ם
 
ת
א
כ
ל
 
מ
צ
ו
ת
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ח
ג
 
ל
י
ה
ו
ה
 
מ
צ
ו
ת
 
י
א
כ
ל
 
א
ת
 
ש
ב
ע
ת
 
ה
י
מ
י
ם
 
ל
א
 
י
ר
א
ה
 
ל
ך
 
ח
מ
ץ
 
ו
ל
א
 
י
ר
א
ה
 
ל
ך
 
ש
א
ר
 
ב
כ
ל
 
ג
ב
ו
ל
ך
 
ו
ה
ג
ד
ת
 
ל
ב
נ
ך
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ל
א
מ
ר
 
ב
ע
ב
ו
ר
 
ז
ה
 
ע
ש
ה
 
י
ה
ו
ה
 
ל
י
 
ב
צ
א
ת
י
 
מ
מ
צ
ר
י
ם
 
ו
ה
י
ו
 
ל
ך
 
ל
א
ו
ת
 
ע
ל
 
י
ד
י
ך
 
ו
ל
ז
כ
ר
ו
ן
 
ב
י
ן
 
ע
י
נ
י
ך
 
ל
מ
ע
ן
 
ת
ה
י
ה
 
ת
ו
ר
ת
 
י
ה
ו
ה
 
ב
פ
י
ך
 
כ
י
 
ב
י
ד
 
ח
ז
ק
ה
 
ה
ו
צ
י
א
ך
 
י
ה
ו
ה
 
מ
מ
צ
ר
י
ם
 
ו
ש
מ
ר
ת
 
א
ת
 
ה
ח
ק
ה
 
ה
ז
א
ת
 
ל
מ
ו
ע
ד
ה
 
מ
י
מ
י
ם
 
י
מ
י
מ
ה
 
ו
ה
י
ה
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
כ
א
ש
ר
 
נ
ש
ב
ע
 
ל
ך
 
ו
ל
א
ב
ת
י
ך
 
ו
נ
ת
נ
ה
 
ל
ך
 
ו
ה
ע
ב
ר
ת
 
כ
ל
 
פ
ט
ר
 
ר
ח
ם
 
ל
י
ה
ו
ה
 
ו
כ
ל
 
פ
ט
ר
 
ש
ג
ר
 
ב
ה
מ
ה
 
א
ש
ר
 
י
ה
י
ו
 
ל
ך
 
ה
ז
כ
ר
י
ם
 
ל
י
ה
ו
ה
 
ו
כ
ל
 
פ
ט
ר
 
ח
מ
ו
ר
 
ת
פ
ד
ה
 
ב
ש
ה
 
ו
א
ם
 
ל
א
 
ת
פ
ד
נ
ו
 
ו
ע
ר
פ
ת
ו
 
ו
כ
ל
 
ב
כ
ו
ר
 
א
ד
ם
 
ב
ב
נ
י
ך
 
ת
פ
ד
ה
 
ו
ה
י
ה
 
כ
י
 
י
ש
א
ל
ך
 
ב
נ
ך
 
מ
ח
ר
 
ל
א
מ
ר
 
מ
ה
 
ז
א
ת
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
ב
ח
ז
ק
 
י
ד
 
ה
ו
צ
י
א
נ
ו
 
י
ה
ו
ה
 
מ
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
ו
י
ה
י
 
כ
י
 
ה
ק
ש
ה
 
פ
ר
ע
ה
 
ל
ש
ל
ח
נ
ו
 
ו
י
ה
ר
ג
 
י
ה
ו
ה
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
כ
ו
ר
 
א
ד
ם
 
ע
ד
 
ב
כ
ו
ר
 
ב
ה
מ
ה
 
ע
ל
 
כ
ן
 
א
נ
י
 
ז
ב
ח
 
ל
י
ה
ו
ה
 
כ
ל
 
פ
ט
ר
 
ר
ח
ם
 
ה
ז
כ
ר
י
ם
 
ו
כ
ל
 
ב
כ
ו
ר
 
א
ד
ם
 
ב
ב
נ
י
 
א
פ
ד
ה
 
ו
ה
י
ו
 
ל
ך
 
ל
א
ו
ת
 
ע
ל
 
י
ד
י
ך
 
ו
ל
ט
ט
פ
ו
ת
 
ב
י
ן
 
ע
י
נ
י
ך
 
כ
י
 
ב
ח
ז
ק
 
י
ד
 
ה
ו
צ
י
א
ך
 
י
ה
ו
ה
 
מ
מ
צ
ר
י
ם
 
ו
י
ה
י
 
ב
ש
ל
ח
 
פ
ר
ע
ה
 
א
ת
 
ה
ע
ם
 
ו
ל
א
 
נ
ח
ם
 
א
ל
ה
י
ם
 
ד
ר
ך
 
א
ר
ץ
 
פ
ל
ש
ת
י
ם
 
כ
י
 
ק
ר
ו
ב
 
ה
ו
א
 
כ
י
 
א
מ
ר
 
א
ל
ה
י
ם
 
פ
ן
 
י
נ
ח
ם
 
ה
ע
ם
 
ב
ר
א
ו
ת
ם
 
מ
ל
ח
מ
ה
 
ו
ש
ב
ו
 
מ
צ
ר
י
מ
ה
 
ו
י
ס
ב
 
א
ל
ה
י
ם
 
א
ת
 
ה
ע
ם
 
ד
ר
ך
 
מ
ד
ב
ר
 
י
ם
 
ס
ו
ף
 
ו
ח
מ
י
ש
י
ם
 
ע
ל
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ע
צ
מ
ו
ת
 
י
ו
ס
ף
 
ע
מ
ו
 
כ
י
 
ה
ש
ב
ע
 
ה
ש
ב
י
ע
 
י
ו
ס
ף
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
פ
ק
ד
 
י
פ
ק
ד
 
א
ל
ה
י
ם
 
א
ת
כ
ם
 
ו
ה
ע
ל
י
ת
ם
 
א
ת
 
ע
צ
מ
ת
י
 
מ
ז
ה
 
א
ת
כ
ם
 
ו
י
ס
ע
ו
 
מ
ס
כ
ו
ת
 
ו
י
ח
נ
ו
 
ב
א
ת
ם
 
א
ש
ר
 
ב
ק
צ
ה
 
ה
מ
ד
ב
ר
 
ו
י
ה
ו
ה
 
ה
ל
ך
 
ל
פ
נ
י
ה
ם
 
י
ו
מ
ם
 
ב
ע
מ
ו
ד
 
ע
נ
ן
 
נ
ח
ת
ם
 
ד
ר
ך
 
ו
ל
י
ל
ה
 
ב
ע
מ
ו
ד
 
א
ש
 
ל
ה
א
י
ר
 
ל
ה
ם
 
ל
ל
כ
ת
 
י
ו
מ
ם
 
ו
ל
י
ל
ה
 
ל
א
 
י
מ
ו
ש
 
ע
מ
ו
ד
 
ה
ע
נ
ן
 
י
ו
מ
ם
 
ו
ע
מ
ו
ד
 
א
ש
 
ל
י
ל
ה
 
ל
פ
נ
י
 
ה
ע
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ש
ו
ב
ו
 
ו
י
ח
נ
ו
 
ל
פ
נ
י
 
פ
י
 
ה
ח
י
ר
ת
 
ב
י
ן
 
מ
ג
ד
ל
 
ו
ב
י
ן
 
ה
י
ם
 
ל
פ
נ
י
 
ב
ע
ל
 
צ
פ
ו
ן
 
נ
כ
ח
ו
 
ת
ח
נ
ו
 
ע
ל
 
ה
י
ם
 
ו
א
מ
ר
 
פ
ר
ע
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
נ
ב
כ
י
ם
 
ה
ם
 
ב
א
ר
ץ
 
ס
ג
ר
 
ע
ל
י
ה
ם
 
ה
מ
ד
ב
ר
 
ו
ה
ח
ז
ק
ת
י
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
ו
ר
ד
ף
 
א
ח
ר
י
ה
ם
 
ו
א
כ
ב
ד
ה
 
ב
פ
ר
ע
ה
 
ו
ב
כ
ל
 
ח
י
ל
ו
 
ו
י
ד
ע
ו
 
מ
צ
ר
י
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ו
י
ע
ש
ו
 
כ
ן
 
ו
י
ג
ד
 
ל
מ
ל
ך
 
מ
צ
ר
י
ם
 
כ
י
 
ב
ר
ח
 
ה
ע
ם
 
ו
י
ה
פ
ך
 
ל
ב
 
פ
ר
ע
ה
 
ו
ע
ב
ד
י
ו
 
ע
ל
 
ה
ע
ם
 
ו
י
א
מ
ר
ו
 
מ
ה
 
ז
א
ת
 
ע
ש
י
נ
ו
 
כ
י
 
ש
ל
ח
נ
ו
 
א
ת
 
י
ש
ר
א
ל
 
מ
ע
ב
ד
נ
ו
 
ו
י
א
ס
ר
 
א
ת
 
ר
כ
ב
ו
 
ו
א
ת
 
ע
מ
ו
 
ל
ק
ח
 
ע
מ
ו
 
ו
י
ק
ח
 
ש
ש
 
מ
א
ו
ת
 
ר
כ
ב
 
ב
ח
ו
ר
 
ו
כ
ל
 
ר
כ
ב
 
מ
צ
ר
י
ם
 
ו
ש
ל
י
ש
י
ם
 
ע
ל
 
כ
ל
ו
 
ו
י
ח
ז
ק
 
י
ה
ו
ה
 
א
ת
 
ל
ב
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
י
ר
ד
ף
 
א
ח
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
י
ו
צ
א
י
ם
 
ב
י
ד
 
ר
מ
ה
 
ו
י
ר
ד
פ
ו
 
מ
צ
ר
י
ם
 
א
ח
ר
י
ה
ם
 
ו
י
ש
ג
ו
 
א
ת
ם
 
ח
נ
י
ם
 
ע
ל
 
ה
י
ם
 
כ
ל
 
ס
ו
ס
 
ר
כ
ב
 
פ
ר
ע
ה
 
ו
פ
ר
ש
י
ו
 
ו
ח
י
ל
ו
 
ע
ל
 
פ
י
 
ה
ח
י
ר
ת
 
ל
פ
נ
י
 
ב
ע
ל
 
צ
פ
ו
ן
 
ו
פ
ר
ע
ה
 
ה
ק
ר
י
ב
 
ו
י
ש
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ע
י
נ
י
ה
ם
 
ו
י
ר
א
ו
 
ו
ה
נ
ה
 
מ
צ
ר
י
ם
 
נ
ס
ע
י
ם
 
א
ח
ר
י
ה
ם
 
ו
י
י
ר
א
ו
 
מ
א
ד
 
ו
י
צ
ע
ק
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
י
ה
ו
ה
 
ו
י
א
מ
ר
ו
 
א
ל
 
מ
ש
ה
 
ה
מ
ב
ל
י
 
א
י
ן
 
ק
ב
ר
י
ם
 
ב
מ
צ
ר
י
ם
 
ל
ק
ח
ת
נ
ו
 
ל
מ
ו
ת
 
ב
מ
ד
ב
ר
 
מ
ה
 
ז
א
ת
 
ע
ש
י
ת
 
ל
נ
ו
 
ל
ה
ו
צ
י
א
נ
ו
 
מ
מ
צ
ר
י
ם
 
ה
ל
ו
א
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
ד
ב
ר
נ
ו
 
א
ל
י
ך
 
ב
מ
צ
ר
י
ם
 
ל
א
מ
ר
 
ח
ד
ל
 
נ
א
 
מ
מ
נ
ו
 
ו
נ
ע
ב
ד
ה
 
א
ת
 
מ
צ
ר
י
ם
 
כ
י
 
ט
ו
ב
 
ל
נ
ו
 
ע
ב
ד
 
א
ת
 
מ
צ
ר
י
ם
 
מ
מ
ו
ת
נ
ו
 
ב
מ
ד
ב
ר
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ם
 
א
ל
 
ת
י
ר
א
ו
 
ה
ת
י
צ
ב
ו
 
ו
ר
א
ו
 
א
ת
 
י
ש
ו
ע
ת
 
י
ה
ו
ה
 
א
ש
ר
 
י
ע
ש
ה
 
ל
כ
ם
 
ה
י
ו
ם
 
כ
י
 
כ
א
ש
ר
 
ר
א
י
ת
ם
 
א
ת
 
מ
צ
ר
י
ם
 
ה
י
ו
ם
 
ל
א
 
ת
ו
ס
י
פ
ו
ן
 
ל
ר
א
ו
ת
ם
 
ע
ו
ד
 
ע
ד
 
ע
ו
ל
ם
 
י
ה
ו
ה
 
י
ל
ח
ם
 
ל
כ
ם
 
ו
א
ת
ם
 
ת
ח
ר
י
ש
ו
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
מ
ה
 
ת
צ
ע
ק
 
א
ל
י
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ס
ע
ו
 
ו
א
ת
ה
 
ה
ר
ם
 
א
ת
 
מ
ט
ך
 
ו
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ע
ל
 
ה
י
ם
 
ו
ב
ק
ע
ה
ו
 
ו
י
ב
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ת
ו
ך
 
ה
י
ם
 
ב
י
ב
ש
ה
 
ו
א
נ
י
 
ה
נ
נ
י
 
מ
ח
ז
י
ק
 
א
ת
 
ל
ב
 
מ
צ
ר
י
ם
 
ו
י
ב
א
ו
 
א
ח
ר
י
ה
ם
 
ו
א
כ
ב
ד
ה
 
ב
פ
ר
ע
ה
 
ו
ב
כ
ל
 
ח
י
ל
ו
 
ב
ר
כ
ב
ו
 
ו
ב
פ
ר
ש
י
ו
 
ו
י
ד
ע
ו
 
כ
ל
 
מ
צ
ר
י
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ב
ה
כ
ב
ד
י
 
ב
פ
ר
ע
ה
 
ו
ב
כ
ל
 
ח
י
ל
ו
 
ב
ר
כ
ב
ו
 
ו
ב
פ
ר
ש
י
ו
 
ו
י
ס
ע
 
מ
ל
א
ך
 
ה
א
ל
ה
י
ם
 
ה
ה
ל
ך
 
ל
פ
נ
י
 
מ
ח
נ
ה
 
י
ש
ר
א
ל
 
ו
י
ל
ך
 
מ
א
ח
ר
י
ה
ם
 
ו
י
ס
ע
 
ע
מ
ו
ד
 
ה
ע
נ
ן
 
מ
פ
נ
י
ה
ם
 
ו
י
ע
מ
ד
 
מ
א
ח
ר
י
ה
ם
 
ו
י
ב
א
 
ב
י
ן
 
מ
ח
נ
ה
 
מ
צ
ר
י
ם
 
ו
ב
י
ן
 
מ
ח
נ
ה
 
י
ש
ר
א
ל
 
ו
י
ה
י
 
ה
ע
נ
ן
 
ה
ח
ש
ך
 
ו
י
א
ר
 
א
ת
 
ה
ל
י
ל
ה
 
ו
ל
א
 
ק
ר
ב
 
ז
ה
 
א
ל
 
ז
ה
 
כ
ל
 
ה
ל
י
ל
ה
 
ו
י
ט
 
מ
ש
ה
 
א
ת
 
י
ד
ו
 
ע
ל
 
ה
י
ם
 
ו
י
ו
ל
ך
 
י
ה
ו
ה
 
א
ת
 
ה
י
ם
 
ב
ר
ו
ח
 
ק
ד
י
ם
 
ע
ז
ה
 
כ
ל
 
ה
ל
י
ל
ה
 
ו
י
ש
ם
 
א
ת
 
ה
י
ם
 
ל
ח
ר
ב
ה
 
ו
י
ב
ק
ע
ו
 
ה
מ
י
ם
 
ו
י
ב
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ת
ו
ך
 
ה
י
ם
 
ב
י
ב
ש
ה
 
ו
ה
מ
י
ם
 
ל
ה
ם
 
ח
ו
מ
ה
 
מ
י
מ
י
נ
ם
 
ו
מ
ש
מ
א
ל
ם
 
ו
י
ר
ד
פ
ו
 
מ
צ
ר
י
ם
 
ו
י
ב
א
ו
 
א
ח
ר
י
ה
ם
 
כ
ל
 
ס
ו
ס
 
פ
ר
ע
ה
 
ר
כ
ב
ו
 
ו
פ
ר
ש
י
ו
 
א
ל
 
ת
ו
ך
 
ה
י
ם
 
ו
י
ה
י
 
ב
א
ש
מ
ר
ת
 
ה
ב
ק
ר
 
ו
י
ש
ק
ף
 
י
ה
ו
ה
 
ע
ל
 
מ
ח
נ
ה
 
מ
צ
ר
י
ם
 
ב
ע
מ
ו
ד
 
א
ש
 
ו
ע
נ
ן
 
ו
י
ה
ם
 
א
ת
 
מ
ח
נ
ה
 
מ
צ
ר
י
ם
 
ו
י
א
ס
ר
 
א
ת
 
א
פ
ן
 
מ
ר
כ
ב
ת
י
ו
 
ו
י
נ
ה
ג
ה
ו
 
ב
כ
ב
ו
ד
ו
ת
 
ו
י
א
מ
ר
ו
 
מ
צ
ר
י
ם
 
א
נ
ו
ס
ה
 
מ
פ
נ
י
 
י
ש
ר
א
ל
 
כ
י
 
י
ה
ו
ה
 
ה
נ
ל
ח
ם
 
ל
ה
ם
 
ב
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
נ
ט
ה
 
א
ת
 
י
ד
ך
 
ע
ל
 
ה
י
ם
 
ו
י
ש
ו
ב
ו
 
ה
מ
י
ם
 
ע
ל
 
מ
צ
ר
י
ם
 
ע
ל
 
ר
כ
ב
ו
 
ו
ע
ל
 
פ
ר
ש
י
ו
 
ו
י
ט
 
מ
ש
ה
 
א
ת
 
י
ד
ו
 
ע
ל
 
ה
י
ם
 
ו
י
ש
ב
 
ה
י
ם
 
ל
פ
נ
ו
ת
 
ה
ב
ק
ר
 
ל
א
י
ת
נ
ו
 
ו
מ
צ
ר
י
ם
 
נ
ס
ע
י
ם
 
ל
ק
ר
א
ת
ו
 
ו
י
נ
ע
ר
 
י
ה
ו
ה
 
א
ת
 
מ
צ
ר
י
ם
 
ת
ו
ך
 
ה
י
ם
 
ו
י
ש
ו
ב
ו
 
ה
מ
י
ם
 
ו
י
כ
ס
ו
 
א
ת
 
ה
ר
כ
ב
 
ו
א
ת
 
ה
פ
ר
ש
י
ם
 
ל
כ
ל
 
ח
י
ל
 
פ
ר
ע
ה
 
ה
ב
א
י
ם
 
א
ח
ר
י
ה
ם
 
ב
י
ם
 
ל
א
 
נ
ש
א
ר
 
ב
ה
ם
 
ע
ד
 
א
ח
ד
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
ה
ל
כ
ו
 
ב
י
ב
ש
ה
 
ב
ת
ו
ך
 
ה
י
ם
 
ו
ה
מ
י
ם
 
ל
ה
ם
 
ח
ו
מ
ה
 
מ
י
מ
י
נ
ם
 
ו
מ
ש
מ
א
ל
ם
 
ו
י
ו
ש
י
ע
 
י
ה
ו
ה
 
ב
י
ו
ם
 
ה
ה
ו
א
 
א
ת
 
י
ש
ר
א
ל
 
מ
י
ד
 
מ
צ
ר
י
ם
 
ו
י
ר
א
 
י
ש
ר
א
ל
 
א
ת
 
מ
צ
ר
י
ם
 
מ
ת
 
ע
ל
 
ש
פ
ת
 
ה
י
ם
 
ו
י
ר
א
 
י
ש
ר
א
ל
 
א
ת
 
ה
י
ד
 
ה
ג
ד
ל
ה
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ב
מ
צ
ר
י
ם
 
ו
י
י
ר
א
ו
 
ה
ע
ם
 
א
ת
 
י
ה
ו
ה
 
ו
י
א
מ
נ
ו
 
ב
י
ה
ו
ה
 
ו
ב
מ
ש
ה
 
ע
ב
ד
ו
 
א
ז
 
י
ש
ר
 
מ
ש
ה
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ל
י
ה
ו
ה
 
ו
י
א
מ
ר
ו
 
ל
א
מ
ר
 
א
ש
י
ר
ו
 
ל
י
ה
ו
ה
 
כ
י
 
ג
ו
י
 
ג
א
ה
 
ס
ו
ס
 
ו
ר
כ
ב
ו
 
ר
מ
ה
 
ב
י
ם
 
ע
ז
י
 
ו
ז
מ
ר
ת
י
 
ו
י
ה
י
 
ל
י
 
ל
י
ש
ו
ע
ה
 
ז
ה
 
א
ל
י
 
ו
א
נ
ו
ה
ו
 
א
ל
ה
י
 
א
ב
י
 
ו
א
ר
מ
מ
נ
ה
ו
 
י
ה
ו
ה
 
ג
י
ב
ו
ר
 
ב
מ
ל
ח
מ
ה
 
י
ה
ו
ה
 
ש
מ
ו
 
מ
ר
כ
ב
ת
 
פ
ר
ע
ה
 
ו
ח
י
ל
י
ו
 
י
ר
א
 
ב
י
ם
 
ו
מ
ב
ח
ר
 
ש
ל
י
ש
י
ו
 
ט
ב
ע
ו
 
ב
י
ם
 
ס
ו
ף
 
ת
ה
ו
מ
ו
ת
 
י
כ
ס
מ
ו
 
י
ר
ד
ו
 
ב
מ
צ
ל
ו
ת
 
כ
מ
ו
 
א
ב
ן
 
י
מ
י
נ
ך
 
י
ה
ו
ה
 
נ
ד
א
ר
י
 
ב
כ
ח
 
י
מ
י
נ
ך
 
י
ה
ו
ה
 
ת
ר
ע
ץ
 
א
ו
י
ב
 
ו
ב
ר
ב
 
ג
א
נ
י
ך
 
ת
ה
ר
ס
 
ק
מ
י
ך
 
ת
ש
ל
ח
 
ח
ר
ו
נ
ך
 
י
א
כ
ל
מ
ו
 
כ
ק
ש
 
ו
ב
ר
ו
ח
 
א
פ
ך
 
נ
ע
ר
מ
ו
 
מ
י
ם
 
נ
צ
ב
ו
 
כ
מ
ו
 
נ
ד
 
נ
ז
ל
י
ם
 
ק
פ
א
ו
 
ת
ה
ו
מ
ו
ת
 
ב
ל
ב
 
י
ם
 
א
מ
ר
 
א
ו
י
ב
 
א
ר
ד
ף
 
א
ש
י
ג
 
א
ח
ל
ק
 
ש
ל
ל
 
ת
מ
ל
א
מ
ו
 
נ
פ
ש
י
 
א
ר
י
ק
 
ח
ר
ב
י
 
ת
ו
ר
י
ש
מ
ו
 
י
ד
י
 
נ
ש
ב
ת
 
ב
ר
ו
ח
ך
 
כ
ס
מ
ו
 
י
ם
 
צ
ל
ל
ו
 
כ
ע
ו
פ
ר
ת
 
ב
מ
י
ם
 
א
ד
י
ר
י
ם
 
מ
י
 
כ
מ
ו
ך
 
ב
א
ל
י
ם
 
י
ה
ו
ה
 
מ
י
 
כ
מ
ו
ך
 
נ
ד
א
ר
י
 
ב
ק
ד
ש
 
נ
ו
ר
א
 
ת
ה
ל
ת
 
ע
ש
ה
 
פ
ל
א
ה
 
נ
ט
י
ת
 
י
מ
י
נ
ך
 
ת
ב
ל
ע
מ
ו
 
ה
א
ר
ץ
 
נ
ח
י
ת
 
ב
ח
ס
ד
ך
 
ע
ם
 
ז
ה
 
ג
א
ל
ת
 
נ
ח
ל
ת
 
ב
ע
ז
ך
 
א
ל
 
נ
ו
ה
 
ק
ד
ש
ך
 
ש
מ
ע
ו
 
ע
מ
י
ם
 
ו
י
ר
ג
ז
ו
 
ח
י
ל
 
א
ח
ז
 
י
ש
ב
י
 
פ
ל
ש
ת
 
א
ז
 
נ
ב
ה
ל
ו
 
א
ל
ו
פ
י
 
א
ד
ו
ם
 
א
י
ל
י
 
מ
ו
א
ב
 
י
א
ח
ז
מ
ו
 
ר
ע
ד
 
נ
מ
ג
ו
 
כ
ל
 
י
ש
ב
י
 
כ
נ
ע
ן
 
ת
פ
ל
 
ע
ל
י
ה
ם
 
א
י
מ
ה
 
ו
פ
ח
ד
 
ו
ב
ג
ד
ו
ל
 
ז
ר
ו
ע
ך
 
י
ד
מ
א
ו
 
כ
א
ב
ן
 
ע
ד
 
י
ע
ב
ר
 
ע
מ
ך
 
י
ה
ו
ה
 
ע
ד
 
י
ע
ב
ר
 
ע
ם
 
ז
ה
 
ק
נ
י
ת
 
ת
ב
י
א
מ
ו
 
ו
ת
ט
ע
מ
ו
 
ב
ה
ר
 
נ
ח
ל
ת
ך
 
מ
כ
ו
ן
 
ל
ש
ב
ת
ך
 
פ
ע
ל
ת
 
י
ה
ו
ה
 
מ
ק
ד
ש
 
י
ה
ו
ה
 
כ
ו
נ
נ
ו
 
י
ד
ך
 
י
ה
ו
ה
 
י
מ
ל
ך
 
ע
ו
ל
ם
 
ו
ע
ו
ד
 
כ
י
 
ב
א
 
ס
ו
ס
 
פ
ר
ע
ה
 
ב
ר
כ
ב
ו
 
ו
ב
פ
ר
ש
י
ו
 
ב
י
ם
 
ו
י
ש
ב
 
י
ה
ו
ה
 
ע
ל
י
ה
ם
 
א
ת
 
מ
י
 
ה
י
ם
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
ה
ל
כ
ו
 
ב
י
ב
ש
ה
 
ב
ת
ו
ך
 
ה
י
ם
 
ו
ת
ק
ח
 
מ
ר
י
ם
 
ה
נ
ב
י
א
ה
 
א
ח
ו
ת
 
א
ה
ר
ן
 
א
ת
 
ה
ת
ף
 
ב
י
ד
ה
 
ו
ת
צ
א
נ
ה
 
כ
ל
 
ה
נ
ש
י
ם
 
א
ח
ר
י
ה
 
ב
ת
פ
י
ם
 
ו
ב
מ
ח
ל
ו
ת
 
ו
ת
ע
ן
 
ל
ה
ם
 
מ
ר
י
ם
 
ש
י
ר
ו
 
ל
י
ה
ו
ה
 
כ
י
 
ג
ו
י
 
ג
א
ה
 
ס
ו
ס
 
ו
ר
כ
ב
ו
 
ר
מ
ה
 
ב
י
ם
 
ו
י
ס
ע
 
מ
ש
ה
 
א
ת
 
י
ש
ר
א
ל
 
מ
י
ם
 
ס
ו
ף
 
ו
י
ו
צ
י
א
ה
ו
 
א
ל
 
מ
ד
ב
ר
 
ש
ו
ר
 
ו
י
ל
כ
ו
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ב
מ
ד
ב
ר
 
ו
ל
א
 
מ
צ
א
ו
 
מ
י
ם
 
ו
י
ב
א
ו
 
מ
ר
ת
ה
 
ו
ל
א
 
י
כ
ל
ו
 
ל
ש
ת
ו
ת
 
מ
י
ם
 
מ
מ
ר
ה
 
כ
י
 
מ
ר
י
ם
 
ה
ם
 
ע
ל
 
כ
ן
 
ק
ר
א
 
ש
מ
ה
 
מ
ר
ה
 
ו
י
ל
ן
 
ה
ע
ם
 
ע
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
מ
ה
 
נ
ש
ת
ה
 
ו
י
צ
ע
ק
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ו
י
ר
א
ה
ו
 
י
ה
ו
ה
 
ע
ץ
 
ו
י
ש
ל
ך
 
א
ל
 
ה
מ
י
ם
 
ו
י
מ
ת
ק
ו
 
ה
מ
י
ם
 
ש
ם
 
ש
ם
 
ל
ו
 
ח
ק
 
ו
מ
ש
פ
ט
 
ו
ש
ם
 
נ
ס
ה
ו
 
ו
י
א
מ
ר
 
א
ם
 
ש
מ
ע
 
ת
ש
מ
ע
 
ל
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
י
ש
ר
 
ב
ע
י
נ
י
ו
 
ת
ע
ש
ה
 
ו
ה
א
ז
נ
ת
 
ל
מ
צ
ו
ת
י
ו
 
ו
ש
מ
ר
ת
 
כ
ל
 
ח
ק
י
ו
 
כ
ל
 
ה
מ
ח
ל
ה
 
א
ש
ר
 
ש
מ
ת
י
 
ב
מ
צ
ר
י
ם
 
ל
א
 
א
ש
י
ם
 
ע
ל
י
ך
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ר
פ
א
ך
 
ו
י
ב
א
ו
 
א
י
ל
י
ם
 
ו
ב
א
י
ל
י
ם
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ע
י
נ
ו
ת
 
מ
י
ם
 
ו
ש
ב
ע
י
ם
 
ת
מ
ר
י
ם
 
ו
י
ח
נ
ו
 
ש
ם
 
ע
ל
 
ה
מ
י
ם
 
ו
י
ס
ע
ו
 
מ
א
י
ל
י
ם
 
ו
י
ב
א
ו
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
מ
ד
ב
ר
 
ס
י
ן
 
א
ש
ר
 
ב
י
ן
 
א
י
ל
י
ם
 
ו
ב
י
ן
 
ס
י
נ
י
 
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ש
נ
י
 
ל
צ
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ל
נ
ו
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
ב
מ
ד
ב
ר
 
ו
י
א
מ
ר
ו
 
א
ל
י
ה
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
י
 
י
ת
ן
 
מ
ו
ת
נ
ו
 
ב
י
ד
 
י
ה
ו
ה
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
ש
ב
ת
נ
ו
 
ע
ל
 
ס
י
ר
 
ה
ב
ש
ר
 
ב
א
כ
ל
נ
ו
 
ל
ח
ם
 
ל
ש
ב
ע
 
כ
י
 
ה
ו
צ
א
ת
ם
 
א
ת
נ
ו
 
א
ל
 
ה
מ
ד
ב
ר
 
ה
ז
ה
 
ל
ה
מ
י
ת
 
א
ת
 
כ
ל
 
ה
ק
ה
ל
 
ה
ז
ה
 
ב
ר
ע
ב
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
נ
נ
י
 
מ
מ
ט
י
ר
 
ל
כ
ם
 
ל
ח
ם
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
י
צ
א
 
ה
ע
ם
 
ו
ל
ק
ט
ו
 
ד
ב
ר
 
י
ו
ם
 
ב
י
ו
מ
ו
 
ל
מ
ע
ן
 
א
נ
ס
נ
ו
 
ה
י
ל
כ
ו
 
ב
ת
ו
ר
ו
ת
י
 
א
ם
 
ל
א
 
ו
ה
י
ה
 
ב
י
ו
ם
 
ה
ש
ש
י
 
ו
ה
כ
י
נ
ו
 
א
ת
 
א
ש
ר
 
י
ב
י
א
ו
 
ו
ה
י
ה
 
מ
ש
נ
ה
 
ע
ל
 
א
ש
ר
 
י
ל
ק
ט
ו
 
י
ו
ם
 
ו
י
ו
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ר
ב
 
ו
י
ד
ע
ת
ם
 
כ
י
 
י
ה
ו
ה
 
ה
ו
צ
י
א
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ב
ק
ר
 
ו
ר
א
י
ת
ם
 
א
ת
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
ב
ש
מ
ע
ו
 
א
ת
 
ת
ל
נ
ת
י
כ
ם
 
ע
ל
 
י
ה
ו
ה
 
ו
א
נ
ח
נ
ו
 
מ
ה
 
כ
י
 
ת
ל
נ
ו
 
ע
ל
י
נ
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ב
ת
ת
 
י
ה
ו
ה
 
ל
כ
ם
 
ב
ע
ר
ב
 
ב
ש
ר
 
ל
א
כ
ל
 
ו
ל
ח
ם
 
ב
ב
ק
ר
 
ל
ש
ב
ע
 
ב
ש
מ
ע
 
י
ה
ו
ה
 
א
ת
 
ת
ל
נ
ת
י
כ
ם
 
א
ש
ר
 
א
ת
ם
 
מ
ל
נ
י
ם
 
ע
ל
י
ו
 
ו
א
נ
ח
נ
ו
 
מ
ה
 
ל
א
 
ע
ל
י
נ
ו
 
ת
ל
נ
ת
י
כ
ם
 
כ
י
 
ע
ל
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
א
מ
ר
 
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ק
ר
ב
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
י
 
ש
מ
ע
 
א
ת
 
ת
ל
נ
ת
י
כ
ם
 
ו
י
ה
י
 
כ
ד
ב
ר
 
א
ה
ר
ן
 
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
פ
נ
ו
 
א
ל
 
ה
מ
ד
ב
ר
 
ו
ה
נ
ה
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
נ
ר
א
ה
 
ב
ע
נ
ן
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ש
מ
ע
ת
י
 
א
ת
 
ת
ל
נ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ד
ב
ר
 
א
ל
י
ה
ם
 
ל
א
מ
ר
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ת
א
כ
ל
ו
 
ב
ש
ר
 
ו
ב
ב
ק
ר
 
ת
ש
ב
ע
ו
 
ל
ח
ם
 
ו
י
ד
ע
ת
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ה
י
 
ב
ע
ר
ב
 
ו
ת
ע
ל
 
ה
ש
ל
ו
י
 
ו
ת
כ
ס
 
א
ת
 
ה
מ
ח
נ
ה
 
ו
ב
ב
ק
ר
 
ה
י
ת
ה
 
ש
כ
ב
ת
 
ה
ט
ל
 
ס
ב
י
ב
 
ל
מ
ח
נ
ה
 
ו
ת
ע
ל
 
ש
כ
ב
ת
 
ה
ט
ל
 
ו
ה
נ
ה
 
ע
ל
 
פ
נ
י
 
ה
מ
ד
ב
ר
 
ד
ק
 
מ
ח
ס
פ
ס
 
ד
ק
 
כ
כ
ו
פ
ר
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
ר
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
ו
 
א
י
ש
 
א
ל
 
א
ח
י
ו
 
מ
ן
 
ה
ו
א
 
כ
י
 
ל
א
 
י
ד
ע
ו
 
מ
ה
 
ה
ו
א
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
י
ה
ם
 
ה
ו
א
 
ה
ל
ח
ם
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ל
כ
ם
 
ל
א
כ
ל
ה
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ק
ט
ו
 
מ
מ
נ
ו
 
א
י
ש
 
ל
פ
י
 
א
כ
ל
ו
 
ע
מ
ר
 
ל
ג
ל
ג
ל
ת
 
מ
ס
פ
ר
 
נ
פ
ש
ת
י
כ
ם
 
א
י
ש
 
ל
א
ש
ר
 
ב
א
ה
ל
ו
 
ת
ק
ח
ו
 
ו
י
ע
ש
ו
 
כ
ן
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ל
ק
ט
ו
 
ה
מ
ר
ב
ה
 
ו
ה
מ
מ
ע
י
ט
 
ו
י
מ
ד
ו
 
ב
ע
מ
ר
 
ו
ל
א
 
ה
ע
ד
י
ף
 
ה
מ
ר
ב
ה
 
ו
ה
מ
מ
ע
י
ט
 
ל
א
 
ה
ח
ס
י
ר
 
א
י
ש
 
ל
פ
י
 
א
כ
ל
ו
 
ל
ק
ט
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
י
ה
ם
 
א
י
ש
 
א
ל
 
י
ו
ת
י
ר
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
ו
ל
א
 
ש
מ
ע
ו
 
א
ל
 
מ
ש
ה
 
ו
י
ו
ת
י
ר
ו
 
א
נ
ש
י
ם
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
ו
י
ר
ם
 
ת
ו
ל
ע
י
ם
 
ו
י
ב
א
ש
 
ו
י
ק
צ
ף
 
ע
ל
י
ה
ם
 
מ
ש
ה
 
ו
י
ל
ק
ט
ו
 
א
ת
ו
 
ב
ב
ק
ר
 
ב
ב
ק
ר
 
א
י
ש
 
ל
פ
י
 
א
כ
ל
ו
 
ו
ח
מ
ה
 
ה
ש
מ
ש
 
ו
נ
מ
ס
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ש
ש
י
 
ל
ק
ט
ו
 
ל
ח
ם
 
מ
ש
נ
ה
 
ש
נ
י
 
ה
ע
מ
ר
 
ל
א
ח
ד
 
ו
י
ב
א
ו
 
כ
ל
 
נ
ש
י
א
י
 
ה
ע
ד
ה
 
ו
י
ג
ד
ו
 
ל
מ
ש
ה
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ה
ו
א
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ש
ב
ת
ו
ן
 
ש
ב
ת
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
מ
ח
ר
 
א
ת
 
א
ש
ר
 
ת
א
פ
ו
 
א
פ
ו
 
ו
א
ת
 
א
ש
ר
 
ת
ב
ש
ל
ו
 
ב
ש
ל
ו
 
ו
א
ת
 
כ
ל
 
ה
ע
ד
ף
 
ה
נ
י
ח
ו
 
ל
כ
ם
 
ל
מ
ש
מ
ר
ת
 
ע
ד
 
ב
ק
ר
 
ו
י
נ
י
ח
ו
 
א
ת
ו
 
ע
ד
 
ה
ב
ק
ר
 
כ
א
ש
ר
 
צ
ו
ה
 
מ
ש
ה
 
ו
ל
א
 
ה
ב
א
י
ש
 
ו
ר
מ
ה
 
ל
א
 
ה
י
ת
ה
 
ב
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
כ
ל
ה
ו
 
ה
י
ו
ם
 
כ
י
 
ש
ב
ת
 
ה
י
ו
ם
 
ל
י
ה
ו
ה
 
ה
י
ו
ם
 
ל
א
 
ת
מ
צ
א
ו
 
ב
ש
ד
ה
 
ש
ש
ת
 
י
מ
י
ם
 
ת
ל
ק
ט
ה
ו
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
ב
ת
 
ל
א
 
י
ה
י
ה
 
ב
ו
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
י
צ
א
ו
 
מ
ן
 
ה
ע
ם
 
ל
ל
ק
ט
 
ו
ל
א
 
מ
צ
א
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ע
ד
 
ה
נ
ה
 
מ
א
נ
ת
ם
 
ל
ש
מ
ר
 
מ
צ
ו
ת
י
 
ו
ת
ו
ר
ו
ת
י
 
ר
א
ו
 
כ
י
 
י
ה
ו
ה
 
נ
ת
ן
 
ל
כ
ם
 
א
ת
 
ה
ש
ב
ת
 
ע
ל
 
כ
ן
 
ה
ו
א
 
נ
ת
ן
 
ל
כ
ם
 
ב
י
ו
ם
 
ה
ש
ש
י
 
ל
ח
ם
 
י
ו
מ
י
ם
 
ש
ב
ו
 
א
י
ש
 
ת
ח
ת
י
ו
 
א
ל
 
י
צ
א
 
א
י
ש
 
מ
מ
ק
ו
מ
ו
 
ב
י
ו
ם
 
ה
ש
ב
ת
 
ו
י
ש
ב
ת
 
ה
ע
ם
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
י
ק
ר
א
ו
 
ב
י
ת
 
י
ש
ר
א
ל
 
א
ת
 
ש
מ
ו
 
מ
ן
 
ו
ה
ו
א
 
כ
ז
ר
ע
 
ג
ד
 
ל
ב
ן
 
ו
ט
ע
מ
ו
 
כ
צ
פ
ח
י
ת
 
ב
ד
ב
ש
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
מ
ל
א
ו
 
ה
ע
מ
ר
 
מ
מ
נ
ו
 
ל
מ
ש
מ
ר
ת
 
ל
ד
ר
ת
י
כ
ם
 
ל
מ
ע
ן
 
י
ר
א
ו
 
א
ת
 
ה
ל
ח
ם
 
א
ש
ר
 
ה
א
כ
ל
ת
י
 
א
ת
כ
ם
 
ב
מ
ד
ב
ר
 
ב
ה
ו
צ
א
י
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ק
ח
 
צ
נ
צ
נ
ת
 
א
ח
ת
 
ו
ת
ן
 
ש
ם
 
מ
ל
ו
א
 
ה
ע
מ
ר
 
מ
ן
 
ו
ה
נ
י
ח
 
א
ת
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
מ
ש
מ
ר
ת
 
ל
ד
ר
ת
י
כ
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
נ
י
ח
ה
ו
 
א
ה
ר
ן
 
ל
פ
נ
י
 
ה
ע
ד
ו
ת
 
ל
מ
ש
מ
ר
ת
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
א
כ
ל
ו
 
א
ת
 
ה
מ
ן
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ע
ד
 
ב
א
ם
 
א
ל
 
א
ר
ץ
 
נ
ו
ש
ב
ת
 
א
ת
 
ה
מ
ן
 
א
כ
ל
ו
 
ע
ד
 
ב
א
ם
 
א
ל
 
ק
צ
ה
 
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ה
ע
מ
ר
 
ע
ש
י
ר
ת
 
ה
א
י
פ
ה
 
ה
ו
א
 
ו
י
ס
ע
ו
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
מ
ד
ב
ר
 
ס
י
ן
 
ל
מ
ס
ע
י
ה
ם
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ו
י
ח
נ
ו
 
ב
ר
פ
י
ד
י
ם
 
ו
א
י
ן
 
מ
י
ם
 
ל
ש
ת
ו
ת
 
ה
ע
ם
 
ו
י
ר
ב
 
ה
ע
ם
 
ע
ם
 
מ
ש
ה
 
ו
י
א
מ
ר
 
ת
נ
ה
 
ל
נ
ו
 
מ
י
ם
 
ו
נ
ש
ת
ה
 
ו
י
א
מ
ר
 
ל
ה
ם
 
מ
ש
ה
 
מ
ה
 
ת
ר
י
ב
ו
ן
 
ע
מ
ד
י
 
ו
מ
ה
 
ת
נ
ס
ו
 
א
ת
 
י
ה
ו
ה
 
ו
י
צ
מ
א
 
ש
ם
 
ה
ע
ם
 
ל
מ
י
ם
 
ו
י
ל
ן
 
ה
ע
ם
 
ע
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
ו
 
ל
מ
ה
 
ה
ע
ל
י
ת
נ
ו
 
מ
מ
צ
ר
י
ם
 
ל
ה
מ
י
ת
 
א
ת
י
 
ו
א
ת
 
ב
נ
י
 
ו
א
ת
 
מ
ק
נ
י
 
ב
צ
מ
א
 
ו
י
צ
ע
ק
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ל
א
מ
ר
 
מ
ה
 
א
ע
ש
ה
 
ל
ע
ם
 
ה
ז
ה
 
ע
ו
ד
 
מ
ע
ט
 
ו
ס
ק
ל
ו
נ
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ע
ב
ר
 
ל
פ
נ
י
 
ה
ע
ם
 
ו
ק
ח
 
א
ת
ך
 
מ
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
מ
ט
ך
 
א
ש
ר
 
ה
כ
י
ת
 
ב
ו
 
א
ת
 
ה
י
א
ר
 
ת
ק
ח
 
ב
י
ד
ך
 
ו
ה
ל
כ
ת
 
ה
נ
נ
י
 
ע
מ
ד
 
ל
פ
נ
י
ך
 
ש
ם
 
ע
ל
 
ה
צ
ו
ר
 
ב
ח
ו
ר
ב
 
ו
ה
כ
י
ת
 
ב
צ
ו
ר
 
ו
י
צ
א
 
מ
מ
נ
ו
 
מ
י
ם
 
ו
ש
ת
ה
 
ה
ע
ם
 
ו
י
ע
ש
 
כ
ן
 
מ
ש
ה
 
ל
ע
י
נ
י
 
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ר
א
 
ש
ם
 
ה
מ
ק
ו
ם
 
מ
ס
ה
 
ו
מ
ר
י
ב
ה
 
ע
ל
 
ר
י
ב
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ע
ל
 
נ
ס
ו
ת
ם
 
א
ת
 
י
ה
ו
ה
 
ל
א
מ
ר
 
ה
י
ש
 
י
ה
ו
ה
 
ב
ק
ר
ב
נ
ו
 
א
ם
 
א
י
ן
 
ו
י
ב
א
 
ע
מ
ל
ק
 
ו
י
ל
ח
ם
 
ע
ם
 
י
ש
ר
א
ל
 
ב
ר
פ
י
ד
י
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
י
ה
ו
ש
ע
 
ב
ח
ר
 
ל
נ
ו
 
א
נ
ש
י
ם
 
ו
צ
א
 
ה
ל
ח
ם
 
ב
ע
מ
ל
ק
 
מ
ח
ר
 
א
נ
כ
י
 
נ
צ
ב
 
ע
ל
 
ר
א
ש
 
ה
ג
ב
ע
ה
 
ו
מ
ט
ה
 
ה
א
ל
ה
י
ם
 
ב
י
ד
י
 
ו
י
ע
ש
 
י
ה
ו
ש
ע
 
כ
א
ש
ר
 
א
מ
ר
 
ל
ו
 
מ
ש
ה
 
ל
ה
ל
ח
ם
 
ב
ע
מ
ל
ק
 
ו
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
ח
ו
ר
 
ע
ל
ו
 
א
ל
 
ר
א
ש
 
ה
ג
ב
ע
ה
 
ו
ה
י
ה
 
כ
א
ש
ר
 
י
ר
י
ם
 
מ
ש
ה
 
י
ד
י
ו
 
ו
ג
ב
ר
 
י
ש
ר
א
ל
 
ו
כ
א
ש
ר
 
י
נ
י
ח
 
י
ד
י
ו
 
ו
ג
ב
ר
 
ע
מ
ל
ק
 
ו
י
ד
י
 
מ
ש
ה
 
כ
ב
ד
י
ם
 
ו
י
ק
ח
ו
 
א
ב
ן
 
ו
י
ש
מ
ו
 
ת
ח
ת
י
ו
 
ו
י
ש
ב
 
ע
ל
י
ה
 
ו
א
ה
ר
ן
 
ו
ח
ו
ר
 
ת
מ
כ
ו
 
ב
י
ד
י
ו
 
מ
ז
ה
 
א
ח
ד
 
ו
מ
ז
ה
 
א
ח
ד
 
ו
י
ה
י
ו
 
י
ד
י
ו
 
א
מ
ו
נ
ה
 
ע
ד
 
ב
א
 
ה
ש
מ
ש
 
ו
י
ח
ל
ש
 
י
ה
ו
ש
ע
 
א
ת
 
ע
מ
ל
ק
 
ו
א
ת
 
ע
מ
ו
 
ו
י
כ
ם
 
ל
פ
י
 
ח
ר
ב
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
כ
ת
ב
 
ז
א
ת
 
ז
כ
ר
ו
ן
 
ב
ס
פ
ר
 
ו
ש
י
ם
 
ב
א
ז
נ
י
 
י
ה
ו
ש
ע
 
כ
י
 
מ
ח
ה
 
א
מ
ח
ה
 
א
ת
 
ז
כ
ר
 
ע
מ
ל
ק
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
ו
י
ב
ן
 
מ
ש
ה
 
מ
ז
ב
ח
 
ו
י
ק
ר
א
 
ש
מ
ו
 
י
ה
ו
ה
 
נ
ס
י
 
ו
י
א
מ
ר
 
כ
י
 
י
ד
 
ע
ל
 
כ
ס
א
 
מ
ל
ח
מ
ה
 
ל
י
ה
ו
ה
 
ב
ע
מ
ל
ק
 
מ
ד
ר
 
ו
ד
ר
 
ו
י
ש
מ
ע
 
י
ת
ר
ו
 
כ
ה
ן
 
מ
ד
י
ן
 
ח
ת
ן
 
מ
ש
ה
 
א
ת
 
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
א
ל
ה
י
ם
 
ל
מ
ש
ה
 
ו
ל
י
ש
ר
א
ל
 
ע
מ
ו
 
כ
י
 
ה
ו
צ
י
א
 
י
ה
ו
ה
 
א
ת
 
י
ש
ר
א
ל
 
מ
מ
צ
ר
י
ם
 
ו
י
ק
ח
 
י
ת
ר
ו
 
ח
ת
ן
 
מ
ש
ה
 
א
ת
 
צ
פ
ו
ר
ה
 
א
ש
ת
 
מ
ש
ה
 
א
ח
ר
 
ש
ל
ח
י
ה
 
ו
א
ת
 
ש
נ
י
 
ב
נ
י
ה
 
א
ש
ר
 
ש
ם
 
ה
א
ח
ד
 
ג
ר
ש
ם
 
כ
י
 
א
מ
ר
 
ג
ר
 
ה
י
י
ת
י
 
ב
א
ר
ץ
 
נ
כ
ר
י
ה
 
ו
ש
ם
 
ה
א
ח
ד
 
א
ל
י
ע
ז
ר
 
כ
י
 
א
ל
ה
י
 
א
ב
י
 
ב
ע
ז
ר
י
 
ו
י
צ
ל
נ
י
 
מ
ח
ר
ב
 
פ
ר
ע
ה
 
ו
י
ב
א
 
י
ת
ר
ו
 
ח
ת
ן
 
מ
ש
ה
 
ו
ב
נ
י
ו
 
ו
א
ש
ת
ו
 
א
ל
 
מ
ש
ה
 
א
ל
 
ה
מ
ד
ב
ר
 
א
ש
ר
 
ה
ו
א
 
ח
נ
ה
 
ש
ם
 
ה
ר
 
ה
א
ל
ה
י
ם
 
ו
י
א
מ
ר
 
ל
מ
ש
ה
 
ה
נ
ה
 
ח
ת
נ
ך
 
י
ת
ר
ו
 
ב
א
 
א
ל
י
ך
 
ו
א
ש
ת
ך
 
ו
ש
נ
י
 
ב
נ
י
ה
 
ע
מ
ה
 
ו
י
צ
א
 
מ
ש
ה
 
ל
ק
ר
א
ת
 
ח
ת
נ
ו
 
ו
י
ש
ת
ח
ו
י
 
ל
מ
ש
ה
 
ו
י
ש
ק
 
ל
ו
 
ו
י
ש
א
ל
ו
 
א
י
ש
 
ל
ר
ע
ה
ו
 
ל
ש
ל
ו
ם
 
ו
י
ב
א
ה
ו
 
ה
א
ה
ל
ה
 
ו
י
ס
פ
ר
 
מ
ש
ה
 
ל
ח
ת
נ
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ל
פ
ר
ע
ה
 
ו
ל
מ
צ
ר
י
ם
 
ע
ל
 
א
ד
ו
ת
 
י
ש
ר
א
ל
 
א
ת
 
כ
ל
 
ה
ת
ל
א
ה
 
א
ש
ר
 
מ
צ
א
ת
ם
 
ב
ד
ר
ך
 
ו
י
צ
ל
ם
 
י
ה
ו
ה
 
ו
י
ח
ד
 
י
ת
ר
ו
 
ע
ל
 
כ
ל
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ל
י
ש
ר
א
ל
 
א
ש
ר
 
ה
צ
י
ל
ו
 
מ
י
ד
 
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
י
ת
ר
ו
 
ב
ר
ו
ך
 
י
ה
ו
ה
 
א
ש
ר
 
ה
צ
י
ל
 
א
ת
כ
ם
 
מ
י
ד
 
מ
צ
ר
י
ם
 
ו
מ
י
ד
 
פ
ר
ע
ה
 
א
ש
ר
 
ה
צ
י
ל
 
א
ת
 
ה
ע
ם
 
מ
ת
ח
ת
 
י
ד
 
מ
צ
ר
י
ם
 
ע
ת
ה
 
י
ד
ע
ת
י
 
כ
י
 
ג
ד
ו
ל
 
י
ה
ו
ה
 
מ
כ
ל
 
ה
א
ל
ה
י
ם
 
כ
י
 
ב
ד
ב
ר
 
א
ש
ר
 
ז
ד
ו
 
ע
ל
י
ה
ם
 
ו
י
ק
ח
 
י
ת
ר
ו
 
ח
ת
ן
 
מ
ש
ה
 
ע
ל
ה
 
ו
ז
ב
ח
י
ם
 
ל
א
ל
ה
י
ם
 
ו
י
ב
א
 
א
ה
ר
ן
 
ו
מ
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ל
א
כ
ל
 
ל
ח
ם
 
ע
ם
 
ח
ת
ן
 
מ
ש
ה
 
ל
פ
נ
י
 
ה
א
ל
ה
י
ם
 
ו
י
ה
י
 
מ
מ
ח
ר
ת
 
ו
י
ש
ב
 
מ
ש
ה
 
ל
ש
פ
ט
 
א
ת
 
ה
ע
ם
 
ו
י
ע
מ
ד
 
ה
ע
ם
 
ע
ל
 
מ
ש
ה
 
מ
ן
 
ה
ב
ק
ר
 
ו
ע
ד
 
ה
ע
ר
ב
 
ו
י
ר
א
 
ח
ת
ן
 
מ
ש
ה
 
א
ת
 
כ
ל
 
א
ש
ר
 
ה
ו
א
 
ע
ש
ה
 
ל
ע
ם
 
ו
י
א
מ
ר
 
מ
ה
 
ה
ד
ב
ר
 
ה
ז
ה
 
א
ש
ר
 
א
ת
ה
 
ע
ש
ה
 
ל
ע
ם
 
מ
ד
ו
ע
 
א
ת
ה
 
י
ש
ב
 
ל
ב
ד
ך
 
ו
כ
ל
 
ה
ע
ם
 
נ
צ
ב
 
ע
ל
י
ך
 
מ
ן
 
ה
ב
ק
ר
 
ו
ע
ד
 
ה
ע
ר
ב
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
ח
ת
נ
ו
 
כ
י
 
י
ב
ו
א
 
א
ל
י
 
ה
ע
ם
 
ל
ד
ר
ש
 
א
ל
ה
י
ם
 
כ
י
 
י
ה
י
ה
 
ל
ה
ם
 
ד
ב
ר
 
ב
א
 
א
ל
י
 
ו
ש
פ
ט
ת
י
 
ב
י
ן
 
א
י
ש
 
ו
ב
י
ן
 
ר
ע
ה
ו
 
ו
ה
ו
ד
ע
ת
י
ו
 
א
ת
 
ח
ק
י
 
ה
א
ל
ה
י
ם
 
ו
א
ת
 
ת
ו
ר
ו
ת
י
ו
 
ו
י
א
מ
ר
 
ח
ת
ן
 
מ
ש
ה
 
א
ל
י
ו
 
ל
א
 
ט
ו
ב
 
ה
ד
ב
ר
 
א
ש
ר
 
א
ת
ה
 
ע
ש
ה
 
נ
ב
ל
 
ת
ב
ל
 
ג
ם
 
א
ת
ה
 
ג
ם
 
ה
ע
ם
 
ה
ז
ה
 
א
ש
ר
 
ע
מ
ך
 
כ
י
 
כ
ב
ד
 
מ
מ
ך
 
ה
ד
ב
ר
 
ל
א
 
ת
ו
כ
ל
 
ע
ש
ו
ת
ו
 
ל
ב
ד
ך
 
ע
ת
ה
 
ש
מ
ע
 
ב
ק
ו
ל
י
 
א
ע
י
צ
ך
 
ו
י
ה
י
 
א
ל
ה
י
ם
 
ע
מ
ך
 
ה
ו
י
 
א
ת
ה
 
ל
ע
ם
 
מ
ו
ל
 
ה
א
ל
ה
י
ם
 
ו
ה
ב
א
ת
 
א
ת
ה
 
א
ת
 
ה
ד
ב
ר
י
ם
 
א
ל
 
ה
א
ל
ה
י
ם
 
ו
ה
ז
ה
ר
ת
 
א
ת
ם
 
א
ת
 
ה
ח
ק
י
ם
 
ו
א
ת
 
ה
ת
ו
ר
ה
 
ו
ה
ו
ד
ע
ת
 
ל
ה
ם
 
א
ת
 
ה
ד
ר
ך
 
א
ש
ר
 
י
ל
כ
ו
 
ב
ה
 
ו
א
ת
 
ה
מ
ע
ש
ה
 
א
ש
ר
 
י
ע
ש
ו
ן
 
ו
א
ת
ה
 
ת
ח
ז
ה
 
ל
ך
 
מ
כ
ל
 
ה
ע
ם
 
א
נ
ש
י
 
ח
י
ל
 
י
ר
א
י
 
א
ל
ה
י
ם
 
א
נ
ש
י
 
א
מ
ת
 
ש
נ
א
י
 
ב
צ
ע
 
ו
ש
מ
ת
 
ע
ל
י
ה
ם
 
ש
ר
י
 
א
ל
פ
י
ם
 
ו
ש
ר
י
 
מ
א
ו
ת
 
ש
ר
י
 
ח
מ
ש
י
ם
 
ו
ש
ר
י
 
ע
ש
ר
ו
ת
 
ו
ש
פ
ט
ו
 
א
ת
 
ה
ע
ם
 
ב
כ
ל
 
ע
ת
 
ו
ה
י
ה
 
כ
ל
 
ה
ד
ב
ר
 
ה
ג
ד
ו
ל
 
י
ב
י
א
ו
ן
 
א
ל
י
ך
 
ו
כ
ל
 
ה
ד
ב
ר
 
ה
ק
ט
ן
 
י
ש
פ
ט
ו
 
ה
ם
 
ו
ה
ק
ל
 
מ
ע
ל
י
ך
 
ו
נ
ש
א
ו
 
א
ת
ך
 
א
ם
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ת
ע
ש
ה
 
ו
צ
ו
ך
 
א
ל
ה
י
ם
 
ו
י
כ
ל
ת
 
ע
מ
ד
 
ו
ג
ם
 
כ
ל
 
ה
ע
ם
 
ה
ז
ה
 
א
ל
 
מ
ק
ו
מ
ו
 
י
ב
ו
א
 
ב
ש
ל
ו
ם
 
ו
י
ש
מ
ע
 
מ
ש
ה
 
ל
ק
ו
ל
 
ח
ת
נ
ו
 
ו
י
ע
ש
 
כ
ל
 
א
ש
ר
 
א
מ
ר
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ם
 
ל
א
 
א
ו
כ
ל
 
א
נ
כ
י
 
ל
ב
ד
י
 
ש
א
ת
 
א
ת
כ
ם
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ר
ב
ה
 
א
ת
כ
ם
 
ו
ה
נ
כ
ם
 
ה
י
ו
ם
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ל
ר
ב
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
י
ס
ף
 
ע
ל
י
כ
ם
 
כ
כ
ם
 
א
ל
ף
 
פ
ע
מ
י
ם
 
ו
י
ב
ר
ך
 
א
ת
כ
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
כ
ם
 
א
י
ך
 
א
ש
א
 
ל
ב
ד
י
 
ט
ר
ח
כ
ם
 
מ
ש
א
כ
ם
 
ו
ר
י
ב
כ
ם
 
ה
ב
ו
 
ל
כ
ם
 
א
נ
ש
י
ם
 
ח
כ
מ
י
ם
 
ו
נ
ב
ו
נ
י
ם
 
ו
י
ד
ע
י
ם
 
ל
ש
ב
ט
י
כ
ם
 
ו
א
ש
י
מ
ם
 
ב
ר
א
ש
י
כ
ם
 
ו
י
ע
נ
ו
 
ו
י
א
מ
ר
ו
 
ט
ו
ב
 
ה
ד
ב
ר
 
א
ש
ר
 
ד
ב
ר
ת
 
ל
ע
ש
ו
ת
 
ו
י
ק
ח
 
א
ת
 
ר
א
ש
י
 
ש
ב
ט
י
ה
ם
 
א
נ
ש
י
ם
 
ח
כ
מ
י
ם
 
ו
י
ד
ע
י
ם
 
ו
י
ת
ן
 
א
ת
ם
 
ר
א
ש
י
ם
 
ע
ל
י
ה
ם
 
ש
ר
י
 
א
ל
פ
י
ם
 
ו
ש
ר
י
 
מ
א
ו
ת
 
ש
ר
י
 
ח
מ
ש
י
ם
 
ו
ש
ר
י
 
ע
ש
ר
ו
ת
 
ו
ש
ט
ר
י
ם
 
ל
ש
ב
ט
י
ה
ם
 
ו
י
צ
ו
 
א
ת
 
ש
פ
ט
י
ה
ם
 
ל
א
מ
ר
 
ש
מ
ע
ו
 
ב
י
ן
 
א
ח
י
כ
ם
 
ו
ש
פ
ט
ת
ם
 
צ
ד
ק
 
ב
י
ן
 
א
י
ש
 
ו
ב
י
ן
 
א
ח
י
ו
 
ו
ב
י
ן
 
ג
ר
ו
 
ל
א
 
ת
כ
י
ר
ו
 
פ
נ
י
ם
 
ב
מ
ש
פ
ט
 
כ
ק
ט
ן
 
כ
ג
ד
ו
ל
 
ת
ש
מ
ע
ו
ן
 
ל
א
 
ת
ג
ו
ר
ו
 
מ
פ
נ
י
 
א
י
ש
 
כ
י
 
ה
מ
ש
פ
ט
 
ל
א
ל
ה
י
ם
 
ה
ו
א
 
ו
ה
ד
ב
ר
 
א
ש
ר
 
י
ק
ש
ה
 
מ
כ
ם
 
ת
ק
ר
י
ב
ו
ן
 
א
ל
י
 
ו
ש
מ
ע
ת
י
ו
 
ו
י
צ
ו
 
א
ת
ם
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
י
ע
ש
ו
ן
 
ו
י
ש
פ
ט
ו
 
א
ת
 
ה
ע
ם
 
ב
כ
ל
 
ע
ת
 
א
ת
 
ה
ד
ב
ר
 
ה
ג
ד
ו
ל
 
י
ב
י
א
ו
ן
 
א
ל
 
מ
ש
ה
 
ו
כ
ל
 
ה
ד
ב
ר
 
ה
ק
ט
ן
 
י
ש
פ
ט
ו
 
ה
ם
 
ו
י
ש
ל
ח
 
מ
ש
ה
 
א
ת
 
ח
ת
נ
ו
 
ו
י
ל
ך
 
ל
ו
 
א
ל
 
א
ר
צ
ו
 
ב
ח
ד
ש
 
ה
ש
ל
י
ש
י
 
ל
צ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
י
ו
ם
 
ה
ז
ה
 
ב
א
ו
 
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ס
ע
ו
 
מ
ר
פ
י
ד
י
ם
 
ו
י
ב
א
ו
 
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ח
נ
ו
 
ב
מ
ד
ב
ר
 
ו
י
ח
ן
 
ש
ם
 
י
ש
ר
א
ל
 
נ
ג
ד
 
ה
ה
ר
 
ו
מ
ש
ה
 
ע
ל
ה
 
א
ל
 
ה
א
ל
ה
י
ם
 
ו
י
ק
ר
א
 
א
ל
י
ו
 
י
ה
ו
ה
 
מ
ן
 
ה
ה
ר
 
ל
א
מ
ר
 
כ
ה
 
ת
א
מ
ר
 
ל
ב
י
ת
 
י
ע
ק
ב
 
ו
ת
ג
י
ד
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
ם
 
ר
א
י
ת
ם
 
א
ת
 
א
ש
ר
 
ע
ש
י
ת
י
 
ל
מ
צ
ר
י
ם
 
ו
א
ש
א
 
א
ת
כ
ם
 
ע
ל
 
כ
נ
פ
י
 
נ
ש
ר
י
ם
 
ו
א
ב
י
א
 
א
ת
כ
ם
 
א
ל
י
 
ו
ע
ת
ה
 
א
ם
 
ש
מ
ע
 
ת
ש
מ
ע
ו
 
ב
ק
ו
ל
י
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ב
ר
י
ת
י
 
ו
ה
י
י
ת
ם
 
ל
י
 
ס
ג
ל
ה
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
כ
י
 
ל
י
 
כ
ל
 
ה
א
ר
ץ
 
ו
א
ת
ם
 
ת
ה
י
ו
 
ל
י
 
מ
מ
ל
כ
ת
 
כ
ה
נ
י
ם
 
ו
ג
ו
י
 
ק
ד
ש
 
א
ל
ה
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ת
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ב
א
 
מ
ש
ה
 
ו
י
ק
ר
א
 
ל
ז
ק
נ
י
 
ה
ע
ם
 
ו
י
ש
ם
 
ל
פ
נ
י
ה
ם
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
צ
ו
ה
ו
 
י
ה
ו
ה
 
ו
י
ע
נ
ו
 
כ
ל
 
ה
ע
ם
 
י
ח
ד
ו
 
ו
י
א
מ
ר
ו
 
כ
ל
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
נ
ע
ש
ה
 
ו
י
ש
ב
 
מ
ש
ה
 
א
ת
 
ד
ב
ר
י
 
ה
ע
ם
 
א
ל
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
נ
ה
 
א
נ
כ
י
 
ב
א
 
א
ל
י
ך
 
ב
ע
ב
י
 
ה
ע
נ
ן
 
ב
ע
ב
ו
ר
 
י
ש
מ
ע
 
ה
ע
ם
 
ב
ד
ב
ר
י
 
ע
מ
ך
 
ו
ג
ם
 
ב
ך
 
י
א
מ
נ
ו
 
ל
ע
ו
ל
ם
 
ו
י
ג
ד
 
מ
ש
ה
 
א
ת
 
ד
ב
ר
י
 
ה
ע
ם
 
א
ל
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
ך
 
א
ל
 
ה
ע
ם
 
ו
ק
ד
ש
ת
ם
 
ה
י
ו
ם
 
ו
מ
ח
ר
 
ו
כ
ב
ס
ו
 
ש
מ
ל
ו
ת
ם
 
ו
ה
י
ו
 
נ
כ
ו
נ
י
ם
 
ל
י
ו
ם
 
ה
ש
ל
י
ש
י
 
כ
י
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
י
ר
ד
 
י
ה
ו
ה
 
ל
ע
י
נ
י
 
כ
ל
 
ה
ע
ם
 
א
ל
 
ה
ר
 
ס
י
נ
י
 
ו
ה
ג
ב
ל
ת
 
א
ת
 
ה
ה
ר
 
ס
ב
י
ב
 
ו
א
ל
 
ה
ע
ם
 
ת
א
מ
ר
 
ה
ש
מ
ר
ו
 
ל
כ
ם
 
ע
ל
ו
ת
 
ב
ה
ר
 
ו
נ
ג
ע
 
ב
ק
צ
ה
ו
 
כ
ל
 
ה
נ
ג
ע
 
ב
ה
ר
 
מ
ו
ת
 
י
ו
מ
ת
 
ל
א
 
ת
ג
ע
 
ב
ו
 
י
ד
 
כ
י
 
ס
ק
ל
 
י
ס
ק
ל
 
א
ו
 
י
ר
א
 
י
ר
א
ה
 
א
ם
 
ב
ה
מ
ה
 
א
ם
 
א
י
ש
 
ל
א
 
י
ח
י
ה
 
ב
מ
ו
ש
ך
 
ה
י
ו
ב
ל
 
ה
ם
 
י
ע
ל
ו
 
ב
ה
ר
 
ו
י
ר
ד
 
מ
ש
ה
 
מ
ן
 
ה
ה
ר
 
א
ל
 
ה
ע
ם
 
ו
י
ק
ד
ש
 
א
ת
 
ה
ע
ם
 
ו
י
כ
ב
ס
ו
 
ש
מ
ל
ו
ת
ם
 
ו
י
א
מ
ר
 
א
ל
 
ה
ע
ם
 
ה
י
ו
 
נ
כ
ו
נ
י
ם
 
ל
ש
ל
ש
ת
 
ה
י
מ
י
ם
 
א
ל
 
ת
ג
ש
ו
 
א
ל
 
א
ש
ה
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ב
ה
י
ו
ת
 
ה
ב
ק
ר
 
ו
י
ה
י
 
ק
ו
ל
ו
ת
 
ו
ב
ר
ק
י
ם
 
ו
ע
נ
ן
 
כ
ב
ד
 
ע
ל
 
ה
ה
ר
 
ו
ק
ו
ל
 
ה
ש
ו
פ
ר
 
ח
ז
ק
 
מ
א
ד
 
ו
י
ח
ר
ד
 
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
ב
מ
ח
נ
ה
 
ו
י
ו
צ
א
 
מ
ש
ה
 
א
ת
 
ה
ע
ם
 
ל
ק
ר
א
ת
 
ה
א
ל
ה
י
ם
 
מ
ן
 
ה
מ
ח
נ
ה
 
ו
י
ת
י
צ
ב
ו
 
ב
ת
ח
ת
י
ת
 
ה
ה
ר
 
ו
ה
ר
 
ס
י
נ
י
 
ע
ש
ן
 
כ
ל
ו
 
מ
פ
נ
י
 
א
ש
ר
 
י
ר
ד
 
י
ה
ו
ה
 
ע
ל
י
ו
 
ב
א
ש
 
ו
י
ע
ל
 
ע
ש
נ
ו
 
כ
ע
ש
ן
 
ה
כ
ב
ש
ן
 
ו
י
ח
ר
ד
 
כ
ל
 
ה
ה
ר
 
מ
א
ד
 
ו
י
ה
י
 
ק
ו
ל
 
ה
ש
ו
פ
ר
 
ה
ל
ך
 
ו
ח
ז
ק
 
מ
א
ד
 
מ
ש
ה
 
י
ד
ב
ר
 
ו
ה
א
ל
ה
י
ם
 
י
ע
נ
נ
ו
 
ב
ק
ו
ל
 
ו
י
ר
ד
 
י
ה
ו
ה
 
ע
ל
 
ה
ר
 
ס
י
נ
י
 
א
ל
 
ר
א
ש
 
ה
ה
ר
 
ו
י
ק
ר
א
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ל
 
ר
א
ש
 
ה
ה
ר
 
ו
י
ע
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ר
ד
 
ה
ע
ד
 
ב
ע
ם
 
פ
ן
 
י
ח
ר
ס
ו
 
א
ל
 
י
ה
ו
ה
 
ל
ר
א
ו
ת
 
ו
נ
פ
ל
 
מ
מ
נ
ו
 
ר
ב
 
ו
ג
ם
 
ה
כ
ה
נ
י
ם
 
ה
נ
ג
ש
י
ם
 
א
ל
 
י
ה
ו
ה
 
י
ת
ק
ד
ש
ו
 
פ
ן
 
י
פ
ר
ץ
 
ב
ם
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ל
א
 
י
ו
כ
ל
 
ה
ע
ם
 
ל
ע
ל
ו
ת
 
א
ל
 
ה
ר
 
ס
י
נ
י
 
כ
י
 
א
ת
ה
 
ה
ע
ד
ת
 
ב
נ
ו
 
ל
א
מ
ר
 
ה
ג
ב
ל
 
א
ת
 
ה
ה
ר
 
ו
ק
ד
ש
ת
ו
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
י
ה
ו
ה
 
ך
 
ר
ד
 
ו
ע
ל
י
ת
 
א
ת
ה
 
ו
א
ה
ר
ן
 
ע
מ
ך
 
ו
ה
כ
ה
נ
י
ם
 
ו
ה
ע
ם
 
א
ל
 
י
ח
ר
ס
ו
 
ל
ע
ל
ו
ת
 
א
ל
 
י
ה
ו
ה
 
פ
ן
 
י
פ
ר
ץ
 
ב
ם
 
ו
י
ר
ד
 
מ
ש
ה
 
מ
ן
 
ה
ה
ר
 
א
ל
 
ה
ע
ם
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ו
י
ד
ב
ר
 
א
ל
ה
י
ם
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ל
א
מ
ר
 
א
נ
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
ה
ו
צ
א
ת
י
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
ל
א
 
י
ה
י
ה
 
ל
ך
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ע
ל
 
פ
נ
י
 
ל
א
 
ת
ע
ש
ה
 
ל
ך
 
פ
ס
ל
 
ו
כ
ל
 
ת
מ
ו
נ
ה
 
א
ש
ר
 
ב
ש
מ
י
ם
 
מ
מ
ע
ל
 
ו
א
ש
ר
 
ב
א
ר
ץ
 
מ
ת
ח
ת
 
ו
א
ש
ר
 
ב
מ
י
ם
 
מ
ת
ח
ת
 
ל
א
ר
ץ
 
ל
א
 
ת
ש
ת
ח
ו
ה
 
ל
ה
ם
 
ו
ל
א
 
ת
ע
ב
ד
ם
 
כ
י
 
א
נ
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
ק
נ
א
 
פ
ק
ד
 
ע
ו
ן
 
א
ב
ו
ת
 
ע
ל
 
ב
נ
י
ם
 
ע
ל
 
ש
ל
י
ש
י
ם
 
ו
ע
ל
 
ר
ב
י
ע
י
ם
 
ל
ש
נ
א
י
 
ו
ע
ש
ה
 
ח
ס
ד
 
ל
א
ל
פ
י
ם
 
ל
א
ה
ב
י
 
ו
ל
ש
מ
ר
י
 
מ
צ
ו
ת
י
 
ל
א
 
ת
ש
א
 
א
ת
 
ש
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
ו
א
 
כ
י
 
ל
א
 
י
נ
ק
ה
 
י
ה
ו
ה
 
א
ת
 
א
ש
ר
 
י
ש
א
 
א
ת
 
ש
מ
ו
 
ל
ש
ו
א
 
ש
מ
ו
ר
 
א
ת
 
י
ו
ם
 
ה
ש
ב
ת
 
ל
ק
ד
ש
ה
ו
 
ש
ש
ת
 
י
מ
י
ם
 
ת
ע
ב
ד
 
ו
ע
ש
י
ת
 
כ
ל
 
מ
ל
א
כ
ת
ך
 
ו
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
ב
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ע
ש
ה
 
ב
ו
 
כ
ל
 
מ
ל
א
כ
ה
 
א
ת
ה
 
ו
ב
נ
ך
 
ו
ב
ת
ך
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
ב
ה
מ
ת
ך
 
ו
ג
ר
ך
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
כ
י
 
ש
ש
ת
 
י
מ
י
ם
 
ע
ש
ה
 
י
ה
ו
ה
 
א
ת
 
ה
ש
מ
י
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
א
ת
 
ה
י
ם
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ם
 
ו
י
נ
ח
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ע
ל
 
כ
ן
 
ב
ר
ך
 
י
ה
ו
ה
 
א
ת
 
י
ו
ם
 
ה
ש
ב
ת
 
ו
י
ק
ד
ש
ה
ו
 
כ
ב
ד
 
א
ת
 
א
ב
י
ך
 
ו
א
ת
 
א
מ
ך
 
ל
מ
ע
ן
 
י
א
ר
כ
ו
ן
 
י
מ
י
ך
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
א
 
ת
ר
צ
ח
 
ל
א
 
ת
נ
א
ף
 
ל
א
 
ת
ג
נ
ב
 
ל
א
 
ת
ע
נ
ה
 
ב
ר
ע
ך
 
ע
ד
 
ש
ק
ר
 
ל
א
 
ת
ח
מ
ד
 
ב
י
ת
 
ר
ע
ך
 
ו
ל
א
 
ת
ח
מ
ד
 
א
ש
ת
 
ר
ע
ך
 
ש
ד
ה
ו
 
ע
ב
ד
ו
 
ו
א
מ
ת
ו
 
ש
ו
ר
ו
 
ו
ח
מ
ו
ר
ו
 
ו
כ
ל
 
א
ש
ר
 
ל
ר
ע
ך
 
ו
ה
י
ה
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
ה
ק
מ
ת
 
ל
ך
 
א
ב
נ
י
ם
 
ג
ד
ל
ו
ת
 
ו
ש
ד
ת
 
א
ת
ם
 
ב
ש
י
ד
 
ו
כ
ת
ב
ת
 
ע
ל
 
ה
א
ב
נ
י
ם
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
ה
י
ה
 
ב
ע
ב
ר
כ
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ת
ק
י
מ
ו
 
א
ת
 
ה
א
ב
נ
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ב
ה
ר
ג
ר
י
ז
י
ם
 
ו
ב
נ
י
ת
 
ש
ם
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ז
ב
ח
 
א
ב
נ
י
ם
 
ל
א
 
ת
נ
י
ף
 
ע
ל
י
ה
ם
 
ב
ר
ז
ל
 
א
ב
נ
י
ם
 
ש
ל
מ
ו
ת
 
ת
ב
נ
ה
 
א
ת
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ע
ל
י
ת
 
ע
ל
י
ו
 
ע
ל
ו
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ז
ב
ח
ת
 
ש
ל
מ
י
ם
 
ו
א
כ
ל
ת
 
ש
ם
 
ו
ש
מ
ח
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ה
ר
 
ה
ה
ו
א
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
א
ח
ר
י
 
ד
ר
ך
 
מ
ב
ו
א
 
ה
ש
מ
ש
 
ב
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ה
י
ש
ב
 
ב
ע
ר
ב
ה
 
מ
ו
ל
 
ה
ג
ל
ג
ל
 
א
צ
ל
 
א
ל
ו
ן
 
מ
ו
ר
א
 
מ
ו
ל
 
ש
כ
ם
 
ו
כ
ל
 
ה
ע
ם
 
ש
מ
ע
 
א
ת
 
ה
ק
ו
ל
ו
ת
 
ו
א
ת
 
ק
ו
ל
 
ה
ש
ו
פ
ר
 
ו
ר
א
י
ם
 
א
ת
 
ה
ל
פ
י
ד
י
ם
 
ו
א
ת
 
ה
ה
ר
 
ע
ש
ן
 
ו
י
ר
א
ו
 
כ
ל
 
ה
ע
ם
 
ו
י
נ
ע
ו
 
ו
י
ע
מ
ד
ו
 
מ
ר
ח
ק
 
ו
י
א
מ
ר
ו
 
א
ל
 
מ
ש
ה
 
ה
ן
 
ה
ר
א
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
ת
 
כ
ב
ו
ד
ו
 
ו
א
ת
 
ג
ד
ל
ו
 
ו
א
ת
 
ק
ו
ל
ו
 
ש
מ
ע
נ
ו
 
מ
ת
ו
ך
 
ה
א
ש
 
ה
י
ו
ם
 
ה
ז
ה
 
ר
א
י
נ
ו
 
כ
י
 
י
ד
ב
ר
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ד
ם
 
ו
ח
י
 
ו
ע
ת
ה
 
ל
מ
ה
 
נ
מ
ו
ת
 
כ
י
 
ת
א
כ
ל
נ
ו
 
ה
א
ש
 
ה
ג
ד
ל
ה
 
ה
ז
א
ת
 
א
ם
 
י
ס
פ
י
ם
 
א
נ
ח
נ
ו
 
ל
ש
מ
ע
 
א
ת
 
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ע
ו
ד
 
ו
מ
ת
נ
ו
 
כ
י
 
מ
י
 
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
ש
מ
ע
 
ק
ו
ל
 
א
ל
ה
י
ם
 
ח
י
י
ם
 
מ
ד
ב
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
כ
מ
ו
נ
ו
 
ו
ח
י
 
ק
ר
ב
 
א
ת
ה
 
ו
ש
מ
ע
 
א
ת
 
כ
ל
 
א
ש
ר
 
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
א
ת
ה
 
ת
ד
ב
ר
 
א
ל
י
נ
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
ל
י
ך
 
ו
ש
מ
ע
נ
ו
 
ו
ע
ש
י
נ
ו
 
ו
א
ל
 
י
ד
ב
ר
 
ע
מ
נ
ו
 
ה
א
ל
ה
י
ם
 
פ
ן
 
נ
מ
ו
ת
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ם
 
א
ל
 
ת
י
ר
א
ו
 
כ
י
 
ל
ב
ע
ב
ו
ר
 
נ
ס
ו
ת
 
א
ת
כ
ם
 
ב
א
 
ה
א
ל
ה
י
ם
 
ו
ב
ע
ב
ו
ר
 
ת
ה
י
ה
 
י
ר
א
ת
ו
 
ע
ל
 
פ
נ
י
כ
ם
 
ל
ב
ל
ת
י
 
ת
ח
ט
א
ו
 
ו
י
ע
מ
ד
 
ה
ע
ם
 
מ
ר
ח
ק
 
ו
מ
ש
ה
 
נ
ג
ש
 
א
ל
 
ה
ע
ר
פ
ל
 
א
ש
ר
 
ש
ם
 
ה
א
ל
ה
י
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ש
מ
ע
ת
י
 
א
ת
 
ק
ו
ל
 
ד
ב
ר
י
 
ה
ע
ם
 
ה
ז
ה
 
א
ש
ר
 
ד
ב
ר
ו
 
א
ל
י
ך
 
ה
ט
י
ב
ו
 
כ
ל
 
א
ש
ר
 
ד
ב
ר
ו
 
מ
י
 
י
ת
ן
 
ו
ה
י
ה
 
ל
ב
ב
ם
 
ז
ה
 
ל
ה
ם
 
ל
י
ר
א
ה
 
א
ת
י
 
ו
ל
ש
מ
ר
 
א
ת
 
מ
צ
ו
ת
י
 
כ
ל
 
ה
י
מ
י
ם
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ה
ם
 
ו
ל
ב
נ
י
ה
ם
 
ל
ע
ו
ל
ם
 
נ
ב
י
א
 
א
ק
י
ם
 
ל
ה
ם
 
מ
ק
ר
ב
 
א
ח
י
ה
ם
 
כ
מ
ו
ך
 
ו
נ
ת
ת
י
 
ד
ב
ר
י
 
ב
פ
י
ו
 
ו
ד
ב
ר
 
א
ל
י
ה
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
צ
ו
נ
ו
 
ו
ה
י
ה
 
ה
א
י
ש
 
א
ש
ר
 
ל
א
 
י
ש
מ
ע
 
א
ל
 
ד
ב
ר
י
ו
 
א
ש
ר
 
י
ד
ב
ר
 
ב
ש
מ
י
 
א
נ
כ
י
 
א
ד
ר
ש
 
מ
ע
מ
ו
 
א
ך
 
ה
נ
ב
י
א
 
א
ש
ר
 
י
ז
י
ד
 
ל
ד
ב
ר
 
ד
ב
ר
 
ב
ש
מ
י
 
א
ת
 
א
ש
ר
 
ל
א
 
צ
ו
י
ת
י
ו
 
ל
ד
ב
ר
 
ו
א
ש
ר
 
י
ד
ב
ר
 
ב
ש
ם
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
מ
ת
 
ה
נ
ב
י
א
 
ה
ה
ו
א
 
ו
כ
י
 
ת
א
מ
ר
 
ב
ל
ב
ב
ך
 
א
י
ך
 
נ
ו
ד
ע
 
א
ת
 
ה
ד
ב
ר
 
א
ש
ר
 
ל
א
 
ד
ב
ר
ו
 
י
ה
ו
ה
 
א
ש
ר
 
י
ד
ב
ר
 
ה
נ
ב
י
א
 
ב
ש
ם
 
י
ה
ו
ה
 
ל
א
 
י
ה
י
ה
 
ה
ד
ב
ר
 
ו
ל
א
 
י
ב
ו
א
 
ה
ו
א
 
ה
ד
ב
ר
 
א
ש
ר
 
ל
א
 
ד
ב
ר
ו
 
י
ה
ו
ה
 
ב
ז
ד
ו
ן
 
ד
ב
ר
ו
 
ה
נ
ב
י
א
 
ל
א
 
ת
ג
ו
ר
 
מ
מ
נ
ו
 
ל
ך
 
א
מ
ר
 
ל
ה
ם
 
ש
ו
ב
ו
 
ל
כ
ם
 
ל
א
ה
ל
י
כ
ם
 
ו
א
ת
ה
 
פ
ה
 
ע
מ
ד
 
ע
מ
ד
י
 
ו
א
ד
ב
ר
ה
 
א
ל
י
ך
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
ת
ל
מ
ד
ם
 
ו
ע
ש
ו
 
ב
א
ר
ץ
 
א
ש
ר
 
א
נ
כ
י
 
נ
ת
ן
 
ל
ה
ם
 
ל
ר
ש
ת
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
ם
 
ר
א
י
ת
ם
 
כ
י
 
מ
ן
 
ה
ש
מ
י
ם
 
ד
ב
ר
ת
י
 
ע
מ
כ
ם
 
ל
א
 
ת
ע
ש
ו
 
א
ת
י
 
א
ל
ה
י
 
כ
ס
ף
 
ו
א
ל
ה
י
 
ז
ה
ב
 
ל
א
 
ת
ע
ש
ו
 
ל
כ
ם
 
מ
ז
ב
ח
 
א
ד
מ
ה
 
ת
ע
ש
ה
 
ל
י
 
ו
ז
ב
ח
ת
 
ע
ל
י
ו
 
א
ת
 
ע
ל
ת
י
ך
 
ו
א
ת
 
ש
ל
מ
י
ך
 
מ
צ
א
נ
ך
 
ו
מ
ב
ק
ר
ך
 
ו
ב
מ
ק
ו
ם
 
א
ש
ר
 
א
ז
כ
ר
ת
י
 
א
ת
 
ש
מ
י
 
ש
מ
ה
 
א
ב
ו
א
 
א
ל
י
ך
 
ו
ב
ר
כ
ת
י
ך
 
ו
א
ם
 
מ
ז
ב
ח
 
א
ב
נ
י
ם
 
ת
ע
ש
ה
 
ל
י
 
ל
א
 
ת
ב
נ
ה
 
א
ת
ה
ן
 
ג
ז
י
ת
 
כ
י
 
ח
ר
ב
ך
 
ה
נ
פ
ת
 
ע
ל
י
ו
 
ו
ת
ח
ל
ל
ה
ו
 
ו
ל
א
 
ת
ע
ל
ה
 
ב
מ
ע
ל
ו
ת
 
ע
ל
 
מ
ז
ב
ח
י
 
א
ש
ר
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
ך
 
א
ל
י
ו
 
א
ל
ה
 
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
ת
ש
י
ם
 
ל
פ
נ
י
ה
ם
 
כ
י
 
ת
ק
נ
ה
 
ע
ב
ד
 
ע
ב
ר
י
 
ש
ש
 
ש
נ
י
ם
 
י
ע
ב
ד
ך
 
ו
ב
ש
ב
ע
י
ת
 
י
צ
א
 
ל
ח
פ
ש
י
 
ח
נ
ם
 
א
ם
 
ב
ג
פ
י
ו
 
י
ב
ו
א
 
ב
ג
פ
י
ו
 
י
צ
א
 
א
ם
 
ב
ע
ל
 
א
ש
ה
 
ה
ו
א
 
ו
י
צ
א
ה
 
א
ש
ת
ו
 
ע
מ
ו
 
א
ם
 
א
ד
נ
י
ו
 
י
ת
ן
 
ל
ו
 
א
ש
ה
 
ו
י
ל
ד
ה
 
ל
ו
 
ב
נ
י
ם
 
א
ו
 
ב
נ
ו
ת
 
ה
א
ש
ה
 
ו
י
ל
י
ד
י
ה
 
ת
ה
י
ה
 
ל
א
ד
נ
י
ו
 
ו
ה
ו
א
 
י
צ
א
 
ב
ג
פ
י
ו
 
א
ם
 
א
מ
ר
 
י
א
מ
ר
 
ה
ע
ב
ד
 
א
ה
ב
ת
י
 
א
ת
 
א
ד
נ
י
 
א
ת
 
א
ש
ת
י
 
ו
א
ת
 
ב
נ
י
 
ל
א
 
א
צ
א
 
ח
פ
ש
י
 
ו
ה
ג
י
ש
ו
 
א
ד
נ
י
ו
 
א
ל
 
ה
א
ל
ה
י
ם
 
ו
ה
ג
י
ש
ו
 
א
ל
 
ה
ד
ל
ת
 
א
ו
 
א
ל
 
ה
מ
ז
ו
ז
ה
 
ו
ר
צ
ע
 
א
ד
נ
י
ו
 
א
ת
 
א
ז
נ
ו
 
ב
מ
ר
צ
ע
 
ו
ע
ב
ד
ו
 
ל
ע
ו
ל
ם
 
ו
כ
י
 
י
מ
כ
ר
 
א
י
ש
 
א
ת
 
ב
ת
ו
 
ל
א
מ
ה
 
ל
א
 
ת
צ
א
 
כ
צ
א
ת
 
ה
ע
ב
ד
י
ם
 
א
ם
 
ר
ע
ה
 
ה
י
א
 
ב
ע
י
נ
י
 
א
ד
נ
י
ה
 
א
ש
ר
 
ל
א
 
ה
ע
י
ד
ה
 
ו
ה
פ
ד
ה
 
ל
ע
ם
 
נ
כ
ר
י
 
ל
א
 
י
מ
ש
ל
 
ל
מ
כ
ר
ה
 
ב
ב
ג
ד
ו
 
ב
ה
 
ו
א
ם
 
ל
ב
נ
ו
 
י
ע
י
ד
נ
ה
 
כ
מ
ש
פ
ט
 
ה
ב
נ
ו
ת
 
י
ע
ש
ה
 
ל
ה
 
ו
א
ם
 
א
ח
ר
ת
 
י
ק
ח
 
ל
ו
 
ש
א
ר
ה
 
כ
ס
ו
ת
ה
 
ו
ע
נ
ת
ה
 
ל
א
 
י
ג
ר
ע
 
ו
א
ם
 
ש
ל
ש
 
א
ל
ה
 
ל
א
 
י
ע
ש
ה
 
ל
ה
 
ו
י
צ
א
ה
 
ח
נ
ם
 
א
י
ן
 
כ
ס
ף
 
מ
כ
ה
 
א
י
ש
 
ו
מ
ת
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
א
ש
ר
 
ל
א
 
צ
ד
ה
 
ו
ה
א
ל
ה
י
ם
 
א
נ
ה
 
ל
י
ד
ו
 
ו
ש
מ
ת
י
 
ל
ך
 
מ
ק
ו
ם
 
א
ש
ר
 
י
נ
ו
ס
 
ש
מ
ה
 
ו
כ
י
 
י
ז
י
ד
 
א
י
ש
 
ע
ל
 
ר
ע
ה
ו
 
ל
ה
ר
ג
ו
 
ב
ע
ר
מ
ה
 
מ
ע
ם
 
מ
ז
ב
ח
י
 
ת
ק
ח
נ
ו
 
ל
מ
ו
ת
 
ו
מ
כ
ה
 
א
ב
י
ו
 
ו
א
מ
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
ג
נ
ב
 
א
י
ש
 
ו
מ
כ
ר
ו
 
ו
נ
מ
צ
א
 
ב
י
ד
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
מ
ק
ל
ל
 
א
ב
י
ו
 
ו
א
מ
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
כ
י
 
י
ר
י
ב
ו
ן
 
א
נ
ש
י
ם
 
ו
ה
כ
ו
 
א
י
ש
 
א
ת
 
ר
ע
ה
ו
 
ו
ל
א
 
י
מ
ו
ת
 
ו
נ
פ
ל
 
ל
מ
ש
כ
ב
 
א
ם
 
י
ק
ו
ם
 
ו
ה
ת
ה
ל
ך
 
ב
ח
ו
ץ
 
ע
ל
 
מ
ש
ע
נ
ת
ו
 
ו
נ
ק
ה
 
ה
מ
כ
ה
 
ר
ק
 
ש
ב
ת
ו
 
י
ת
ן
 
ו
ר
פ
א
 
י
ר
פ
א
 
ו
כ
י
 
י
כ
ה
 
א
י
ש
 
א
ת
 
ע
ב
ד
ו
 
א
ו
 
א
ת
 
א
מ
ת
ו
 
ו
מ
ת
 
ת
ח
ת
 
י
ד
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
א
ך
 
א
ם
 
י
ו
ם
 
א
ו
 
י
ו
מ
י
ם
 
י
ע
מ
ד
 
ל
א
 
י
ו
מ
ת
 
כ
י
 
כ
ס
פ
ו
 
ה
ו
א
 
ו
כ
י
 
י
נ
צ
ו
 
א
נ
ש
י
ם
 
ו
נ
ג
פ
ו
 
א
ש
ה
 
ה
ר
ה
 
ו
י
צ
א
 
ו
ל
ד
ה
 
ו
ל
א
 
י
ה
י
ה
 
א
ס
ו
ן
 
ע
נ
ש
 
י
ע
נ
ש
 
כ
א
ש
ר
 
י
ש
י
ת
 
ע
ל
י
ו
 
ב
ע
ל
 
ה
א
ש
ה
 
ו
נ
ת
ן
 
ב
פ
ל
ל
י
ם
 
ו
א
ם
 
א
ס
ו
ן
 
י
ה
י
ה
 
ו
נ
ת
ת
ה
 
נ
פ
ש
 
ת
ח
ת
 
נ
פ
ש
 
ע
י
ן
 
ת
ח
ת
 
ע
י
ן
 
ש
ן
 
ת
ח
ת
 
ש
ן
 
י
ד
 
ת
ח
ת
 
י
ד
 
ר
ג
ל
 
ת
ח
ת
 
ר
ג
ל
 
מ
כ
ו
ה
 
ת
ח
ת
 
מ
כ
ו
ה
 
פ
צ
ע
 
ת
ח
ת
 
פ
צ
ע
 
ח
ב
ו
ר
ה
 
ת
ח
ת
 
ח
ב
ו
ר
ה
 
ו
כ
י
 
י
כ
ה
 
א
י
ש
 
א
ת
 
ע
י
ן
 
ע
ב
ד
ו
 
א
ו
 
א
ת
 
ע
י
ן
 
א
מ
ת
ו
 
ו
ש
ח
ת
ה
 
ל
ח
פ
ש
י
 
י
ש
ל
ח
נ
ו
 
ת
ח
ת
 
ע
י
נ
ו
 
ו
א
ם
 
ש
ן
 
ע
ב
ד
ו
 
א
ו
 
ש
ן
 
א
מ
ת
ו
 
י
פ
ל
 
ל
ח
פ
ש
י
 
י
ש
ל
ח
נ
ו
 
ת
ח
ת
 
ש
נ
ו
 
ו
כ
י
 
י
כ
ה
 
ש
ו
ר
 
ו
כ
ל
 
ב
ה
מ
ה
 
א
ת
 
א
י
ש
 
א
ו
 
א
ת
 
א
ש
ה
 
ו
מ
ת
 
ס
ק
ל
 
י
ס
ק
ל
 
ה
ב
ה
מ
ה
 
ו
ל
א
 
י
א
כ
ל
 
א
ת
 
ב
ש
ר
ו
 
ו
ב
ע
ל
 
ה
ב
ה
מ
ה
 
נ
ק
י
א
 
ו
א
ם
 
ב
ה
מ
ה
 
מ
כ
ה
 
ה
י
א
 
מ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ו
ה
ו
ע
ד
 
ב
ב
ע
ל
י
ו
 
ו
ל
א
 
י
ש
מ
ר
נ
ו
 
ו
ה
מ
י
ת
 
א
י
ש
 
א
ו
 
א
ש
ה
 
ה
ב
ה
מ
ה
 
ת
ס
ק
ל
 
ו
ג
ם
 
ב
ע
ל
י
ו
 
י
ו
מ
ת
 
א
ם
 
כ
ו
פ
ר
 
י
ו
ש
ת
 
ע
ל
י
ו
 
ו
נ
ת
ן
 
פ
ד
י
ו
ן
 
נ
פ
ש
ו
 
כ
כ
ל
 
א
ש
ר
 
י
ו
ש
ת
 
ע
ל
י
ו
 
א
ו
 
ב
ן
 
י
כ
ה
 
א
ו
 
ב
ת
 
כ
מ
ש
פ
ט
 
ה
ז
ה
 
י
ע
ש
ה
 
ל
ו
 
א
ם
 
ע
ב
ד
 
ת
כ
ה
 
ה
ב
ה
מ
ה
 
א
ו
 
א
מ
ה
 
כ
ס
ף
 
ש
ל
ש
י
ם
 
ש
ק
ל
י
ם
 
י
ת
ן
 
ל
א
ד
נ
י
ו
 
ו
ה
ב
ה
מ
ה
 
ת
ס
ק
ל
 
ו
כ
י
 
י
פ
ת
ח
 
א
י
ש
 
ב
ו
ר
 
א
ו
 
כ
י
 
י
כ
ר
ה
 
א
י
ש
 
ב
ו
ר
 
ו
ל
א
 
י
כ
ס
נ
ו
 
ו
נ
פ
ל
 
ש
ם
 
ש
ו
ר
 
א
ו
 
ח
מ
ו
ר
 
א
ו
 
כ
ל
 
ב
ה
מ
ה
 
ב
ע
ל
 
ה
ב
ו
ר
 
י
ש
ל
ם
 
כ
ס
ף
 
י
ש
י
ב
 
ל
ב
ע
ל
י
ו
 
ו
ה
מ
ת
 
י
ה
י
ה
 
ל
ו
 
ו
כ
י
 
י
ג
ף
 
ש
ו
ר
 
א
י
ש
 
א
ו
 
כ
ל
 
ב
ה
מ
ת
ו
 
א
ת
 
ש
ו
ר
 
ר
ע
ה
ו
 
א
ו
 
א
ת
 
כ
ל
 
ב
ה
מ
ת
ו
 
ו
מ
ת
 
ו
מ
כ
ר
ו
 
א
ת
 
ה
ח
י
 
ו
ח
צ
ו
 
א
ת
 
כ
ס
פ
ו
 
ו
ג
ם
 
א
ת
 
ה
מ
ת
 
י
ח
צ
ו
ן
 
א
ו
 
נ
ו
ד
ע
 
כ
י
 
ב
ה
מ
ה
 
מ
כ
ה
 
ה
י
א
 
מ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ו
ל
א
 
י
ש
מ
ר
נ
ו
 
ב
ע
ל
י
ו
 
ש
ל
ם
 
י
ש
ל
ם
 
ב
ה
מ
ה
 
ת
ח
ת
 
ב
ה
מ
ה
 
ו
ה
מ
ת
 
י
ה
י
ה
 
ל
ו
 
ו
כ
י
 
י
ג
נ
ב
 
א
י
ש
 
ש
ו
ר
 
א
ו
 
ש
ה
 
ו
ט
ב
ח
ו
 
א
ו
 
מ
כ
ר
ו
 
ח
מ
ש
ה
 
ב
ק
ר
 
י
ש
ל
ם
 
ת
ח
ת
 
ה
ש
ו
ר
 
ו
א
ר
ב
ע
 
צ
א
ן
 
ת
ח
ת
 
ה
ש
ה
 
א
ם
 
ב
מ
ח
ת
ר
ת
 
י
מ
צ
א
 
ה
ג
נ
ב
 
ו
ה
כ
ה
ו
 
ו
מ
ת
 
א
י
ן
 
ל
ו
 
ד
ם
 
א
ם
 
ז
ר
ח
ה
 
ה
ש
מ
ש
 
ע
ל
י
ו
 
ד
ם
 
ל
ו
 
ש
ל
ם
 
י
ש
ל
ם
 
א
ם
 
א
י
ן
 
ל
ו
 
ו
נ
מ
כ
ר
 
ב
ג
נ
ב
ת
ו
 
א
ם
 
ה
מ
צ
א
 
ת
מ
צ
א
 
ב
י
ד
ו
 
ה
ג
נ
ב
ה
 
מ
ש
ו
ר
 
ע
ד
 
ח
מ
ו
ר
 
ע
ד
 
ש
ה
 
ע
ד
 
כ
ל
 
ב
ה
מ
ה
 
ח
י
י
ם
 
א
ח
ד
 
ש
נ
י
ם
 
י
ש
ל
ם
 
ו
כ
י
 
י
ב
ע
י
ר
 
א
י
ש
 
ש
ד
ה
 
א
ו
 
כ
ר
ם
 
ו
ש
ל
ח
 
א
ת
 
ב
ע
י
ר
ו
 
ו
ב
ע
ר
 
ב
ש
ד
ה
 
א
ח
ר
 
ש
ל
ם
 
י
ש
ל
ם
 
מ
ש
ד
ה
ו
 
כ
ת
ב
ו
א
ת
ה
 
ו
א
ם
 
כ
ל
 
ה
ש
ד
ה
 
י
ב
ע
ה
 
מ
י
ט
ב
 
ש
ד
ה
ו
 
ו
מ
י
ט
ב
 
כ
ר
מ
ו
 
י
ש
ל
ם
 
כ
י
 
ת
צ
א
 
א
ש
 
ו
מ
צ
א
ה
 
ק
ו
צ
י
ם
 
ו
נ
א
כ
ל
 
ג
ד
י
ש
 
א
ו
 
ה
ק
מ
ה
 
א
ו
 
ש
ד
ה
 
ש
ל
ם
 
י
ש
ל
ם
 
ה
מ
ב
ע
י
ר
 
א
ת
 
ה
ב
ע
י
ר
ה
 
ו
כ
י
 
י
ת
ן
 
א
י
ש
 
א
ל
 
ר
ע
ה
ו
 
כ
ס
ף
 
א
ו
 
כ
ל
י
ם
 
ל
ש
מ
ר
 
ו
נ
ג
נ
ב
 
מ
ב
י
ת
 
ה
א
י
ש
 
א
ם
 
י
מ
צ
א
 
ה
ג
נ
ב
 
ו
ש
ל
ם
 
א
ח
ד
 
ש
נ
י
ם
 
ו
א
ם
 
ל
א
 
י
מ
צ
א
 
ה
ג
נ
ב
 
ו
נ
ק
ר
ב
 
ב
ע
ל
 
ה
ב
י
ת
 
א
ל
 
ה
א
ל
ה
י
ם
 
א
ם
 
ל
א
 
ש
ל
ח
 
י
ד
ו
 
ב
מ
ל
א
כ
ת
 
ר
ע
ה
ו
 
ע
ל
 
כ
ל
 
ד
ב
ר
 
פ
ש
ע
 
ע
ל
 
ש
ו
ר
 
ע
ל
 
ח
מ
ו
ר
 
ע
ל
 
ש
ה
 
ע
ל
 
ש
מ
ל
ה
 
ע
ל
 
כ
ל
 
ה
א
ב
ד
ה
 
א
ש
ר
 
י
א
מ
ר
 
כ
י
 
ה
ו
א
 
ז
ה
 
ע
ד
 
י
ה
ו
ה
 
י
ב
ו
א
 
ד
ב
ר
 
ש
נ
י
ה
ם
 
א
ש
ר
 
י
ר
ש
י
ע
נ
ו
 
ה
א
ל
ה
י
ם
 
י
ש
ל
ם
 
א
ח
ד
 
ש
נ
י
ם
 
ל
ר
ע
ה
ו
 
ו
כ
י
 
י
ת
ן
 
א
י
ש
 
א
ל
 
ר
ע
ה
ו
 
ח
מ
ו
ר
 
א
ו
 
ש
ו
ר
 
א
ו
 
ש
ה
 
א
ו
 
כ
ל
 
ב
ה
מ
ה
 
ל
ש
מ
ר
 
ו
מ
ת
 
א
ו
 
נ
ש
ב
ר
 
א
ו
 
נ
ש
ב
ה
 
א
י
ן
 
ר
א
ה
 
ש
ב
ו
ע
ת
 
י
ה
ו
ה
 
ת
ה
י
ה
 
ב
י
ן
 
ש
נ
י
ה
ם
 
א
ם
 
ל
א
 
ש
ל
ח
 
י
ד
ו
 
ב
מ
ל
א
כ
ת
 
ר
ע
ה
ו
 
ו
ל
ק
ח
 
ב
ע
ל
י
ו
 
ו
ל
א
 
י
ש
ל
ם
 
א
ם
 
ג
נ
ב
 
י
ג
נ
ב
 
מ
ע
מ
ו
 
ו
ש
ל
ם
 
ל
ב
ע
ל
י
ו
 
א
ם
 
ט
ר
ף
 
י
ט
ר
ף
 
י
ב
י
א
 
ע
ד
 
ה
ט
ר
פ
ה
 
ו
ל
א
 
י
ש
ל
ם
 
ו
כ
י
 
י
ש
א
ל
 
א
י
ש
 
מ
ע
ם
 
ר
ע
ה
ו
 
ו
נ
ש
ב
ר
 
א
ו
 
מ
ת
 
ב
ע
ל
י
ו
 
א
י
ן
 
ע
מ
ו
 
ש
ל
ם
 
י
ש
ל
ם
 
א
ם
 
ב
ע
ל
י
ו
 
ע
מ
ו
 
ל
א
 
י
ש
ל
ם
 
א
ם
 
ש
כ
י
ר
 
ה
ו
א
 
ו
ב
א
 
ב
ש
כ
ר
ו
 
ו
כ
י
 
י
פ
ת
ה
 
א
י
ש
 
ב
ת
ו
ל
ה
 
א
ש
ר
 
ל
א
 
א
ר
ש
ה
 
ו
ש
כ
ב
 
ע
מ
ה
 
מ
ה
ר
 
י
מ
ה
ר
נ
ה
 
ל
ו
 
ל
א
ש
ה
 
ו
א
ם
 
מ
א
ן
 
י
מ
א
ן
 
א
ב
י
ה
 
ל
ת
ת
ה
 
ל
ו
 
כ
ס
ף
 
י
ש
ק
ל
 
כ
מ
ה
ר
 
ה
ב
ת
ו
ל
ו
ת
 
מ
כ
ש
פ
ה
 
ל
א
 
ת
ח
י
ה
 
כ
ל
 
ש
כ
ב
 
ע
ם
 
ב
ה
מ
ה
 
מ
ו
ת
 
י
ו
מ
ת
 
ז
ב
ח
 
ל
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
י
ח
ר
ם
 
ו
ג
ר
 
ל
א
 
ת
ו
נ
ו
 
ו
ל
א
 
ת
ל
ח
צ
ו
 
כ
י
 
ג
ר
י
ם
 
ה
י
י
ת
ם
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
כ
ל
 
א
ל
מ
נ
ה
 
ו
י
ת
ו
ם
 
ל
א
 
ת
ע
נ
ו
 
כ
י
 
א
ם
 
ע
נ
ה
 
ת
ע
נ
ו
 
א
ת
ו
 
כ
י
 
א
ם
 
צ
ע
ק
 
י
צ
ע
ק
 
א
ל
י
 
ש
מ
ע
 
א
ש
מ
ע
 
צ
ע
ק
ת
ו
 
ו
ח
ר
ה
 
א
פ
י
 
ו
ה
ר
ג
ת
י
 
א
ת
כ
ם
 
ב
ח
ר
ב
 
ו
ה
י
ו
 
נ
ש
י
כ
ם
 
א
ל
מ
נ
ו
ת
 
ו
ב
נ
י
כ
ם
 
י
ת
ו
מ
י
ם
 
א
ם
 
כ
ס
ף
 
ת
ל
ו
ה
 
א
ת
 
ע
מ
י
 
א
ת
 
ע
נ
י
 
ע
מ
ך
 
ל
א
 
ת
ה
י
ה
 
ל
ו
 
כ
נ
ש
א
 
ל
א
 
ת
ש
י
מ
נ
ו
 
ע
ל
י
ו
 
נ
ש
ך
 
א
ם
 
ח
ב
ל
 
ת
ח
ב
ל
 
א
ת
 
ש
מ
ל
ת
 
ר
ע
ך
 
ע
ד
 
ב
א
 
ה
ש
מ
ש
 
ת
ש
י
ב
נ
ה
 
ל
ו
 
כ
י
 
ה
י
א
 
כ
ס
ו
ת
ו
 
ל
ב
ד
ה
 
ה
י
א
 
ש
מ
ל
ת
ו
 
ל
ע
ו
ר
ו
 
ב
מ
ה
 
י
ש
כ
ב
 
ו
ה
י
ה
 
כ
י
 
י
צ
ע
ק
 
א
ל
י
 
ו
ש
מ
ע
ת
י
 
כ
י
 
ח
נ
ו
ן
 
א
נ
כ
י
 
א
ל
ה
י
ם
 
ל
א
 
ת
ק
ל
ל
 
ו
נ
ש
י
א
 
ב
ע
מ
ך
 
ל
א
 
ת
א
ר
 
מ
ל
י
ת
ך
 
ו
ד
מ
ע
ך
 
ל
א
 
ת
א
ח
ר
 
ב
כ
ו
ר
 
ב
נ
י
ך
 
ת
ת
ן
 
ל
י
 
כ
ן
 
ת
ע
ש
ה
 
ל
ש
ו
ר
ך
 
ו
ל
צ
א
נ
ך
 
ש
ב
ע
ת
 
י
מ
י
ם
 
י
ה
י
ה
 
ע
ם
 
א
מ
ו
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ת
ת
נ
נ
ו
 
ל
י
 
ו
א
נ
ש
י
 
ק
ד
ש
 
ת
ה
י
ו
 
ל
י
 
ו
ב
ש
ר
 
ב
ש
ד
ה
 
ט
ר
פ
ה
 
ל
א
 
ת
א
כ
ל
ו
 
ה
ש
ל
י
ך
 
ת
ש
ל
י
כ
ו
 
א
ת
ו
 
ל
א
 
ת
ש
א
 
ש
מ
ע
 
ש
ו
א
 
א
ל
 
ת
ש
י
ת
 
י
ד
ך
 
ע
ם
 
ר
ש
ע
 
ל
ה
י
ו
ת
 
ע
ד
 
ח
מ
ס
 
ל
א
 
ת
ה
י
ה
 
א
ח
ר
י
 
ר
ב
י
ם
 
ל
ר
ע
ו
ת
 
ו
ל
א
 
ת
ע
נ
ה
 
ע
ל
 
ר
י
ב
 
ל
נ
ט
ו
ת
 
א
ח
ר
י
 
ר
ב
י
ם
 
ל
ה
ט
ו
ת
 
ו
ד
ל
 
ל
א
 
ת
ה
ד
ר
 
ב
ר
י
ב
ו
 
כ
י
 
ת
פ
ג
ע
 
ש
ו
ר
 
א
י
ב
ך
 
א
ו
 
ח
מ
ו
ר
ו
 
א
ו
 
כ
ל
 
ב
ה
מ
ת
ו
 
ת
ע
ה
 
ה
ש
ב
 
ת
ש
י
ב
נ
ו
 
ל
ו
 
כ
י
 
ת
ר
א
ה
 
ח
מ
ו
ר
 
ש
נ
א
ך
 
ר
ב
ץ
 
ת
ח
ת
 
מ
ש
א
ו
 
ו
ח
ד
ל
ת
 
מ
ע
ז
ב
 
ל
ו
 
ע
ז
ב
 
ת
ע
ז
ב
 
ע
מ
ו
 
ל
א
 
ת
ט
ה
 
מ
ש
פ
ט
 
א
ב
י
ו
נ
ך
 
ב
ר
י
ב
ו
 
מ
ד
ב
ר
 
ש
ק
ר
 
ת
ר
ח
ק
 
ו
נ
ק
י
א
 
ו
צ
ד
י
ק
 
א
ל
 
ת
ה
ר
ג
 
כ
י
 
ל
א
 
ה
צ
ד
י
ק
 
ר
ש
ע
 
ו
ש
ח
ד
 
א
ל
 
ת
ק
ח
 
כ
י
 
ה
ש
ח
ד
 
י
ע
ו
ר
 
ע
י
נ
י
 
פ
ק
ח
י
ם
 
ו
י
ס
ל
ף
 
ד
ב
ר
י
 
צ
ד
ק
י
ם
 
ו
ג
ר
 
ל
א
 
ת
ל
ח
צ
ו
 
ו
א
ת
ם
 
י
ד
ע
ת
ם
 
א
ת
 
נ
פ
ש
 
ה
ג
ר
 
כ
י
 
ג
ר
י
ם
 
ה
י
י
ת
ם
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ש
ש
 
ש
נ
י
ם
 
ת
ז
ר
ע
 
א
ת
 
א
ר
צ
ך
 
ו
א
ס
פ
ת
 
א
ת
 
ת
ב
ו
א
ת
ה
 
ו
ה
ש
ב
י
ע
י
ת
 
ת
ש
מ
ט
נ
ה
 
ו
נ
ט
ש
ת
ה
 
ו
א
כ
ל
ו
 
א
ב
י
ו
נ
י
 
ע
מ
ך
 
ו
י
ת
ר
ם
 
ת
א
כ
ל
 
ח
י
ת
 
ה
ש
ד
ה
 
כ
ן
 
ת
ע
ש
ה
 
ל
כ
ר
מ
ך
 
ו
ל
ז
י
ת
י
ך
 
ש
ש
ת
 
י
מ
י
ם
 
ת
ע
ש
ה
 
מ
ע
ש
י
ך
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ת
ש
ב
ת
 
ל
מ
ע
ן
 
י
נ
ו
ח
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
כ
מ
ו
ך
 
ו
כ
ל
 
ב
ה
מ
ת
ך
 
ו
ה
ג
ר
 
ו
כ
ל
 
א
ש
ר
 
א
מ
ר
ת
י
 
א
ל
י
כ
ם
 
ת
ש
מ
ר
ו
 
ו
ש
ם
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ל
א
 
ת
ז
כ
ר
 
ו
ל
א
 
י
ש
מ
ע
ו
 
ע
ל
 
פ
י
ך
 
ש
ל
ש
 
ר
ג
ל
י
ם
 
ת
ח
ג
 
ל
י
 
ב
ש
נ
ה
 
א
ת
 
ח
ג
 
ה
מ
צ
ו
ת
 
ת
ש
מ
ר
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
א
כ
ל
 
מ
צ
ו
ת
 
כ
א
ש
ר
 
צ
ו
י
ת
י
ך
 
ל
מ
ו
ע
ד
 
ח
ד
ש
 
ה
א
ב
י
ב
 
כ
י
 
ב
ו
 
י
צ
א
ת
 
מ
מ
צ
ר
י
ם
 
ו
ל
א
 
י
ר
א
ו
 
פ
נ
י
 
ר
ק
י
ם
 
ו
ח
ג
 
ה
ק
צ
י
ר
 
ב
כ
ו
ר
י
 
מ
ע
ש
י
ך
 
א
ש
ר
 
ת
ז
ר
ע
 
ב
ש
ד
ה
 
ו
ח
ג
 
ה
א
ס
ף
 
ב
צ
א
ת
 
ה
ש
נ
ה
 
ב
א
ס
פ
ך
 
א
ת
 
מ
ע
ש
י
ך
 
מ
ן
 
ה
ש
ד
ה
 
ש
ל
ש
 
פ
ע
מ
י
ם
 
ב
ש
נ
ה
 
י
ר
א
ה
 
כ
ל
 
ז
כ
ו
ר
ך
 
א
ת
 
פ
נ
י
 
ה
א
ר
ו
ן
 
י
ה
ו
ה
 
ל
א
 
ת
ז
ב
ח
 
ע
ל
 
ח
מ
ץ
 
ד
ם
 
ז
ב
ח
י
 
ו
ל
א
 
י
ל
י
ן
 
ח
ל
ב
 
ח
ג
י
 
ע
ד
 
ב
ק
ר
 
ר
א
ש
י
ת
 
ב
כ
ו
ר
י
 
א
ד
מ
ת
ך
 
ת
ב
י
א
 
ב
י
ת
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ב
ש
ל
 
ג
ד
י
 
ב
ח
ל
ב
 
א
מ
ו
 
כ
י
 
ע
ש
ה
 
ז
א
ת
 
כ
ז
ב
ח
 
ש
כ
ח
 
ו
ע
ב
ר
ה
 
ה
י
א
 
ל
א
ל
ה
י
 
י
ע
ק
ב
 
ה
נ
ה
 
א
נ
כ
י
 
ש
ל
ח
 
מ
ל
א
כ
י
 
ל
פ
נ
י
ך
 
ל
ש
מ
ר
ך
 
ב
ד
ר
ך
 
ו
ל
ה
ב
י
א
ך
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ה
כ
נ
ת
י
 
ה
ש
מ
ר
 
מ
פ
נ
י
ו
 
ו
ש
מ
ע
 
ב
ק
ו
ל
ו
 
א
ל
 
ת
מ
ר
י
 
ב
ו
 
כ
י
 
ל
א
 
י
ש
א
 
ל
פ
ש
ע
כ
ם
 
כ
י
 
ש
מ
י
 
ב
ק
ר
ב
ו
 
כ
י
 
א
ם
 
ש
מ
ע
 
ת
ש
מ
ע
ו
 
ב
ק
ו
ל
י
 
ו
ע
ש
י
ת
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
ד
ב
ר
 
ו
א
י
ב
ת
י
 
א
ת
 
א
י
ב
י
ך
 
ו
צ
ר
ת
י
 
א
ת
 
צ
ר
ר
י
ך
 
כ
י
 
י
ל
ך
 
מ
ל
א
כ
י
 
ל
פ
נ
י
ך
 
ו
ה
ב
י
א
ך
 
א
ל
 
ה
כ
נ
ע
נ
י
 
ו
ה
א
מ
ר
י
 
ו
ה
ח
ת
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
ו
ה
כ
ח
ד
ת
י
ו
 
ל
א
 
ת
ש
ת
ח
ו
י
 
ל
א
ל
ה
י
ה
ם
 
ו
ל
א
 
ת
ע
ב
ד
ם
 
ו
ל
א
 
ת
ע
ש
ה
 
כ
מ
ע
ש
י
ה
ם
 
כ
י
 
ה
ר
ס
 
ת
ה
ר
ס
ם
 
ו
ש
ב
ר
 
ת
ש
ב
ר
 
מ
צ
ב
ת
י
ה
ם
 
ו
ע
ב
ד
ת
ם
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ב
ר
ך
 
א
ת
 
ל
ח
מ
ך
 
ו
א
ת
 
מ
י
מ
י
ך
 
ו
ה
ס
ר
ת
י
 
מ
ח
ל
ה
 
מ
ק
ר
ב
ך
 
ו
ל
א
 
ת
ה
י
ה
 
מ
ש
כ
ל
ה
 
ו
ע
ק
ר
ה
 
ב
א
ר
צ
ך
 
א
ת
 
מ
ס
פ
ר
 
י
מ
י
ך
 
א
מ
ל
א
 
א
ת
 
א
י
מ
ת
י
 
א
ש
ל
ח
 
ל
פ
נ
י
ך
 
ו
ה
מ
ת
י
 
א
ת
 
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
ת
ב
ו
א
 
ב
ה
ן
 
ו
נ
ת
ת
י
 
א
ת
 
כ
ל
 
א
י
ב
י
ך
 
א
ל
י
ך
 
ע
ר
ף
 
ו
ש
ל
ח
ת
י
 
א
ת
 
ה
צ
ר
ע
ה
 
ל
פ
נ
י
ך
 
ו
ג
ר
ש
ה
 
א
ת
 
ה
כ
נ
ע
נ
י
 
ו
א
ת
 
ה
א
מ
ר
י
 
ו
א
ת
 
ה
ח
ת
י
 
ו
א
ת
 
ה
ג
ר
ג
ש
י
 
ו
א
ת
 
ה
פ
ר
ז
י
 
ו
א
ת
 
ה
ח
ו
י
 
ו
א
ת
 
ה
י
ב
ו
ס
י
 
מ
ל
פ
נ
י
ך
 
ל
א
 
א
ג
ר
ש
נ
ו
 
מ
פ
נ
י
ך
 
ב
ש
נ
ה
 
א
ח
ת
 
פ
ן
 
ת
ה
י
ה
 
ה
א
ר
ץ
 
ש
מ
מ
ה
 
ו
ר
ב
ה
 
ע
ל
י
ך
 
ח
י
ת
 
ה
ש
ד
ה
 
מ
ע
ט
 
מ
ע
ט
 
א
ג
ר
ש
נ
ו
 
מ
פ
נ
י
ך
 
ע
ד
 
א
ש
ר
 
ת
פ
ר
ה
 
ו
נ
ח
ל
ת
 
א
ת
 
ה
א
ר
ץ
 
ו
ש
ת
י
 
א
ת
 
ג
ב
ו
ל
ך
 
מ
י
ם
 
ס
ו
ף
 
ו
ע
ד
 
י
ם
 
פ
ל
ש
ת
י
ם
 
ו
מ
מ
ד
ב
ר
 
ע
ד
 
ה
נ
ה
ר
 
כ
י
 
א
ת
ן
 
ב
י
ד
כ
ם
 
א
ת
 
י
ש
ב
י
 
ה
א
ר
ץ
 
ו
ג
ר
ש
ת
י
ם
 
מ
פ
נ
י
ך
 
ל
א
 
ת
כ
ר
ת
 
ל
ה
ם
 
ו
ל
א
ל
ה
י
ה
ם
 
ב
ר
י
ת
 
ל
א
 
י
ש
ב
ו
 
ב
א
ר
צ
ך
 
פ
ן
 
י
ח
ט
י
א
ו
 
א
ת
ך
 
ל
י
 
כ
י
 
ת
ע
ב
ד
 
א
ת
 
א
ל
ה
י
ה
ם
 
כ
י
 
י
ה
י
ו
 
ל
ך
 
ל
מ
ו
ק
ש
 
ו
א
ל
 
מ
ש
ה
 
א
מ
ר
 
ע
ל
ה
 
א
ל
 
י
ה
ו
ה
 
א
ת
ה
 
ו
א
ה
ר
ן
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
א
ל
ע
ז
ר
 
ו
א
י
ת
מ
ר
 
ו
ש
ב
ע
י
ם
 
מ
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
ה
ש
ת
ח
ו
י
ת
ם
 
מ
ר
ח
ק
 
ו
נ
ג
ש
 
מ
ש
ה
 
ל
ב
ד
ו
 
א
ל
 
י
ה
ו
ה
 
ו
ה
ם
 
ל
א
 
י
ג
ש
ו
 
ו
ה
ע
ם
 
ל
א
 
י
ע
ל
ה
 
ע
מ
ו
 
ו
י
ב
א
 
מ
ש
ה
 
ו
י
ס
פ
ר
 
ל
ע
ם
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
י
ה
ו
ה
 
ו
א
ת
 
כ
ל
 
ה
מ
ש
פ
ט
י
ם
 
ו
י
ע
נ
ו
 
כ
ל
 
ה
ע
ם
 
ק
ו
ל
 
א
ח
ד
 
ו
י
א
מ
ר
ו
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
נ
ע
ש
ה
 
ו
י
כ
ת
ב
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
י
ה
ו
ה
 
ו
י
ש
כ
ם
 
ב
ב
ק
ר
 
ו
י
ב
ן
 
מ
ז
ב
ח
 
ת
ח
ת
 
ה
ה
ר
 
ו
ש
ת
י
ם
 
ע
ש
ר
ה
 
א
ב
נ
י
ם
 
ל
ש
נ
י
ם
 
ע
ש
ר
 
ש
ב
ט
י
 
י
ש
ר
א
ל
 
ו
י
ש
ל
ח
 
א
ת
 
נ
ע
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ע
ל
ו
 
ע
ל
ו
ת
 
ו
י
ז
ב
ח
ו
 
ז
ב
ח
י
ם
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
פ
ר
י
ם
 
ב
נ
י
 
ב
ק
ר
 
ו
י
ק
ח
 
מ
ש
ה
 
ח
צ
י
 
ה
ד
ם
 
ו
י
ש
ם
 
ב
א
ג
נ
ו
ת
 
ו
ח
צ
י
 
ה
ד
ם
 
ז
ר
ק
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
י
ק
ח
 
ס
פ
ר
 
ה
ב
ר
י
ת
 
ו
י
ק
ר
א
 
ב
א
ז
נ
י
 
ה
ע
ם
 
ו
י
א
מ
ר
ו
 
כ
ל
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
נ
ש
מ
ע
 
ו
נ
ע
ש
ה
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ה
ד
ם
 
ו
י
ז
ר
ק
ה
ו
 
ע
ל
 
ה
ע
ם
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ד
ם
 
ה
ב
ר
י
ת
 
א
ש
ר
 
כ
ר
ת
 
י
ה
ו
ה
 
ע
מ
כ
ם
 
ע
ל
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
י
ע
ל
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
א
ל
ע
ז
ר
 
ו
א
י
ת
מ
ר
 
ו
ש
ב
ע
י
ם
 
מ
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
י
ר
א
ו
 
א
ת
 
א
ל
ה
י
 
י
ש
ר
א
ל
 
ו
ת
ח
ת
 
ר
ג
ל
י
ו
 
כ
מ
ע
ש
ה
 
ל
ב
נ
ת
 
ה
ס
פ
י
ר
 
ו
כ
ע
צ
ם
 
ה
ש
מ
י
ם
 
ל
ט
ה
ו
ר
 
ו
א
ל
 
א
צ
ל
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
ש
ל
ח
 
י
ד
ו
 
ו
י
א
ח
ז
ו
 
א
ת
 
ה
א
ל
ה
י
ם
 
ו
י
א
כ
ל
ו
 
ו
י
ש
ת
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ע
ל
ה
 
א
ל
י
 
ה
ה
ר
ה
 
ו
ה
ו
י
 
ש
ם
 
ו
א
ת
ן
 
ל
ך
 
א
ת
 
ל
ו
ח
ת
 
ה
א
ב
נ
י
ם
 
ה
ת
ו
ר
ה
 
ו
ה
מ
צ
ו
ה
 
א
ש
ר
 
כ
ת
ב
ת
י
 
ל
ה
ו
ר
ת
ם
 
ו
י
ק
ם
 
מ
ש
ה
 
ו
י
ה
ו
ש
ע
 
מ
ש
ר
ת
ו
 
ו
י
ע
ל
 
מ
ש
ה
 
א
ל
 
ה
ר
 
ה
א
ל
ה
י
ם
 
ו
א
ל
 
ה
ז
ק
נ
י
ם
 
א
מ
ר
 
ש
ב
ו
 
ל
נ
ו
 
ב
ז
ה
 
ע
ד
 
א
ש
ר
 
נ
ש
ו
ב
 
א
ל
י
כ
ם
 
ה
נ
ה
 
א
ה
ר
ן
 
ו
ח
ו
ר
 
ע
מ
כ
ם
 
מ
י
 
ב
ע
ל
 
ד
ב
ר
י
ם
 
י
ג
ש
 
א
ל
י
ה
ם
 
ו
י
ע
ל
 
מ
ש
ה
 
א
ל
 
ה
ה
ר
 
ו
י
כ
ס
 
ה
ע
נ
ן
 
א
ת
 
ה
ה
ר
 
ו
י
ש
כ
ן
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
ע
ל
 
ה
ר
 
ס
י
נ
י
 
ו
י
כ
ס
ה
ו
 
ה
ע
נ
ן
 
ש
ש
ת
 
י
מ
י
ם
 
ו
י
ק
ר
א
 
א
ל
 
מ
ש
ה
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
מ
ת
ו
ך
 
ה
ע
נ
ן
 
ו
מ
ר
א
ה
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
כ
א
ש
 
א
כ
ל
ת
 
ב
ר
א
ש
 
ה
ה
ר
 
ל
ע
י
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ב
א
 
מ
ש
ה
 
ב
ת
ו
ך
 
ה
ע
נ
ן
 
ו
י
ע
ל
 
א
ל
 
ה
ה
ר
 
ו
י
ה
י
 
מ
ש
ה
 
ב
ה
ר
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ח
ו
 
ל
י
 
ת
ר
ו
מ
ה
 
מ
א
ת
 
כ
ל
 
א
י
ש
 
א
ש
ר
 
י
ד
ב
נ
ו
 
ל
ב
ו
 
ת
ק
ח
ו
 
א
ת
 
ת
ר
ו
מ
ת
י
 
ו
ז
א
ת
 
ה
ת
ר
ו
מ
ה
 
א
ש
ר
 
ת
ק
ח
ו
 
מ
א
ת
ם
 
ז
ה
ב
 
כ
ס
ף
 
ו
נ
ח
ש
ת
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
ו
ע
ז
י
ם
 
ו
ע
ו
ר
ו
ת
 
א
י
ל
י
ם
 
מ
א
ד
מ
י
ם
 
ו
ע
ו
ר
ו
ת
 
ת
ח
ש
י
ם
 
ו
ע
צ
י
 
ש
ט
י
ם
 
ו
ש
מ
ן
 
ל
מ
א
ו
ר
 
ו
ב
ש
מ
י
ם
 
ל
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
ל
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ו
א
ב
נ
י
 
ש
ה
ם
 
ו
א
ב
נ
י
 
מ
ל
א
י
ם
 
ל
א
פ
ו
ד
 
ו
ל
ח
ש
ן
 
ו
ע
ש
ו
 
ל
י
 
מ
ק
ד
ש
 
ו
ש
כ
נ
ת
י
 
ב
ת
ו
כ
כ
ם
 
כ
כ
ל
 
א
ש
ר
 
א
נ
י
 
מ
ר
א
ה
 
א
ת
ך
 
ב
ה
ר
 
א
ת
 
ת
ב
נ
י
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
ת
ב
נ
י
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
כ
ן
 
ת
ע
ש
ה
 
ו
ע
ש
י
ת
 
א
ר
ו
ן
 
ע
צ
י
 
ש
ט
י
ם
 
א
מ
ת
י
ם
 
ו
ח
צ
י
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ר
ח
ב
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ק
ו
מ
ת
ו
 
ו
צ
פ
י
ת
 
א
ת
ו
 
ז
ה
ב
 
ט
ה
ו
ר
 
מ
ב
י
ת
 
ו
מ
ח
ו
ץ
 
ת
צ
פ
נ
ו
 
ו
ע
ש
י
ת
 
ל
ו
 
ז
ר
 
ז
ה
ב
 
ס
ב
י
ב
 
ו
י
צ
ק
ת
 
ל
ו
 
א
ר
ב
ע
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
נ
ת
ת
ה
 
ע
ל
 
א
ר
ב
ע
 
פ
ע
מ
ת
י
ו
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
 
ה
א
ח
ד
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
 
ה
ש
נ
י
 
ו
ע
ש
י
ת
 
ב
ד
י
 
ע
צ
י
 
ש
ט
י
ם
 
ו
צ
פ
י
ת
 
א
ת
ם
 
ז
ה
ב
 
ו
ה
ב
א
ת
 
א
ת
 
ה
ב
ד
י
ם
 
ב
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
ת
 
ה
א
ר
ו
ן
 
ל
ש
א
ת
 
א
ת
 
ה
א
ר
ו
ן
 
ב
ה
ם
 
ב
ט
ב
ע
ו
ת
 
ה
א
ר
ו
ן
 
י
ה
י
ו
 
ה
ב
ד
י
ם
 
ל
א
 
י
ס
ו
ר
ו
 
מ
מ
נ
ו
 
ו
נ
ת
ת
ה
 
א
ל
 
ה
א
ר
ו
ן
 
א
ת
 
ה
ע
ד
ו
ת
 
א
ש
ר
 
א
ת
ן
 
א
ל
י
ך
 
ו
ע
ש
י
ת
 
כ
פ
ר
ת
 
ז
ה
ב
 
ט
ה
ו
ר
 
א
מ
ת
י
ם
 
ו
ח
צ
י
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ר
ח
ב
ו
 
ו
ע
ש
י
ת
 
ש
נ
י
 
כ
ר
ו
ב
י
ם
 
ז
ה
ב
 
מ
ק
ש
ה
 
ת
ע
ש
ה
 
א
ת
ם
 
מ
ש
נ
י
 
ק
צ
ו
ת
 
ה
כ
פ
ר
ת
 
י
ע
ש
ו
 
כ
ר
ו
ב
 
א
ח
ד
 
מ
ק
צ
ה
 
מ
ז
ה
 
ו
כ
ר
ו
ב
 
א
ח
ד
 
מ
ק
צ
ה
 
מ
ז
ה
 
מ
ן
 
ה
כ
פ
ר
ת
 
ת
ע
ש
ה
 
א
ת
 
ה
כ
ר
ו
ב
י
ם
 
ע
ל
 
ש
נ
י
 
ק
צ
ת
י
ו
 
ו
ה
י
ו
 
ה
כ
ר
ו
ב
י
ם
 
פ
ר
ש
י
 
כ
נ
פ
י
ם
 
ל
מ
ע
ל
ה
 
ס
כ
כ
י
ם
 
ב
כ
נ
פ
י
ה
ם
 
ע
ל
 
ה
כ
פ
ר
ת
 
ו
פ
נ
י
ה
ם
 
א
ח
ד
 
א
ל
 
א
ח
ד
 
א
ל
 
ה
כ
פ
ר
ת
 
י
ה
י
ו
 
פ
נ
י
 
ה
כ
ר
ו
ב
י
ם
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
כ
פ
ר
ת
 
ע
ל
 
ה
א
ר
ו
ן
 
מ
ל
מ
ע
ל
ה
 
ו
א
ל
 
ה
א
ר
ו
ן
 
ת
ת
ן
 
א
ת
 
ה
ע
ד
ו
ת
 
ו
נ
ו
ע
ד
ת
י
 
ל
ך
 
ש
ם
 
ו
ד
ב
ר
ת
י
 
א
ת
ך
 
מ
ע
ל
 
ה
כ
פ
ר
ת
 
מ
ב
י
ן
 
ש
נ
י
 
ה
כ
ר
ו
ב
י
ם
 
א
ש
ר
 
ע
ל
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
צ
ו
ה
 
א
ת
ך
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ע
ש
י
ת
 
ש
ל
ח
ן
 
ע
צ
י
 
ש
ט
י
ם
 
א
מ
ת
י
ם
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ר
ח
ב
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ק
ו
מ
ת
ו
 
ו
צ
פ
י
ת
 
א
ת
ו
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
ע
ש
י
ת
 
ל
ו
 
ז
ר
 
ז
ה
ב
 
ס
ב
י
ב
 
ו
ע
ש
י
ת
 
ל
ו
 
מ
ס
ג
ר
ת
 
ט
פ
ח
 
ס
ב
י
ב
 
ו
ע
ש
י
ת
 
ז
ר
 
ז
ה
ב
 
ל
מ
ס
ג
ר
ת
ו
 
ס
ב
י
ב
 
ו
ע
ש
י
ת
 
ל
ו
 
א
ר
ב
ע
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
ט
ב
ע
ו
ת
 
ע
ל
 
א
ר
ב
ע
 
ה
פ
א
ו
ת
 
א
ש
ר
 
ל
א
ר
ב
ע
 
ר
ג
ל
י
ו
 
ל
ע
מ
ת
 
ה
מ
ס
ג
ר
ת
 
ת
ה
י
נ
ה
 
ה
ט
ב
ע
ו
ת
 
ב
ת
י
ם
 
ל
ב
ד
י
ם
 
ל
ש
א
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
ע
ש
י
ת
 
א
ת
 
ה
ב
ד
י
ם
 
ע
צ
י
 
ש
ט
י
ם
 
ו
צ
פ
י
ת
 
א
ת
ם
 
ז
ה
ב
 
ו
נ
ש
א
ו
 
ב
ה
ם
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
ע
ש
י
ת
 
א
ת
 
ק
ע
ר
ת
י
ו
 
ו
כ
פ
ת
י
ו
 
ו
מ
נ
ק
י
ת
י
ו
 
ו
ק
ש
ת
י
ו
 
א
ש
ר
 
י
ס
כ
ו
 
ב
ה
ם
 
ז
ה
ב
 
ט
ה
ו
ר
 
ת
ע
ש
ה
 
א
ת
ם
 
ו
נ
ת
ת
ה
 
ע
ל
 
ה
ש
ל
ח
ן
 
ל
ח
ם
 
פ
נ
י
ם
 
ל
פ
נ
י
 
ת
מ
י
ד
 
ו
ע
ש
י
ת
 
מ
נ
ו
ר
ת
 
ז
ה
ב
 
ט
ה
ו
ר
 
מ
ק
ש
ה
 
ת
ע
ש
ה
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
י
ר
כ
י
ה
 
ק
נ
י
ה
 
ג
ב
י
ע
י
ה
 
כ
פ
ת
ר
י
ה
 
ו
פ
ר
ח
י
ה
 
מ
מ
נ
ה
 
י
ה
י
ו
 
ו
ש
ש
ה
 
ק
נ
י
ם
 
י
ו
צ
א
י
ם
 
מ
צ
ד
י
ה
 
ש
ל
ש
ה
 
ק
נ
י
 
מ
נ
ו
ר
ה
 
מ
צ
ד
ה
 
ה
א
ח
ד
 
ו
ש
ל
ש
ה
 
ק
נ
י
 
מ
נ
ו
ר
ה
 
מ
צ
ד
ה
 
ה
ש
נ
י
 
ש
ל
ש
ה
 
ג
ב
ע
י
ם
 
מ
ש
ק
ד
י
ם
 
ב
ק
נ
ה
 
א
ח
ד
 
כ
פ
ת
ר
 
ו
פ
ר
ח
 
ו
ש
ל
ש
ה
 
ג
ב
ע
י
ם
 
מ
ש
ק
ד
י
ם
 
ב
ק
נ
ה
 
א
ח
ד
 
כ
פ
ת
ר
 
ו
פ
ר
ח
 
כ
ן
 
ת
ע
ש
ה
 
ל
ש
ש
ת
 
ה
ק
נ
י
ם
 
ה
י
צ
א
י
ם
 
מ
ן
 
ה
מ
נ
ו
ר
ה
 
ו
ב
מ
נ
ו
ר
ה
 
א
ר
ב
ע
ה
 
ג
ב
ע
י
ם
 
מ
ש
ק
ד
י
ם
 
כ
פ
ת
ר
י
ה
 
ו
פ
ר
ח
י
ה
 
ו
כ
פ
ת
ר
 
ת
ח
ת
 
ש
נ
י
 
ה
ק
נ
י
ם
 
מ
מ
נ
ה
 
ו
כ
פ
ת
ר
 
ת
ח
ת
 
ש
נ
י
 
ה
ק
נ
י
ם
 
מ
מ
נ
ה
 
ו
כ
פ
ת
ר
 
ת
ח
ת
 
ש
נ
י
 
ה
ק
נ
י
ם
 
מ
מ
נ
ה
 
ל
ש
ש
ת
 
ה
ק
נ
י
ם
 
ה
י
ו
צ
א
י
ם
 
מ
ן
 
ה
מ
נ
ו
ר
ה
 
כ
פ
ת
ר
י
ה
ם
 
ו
ק
נ
ו
ת
ם
 
מ
מ
נ
ה
 
י
ה
י
ו
 
כ
ל
ה
 
מ
ק
ש
ה
 
א
ח
ד
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
ע
ש
י
ת
 
א
ת
 
נ
ר
ת
י
ה
 
ש
ב
ע
ה
 
ו
ה
ע
ל
י
ת
 
א
ת
 
נ
ר
ת
י
ה
 
ו
ה
א
י
ר
ו
 
א
ל
 
ע
ב
ר
 
פ
נ
י
ה
 
ו
מ
ל
ק
ח
י
ה
 
ו
מ
ח
ת
י
ת
י
ה
 
ז
ה
ב
 
ט
ה
ו
ר
 
כ
כ
ר
 
ז
ה
ב
 
ט
ה
ו
ר
 
ת
ע
ש
ה
 
א
ת
ה
 
ו
א
ת
 
כ
ל
 
ה
כ
ל
י
ם
 
ה
א
ל
ה
 
ו
ר
א
ה
 
ו
ע
ש
ה
 
ב
ת
ב
נ
י
ת
ם
 
א
ש
ר
 
א
ת
ה
 
מ
ר
א
ה
 
ב
ה
ר
 
ו
א
ת
 
ה
מ
ש
כ
ן
 
ת
ע
ש
ה
 
ע
ש
ר
 
י
ר
י
ע
ו
ת
 
ש
ש
 
מ
ש
ז
ר
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
כ
ר
ו
ב
י
ם
 
מ
ע
ש
ה
 
ח
ש
ב
 
ת
ע
ש
ה
 
א
ת
ם
 
א
ר
ך
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ש
מ
נ
ה
 
ו
ע
ש
ר
י
ם
 
ב
א
מ
ה
 
ו
ר
ח
ב
 
א
ר
ב
ע
 
ב
א
מ
ה
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
מ
ד
ה
 
א
ח
ת
 
ל
כ
ל
 
ה
י
ר
י
ע
ו
ת
 
ו
ח
מ
ש
 
ה
י
ר
י
ע
ו
ת
 
ת
ה
י
נ
ה
 
ח
ב
ר
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ו
ח
מ
ש
 
ה
י
ר
י
ע
ו
ת
 
ת
ה
י
נ
ה
 
ח
ב
ר
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ו
ע
ש
י
ת
 
ל
ל
א
ו
ת
 
ת
כ
ל
ת
 
ע
ל
 
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ב
ק
צ
ה
 
ב
מ
ח
ב
ר
ת
 
ו
כ
ן
 
ת
ע
ש
ה
 
ב
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
ק
צ
ו
נ
ה
 
ב
מ
ח
ב
ר
ת
 
ה
ש
נ
י
ת
 
ח
מ
ש
י
ם
 
ל
ל
א
ו
ת
 
ת
ע
ש
ה
 
ב
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ו
ח
מ
ש
י
ם
 
ל
ל
א
ו
ת
 
ת
ע
ש
ה
 
ב
ק
צ
ה
 
ה
י
ר
י
ע
ה
 
א
ש
ר
 
ב
מ
ח
ב
ר
ת
 
ה
ש
נ
י
ת
 
מ
ק
ב
ל
ו
ת
 
ה
ל
ל
א
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ו
ע
ש
י
ת
 
ח
מ
ש
י
ם
 
ק
ר
ס
י
 
ז
ה
ב
 
ו
ח
ב
ר
ת
 
א
ת
 
ה
י
ר
י
ע
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ב
ק
ר
ס
י
ם
 
ו
ה
י
ה
 
ה
מ
ש
כ
ן
 
א
ח
ד
 
ו
ע
ש
י
ת
 
י
ר
י
ע
ו
ת
 
ע
ז
י
ם
 
ל
א
ה
ל
 
ע
ל
 
ה
מ
ש
כ
ן
 
ע
ש
ת
ה
 
ע
ש
ר
ה
 
י
ר
י
ע
ו
ת
 
ת
ע
ש
ה
 
א
ת
ם
 
א
ר
ך
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ש
ל
ש
י
ם
 
ב
א
מ
ה
 
ו
א
ר
ב
ע
 
א
מ
ו
ת
 
ר
ח
ב
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
מ
ד
ה
 
א
ח
ת
 
ל
ע
ש
ת
ה
 
ע
ש
ר
ה
 
ה
י
ר
י
ע
ו
ת
 
ו
ח
ב
ר
ת
 
א
ת
 
ח
מ
ש
 
ה
י
ר
י
ע
ו
ת
 
ל
ב
ד
 
ו
א
ת
 
ש
ש
 
ה
י
ר
י
ע
ו
ת
 
ל
ב
ד
 
ו
כ
פ
ל
ת
 
א
ת
 
ה
י
ר
י
ע
ה
 
ה
ש
ש
י
ת
 
א
ל
 
מ
ו
ל
 
פ
נ
י
 
ה
א
ה
ל
 
ו
ע
ש
י
ת
 
ל
ל
א
ו
ת
 
ח
מ
ש
י
ם
 
ע
ל
 
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ה
ק
צ
ו
נ
ה
 
ב
מ
ח
ב
ר
ת
 
ו
ח
מ
ש
י
ם
 
ל
ל
א
ו
ת
 
ת
ע
ש
ה
 
ע
ל
 
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
ח
ב
ר
ת
 
ה
ש
נ
י
ת
 
ו
ע
ש
י
ת
 
ק
ר
ס
י
 
נ
ח
ש
ת
 
ח
מ
ש
י
ם
 
ו
ה
ב
א
ת
 
א
ת
 
ה
ק
ר
ס
י
ם
 
ב
ל
ל
א
ו
ת
 
ו
ח
ב
ר
ת
 
א
ת
 
ה
א
ה
ל
 
ו
ה
י
ה
 
א
ח
ד
 
ו
ס
ר
ח
 
ה
ע
ד
ף
 
ב
י
ר
י
ע
ו
ת
 
ה
א
ה
ל
 
ח
צ
י
 
ה
י
ר
י
ע
ה
 
ה
ע
ד
פ
ת
 
ת
ס
ר
ח
 
א
ל
 
א
ח
ר
י
 
ה
מ
ש
כ
ן
 
ו
ה
א
מ
ה
 
מ
ז
ה
 
ו
ה
א
מ
ה
 
מ
ז
ה
 
ב
ע
ד
ף
 
ב
א
ר
ך
 
י
ר
י
ע
ו
ת
 
ה
א
ה
ל
 
י
ה
י
ה
 
ס
ר
ו
ח
 
א
ל
 
צ
ד
י
 
ה
מ
ש
כ
ן
 
מ
ז
ה
 
ו
מ
ז
ה
 
ל
כ
ס
ו
ת
ו
 
ו
ע
ש
י
ת
 
מ
כ
ס
ה
 
ל
א
ה
ל
 
ע
ו
ר
ו
ת
 
א
י
ל
י
ם
 
מ
א
ד
מ
י
ם
 
ו
מ
כ
ס
ה
 
ע
ו
ר
ו
ת
 
ת
ח
ש
י
ם
 
מ
ל
מ
ע
ל
ה
 
ו
ע
ש
י
ת
 
א
ת
 
ה
ק
ר
ש
י
ם
 
ל
מ
ש
כ
ן
 
ע
צ
י
 
ש
ט
י
ם
 
ע
מ
ד
י
ם
 
ע
ש
ר
 
א
מ
ו
ת
 
א
ר
ך
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
א
מ
ה
 
ו
ח
צ
י
 
ה
א
מ
ה
 
ר
ח
ב
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ש
ת
י
 
י
ד
ו
ת
 
ל
ק
ר
ש
 
ה
א
ח
ד
 
מ
ש
ל
ב
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
כ
ן
 
ת
ע
ש
ה
 
ל
כ
ל
 
ק
ר
ש
י
 
ה
מ
ש
כ
ן
 
ו
ע
ש
י
ת
 
א
ת
 
ה
ק
ר
ש
י
ם
 
ל
מ
ש
כ
ן
 
ע
ש
ר
י
ם
 
ק
ר
ש
י
ם
 
ל
פ
א
ת
 
נ
ג
ב
ה
 
ת
י
מ
נ
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ד
נ
י
 
כ
ס
ף
 
ת
ע
ש
ה
 
ת
ח
ת
 
ע
ש
ר
י
ם
 
ה
ק
ר
ש
י
ם
 
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ל
ש
ת
י
 
י
ת
ד
ת
י
ו
 
ו
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ל
ש
ת
י
 
י
ת
ד
ת
י
ו
 
ו
ל
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ה
ש
נ
י
ת
 
ל
פ
א
ת
 
צ
פ
ו
נ
ה
 
ת
ע
ש
ה
 
ע
ש
ר
י
ם
 
ק
ר
ש
י
ם
 
ו
א
ר
ב
ע
י
ם
 
א
ד
נ
י
ה
ם
 
כ
ס
ף
 
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ו
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ו
ל
י
ר
כ
ת
י
 
ה
מ
ש
כ
ן
 
י
מ
ה
 
ת
ע
ש
ה
 
ש
ש
ה
 
ק
ר
ש
י
ם
 
ו
ש
נ
י
 
ק
ר
ש
י
ם
 
ת
ע
ש
ה
 
ל
מ
ק
צ
ע
ו
ת
 
ה
מ
ש
כ
ן
 
ב
י
ר
כ
ת
י
ם
 
ו
ה
י
ו
 
ת
א
מ
י
ם
 
מ
ל
מ
ט
ה
 
י
ח
ד
ו
 
י
ה
י
ו
 
ת
א
מ
י
ם
 
א
ל
 
ר
א
ש
ו
 
א
ל
 
ה
ט
ב
ע
ת
 
ה
א
ח
ת
 
כ
ן
 
י
ה
י
ה
 
ל
ש
נ
י
ה
ם
 
ל
ש
נ
י
 
ה
מ
ק
צ
ע
ו
ת
 
י
ה
י
ו
 
ו
ה
י
ו
 
ש
מ
נ
ה
 
ק
ר
ש
י
ם
 
ו
א
ד
נ
י
ה
ם
 
כ
ס
ף
 
ש
ש
ה
 
ע
ש
ר
 
א
ד
נ
י
ם
 
ש
נ
י
 
א
ד
נ
י
ם
 
ש
נ
י
 
א
ד
נ
י
ם
 
ל
ק
ר
ש
 
ה
א
ח
ד
 
ו
ע
ש
י
ת
 
ב
ר
י
ח
י
 
ע
צ
י
 
ש
ט
י
ם
 
ח
מ
ש
ה
 
ל
ק
ר
ש
י
 
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ה
א
ח
ד
 
ו
ח
מ
ש
ה
 
ב
ר
י
ח
י
ם
 
ל
ק
ר
ש
י
 
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ה
ש
נ
י
ת
 
ו
ח
מ
ש
ה
 
ב
ר
י
ח
י
ם
 
ל
ק
ר
ש
י
 
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ל
י
ר
כ
ת
י
ם
 
י
מ
ה
 
ו
ה
ב
ר
י
ח
 
ה
ת
י
כ
ו
ן
 
ב
ת
ו
ך
 
ה
ק
ר
ש
י
ם
 
מ
ב
ר
י
ח
 
מ
ן
 
ה
ק
צ
ה
 
א
ל
 
ה
ק
צ
ה
 
ו
א
ת
 
ה
ק
ר
ש
י
ם
 
ת
צ
פ
ה
 
ז
ה
ב
 
ו
א
ת
 
ט
ב
ע
ת
י
ה
ם
 
ת
ע
ש
ה
 
ז
ה
ב
 
ב
ת
י
ם
 
ל
ב
ר
י
ח
י
ם
 
ו
צ
פ
י
ת
 
א
ת
 
ה
ב
ר
י
ח
י
ם
 
ז
ה
ב
 
ו
ה
ק
מ
ת
 
א
ת
 
ה
מ
ש
כ
ן
 
כ
מ
ש
פ
ט
ו
 
א
ש
ר
 
ה
ר
א
ת
 
ב
ה
ר
 
ו
ע
ש
י
ת
 
פ
ר
כ
ת
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
מ
ע
ש
ה
 
ח
ש
ב
 
י
ע
ש
ו
 
א
ת
ה
 
כ
ר
ו
ב
י
ם
 
ו
נ
ת
ת
ה
 
א
ת
ה
 
ע
ל
 
א
ר
ב
ע
ה
 
ע
מ
ו
ד
י
 
ש
ט
י
ם
 
מ
צ
פ
י
ם
 
ז
ה
ב
 
ו
ו
י
ה
ם
 
ז
ה
ב
 
ע
ל
 
א
ר
ב
ע
 
א
ד
נ
י
 
כ
ס
ף
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
פ
ר
כ
ת
 
ת
ח
ת
 
ה
ק
ר
ס
י
ם
 
ו
ה
ב
א
ת
 
ש
ם
 
מ
ב
י
ת
 
ל
פ
ר
כ
ת
 
א
ת
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
ו
ה
ב
ד
י
ל
ה
 
ה
פ
ר
כ
ת
 
ל
כ
ם
 
ב
י
ן
 
ה
ק
ד
ש
 
ו
ב
י
ן
 
ק
ד
ש
 
ה
ק
ד
ש
י
ם
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
כ
פ
ר
ת
 
ע
ל
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
ב
ק
ד
ש
 
ה
ק
ד
ש
י
ם
 
ו
ש
מ
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
מ
ח
ו
ץ
 
ל
פ
ר
כ
ת
 
ו
א
ת
 
ה
מ
נ
ו
ר
ה
 
נ
כ
ח
 
ה
ש
ל
ח
ן
 
ע
ל
 
י
ר
ך
 
ה
מ
ש
כ
ן
 
ת
י
מ
נ
ה
 
ו
א
ת
 
ה
ש
ל
ח
ן
 
ת
ת
ן
 
ע
ל
 
צ
ל
ע
 
צ
פ
ו
נ
ה
 
ו
ע
ש
י
ת
 
מ
ז
ב
ח
 
מ
ק
ט
י
ר
 
ק
ט
ר
ת
 
ע
צ
י
 
ש
ט
י
ם
 
ת
ע
ש
ה
 
א
ת
ו
 
א
מ
ה
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ר
ח
ב
ו
 
ר
ב
ו
ע
 
י
ה
י
ה
 
ו
א
מ
ת
י
ם
 
ק
ו
מ
ת
ו
 
מ
מ
נ
ו
 
ק
ר
נ
ת
י
ו
 
ו
צ
פ
י
ת
 
א
ת
ו
 
ז
ה
ב
 
ט
ה
ו
ר
 
א
ת
 
ג
ג
ו
 
ו
א
ת
 
ק
י
ר
ת
י
ו
 
ס
ב
י
ב
 
ו
א
ת
 
ק
ר
נ
ת
י
ו
 
ו
ע
ש
י
ת
 
ל
ו
 
ז
ר
 
ז
ה
ב
 
ס
ב
י
ב
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ת
ע
ש
ה
 
ל
ו
 
מ
ת
ח
ת
 
ל
ז
ר
ו
 
ע
ל
 
ש
ת
י
 
צ
ל
ע
ת
י
ו
 
ת
ע
ש
ה
 
ע
ל
 
ש
נ
י
 
צ
ד
י
ו
 
ו
ה
י
ו
 
ל
ב
ת
י
ם
 
ל
ב
ד
י
ם
 
ל
ש
א
ת
 
א
ת
ו
 
ב
ה
ם
 
ו
ע
ש
י
ת
 
א
ת
 
ה
ב
ד
י
ם
 
ע
צ
י
 
ש
ט
י
ם
 
ו
צ
פ
י
ת
 
א
ת
ם
 
ז
ה
ב
 
ו
נ
ת
ת
ה
 
א
ת
ו
 
ל
פ
נ
י
 
ה
פ
ר
כ
ת
 
א
ש
ר
 
ע
ל
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
א
ש
ר
 
א
ו
ע
ד
 
ל
ך
 
ש
מ
ה
 
ו
ה
ק
ט
י
ר
 
ע
ל
י
ו
 
א
ה
ר
ן
 
ק
ט
ר
ת
 
ס
מ
י
ם
 
ב
ב
ק
ר
 
ב
ב
ק
ר
 
ב
ה
ט
י
ב
ו
 
א
ת
 
ה
נ
ר
ו
ת
 
י
ק
ט
י
ר
נ
ו
 
ו
ב
ה
ע
ל
ו
ת
 
א
ה
ר
ן
 
א
ת
 
ה
נ
ר
ו
ת
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
י
ק
ט
י
ר
נ
ה
 
ק
ט
ר
ת
 
ת
מ
י
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
ד
ר
ת
י
כ
ם
 
ל
א
 
ת
ע
ל
ו
 
ע
ל
י
ו
 
ק
ט
ר
ת
 
ז
ר
ה
 
ו
ע
ל
ה
 
ו
מ
נ
ח
ה
 
ו
נ
ס
ך
 
ל
א
 
ת
ס
כ
ו
 
ע
ל
י
ו
 
ו
כ
פ
ר
 
א
ה
ר
ן
 
ע
ל
 
ק
ר
נ
ת
י
ו
 
א
ח
ת
 
ב
ש
נ
ה
 
מ
ד
ם
 
ח
ט
א
ת
 
ה
כ
פ
ו
ר
י
ם
 
א
ח
ת
 
ב
ש
נ
ה
 
י
כ
פ
ר
 
ע
ל
י
ו
 
ל
ד
ר
ת
י
כ
ם
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ו
ע
ש
י
ת
 
מ
ס
ך
 
ל
פ
ת
ח
 
ה
א
ה
ל
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
מ
ע
ש
ה
 
ר
ק
ם
 
ו
ע
ש
י
ת
 
ל
מ
ס
ך
 
ח
מ
ש
ה
 
ע
מ
ו
ד
י
 
ש
ט
י
ם
 
ו
צ
פ
י
ת
 
א
ת
ם
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
ו
י
ה
ם
 
ז
ה
ב
 
ו
י
צ
ק
ת
 
ל
ה
ם
 
ח
מ
ש
ה
 
א
ד
נ
י
 
נ
ח
ש
ת
 
ו
ע
ש
י
ת
 
מ
ז
ב
ח
 
ע
צ
י
 
ש
ט
י
ם
 
ח
מ
ש
 
א
מ
ו
ת
 
א
ר
ך
 
ו
ח
מ
ש
 
א
מ
ו
ת
 
ר
ח
ב
 
ר
ב
ו
ע
 
י
ה
י
ה
 
ה
מ
ז
ב
ח
 
ו
ש
ל
ש
 
א
מ
ו
ת
 
ק
ו
מ
ת
ו
 
ו
ע
ש
י
ת
 
ק
ר
נ
ת
י
ו
 
ע
ל
 
א
ר
ב
ע
 
פ
נ
ת
י
ו
 
מ
מ
נ
ו
 
ת
ה
י
נ
ה
 
ק
ר
נ
ת
י
ו
 
ו
צ
פ
י
ת
 
א
ת
ו
 
נ
ח
ש
ת
 
ו
ע
ש
י
ת
 
ס
י
ר
ת
י
ו
 
ל
ד
ש
נ
ו
 
ו
י
ע
י
ו
 
ו
מ
ז
ר
ק
ת
י
ו
 
ו
מ
ז
ל
ג
ת
י
ו
 
ו
מ
ח
ת
י
ת
י
ו
 
ל
כ
ל
 
כ
ל
י
ו
 
ת
ע
ש
ה
 
נ
ח
ש
ת
 
ו
ע
ש
י
ת
 
ל
ו
 
מ
כ
ב
ר
 
מ
ע
ש
ה
 
ר
ש
ת
 
נ
ח
ש
ת
 
ו
ע
ש
י
ת
 
ע
ל
 
ה
ר
ש
ת
 
א
ר
ב
ע
 
ט
ב
ע
ו
ת
 
נ
ח
ש
ת
 
ע
ל
 
א
ר
ב
ע
 
ק
צ
ת
י
ו
 
ו
נ
ת
ת
ה
 
א
ת
ו
 
ת
ח
ת
 
כ
ר
כ
ב
 
ה
מ
ז
ב
ח
 
מ
ל
מ
ט
ה
 
ו
ה
י
ת
ה
 
ה
ר
ש
ת
 
ע
ד
 
ח
צ
י
 
ה
מ
ז
ב
ח
 
ו
ע
ש
י
ת
 
ב
ד
י
ם
 
ל
מ
ז
ב
ח
 
ב
ד
י
 
ע
צ
י
 
ש
ט
י
ם
 
ו
צ
פ
י
ת
 
א
ת
ם
 
נ
ח
ש
ת
 
ו
ה
ב
א
ת
 
א
ת
 
ה
ב
ד
י
ם
 
ב
ט
ב
ע
ו
ת
 
ו
ה
י
ו
 
ה
ב
ד
י
ם
 
ע
ל
 
ש
ת
י
 
צ
ל
ע
ו
ת
 
ה
מ
ז
ב
ח
 
ב
ש
א
ת
 
א
ת
ו
 
נ
ב
ו
ב
 
ל
ו
ח
ו
ת
 
ת
ע
ש
ה
 
א
ת
ו
 
כ
א
ש
ר
 
ה
ר
א
ה
 
א
ת
ך
 
ב
ה
ר
 
ו
כ
ן
 
י
ע
ש
ו
 
ו
ע
ש
י
ת
 
א
ת
 
ח
צ
ר
 
ה
מ
ש
כ
ן
 
ל
פ
א
ת
 
נ
ג
ב
ה
 
ת
י
מ
נ
ה
 
ק
ל
ע
י
ם
 
ל
ח
צ
ר
 
ש
ש
 
מ
ש
ז
ר
 
מ
א
ה
 
ב
א
מ
ה
 
א
ר
ך
 
ל
פ
א
ה
 
ה
א
ח
ת
 
ו
ע
מ
ו
ד
י
ו
 
ע
ש
ר
י
ם
 
ו
א
ד
נ
י
ה
ם
 
ע
ש
ר
י
ם
 
נ
ח
ש
ת
 
ו
ו
י
ה
ם
 
ו
ח
ש
ק
י
ה
ם
 
כ
ס
ף
 
ו
כ
ן
 
ל
פ
א
ת
 
צ
פ
ו
נ
ה
 
ב
א
ר
ך
 
ק
ל
ע
י
ם
 
מ
א
ה
 
ב
א
מ
ה
 
ע
מ
ו
ד
י
ה
ם
 
ע
ש
ר
י
ם
 
ו
א
ד
נ
י
ה
ם
 
ע
ש
ר
י
ם
 
נ
ח
ש
ת
 
ו
ו
י
ה
ם
 
ו
ח
ש
ק
י
ה
ם
 
כ
ס
ף
 
ו
ר
ח
ב
 
ה
ח
צ
ר
 
ל
פ
א
ת
 
י
מ
ה
 
ק
ל
ע
י
ם
 
ח
מ
ש
י
ם
 
א
מ
ה
 
ע
מ
ו
ד
י
ה
ם
 
ע
ש
ר
ה
 
ו
א
ד
נ
י
ה
ם
 
ע
ש
ר
ה
 
נ
ח
ש
ת
 
ו
ר
ח
ב
 
ה
ח
צ
ר
 
ל
פ
א
ת
 
ק
ד
מ
ה
 
מ
ז
ר
ח
ה
 
ח
מ
ש
י
ם
 
א
מ
ה
 
ח
מ
ש
 
ע
ש
ר
ה
 
א
מ
ה
 
ק
ל
ע
י
ם
 
ל
כ
ת
ף
 
ע
מ
ו
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
א
ד
נ
י
ה
ם
 
ש
ל
ש
ה
 
נ
ח
ש
ת
 
ו
ל
פ
א
ת
 
ה
ש
נ
י
ת
 
ח
מ
ש
 
ע
ש
ר
ה
 
א
מ
ה
 
ק
ל
ע
י
ם
 
ע
מ
ו
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
א
ד
נ
י
ה
ם
 
ש
ל
ש
ה
 
נ
ח
ש
ת
 
ו
ל
ש
ע
ר
 
ה
ח
צ
ר
 
מ
ס
ך
 
ע
ש
ר
י
ם
 
א
מ
ה
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
מ
ע
ש
ה
 
ר
ק
ם
 
ו
ע
מ
ו
ד
י
ה
ם
 
א
ר
ב
ע
ה
 
ו
א
ד
נ
י
ה
ם
 
א
ר
ב
ע
ה
 
נ
ח
ש
ת
 
כ
ל
 
ע
מ
ו
ד
י
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
מ
ח
ש
ק
י
ם
 
כ
ס
ף
 
ו
ו
י
ה
ם
 
כ
ס
ף
 
ו
א
ד
נ
י
ה
ם
 
נ
ח
ש
ת
 
א
ר
ך
 
ה
ח
צ
ר
 
מ
א
ה
 
ב
א
מ
ה
 
ו
ר
ח
ב
 
ח
מ
ש
י
ם
 
ב
א
מ
ה
 
ו
ק
ו
מ
ה
 
ח
מ
ש
 
א
מ
ו
ת
 
ש
ש
 
מ
ש
ז
ר
 
ו
א
ד
נ
י
ה
ם
 
נ
ח
ש
ת
 
ו
ע
ש
י
ת
 
א
ת
 
כ
ל
 
כ
ל
י
 
ה
מ
ש
כ
ן
 
ב
כ
ל
 
ע
ב
ד
ת
ו
 
ו
ב
כ
ל
 
י
ת
ד
ת
י
ו
 
ו
כ
ל
 
י
ת
ד
ו
ת
 
ה
ח
צ
ר
 
נ
ח
ש
ת
 
ו
ע
ש
י
ת
 
ב
ג
ד
י
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ל
ש
ר
ת
 
ב
ה
ם
 
ב
ק
ד
ש
 
ו
א
ת
ה
 
ת
צ
ו
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ח
ו
 
א
ל
י
ך
 
ש
מ
ן
 
ז
י
ת
 
ז
ך
 
כ
ת
י
ת
 
ל
מ
א
ו
ר
 
ל
ע
ל
ו
ת
 
נ
ר
 
ת
מ
י
ד
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
מ
ח
ו
ץ
 
ל
פ
ר
כ
ת
 
א
ש
ר
 
ע
ל
 
ה
ע
ד
ו
ת
 
י
ע
ר
י
ך
 
א
ת
ו
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
מ
ע
ר
ב
 
ע
ד
 
ב
ק
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
ה
 
ה
ק
ר
י
ב
 
א
ל
י
ך
 
א
ת
 
א
ה
ר
ן
 
א
ח
י
ך
 
ו
א
ת
 
ב
נ
י
ו
 
א
ת
ו
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
כ
ה
ן
 
ל
י
 
א
ה
ר
ן
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
א
ל
ע
ז
ר
 
ו
א
י
ת
מ
ר
 
ב
נ
י
 
א
ה
ר
ן
 
ו
ע
ש
י
ת
 
ב
ג
ד
י
 
ק
ד
ש
 
ל
א
ה
ר
ן
 
א
ח
י
ך
 
ל
כ
ב
ו
ד
 
ו
ל
ת
פ
א
ר
ת
 
ו
א
ת
ה
 
ת
ד
ב
ר
 
א
ל
 
כ
ל
 
ח
כ
ם
 
ל
ב
 
א
ש
ר
 
מ
ל
א
ת
י
ו
 
ר
ו
ח
 
ח
כ
מ
ה
 
ו
ע
ש
ו
 
א
ת
 
ב
ג
ד
י
 
א
ה
ר
ן
 
ל
ק
ד
ש
ו
 
ל
כ
ה
ן
 
ל
י
 
ו
א
ל
ה
 
ה
ב
ג
ד
י
ם
 
א
ש
ר
 
י
ע
ש
ו
ן
 
ח
ש
ן
 
ו
א
פ
ו
ד
 
ו
מ
ע
י
ל
 
כ
י
ת
נ
ת
 
ת
ש
ב
ץ
 
מ
צ
נ
פ
ת
 
ו
א
ב
נ
י
ט
 
ו
ע
ש
ו
 
ב
ג
ד
י
 
ק
ד
ש
 
ל
א
ה
ר
ן
 
א
ח
י
ך
 
ו
ל
ב
נ
י
ו
 
ל
כ
ה
ן
 
ל
י
 
ו
ה
ם
 
י
ק
ח
ו
 
א
ת
 
ה
ז
ה
ב
 
ו
א
ת
 
ה
ת
כ
ל
ת
 
ו
א
ת
 
ה
א
ר
ג
מ
ן
 
ו
א
ת
 
ה
ת
ו
ל
ע
ת
 
ה
ש
נ
י
 
ו
א
ת
 
ה
ש
ש
 
ו
ע
ש
ו
 
א
ת
 
ה
א
פ
ו
ד
 
ז
ה
ב
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
מ
ע
ש
ה
 
ח
ש
ב
 
ש
ת
י
 
כ
ת
פ
ו
ת
 
ח
ב
ר
ו
ת
 
י
ה
י
ה
 
ל
ו
 
ע
ל
 
ש
נ
י
 
ק
צ
ת
י
ו
 
י
ח
ב
ר
 
ו
ח
ש
ב
 
א
פ
ד
ת
ו
 
א
ש
ר
 
ע
ל
י
ו
 
כ
מ
ע
ש
ה
ו
 
מ
מ
נ
ו
 
י
ה
י
ה
 
ז
ה
ב
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ו
ל
ק
ח
ת
 
א
ת
 
ש
ת
י
 
א
ב
נ
י
 
ה
ש
ה
ם
 
ו
פ
ת
ח
ת
 
ע
ל
י
ה
ן
 
א
ת
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ש
ש
ה
 
מ
ש
מ
ו
ת
ם
 
ע
ל
 
ה
א
ב
ן
 
ה
א
ח
ת
 
ו
א
ת
 
ש
מ
ו
ת
 
ה
ש
ש
ה
 
ה
נ
ו
ת
ר
י
ם
 
ע
ל
 
ה
א
ב
ן
 
ה
ש
נ
י
ת
 
כ
ת
ו
ל
ד
ת
ם
 
מ
ע
ש
ה
 
ח
ר
ש
 
א
ב
ן
 
פ
ת
ו
ח
י
 
ח
ו
ת
ם
 
ת
פ
ת
ח
 
א
ת
 
ש
ת
י
 
ה
א
ב
נ
י
ם
 
ע
ל
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ו
ס
ב
ו
ת
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
ת
ע
ש
ה
 
א
ת
ם
 
ו
ש
מ
ת
 
א
ת
 
ש
ת
י
 
ה
א
ב
נ
י
ם
 
ע
ל
 
כ
ת
פ
ו
ת
 
ה
א
פ
ו
ד
 
א
ב
נ
י
 
ז
כ
ר
ו
ן
 
ה
נ
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ש
א
 
א
ה
ר
ן
 
א
ת
 
ש
מ
ו
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ל
 
ש
ת
י
 
כ
ת
פ
ת
י
ו
 
ל
ז
כ
ר
ו
ן
 
ו
ע
ש
י
ת
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
ו
ש
ת
י
 
ש
ר
ש
ר
ו
ת
 
ז
ה
ב
 
ט
ה
ו
ר
 
מ
ג
ב
ל
ו
ת
 
ת
ע
ש
ה
 
א
ת
ם
 
מ
ע
ש
ה
 
ע
ב
ו
ת
 
ו
נ
ת
ת
ה
 
א
ת
 
ש
ר
ש
ר
ו
ת
 
ה
ע
ב
ת
ו
ת
 
ע
ל
 
ה
מ
ש
ב
צ
ו
ת
 
ו
ע
ש
י
ת
 
ח
ש
ן
 
מ
ש
פ
ט
 
מ
ע
ש
ה
 
ח
ש
ב
 
כ
מ
ע
ש
ה
 
ה
א
פ
ו
ד
 
ת
ע
ש
נ
ו
 
ז
ה
ב
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ת
ע
ש
ה
 
א
ת
ו
 
ר
ב
ו
ע
 
י
ה
י
ה
 
כ
פ
ו
ל
 
ז
ר
ת
 
א
ר
כ
ו
 
ו
ז
ר
ת
 
ר
ח
ב
ו
 
ו
מ
ל
א
ת
 
ב
ו
 
מ
ל
א
ת
 
א
ב
ן
 
א
ר
ב
ע
ה
 
ט
ו
ר
י
ם
 
ט
ו
ר
 
א
ד
ם
 
פ
ט
ד
ה
 
ו
ב
ר
ק
ת
 
ה
ט
ו
ר
 
ה
א
ח
ד
 
ו
ה
ט
ו
ר
 
ה
ש
נ
י
 
נ
פ
ך
 
ס
פ
י
ר
 
ו
י
ח
ל
ם
 
ו
ה
ט
ו
ר
 
ה
ש
ל
י
ש
י
 
ל
ש
ם
 
ש
ב
ו
 
ו
א
ח
ל
מ
ה
 
ו
ה
ט
ו
ר
 
ה
ר
ב
י
ע
י
 
ת
ר
ש
י
ש
 
ש
ה
ם
 
ו
י
ש
פ
ה
 
מ
ו
ס
ב
ו
ת
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
י
ה
י
ו
 
ב
מ
ל
א
ו
ת
ם
 
ו
ה
א
ב
נ
י
ם
 
ת
ה
י
י
נ
ה
 
ע
ל
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ע
ל
 
ש
מ
ו
ת
ם
 
פ
ת
ו
ח
י
 
ח
ו
ת
ם
 
א
י
ש
 
ע
ל
 
ש
מ
ו
 
ת
ה
י
נ
ה
 
ל
ש
נ
י
ם
 
ע
ש
ר
 
ש
ב
ט
 
ו
ע
ש
י
ת
 
ע
ל
 
ה
ח
ש
ן
 
ש
ר
ש
ר
ו
ת
 
ג
ב
ל
ו
ת
 
מ
ע
ש
ה
 
ע
ב
ו
ת
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
ע
ש
י
ת
 
ע
ל
 
ה
ח
ש
ן
 
ש
ת
י
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
ט
ב
ע
ו
ת
 
ע
ל
 
ק
צ
ו
ת
 
ה
ח
ש
ן
 
ו
נ
ת
ת
ה
 
א
ת
 
ש
ת
י
 
ה
ע
ב
ת
ו
ת
 
ה
ז
ה
ב
 
ע
ל
 
ש
ת
י
 
ה
ט
ב
ע
ו
ת
 
ע
ל
 
ק
צ
ו
ת
 
ה
ח
ש
ן
 
ו
א
ת
 
ש
ת
י
 
ה
ק
צ
ו
ת
 
ש
ת
י
 
ה
ע
ב
ת
ו
ת
 
ת
ת
ן
 
ע
ל
 
ש
ת
י
 
ה
מ
ש
ב
צ
ו
ת
 
ו
נ
ת
ת
ה
 
ע
ל
 
כ
ת
פ
ו
ת
 
ה
א
פ
ו
ד
 
א
ל
 
מ
ו
ל
 
פ
נ
י
ו
 
ו
ע
ש
י
ת
 
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
ש
מ
ת
 
א
ת
ם
 
ע
ל
 
ש
נ
י
 
ק
צ
ו
ת
 
ה
ח
ש
ן
 
ע
ל
 
ש
פ
ת
ו
 
א
ש
ר
 
ע
ל
 
ח
ב
ר
 
ה
א
פ
ו
ד
 
ב
י
ת
ה
 
ו
ע
ש
י
ת
 
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
נ
ת
ת
ה
 
א
ת
ם
 
ע
ל
 
ש
ת
י
 
כ
ת
פ
ו
ת
 
ה
א
פ
ו
ד
 
מ
ל
מ
ט
ה
 
מ
מ
ו
ל
 
פ
נ
י
ו
 
ל
ע
מ
ת
 
מ
ח
ב
ר
ת
ו
 
מ
מ
ע
ל
 
ל
ח
ש
ב
 
ה
א
פ
ו
ד
 
ו
י
ר
כ
ס
ו
 
א
ת
 
ה
ח
ש
ן
 
מ
ט
ב
ע
ת
ו
 
א
ל
 
ט
ב
ע
ת
 
ה
א
פ
ו
ד
 
ב
פ
ת
י
ל
 
ת
כ
ל
ת
 
ל
ה
י
ו
ת
 
ע
ל
 
ח
ש
ב
 
ה
א
פ
ו
ד
 
ו
ל
א
 
י
ז
ה
 
ה
ח
ש
ן
 
מ
ע
ל
 
ה
א
פ
ו
ד
 
ו
נ
ש
א
 
א
ה
ר
ן
 
א
ת
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ח
ש
ן
 
ה
מ
ש
פ
ט
 
ע
ל
 
ל
ב
ו
 
ב
ב
א
ו
 
א
ל
 
ה
ק
ד
ש
 
ל
ז
כ
ר
ו
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ת
מ
י
ד
ה
 
ו
ע
ש
י
ת
 
א
ת
 
ה
א
ר
י
ם
 
ו
א
ת
 
ה
ת
מ
י
ם
 
ו
נ
ת
ת
ה
 
ע
ל
 
ח
ש
ן
 
ה
מ
ש
פ
ט
 
א
ת
 
ה
א
ר
י
ם
 
ו
א
ת
 
ה
ת
מ
י
ם
 
ו
ה
י
ו
 
ע
ל
 
ל
ב
 
א
ה
ר
ן
 
ב
ב
א
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
נ
ש
א
 
א
ה
ר
ן
 
א
ת
 
מ
ש
פ
ט
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ל
 
ל
ב
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ת
מ
י
ד
ה
 
ו
ע
ש
י
ת
 
א
ת
 
מ
ע
י
ל
 
ה
א
פ
ו
ד
 
כ
ל
י
ל
 
ת
כ
ל
ת
 
ו
ה
י
ה
 
פ
י
 
ר
א
ש
ו
 
ב
ת
ו
כ
ו
 
ש
פ
ה
 
י
ה
י
ה
 
ל
פ
י
ו
 
ס
ב
י
ב
 
מ
ע
ש
ה
 
א
ר
ג
 
כ
פ
י
 
ת
ח
ר
א
 
י
ה
י
ה
 
ל
ו
 
ל
א
 
י
ק
ר
ע
 
ו
ע
ש
י
ת
 
ע
ל
 
ש
ו
ל
י
ו
 
ר
מ
ו
נ
י
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ע
ל
 
ש
ו
ל
י
ו
 
ס
ב
י
ב
 
ו
פ
ע
מ
ו
נ
י
 
ז
ה
ב
 
ב
ת
ו
כ
ם
 
ס
ב
י
ב
 
פ
ע
מ
ו
ן
 
ז
ה
ב
 
ו
ר
מ
ו
ן
 
פ
ע
מ
ו
ן
 
ז
ה
ב
 
ו
ר
מ
ו
ן
 
ע
ל
 
ש
ו
ל
י
 
ה
מ
ע
י
ל
 
ס
ב
י
ב
 
ו
ה
י
ה
 
ע
ל
 
א
ה
ר
ן
 
ל
ש
ר
ת
 
ו
נ
ש
מ
ע
 
ק
ו
ל
ו
 
ב
ב
א
ו
 
א
ל
 
ה
ק
ד
ש
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ב
צ
א
ת
ו
 
ו
ל
א
 
י
מ
ו
ת
 
ו
ע
ש
י
ת
 
צ
י
ץ
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
פ
ת
ח
ת
 
ע
ל
י
ו
 
פ
ת
ו
ח
י
 
ח
ו
ת
ם
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
ו
ש
מ
ת
 
א
ת
ו
 
ע
ל
 
פ
ת
י
ל
 
ת
כ
ל
ת
 
ו
ה
י
ה
 
ע
ל
 
ה
מ
צ
נ
פ
ת
 
א
ל
 
מ
ו
ל
 
פ
נ
י
 
ה
מ
צ
נ
פ
ת
 
י
ה
י
ה
 
ו
ה
י
ה
 
ע
ל
 
מ
צ
ח
 
א
ה
ר
ן
 
ו
נ
ש
א
 
א
ה
ר
ן
 
א
ת
 
ע
ו
ן
 
ה
ק
ד
ש
י
ם
 
א
ש
ר
 
י
ק
ד
י
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
כ
ל
 
מ
ת
נ
ו
ת
 
ק
ד
ש
י
ה
ם
 
ו
ה
י
ה
 
ע
ל
 
מ
צ
ח
ו
 
ת
מ
י
ד
 
ל
ר
צ
ו
ן
 
ל
ה
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ש
ב
צ
ת
 
א
ת
 
ה
כ
י
ת
נ
ת
 
ש
ש
 
ו
ע
ש
י
ת
 
מ
צ
נ
פ
ת
 
ש
ש
 
ו
א
ב
נ
י
ט
 
ת
ע
ש
ה
 
מ
ע
ש
ה
 
ר
ק
ם
 
ו
ל
ב
נ
י
 
א
ה
ר
ן
 
ת
ע
ש
ה
 
כ
י
ת
נ
ו
ת
 
ו
ע
ש
י
ת
 
ל
ה
ם
 
א
ב
נ
י
ט
י
ם
 
ו
מ
ג
ב
ע
ו
ת
 
ת
ע
ש
ה
 
ל
ה
ם
 
ל
כ
ב
ו
ד
 
ו
ל
ת
פ
א
ר
ת
 
ו
ה
ל
ב
ש
ת
 
א
ת
ם
 
א
ת
 
א
ה
ר
ן
 
א
ח
י
ך
 
ו
א
ת
 
ב
נ
י
ו
 
א
ת
ו
 
ו
מ
ש
ח
ת
 
א
ת
ם
 
ו
מ
ל
א
ת
 
א
ת
 
י
ד
ם
 
ו
ק
ד
ש
ת
 
א
ת
ם
 
ו
כ
ה
נ
ו
 
ל
י
 
ו
ע
ש
ה
 
ל
ה
ם
 
מ
כ
נ
ס
י
 
ב
ד
 
ל
כ
ס
ו
ת
 
ב
ש
ר
 
ע
ר
ו
ה
 
מ
מ
ת
נ
י
ם
 
ו
ע
ד
 
י
ר
כ
י
ם
 
י
ה
י
ו
 
ו
ה
י
ו
 
ע
ל
 
א
ה
ר
ן
 
ו
ע
ל
 
ב
נ
י
ו
 
ב
ב
א
ם
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
א
ו
 
ב
ג
ש
ת
ם
 
א
ל
 
ה
מ
ז
ב
ח
 
ל
ש
ר
ת
 
ב
ק
ד
ש
 
ו
ל
א
 
י
ש
א
ו
 
ע
ו
ן
 
ו
מ
ת
ו
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ו
 
ו
ל
ז
ר
ע
ו
 
א
ח
ר
י
ו
 
ו
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
ת
ע
ש
ה
 
ל
ה
ם
 
ל
ק
ד
ש
 
א
ת
ם
 
ל
כ
ה
ן
 
ל
י
 
ל
ק
ח
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
ו
א
י
ל
י
ם
 
ש
נ
י
ם
 
ת
מ
י
מ
ם
 
ו
ל
ח
ם
 
מ
צ
ו
ת
 
ו
ח
ל
ו
ת
 
מ
צ
ו
ת
 
ב
ל
ל
ו
ת
 
ב
ש
מ
ן
 
ו
ר
ק
י
ק
י
 
מ
צ
ו
ת
 
ס
ל
ת
 
ח
ט
י
ם
 
ת
ע
ש
ה
 
א
ת
ם
 
ו
נ
ת
ת
ה
 
א
ת
ם
 
ע
ל
 
ס
ל
 
א
ח
ד
 
ו
ה
ק
ר
ב
ת
 
א
ת
ם
 
ב
ס
ל
 
ו
א
ת
 
ה
פ
ר
 
ו
א
ת
 
ש
נ
י
 
ה
א
י
ל
י
ם
 
ו
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
ת
ק
ר
י
ב
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ר
ח
צ
ת
 
א
ת
ם
 
ב
מ
י
ם
 
ו
ל
ק
ח
ת
 
א
ת
 
ה
ב
ג
ד
י
ם
 
ו
ה
ל
ב
ש
ת
 
א
ת
 
א
ה
ר
ן
 
א
ת
 
ה
כ
י
ת
נ
ת
 
ו
ח
ג
ר
ת
 
א
ת
ו
 
א
ב
נ
י
ט
 
ו
ה
ל
ב
ש
ת
 
א
ת
ו
 
א
ת
 
ה
מ
ע
י
ל
 
ו
נ
ת
ת
ה
 
ע
ל
י
ו
 
א
ת
 
ה
א
פ
ו
ד
 
ו
א
ת
 
ה
ח
ש
ן
 
ו
א
פ
ד
ת
 
ל
ו
 
ב
ח
ש
ב
 
ה
א
פ
ו
ד
 
ו
ש
מ
ת
 
ה
מ
צ
נ
פ
ת
 
ע
ל
 
ר
א
ש
ו
 
ו
נ
ת
ת
ה
 
א
ת
 
נ
ז
ר
 
ה
ק
ד
ש
 
ע
ל
 
ה
מ
צ
נ
פ
ת
 
ו
ל
ק
ח
ת
 
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
י
צ
ק
ת
 
ע
ל
 
ר
א
ש
ו
 
ו
מ
ש
ח
ת
 
א
ת
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ת
ק
ר
י
ב
 
ו
ה
ל
ב
ש
ת
ם
 
כ
י
ת
נ
ו
ת
 
ו
ח
ג
ר
ת
 
א
ת
ם
 
א
ב
נ
י
ט
י
ם
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
ו
ח
ב
ש
ת
 
ל
ה
ם
 
מ
ג
ב
ע
ו
ת
 
ו
ה
י
ת
ה
 
ל
ה
ם
 
כ
ה
נ
ה
 
ל
ח
ק
ת
 
ע
ו
ל
ם
 
ו
מ
ל
א
ת
 
י
ד
 
א
ה
ר
ן
 
ו
י
ד
 
ב
נ
י
ו
 
ו
ה
ק
ר
ב
ת
 
א
ת
 
ה
פ
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ס
מ
ך
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
פ
ר
 
ו
ש
ח
ט
ת
 
א
ת
 
ה
פ
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
ק
ח
ת
 
מ
ד
ם
 
ה
פ
ר
 
ו
נ
ת
ת
ה
 
ע
ל
 
ק
ר
נ
ו
ת
 
ה
מ
ז
ב
ח
 
ב
א
צ
ב
ע
ך
 
ו
א
ת
 
כ
ל
 
ה
ד
ם
 
ת
ש
פ
ך
 
א
ל
 
י
ס
ו
ד
 
ה
מ
ז
ב
ח
 
ו
ל
ק
ח
ת
 
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
י
ו
ת
ר
ת
 
ה
כ
ב
ד
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
ו
ה
ק
ט
ר
ת
 
ה
מ
ז
ב
ח
ה
 
ו
א
ת
 
ב
ש
ר
 
ה
פ
ר
 
ו
א
ת
 
ע
ו
ר
ו
 
ו
א
ת
 
פ
ר
ש
ו
 
ת
ש
ר
ף
 
ב
א
ש
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ח
ט
א
ת
 
ה
י
א
 
ו
א
ת
 
ה
א
י
ל
 
ה
א
ח
ד
 
ת
ק
ח
 
ו
ס
מ
ך
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
א
י
ל
 
ו
ש
ח
ט
ת
 
א
ת
 
ה
א
י
ל
 
ו
ל
ק
ח
ת
 
א
ת
 
ד
מ
ו
 
ו
ז
ר
ק
ת
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
ה
א
י
ל
 
ת
נ
ת
ח
 
ל
נ
ת
ח
י
ו
 
ו
ר
ח
צ
ת
 
ק
ר
ב
ו
 
ו
כ
ר
ע
י
ו
 
ו
נ
ת
ת
ה
 
ע
ל
 
נ
ת
ח
י
ו
 
ו
ע
ל
 
ר
א
ש
ו
 
ו
ה
ק
ט
ר
ת
 
א
ת
 
כ
ל
 
ה
א
י
ל
 
ה
מ
ז
ב
ח
ה
 
ע
ל
ה
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ו
ל
ק
ח
ת
 
א
ת
 
ה
א
י
ל
 
ה
ש
נ
י
 
ו
ס
מ
ך
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
א
י
ל
 
ו
ש
ח
ט
ת
 
א
ת
 
ה
א
י
ל
 
ו
ל
ק
ח
ת
 
מ
ד
מ
ו
 
ו
נ
ת
ת
ה
 
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
א
ה
ר
ן
 
ו
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
ב
נ
י
ו
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ם
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ם
 
ה
י
מ
נ
י
ת
 
ו
ז
ר
ק
ת
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
ל
ק
ח
ת
 
מ
ן
 
ה
א
י
ל
 
ה
ח
ל
ב
 
א
ת
 
ה
א
ל
י
ה
 
ו
א
ת
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
י
ו
ת
ר
ת
 
ה
כ
ב
ד
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
ו
א
ת
 
ש
ו
ק
 
ה
י
מ
י
ן
 
כ
י
 
א
י
ל
 
מ
ל
א
י
ם
 
ה
ו
א
 
ו
כ
כ
ר
 
ל
ח
ם
 
א
ח
ת
 
ו
ח
ל
ת
 
ל
ח
ם
 
ש
מ
ן
 
א
ח
ת
 
ו
ר
ק
י
ק
 
א
ח
ד
 
מ
ס
ל
 
ה
מ
צ
ו
ת
 
א
ש
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ש
מ
ת
 
ה
כ
ל
 
ע
ל
 
כ
פ
י
 
א
ה
ר
ן
 
ו
ע
ל
 
כ
פ
י
 
ב
נ
י
ו
 
ו
ה
נ
פ
ת
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
ק
ח
ת
 
א
ת
ם
 
מ
י
ד
ם
 
ו
ה
ק
ט
ר
ת
 
א
ת
ם
 
ה
מ
ז
ב
ח
ה
 
ע
ל
 
ה
ע
ל
ה
 
ל
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ו
ל
ק
ח
ת
 
א
ת
 
ה
ח
ז
ה
 
מ
א
י
ל
 
ה
מ
ל
א
י
ם
 
מ
א
ש
ר
 
ל
א
ה
ר
ן
 
ו
ה
נ
פ
ת
 
א
ת
ו
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ה
י
ה
 
ל
ך
 
ל
מ
נ
ה
 
ו
ק
ד
ש
ת
 
א
ת
 
ח
ז
ה
 
ה
ת
נ
ו
פ
ה
 
ו
א
ת
 
ש
ו
ק
 
ה
ת
ר
ו
מ
ה
 
א
ש
ר
 
ה
ו
נ
ף
 
ו
א
ש
ר
 
ה
ו
ר
ם
 
מ
א
י
ל
 
ה
מ
ל
א
י
ם
 
מ
א
ש
ר
 
ל
א
ה
ר
ן
 
ו
מ
א
ש
ר
 
ל
ב
נ
י
ו
 
ו
ה
י
ה
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ל
ח
ק
 
ע
ו
ל
ם
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
י
 
ת
ר
ו
מ
ה
 
ה
ו
א
 
ו
ת
ר
ו
מ
ה
 
י
ה
י
ה
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ז
ב
ח
י
 
ש
ל
מ
י
ה
ם
 
ת
ר
ו
מ
ת
ם
 
ל
י
ה
ו
ה
 
ו
ל
ק
ח
ת
 
מ
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
מ
ן
 
ה
ד
ם
 
א
ש
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ה
ז
י
ת
 
ע
ל
 
א
ה
ר
ן
 
ו
ע
ל
 
ב
ג
ד
י
ו
 
ו
ע
ל
 
ב
נ
י
ו
 
ו
ע
ל
 
ב
ג
ד
י
 
ב
נ
י
ו
 
א
ת
ו
 
ו
ק
ד
ש
ת
ו
 
ו
א
ת
 
ב
ג
ד
י
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ו
א
ת
 
ב
ג
ד
י
 
ב
נ
י
ו
 
א
ת
ו
 
ו
ב
ג
ד
י
 
ה
ק
ד
ש
 
א
ש
ר
 
ל
א
ה
ר
ן
 
י
ה
י
ו
 
ל
ב
נ
י
ו
 
א
ח
ר
י
ו
 
ל
מ
ש
ח
ה
 
ב
ם
 
ו
ל
מ
ל
א
 
ב
ם
 
א
ת
 
י
ד
ם
 
ש
ב
ע
ת
 
י
מ
י
ם
 
י
ל
ב
ש
ם
 
ה
כ
ה
ן
 
ת
ח
ת
י
ו
 
מ
ב
נ
י
ו
 
א
ש
ר
 
י
ב
ו
א
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
ש
ר
ת
 
ב
ק
ד
ש
 
ו
א
ת
 
א
י
ל
 
ה
מ
ל
א
י
ם
 
ת
ק
ח
 
ו
ב
ש
ל
ת
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
ו
א
כ
ל
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
ב
ש
ר
 
ה
א
י
ל
 
ו
א
ת
 
ה
ל
ח
ם
 
א
ש
ר
 
ב
ס
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
י
א
כ
ל
ו
 
א
ת
ם
 
א
ש
ר
 
כ
פ
ר
 
ב
ם
 
ל
מ
ל
א
 
ב
ם
 
א
ת
 
י
ד
ם
 
ל
ק
ד
ש
 
א
ת
ם
 
ו
ז
ר
 
ל
א
 
י
א
כ
ל
 
כ
י
 
ק
ד
ש
 
ה
ם
 
ו
א
ם
 
י
ו
ת
ר
 
מ
ב
ש
ר
 
ה
מ
ל
א
י
ם
 
ו
מ
ן
 
ה
ל
ח
ם
 
ע
ד
 
ב
ק
ר
 
ו
ש
ר
פ
ת
 
א
ת
 
ה
נ
ו
ת
ר
 
ב
א
ש
 
ל
א
 
י
א
כ
ל
 
כ
י
 
ק
ד
ש
 
ה
ו
א
 
ו
ע
ש
י
ת
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
כ
כ
ה
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
י
ת
י
 
א
ת
ך
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
מ
ל
א
 
א
ת
 
י
ד
ם
 
ו
פ
ר
 
ח
ט
א
ת
 
ת
ע
ש
ה
 
ל
י
ו
ם
 
ע
ל
 
ה
כ
פ
ו
ר
י
ם
 
ו
ח
ט
א
ת
 
ע
ל
 
ה
מ
ז
ב
ח
 
ב
כ
פ
ר
ך
 
ע
ל
י
ו
 
ו
מ
ש
ח
ת
 
א
ת
ו
 
ל
ק
ד
ש
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
כ
פ
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ק
ד
ש
ת
 
א
ת
ו
 
ו
ה
י
ה
 
ה
מ
ז
ב
ח
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
כ
ל
 
ה
נ
ג
ע
 
ב
מ
ז
ב
ח
 
י
ק
ד
ש
 
ו
ז
ה
 
א
ש
ר
 
ת
ע
ש
ה
 
ע
ל
 
ה
מ
ז
ב
ח
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
נ
י
ם
 
ל
י
ו
ם
 
ת
מ
י
ד
 
ע
ל
ת
 
ת
מ
י
ד
 
א
ת
 
ה
כ
ב
ש
 
ה
א
ח
ד
 
ת
ע
ש
ה
 
ב
ב
ק
ר
 
ו
א
ת
 
ה
כ
ב
ש
 
ה
ש
נ
י
 
ת
ע
ש
ה
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ו
ע
ש
ר
ו
ן
 
ס
ל
ת
 
ב
ל
ו
ל
 
ב
ש
מ
ן
 
כ
ת
י
ת
 
ר
ב
ע
י
ת
 
ה
ה
י
ן
 
ו
נ
ס
ך
 
ר
ב
ע
י
ת
 
ה
ה
י
ן
 
י
י
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ו
א
ת
 
ה
כ
ב
ש
 
ה
ש
נ
י
 
ת
ע
ש
ה
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
כ
מ
נ
ח
ת
 
ה
ב
ק
ר
 
ו
כ
נ
ס
כ
ו
 
ת
ע
ש
ה
 
ל
ו
 
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ע
ל
ת
 
ת
מ
י
ד
 
ל
ד
ר
ת
י
כ
ם
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ש
ר
 
א
ו
ע
ד
 
ל
ך
 
ש
מ
ה
 
ל
ד
ב
ר
 
א
ל
י
ך
 
ש
ם
 
ו
נ
ד
ר
ש
ת
י
 
ש
ם
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ק
ד
ש
ו
 
ב
כ
ב
ו
ד
י
 
ו
ק
ד
ש
ת
י
 
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
א
ק
ד
ש
 
ל
כ
ה
ן
 
ל
י
 
ו
ש
כ
נ
ת
י
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
י
י
ת
י
 
ל
ה
ם
 
ל
א
ל
ה
י
ם
 
ו
י
ד
ע
ו
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ה
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ש
כ
נ
י
 
ב
ת
ו
כ
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ה
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
כ
י
 
ת
ש
א
 
א
ת
 
ר
א
ש
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
פ
ק
ד
י
ה
ם
 
ו
נ
ת
נ
ו
 
א
י
ש
 
כ
פ
ר
 
נ
פ
ש
ו
 
ל
י
ה
ו
ה
 
ב
פ
ק
ד
 
א
ת
ם
 
ו
ל
א
 
י
ה
י
ה
 
ב
ה
ם
 
נ
ג
ף
 
ב
פ
ק
ד
 
א
ת
ם
 
ז
ה
 
י
ת
נ
ו
 
כ
ל
 
ה
ע
ב
ר
 
ע
ל
 
ה
פ
ק
ד
י
ם
 
מ
ח
צ
י
ת
 
ה
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ו
ש
ק
ל
 
ה
ק
ד
ש
 
ע
ש
ר
י
ם
 
ג
ר
ה
 
ה
ו
א
 
ה
ש
ק
ל
 
ת
ר
ו
מ
ה
 
ל
י
ה
ו
ה
 
כ
ל
 
ה
ע
ב
ר
 
ע
ל
 
ה
פ
ק
ד
י
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
י
ת
נ
ו
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ה
ע
ש
י
ר
 
ל
א
 
י
ר
ב
ה
 
ו
ה
ד
ל
 
ל
א
 
י
מ
ע
י
ט
 
מ
מ
ח
צ
י
ת
 
ה
ש
ק
ל
 
ל
ת
ת
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ל
כ
פ
ר
 
ע
ל
 
נ
פ
ש
ת
י
כ
ם
 
ו
ל
ק
ח
ת
 
א
ת
 
כ
ס
ף
 
ה
כ
פ
ו
ר
י
ם
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ת
ת
ה
 
א
ת
ו
 
א
ל
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
י
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ז
כ
ר
ו
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
כ
פ
ר
 
ע
ל
 
נ
פ
ש
ת
י
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
ע
ש
י
ת
 
כ
י
ו
ר
 
נ
ח
ש
ת
 
ו
כ
נ
ו
 
נ
ח
ש
ת
 
ל
ר
ח
צ
ה
 
ו
נ
ת
ת
ה
 
א
ת
ו
 
ב
י
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ב
י
ן
 
ה
מ
ז
ב
ח
 
ו
נ
ת
ת
ה
 
ש
ם
 
מ
י
ם
 
ו
ר
ח
ץ
 
מ
מ
נ
ו
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ו
א
ת
 
ר
ג
ל
י
ה
ם
 
ב
ב
א
ם
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
י
ר
ח
צ
ו
 
מ
י
ם
 
ו
ל
א
 
י
מ
ו
ת
ו
 
א
ו
 
ב
ג
ש
ת
ם
 
א
ל
 
ה
מ
ז
ב
ח
 
ל
ש
ר
ת
 
ל
ה
ק
ט
י
ר
 
א
ש
ה
 
ל
י
ה
ו
ה
 
י
ר
ח
צ
ו
 
י
ד
י
ה
ם
 
ו
ר
ג
ל
י
ה
ם
 
ו
ל
א
 
י
מ
ו
ת
ו
 
ו
ה
י
ת
ה
 
ל
ה
ם
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ו
 
ו
ל
ז
ר
ע
ו
 
ל
ד
ר
ו
ת
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
א
ת
ה
 
ק
ח
 
ל
ך
 
ב
ש
מ
י
ם
 
ר
א
ש
 
מ
ר
ד
ר
ו
ר
 
ח
מ
ש
 
מ
א
ו
ת
 
ו
ק
נ
מ
ו
ן
 
ב
ש
ם
 
מ
ח
צ
י
ת
ו
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
י
ם
 
ו
ק
נ
ה
 
ב
ש
ם
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
י
ם
 
ו
ק
ד
ה
 
ח
מ
ש
 
מ
א
ו
ת
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ו
ש
מ
ן
 
ז
י
ת
 
ה
י
ן
 
ו
ע
ש
י
ת
 
א
ת
ו
 
ש
מ
ן
 
מ
ש
ח
ת
 
ק
ד
ש
 
ר
ק
ח
 
מ
ר
ק
ח
ת
 
מ
ע
ש
ה
 
ר
ק
ח
 
ש
מ
ן
 
מ
ש
ח
ת
 
ק
ד
ש
 
י
ה
י
ה
 
ו
מ
ש
ח
ת
 
ב
ו
 
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ה
 
א
ת
 
מ
ז
ב
ח
 
ה
ק
ט
ר
ת
 
ו
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
ו
ק
ד
ש
ת
 
א
ת
ם
 
ו
ה
י
ו
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
כ
ל
 
ה
נ
ג
ע
 
ב
ה
ם
 
י
ק
ד
ש
 
ו
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
ת
מ
ש
ח
 
ו
ק
ד
ש
ת
 
א
ת
ם
 
ל
כ
ה
ן
 
ל
י
 
ו
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ד
ב
ר
 
ל
א
מ
ר
 
ש
מ
ן
 
מ
ש
ח
ת
 
ק
ד
ש
 
י
ה
י
ה
 
ז
ה
 
ל
י
 
ל
ד
ר
ת
י
כ
ם
 
ע
ל
 
ב
ש
ר
 
א
ד
ם
 
ל
א
 
י
ו
ס
ך
 
ו
ב
ת
כ
נ
ת
ו
 
ל
א
 
ת
ע
ש
ו
 
כ
מ
ה
ו
 
ק
ד
ש
 
ה
ו
א
 
ו
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
א
י
ש
 
א
ש
ר
 
י
ר
ק
ח
 
כ
מ
ה
ו
 
ו
א
ש
ר
 
י
ת
ן
 
מ
מ
נ
ו
 
ע
ל
 
ז
ר
 
ו
נ
כ
ר
ת
 
מ
ע
מ
י
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ח
 
ל
ך
 
ס
מ
י
ם
 
נ
ט
ף
 
ו
ש
ח
ל
ת
 
ו
ח
ל
ב
נ
י
ה
 
ס
מ
י
ם
 
ו
ל
ב
ו
נ
ה
 
ז
כ
ה
 
ב
ד
 
ב
ב
ד
 
י
ה
י
ה
 
ו
ע
ש
י
ת
 
א
ת
ו
 
ק
ט
ר
ת
 
ר
ק
ח
 
מ
ע
ש
ה
 
ר
ק
ח
 
מ
מ
ל
ח
ת
 
ט
ה
ו
ר
 
ק
ד
ש
 
ו
ש
ח
ק
ת
 
מ
מ
נ
ו
 
ה
ד
ק
 
ו
נ
ת
ת
ה
 
מ
מ
נ
ו
 
ל
פ
נ
י
 
ה
ע
ד
ו
ת
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
א
ש
ר
 
א
ו
ע
ד
 
ל
ך
 
ש
מ
ה
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ת
ה
י
ה
 
ל
כ
ם
 
ו
ה
ק
ט
ר
ת
 
א
ש
ר
 
ת
ע
ש
ה
 
ב
מ
ת
כ
נ
ת
ה
 
ל
א
 
ת
ע
ש
ו
 
ל
כ
ם
 
ק
ד
ש
 
ת
ה
י
ה
 
ל
כ
ם
 
ל
י
ה
ו
ה
 
א
י
ש
 
א
ש
ר
 
י
ע
ש
ה
 
כ
מ
ו
ה
 
ל
ה
ר
י
ח
 
ב
ה
 
ו
נ
כ
ר
ת
 
מ
ע
מ
י
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ר
א
ה
 
ק
ר
א
ת
י
 
ב
ש
ם
 
ב
צ
ל
א
ל
 
ב
ן
 
ח
ו
ר
י
 
ב
ן
 
ח
ו
ר
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
ו
א
מ
ל
א
 
א
ת
ו
 
ר
ו
ח
 
א
ל
ה
י
ם
 
ב
ח
כ
מ
ה
 
ו
ב
ת
ב
ו
נ
ה
 
ו
ב
ד
ע
ת
 
ו
ב
כ
ל
 
מ
ל
א
כ
ה
 
ו
ל
ח
ש
ב
 
מ
ח
ש
ב
ו
ת
 
ל
ע
ש
ו
ת
 
ב
ז
ה
ב
 
ו
ב
כ
ס
ף
 
ו
ב
נ
ח
ש
ת
 
ו
ב
ח
ר
ש
ת
 
א
ב
ן
 
ל
מ
ל
א
ת
 
ו
ב
ח
ר
ש
ת
 
ע
ץ
 
ל
ע
ש
ו
ת
 
ב
כ
ל
 
מ
ל
א
כ
ה
 
ו
א
נ
י
 
ה
נ
ה
 
נ
ת
ת
י
 
א
ת
ו
 
א
ת
 
א
ה
ל
י
א
ב
 
ב
ן
 
א
ח
י
ס
מ
ך
 
ל
מ
ט
ה
 
ד
ן
 
ו
ב
ל
ב
 
כ
ל
 
ח
כ
ם
 
ל
ב
 
נ
ת
ת
י
 
ח
כ
מ
ה
 
ו
ע
ש
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
צ
ו
י
ת
י
ך
 
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
ה
א
ר
ו
ן
 
ל
ע
ד
ו
ת
 
ו
א
ת
 
ה
כ
פ
ר
ת
 
א
ש
ר
 
ע
ל
י
ו
 
ו
א
ת
 
כ
ל
 
כ
ל
י
 
ה
א
ה
ל
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ה
ט
ה
ר
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ה
 
א
ת
 
מ
ז
ב
ח
 
ה
ק
ט
ר
ת
 
ו
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
א
ת
 
ב
ג
ד
י
 
ה
ש
ר
ד
 
ו
א
ת
 
ב
ג
ד
י
 
ה
ק
ד
ש
 
ל
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
א
ת
 
ב
ג
ד
י
 
ב
נ
י
ו
 
ל
כ
ה
ן
 
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
א
ת
 
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ל
ק
ד
ש
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
י
ת
י
ך
 
י
ע
ש
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
א
ת
ה
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
א
ך
 
א
ת
 
ש
ב
ת
ת
י
 
ת
ש
מ
ר
ו
 
כ
י
 
א
ו
ת
 
ה
י
א
 
ב
י
נ
י
 
ו
ב
י
נ
כ
ם
 
ל
ד
ר
ת
י
כ
ם
 
ל
ד
ע
ת
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
כ
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ה
ש
ב
ת
 
כ
י
 
ק
ד
ש
 
ה
י
א
 
ל
כ
ם
 
מ
ח
ל
ל
י
ה
 
מ
ו
ת
 
י
ו
מ
ת
 
כ
י
 
כ
ל
 
ה
ע
ש
ה
 
ב
ה
 
מ
ל
א
כ
ה
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ק
ר
ב
 
ע
מ
י
ה
 
ש
ש
ת
 
י
מ
י
ם
 
י
ע
ש
ה
 
מ
ל
א
כ
ה
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
ב
ת
 
ש
ב
ת
ו
ן
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
כ
ל
 
ה
ע
ש
ה
 
מ
ל
א
כ
ה
 
ב
י
ו
ם
 
ה
ש
ב
ת
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
ש
מ
ר
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
ש
ב
ת
 
ל
ע
ש
ו
ת
 
א
ת
 
ה
ש
ב
ת
 
ל
ד
ר
ת
ם
 
ב
ר
י
ת
 
ע
ו
ל
ם
 
ב
י
נ
י
 
ו
ב
י
ן
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ו
ת
 
ה
י
א
 
ל
ע
ו
ל
ם
 
כ
י
 
ש
ש
ת
 
י
מ
י
ם
 
ע
ש
ה
 
י
ה
ו
ה
 
א
ת
 
ה
ש
מ
י
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
ב
ת
 
ו
י
נ
פ
ש
 
ו
י
ת
ן
 
א
ל
 
מ
ש
ה
 
כ
כ
ל
ו
ת
ו
 
ל
ד
ב
ר
 
א
ת
ו
 
ב
ה
ר
 
ס
י
נ
י
 
א
ת
 
ש
נ
י
 
ל
ו
ח
ת
 
ה
ע
ד
ו
ת
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
כ
ת
ו
ב
י
ם
 
ב
א
צ
ב
ע
 
א
ל
ה
י
ם
 
ו
י
ר
א
 
ה
ע
ם
 
כ
י
 
ב
ש
ש
 
מ
ש
ה
 
ל
ר
ד
ת
 
מ
ן
 
ה
ה
ר
 
ו
י
ק
ה
ל
 
ה
ע
ם
 
ע
ל
 
א
ה
ר
ן
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
ק
ו
ם
 
ע
ש
ה
 
ל
נ
ו
 
א
ל
ה
י
ם
 
א
ש
ר
 
י
ל
כ
ו
 
ל
פ
נ
י
נ
ו
 
כ
י
 
ז
ה
 
מ
ש
ה
 
ה
א
י
ש
 
א
ש
ר
 
ה
ע
ל
נ
ו
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
א
 
י
ד
ע
נ
ו
 
מ
ה
 
ה
י
ה
 
ל
ו
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
ה
ר
ן
 
פ
ר
ק
ו
 
א
ת
 
נ
ז
מ
י
 
ה
ז
ה
ב
 
א
ש
ר
 
ב
א
ז
נ
י
 
נ
ש
י
כ
ם
 
ב
נ
י
כ
ם
 
ו
ב
נ
ת
י
כ
ם
 
ו
ה
ב
י
א
ו
 
א
ל
י
 
ו
י
ת
פ
ר
ק
ו
 
כ
ל
 
ה
ע
ם
 
א
ת
 
נ
ז
מ
י
 
ה
ז
ה
ב
 
א
ש
ר
 
ב
א
ז
נ
י
ה
ם
 
ו
י
ב
י
א
ו
 
א
ל
 
א
ה
ר
ן
 
ו
י
ק
ח
 
מ
י
ד
ם
 
ו
י
צ
ר
 
א
ת
ו
 
ב
ח
ר
ט
 
ו
י
ע
ש
ה
ו
 
ע
ג
ל
 
מ
ס
כ
ה
 
ו
י
א
מ
ר
ו
 
א
ל
ה
 
א
ל
ה
י
ך
 
י
ש
ר
א
ל
 
א
ש
ר
 
ה
ע
ל
ו
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ר
א
 
א
ה
ר
ן
 
ו
י
ב
ן
 
מ
ז
ב
ח
 
ל
פ
נ
י
ו
 
ו
י
ק
ר
א
 
א
ה
ר
ן
 
ו
י
א
מ
ר
 
ח
ג
 
ל
י
ה
ו
ה
 
מ
ח
ר
 
ו
י
ש
כ
מ
ו
 
מ
מ
ח
ר
ת
 
ו
י
ע
ל
ו
 
ע
ל
ו
ת
 
ו
י
ג
י
ש
ו
 
ש
ל
מ
י
ם
 
ו
י
ש
ב
 
ה
ע
ם
 
ל
א
כ
ל
 
ו
ש
ת
ו
 
ו
י
ק
מ
ו
 
ל
צ
ח
ק
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ל
ך
 
ר
ד
 
כ
י
 
ש
ח
ת
 
ע
מ
ך
 
א
ש
ר
 
ה
ע
ל
י
ת
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ס
ר
ו
 
מ
ה
ר
 
מ
ן
 
ה
ד
ר
ך
 
א
ש
ר
 
צ
ו
י
ת
ם
 
ע
ש
ו
 
ל
ה
ם
 
ע
ג
ל
 
מ
ס
כ
ה
 
ו
י
ש
ת
ח
ו
ו
 
ל
ו
 
ו
י
ז
ב
ח
ו
 
ל
ו
 
ו
י
א
מ
ר
ו
 
א
ל
ה
 
א
ל
ה
י
ך
 
י
ש
ר
א
ל
 
א
ש
ר
 
ה
ע
ל
ו
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ר
א
י
ת
י
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
ו
ה
נ
ה
 
ע
ם
 
ק
ש
ה
 
ע
ר
ף
 
ה
ו
א
 
ו
ע
ת
ה
 
ה
נ
י
ח
ה
 
ל
י
 
ו
י
ח
ר
 
א
פ
י
 
ב
ם
 
ו
א
כ
ל
ם
 
ו
א
ע
ש
ה
 
א
ת
ך
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
ו
ב
א
ה
ר
ן
 
ה
ת
א
נ
ף
 
י
ה
ו
ה
 
מ
א
ד
 
ל
ה
ש
מ
י
ד
ו
 
ו
י
ת
פ
ל
ל
 
מ
ש
ה
 
ב
ע
ד
 
א
ה
ר
ן
 
ו
י
ח
ל
 
מ
ש
ה
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ו
 
ו
י
א
מ
ר
 
ל
מ
ה
 
י
ה
ו
ה
 
י
ח
ר
 
א
פ
ך
 
ב
ע
מ
ך
 
א
ש
ר
 
ה
ו
צ
א
ת
 
מ
מ
צ
ר
י
ם
 
ב
כ
ח
 
ג
ד
ו
ל
 
ו
ב
ז
ר
ו
ע
 
נ
ט
ו
י
ה
 
ל
מ
ה
 
י
א
מ
ר
ו
 
מ
צ
ר
י
ם
 
ל
א
מ
ר
 
ב
ר
ע
ה
 
ה
ו
צ
י
א
ם
 
ל
ה
ר
ג
 
א
ת
ם
 
ב
ה
ר
י
ם
 
ו
ל
כ
ל
ו
ת
ם
 
מ
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ש
ו
ב
 
מ
ח
ר
ו
ן
 
א
פ
ך
 
ו
ה
נ
ח
ם
 
ע
ל
 
ה
ר
ע
ה
 
ל
ע
מ
ך
 
ז
כ
ו
ר
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ע
ב
ד
י
ך
 
א
ש
ר
 
נ
ש
ב
ע
ת
 
ל
ה
ם
 
ב
ך
 
ו
ת
ד
ב
ר
 
א
ל
י
ה
ם
 
ה
ר
ב
ה
 
א
ר
ב
ה
 
א
ת
 
ז
ר
ע
כ
ם
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ו
כ
ל
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
א
ש
ר
 
א
מ
ר
ת
י
 
א
ת
ן
 
ל
ז
ר
ע
כ
ם
 
ו
נ
ח
ל
ו
ה
 
ל
ע
ו
ל
ם
 
ו
י
נ
ח
ם
 
י
ה
ו
ה
 
ע
ל
 
ה
ר
ע
ה
 
א
ש
ר
 
ד
ב
ר
 
ל
ע
ש
ו
ת
 
ל
ע
מ
ו
 
ו
י
פ
ן
 
ו
י
ר
ד
 
מ
ש
ה
 
מ
ן
 
ה
ה
ר
 
ו
ש
נ
י
 
ל
ו
ח
ת
 
ה
ע
ד
ו
ת
 
ב
י
ד
ו
 
ל
ו
ח
ת
 
כ
ת
ו
ב
י
ם
 
מ
ש
נ
י
 
ע
ב
ר
י
ה
ם
 
מ
ז
ה
 
ו
מ
ז
ה
 
ה
ם
 
כ
ת
ו
ב
י
ם
 
ו
ה
ל
ו
ח
ו
ת
 
מ
ע
ש
ה
 
א
ל
ה
י
ם
 
ה
ם
 
ו
ה
מ
כ
ת
ב
 
מ
כ
ת
ב
 
א
ל
ה
י
ם
 
ה
ו
א
 
ח
ר
ו
ת
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
ו
י
ש
מ
ע
 
י
ה
ו
ש
ע
 
א
ת
 
ק
ו
ל
 
ה
ע
ם
 
ב
ר
ע
ה
 
ו
י
א
מ
ר
 
א
ל
 
מ
ש
ה
 
ק
ו
ל
 
מ
ל
ח
מ
ה
 
ב
מ
ח
נ
ה
 
ו
י
א
מ
ר
 
א
י
ן
 
ק
ו
ל
 
ע
נ
ו
ת
 
ג
ב
ר
ה
 
ו
א
י
ן
 
ק
ו
ל
 
ע
נ
ו
ת
 
ח
ל
ו
ש
ה
 
ק
ו
ל
 
ע
ו
נ
ו
ת
 
א
נ
כ
י
 
ש
מ
ע
 
ו
י
ה
י
 
כ
א
ש
ר
 
ק
ר
ב
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
י
ר
א
 
א
ת
 
ה
ע
ג
ל
 
ו
א
ת
 
ה
מ
ח
ל
ו
ת
 
ו
י
ח
ר
 
א
ף
 
מ
ש
ה
 
ו
י
ש
ל
י
ך
 
מ
י
ד
י
ו
 
א
ת
 
ה
ל
ו
ח
ו
ת
 
ו
י
ש
ב
ר
 
א
ת
ם
 
ב
ת
ח
ת
י
ת
 
ה
ה
ר
 
ו
י
ק
ח
 
א
ת
 
ה
ע
ג
ל
 
א
ש
ר
 
ע
ש
ו
 
ו
י
ש
ר
פ
ה
ו
 
ב
א
ש
 
ו
י
ט
נ
ח
ה
ו
 
ע
ד
 
א
ש
ר
 
ד
ק
 
ו
י
ז
ר
 
ע
ל
 
פ
נ
י
 
ה
מ
י
ם
 
ו
י
ש
ק
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
מ
ה
 
ע
ש
ה
 
ל
ך
 
ה
ע
ם
 
ה
ז
ה
 
כ
י
 
ה
ב
א
ת
 
ע
ל
י
ו
 
ח
ט
א
ה
 
ג
ד
ל
ה
 
ו
י
א
מ
ר
 
א
ה
ר
ן
 
א
ל
 
י
ח
ר
 
א
ף
 
א
ד
נ
י
 
א
ת
ה
 
י
ד
ע
ת
 
א
ת
 
ה
ע
ם
 
כ
י
 
פ
ר
ו
ע
 
ה
ו
א
 
ו
י
א
מ
ר
ו
 
ל
י
 
ע
ש
ה
 
ל
נ
ו
 
א
ל
ה
י
ם
 
א
ש
ר
 
י
ל
כ
ו
 
ל
פ
נ
י
נ
ו
 
כ
י
 
ז
ה
 
מ
ש
ה
 
ה
א
י
ש
 
א
ש
ר
 
ה
ע
ל
נ
ו
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
א
 
י
ד
ע
נ
ו
 
מ
ה
 
ה
י
ה
 
ל
ו
 
ו
א
מ
ר
 
ל
ה
ם
 
ל
מ
י
 
ז
ה
ב
 
ה
ת
פ
ר
ק
ו
 
ו
י
ת
נ
ו
 
ל
י
 
ו
א
ש
ל
י
כ
ה
ו
 
ב
א
ש
 
ו
י
צ
א
 
ה
ע
ג
ל
 
ה
ז
ה
 
ו
י
ר
א
 
מ
ש
ה
 
א
ת
 
ה
ע
ם
 
כ
י
 
פ
ר
ו
ע
 
ה
ו
א
 
כ
י
 
פ
ר
ע
ו
 
א
ה
ר
ן
 
ל
ש
מ
צ
ו
 
ב
ק
ו
מ
י
ה
ם
 
ו
י
ע
מ
ד
 
מ
ש
ה
 
ב
ש
ע
ר
 
ה
מ
ח
נ
ה
 
ו
י
א
מ
ר
 
מ
י
 
ל
י
ה
ו
ה
 
א
ל
י
 
ו
י
א
ס
פ
ו
 
א
ל
י
ו
 
כ
ל
 
ב
נ
י
 
ל
ו
י
 
ו
י
א
מ
ר
 
ל
ה
ם
 
כ
ה
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
י
ש
ר
א
ל
 
ש
י
מ
ו
 
א
י
ש
 
ח
ר
ב
ו
 
ע
ל
 
י
ר
כ
ו
 
ו
ע
ב
ר
ו
 
ו
ש
ו
ב
ו
 
מ
ש
ע
ר
 
ל
ש
ע
ר
 
ב
מ
ח
נ
ה
 
ו
ה
ר
ג
ו
 
א
י
ש
 
א
ת
 
א
ח
י
ו
 
ו
א
י
ש
 
א
ת
 
ר
ע
ה
ו
 
ו
א
י
ש
 
א
ת
 
ק
ר
י
ב
ו
 
ו
י
ע
ש
ו
 
ב
נ
י
 
ל
ו
י
 
כ
ד
ב
ר
 
מ
ש
ה
 
ו
י
פ
ל
 
מ
ן
 
ה
ע
ם
 
ב
י
ו
ם
 
ה
ה
ו
א
 
כ
ש
ל
ש
ת
 
א
ל
פ
י
ם
 
א
י
ש
 
ו
י
א
מ
ר
 
מ
ש
ה
 
מ
ל
א
ו
 
י
ד
י
כ
ם
 
ה
י
ו
ם
 
ל
י
ה
ו
ה
 
כ
י
 
א
י
ש
 
ב
ב
נ
ו
 
ו
ב
א
ח
י
ו
 
ו
ל
ת
ת
 
ע
ל
י
כ
ם
 
ה
י
ו
ם
 
ב
ר
כ
ה
 
ו
י
ה
י
 
מ
מ
ח
ר
ת
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ם
 
א
ת
ם
 
ח
ט
א
ת
ם
 
ח
ט
א
ה
 
ג
ד
ל
ה
 
ו
ע
ת
ה
 
א
ע
ל
ה
 
א
ל
 
י
ה
ו
ה
 
א
ו
ל
י
 
א
כ
פ
ר
 
ב
ע
ד
 
ח
ט
א
ת
י
כ
ם
 
ו
י
ש
ב
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
ה
נ
ה
 
ח
ט
א
 
ה
ע
ם
 
ה
ז
ה
 
ח
ט
א
ה
 
ג
ד
ל
ה
 
ו
י
ע
ש
ו
 
ל
ה
ם
 
א
ל
ה
י
 
ז
ה
ב
 
ו
ע
ת
ה
 
א
ם
 
ת
ש
א
 
ח
ט
א
ת
ם
 
ש
א
 
ו
א
ם
 
א
י
ן
 
מ
ח
נ
י
 
מ
ס
פ
ר
ך
 
א
ש
ר
 
כ
ת
ב
ת
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
מ
י
 
א
ש
ר
 
ח
ט
א
 
ל
י
 
א
מ
ח
נ
ו
 
מ
ס
פ
ר
י
 
ו
ע
ת
ה
 
ל
ך
 
נ
ח
ה
 
א
ת
 
ה
ע
ם
 
ע
ל
 
א
ש
ר
 
ד
ב
ר
ת
י
 
ל
ך
 
ו
ה
נ
ה
 
מ
ל
א
כ
י
 
י
ל
ך
 
ל
פ
נ
י
ך
 
ו
ב
י
ו
ם
 
פ
ק
ו
ד
י
 
ו
פ
ק
ד
ת
י
 
ע
ל
י
ה
ם
 
ח
ט
א
ת
ם
 
ו
י
ג
ף
 
י
ה
ו
ה
 
א
ת
 
ה
ע
ם
 
ע
ל
 
א
ש
ר
 
ע
ש
ו
 
א
ת
 
ה
ע
ג
ל
 
א
ש
ר
 
ע
ש
ה
 
א
ה
ר
ן
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ל
ך
 
ע
ל
ה
 
מ
ז
ה
 
א
ת
ה
 
ו
ה
ע
ם
 
א
ש
ר
 
ה
ע
ל
י
ת
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ל
א
מ
ר
 
ל
ז
ר
ע
ך
 
א
ת
נ
נ
ה
 
ו
ש
ל
ח
ת
י
 
ל
פ
נ
י
ך
 
מ
ל
א
ך
 
ו
ג
ר
ש
ת
י
 
א
ת
 
ה
כ
נ
ע
נ
י
 
ו
ה
א
מ
ר
י
 
ו
ה
ח
ת
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
א
ל
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
כ
י
 
ל
א
 
א
ע
ל
ה
 
ב
ק
ר
ב
ך
 
כ
י
 
ע
ם
 
ק
ש
ה
 
ע
ר
ף
 
א
ת
ה
 
פ
ן
 
א
כ
ל
ך
 
ב
ד
ר
ך
 
ו
י
ש
מ
ע
 
ה
ע
ם
 
א
ת
 
ה
ד
ב
ר
 
ה
ר
ע
 
ה
ז
ה
 
ו
י
ת
א
ב
ל
ו
 
ו
ל
א
 
ש
ת
ו
 
א
י
ש
 
ע
ד
י
ו
 
ע
ל
י
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
ם
 
ע
ם
 
ק
ש
ה
 
ע
ר
ף
 
ר
ג
ע
 
א
ח
ד
 
א
ע
ל
ה
 
ב
ק
ר
ב
ך
 
ו
כ
ל
י
ת
י
ך
 
ו
ע
ת
ה
 
ה
ו
ר
י
ד
 
ע
ד
י
ך
 
מ
ע
ל
י
ך
 
ו
א
ד
ע
ה
 
מ
ה
 
א
ע
ש
ה
 
ל
ך
 
ו
י
ת
נ
צ
ל
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ע
ד
י
ם
 
מ
ה
ר
 
ח
ו
ר
ב
 
ו
מ
ש
ה
 
י
ק
ח
 
א
ת
 
ה
א
ה
ל
 
ו
נ
ט
ה
 
ל
ו
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ה
ר
ח
י
ק
 
מ
ן
 
ה
מ
ח
נ
ה
 
ו
ק
ר
א
 
ל
ו
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
י
ו
 
כ
ל
 
מ
ב
ק
ש
י
 
י
ה
ו
ה
 
י
צ
א
ו
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
א
ש
ר
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
ה
י
ה
 
כ
צ
א
ת
 
מ
ש
ה
 
א
ל
 
ה
א
ה
ל
 
י
ק
ו
מ
ו
 
כ
ל
 
ה
ע
ם
 
ו
נ
צ
ב
ו
 
א
י
ש
 
פ
ת
ח
 
א
ה
ל
ו
 
ו
ה
ב
י
ט
ו
 
א
ח
ר
י
 
מ
ש
ה
 
ע
ד
 
ב
א
ו
 
ה
א
ה
ל
ה
 
ו
ה
י
ה
 
כ
ב
ו
א
 
מ
ש
ה
 
ה
א
ה
ל
 
י
ר
ד
 
ע
מ
ו
ד
 
ה
ע
נ
ן
 
ו
ע
מ
ד
 
פ
ת
ח
 
ה
א
ה
ל
 
ו
ד
ב
ר
 
ע
ם
 
מ
ש
ה
 
ו
ר
א
ו
 
כ
ל
 
ה
ע
ם
 
א
ת
 
ע
מ
ו
ד
 
ה
ע
נ
ן
 
ע
מ
ד
 
פ
ת
ח
 
ה
א
ה
ל
 
ו
ק
מ
ו
 
כ
ל
 
ה
ע
ם
 
ו
ה
ש
ת
ח
ו
ו
 
א
י
ש
 
פ
ת
ח
 
א
ה
ל
ו
 
ו
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
פ
נ
י
ם
 
א
ל
 
פ
נ
י
ם
 
כ
א
ש
ר
 
י
ד
ב
ר
 
א
י
ש
 
א
ל
 
ר
ע
ה
ו
 
ו
ש
ב
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
מ
ש
ר
ת
ו
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
נ
ע
ר
 
ל
א
 
י
מ
ו
ש
 
מ
ת
ו
ך
 
ה
א
ה
ל
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ר
א
ה
 
א
ת
ה
 
א
מ
ר
 
א
ל
י
 
ה
ע
ל
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
ו
א
ת
ה
 
ל
א
 
ה
ו
ד
ע
ת
נ
י
 
א
ת
 
א
ש
ר
 
ת
ש
ל
ח
 
ע
מ
י
 
ו
א
ת
ה
 
א
מ
ר
ת
 
י
ד
ע
ת
י
ך
 
ב
ש
ם
 
ו
ג
ם
 
מ
צ
א
ת
 
ח
ן
 
ב
ע
י
נ
י
 
ו
ע
ת
ה
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ה
ו
ד
ע
נ
י
 
נ
א
 
א
ת
 
ד
ר
כ
י
ך
 
ו
א
ד
ע
ך
 
ל
מ
ע
ן
 
א
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ו
ר
א
ה
 
כ
י
 
ע
מ
ך
 
ה
ג
ו
י
 
ה
ז
ה
 
ו
י
א
מ
ר
 
פ
נ
י
 
י
ל
כ
ו
 
ו
ה
נ
ח
ת
י
 
ל
ך
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ם
 
א
י
ן
 
פ
נ
י
ך
 
ה
ל
כ
י
ם
 
א
ל
 
ת
ע
ל
נ
י
 
מ
ז
ה
 
ו
ב
מ
ה
 
י
ו
ד
ע
 
א
פ
ו
א
 
כ
י
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
א
נ
י
 
ו
ע
מ
ך
 
ה
ל
ו
א
 
ב
ל
כ
ת
ך
 
ע
מ
נ
ו
 
ו
נ
פ
ל
א
נ
ו
 
א
נ
י
 
ו
ע
מ
ך
 
מ
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ג
ם
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
א
ש
ר
 
ד
ב
ר
ת
 
א
ע
ש
ה
 
כ
י
 
מ
צ
א
ת
 
ח
ן
 
ב
ע
י
נ
י
 
ו
א
ד
ע
ך
 
ב
ש
ם
 
ו
י
א
מ
ר
 
ה
ר
א
נ
י
 
נ
א
 
א
ת
 
כ
ב
ו
ד
ך
 
ו
י
א
מ
ר
 
א
נ
י
 
א
ע
ב
י
ר
 
כ
ל
 
ט
ו
ב
י
 
ע
ל
 
פ
נ
י
ך
 
ו
ק
ר
א
ת
י
 
ב
ש
ם
 
י
ה
ו
ה
 
ל
פ
נ
י
ך
 
ו
ח
נ
ת
י
 
א
ת
 
א
ש
ר
 
א
ח
ן
 
ו
ר
ח
מ
ת
י
 
א
ת
 
א
ש
ר
 
א
ר
ח
ם
 
ו
י
א
מ
ר
 
ל
א
 
ת
ו
כ
ל
 
ל
ר
א
ו
ת
 
פ
נ
י
 
כ
י
 
ל
א
 
י
ר
א
נ
י
 
ה
א
ד
ם
 
ו
ח
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ה
נ
ה
 
מ
ק
ו
ם
 
א
ת
י
 
ו
נ
צ
ב
ת
 
ע
ל
 
ה
צ
ו
ר
 
ו
ה
י
ה
 
ב
ע
ב
ר
 
כ
ב
ו
ד
י
 
ו
ש
מ
ת
י
ך
 
ב
נ
ק
י
ר
ו
ת
 
ה
צ
ו
ר
 
ו
ש
כ
ת
י
 
כ
פ
י
 
ע
ל
י
ך
 
ע
ד
 
ע
ב
ר
י
 
ו
ה
ס
ר
ת
י
 
כ
פ
י
 
ו
ר
א
י
ת
 
א
ת
 
א
ח
ר
י
 
ו
פ
נ
י
 
ל
א
 
י
ר
א
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
פ
ס
ל
 
ל
ך
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
כ
ר
א
י
ש
ו
נ
י
ם
 
ו
כ
ת
ב
ת
י
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
א
ת
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ה
י
ו
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
ה
ר
א
י
ש
ו
נ
י
ם
 
א
ש
ר
 
ש
ב
ר
ת
 
ו
ה
ו
י
 
נ
כ
ו
ן
 
ל
ב
ק
ר
 
ו
ע
ל
י
ת
 
ב
ב
ק
ר
 
א
ל
 
ה
ר
 
ס
י
נ
י
 
ו
נ
צ
ב
ת
 
ל
י
 
ש
ם
 
ע
ל
 
ר
א
ש
 
ה
ה
ר
 
ו
א
י
ש
 
ל
א
 
י
ע
ל
ה
 
ע
מ
ך
 
ו
ג
ם
 
א
י
ש
 
א
ל
 
י
ר
א
ה
 
ב
כ
ל
 
ה
ה
ר
 
ו
ג
ם
 
צ
א
ן
 
ו
ב
ק
ר
 
א
ל
 
י
ר
ע
ו
 
א
ל
 
מ
ו
ל
 
ה
ה
ר
 
ה
ה
ו
א
 
ו
י
פ
ס
ל
 
מ
ש
ה
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
כ
ר
א
י
ש
ו
נ
י
ם
 
ו
י
ש
כ
ם
 
ב
ב
ק
ר
 
ו
י
ע
ל
 
א
ל
 
ה
ר
 
ס
י
נ
י
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
ו
י
ק
ח
 
ב
י
ד
ו
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
ו
י
ר
ד
 
י
ה
ו
ה
 
ב
ע
נ
ן
 
ו
י
ת
י
צ
ב
 
ע
מ
ו
 
ש
ם
 
ו
י
ק
ר
א
 
ב
ש
ם
 
י
ה
ו
ה
 
ו
י
ע
ב
ר
 
י
ה
ו
ה
 
ע
ל
 
פ
נ
י
ו
 
ו
י
ק
ר
א
 
י
ה
ו
ה
 
י
ה
ו
ה
 
א
ל
 
ר
ח
ו
ם
 
ו
ח
נ
ו
ן
 
א
ר
ך
 
א
פ
י
ם
 
ו
ר
ב
 
ח
ס
ד
 
ו
א
מ
ת
 
נ
צ
ר
 
ח
ס
ד
 
ל
א
ל
פ
י
ם
 
נ
ש
א
 
ע
ו
ן
 
ו
פ
ש
ע
 
ו
ח
ט
א
ה
 
ו
נ
ק
ה
 
ל
ו
 
י
נ
ק
ה
 
פ
ק
ד
 
ע
ו
ן
 
א
ב
ו
ת
 
ע
ל
 
ב
נ
י
ם
 
ו
ע
ל
 
ב
נ
י
 
ב
נ
י
ם
 
ע
ל
 
ש
ל
י
ש
י
ם
 
ו
ע
ל
 
ר
ב
י
ע
י
ם
 
ו
י
מ
ה
ר
 
מ
ש
ה
 
ו
י
ק
ד
 
א
ר
צ
ה
 
ו
י
ש
ת
ח
ו
י
 
ו
י
א
מ
ר
 
א
ם
 
נ
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
א
ד
נ
י
 
י
ל
ך
 
נ
א
 
א
ד
נ
י
 
ב
ק
ר
ב
נ
ו
 
כ
י
 
ע
ם
 
ק
ש
ה
 
ע
ר
ף
 
ה
ו
א
 
ו
ס
ל
ח
ת
 
ל
ע
ו
נ
נ
ו
 
ו
ל
ח
ט
א
ת
י
נ
ו
 
ו
נ
ח
ל
ת
נ
ו
 
ו
י
א
מ
ר
 
ה
נ
ה
 
א
נ
כ
י
 
כ
ר
ת
 
ב
ר
י
ת
 
נ
ג
ד
 
כ
ל
 
ע
מ
ך
 
א
ע
ש
ה
 
נ
פ
ל
א
ו
ת
 
א
ש
ר
 
ל
א
 
נ
ב
ר
א
ו
 
ב
כ
ל
 
ה
א
ר
ץ
 
ו
ב
כ
ל
 
ה
ג
ו
י
ם
 
ו
ר
א
ה
 
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
א
ת
ה
 
ב
ק
ר
ב
ו
 
א
ת
 
מ
ע
ש
ה
 
י
ה
ו
ה
 
כ
י
 
נ
ו
ר
א
 
ה
ו
א
 
א
ש
ר
 
א
נ
י
 
ע
ש
ה
 
ע
מ
ך
 
ש
מ
ו
ר
 
ל
ך
 
א
ת
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ה
נ
נ
י
 
ג
ר
ש
 
מ
פ
נ
י
ך
 
א
ת
 
ה
כ
נ
ע
נ
י
 
ו
ה
א
מ
ר
י
 
ו
ה
ח
ת
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
כ
ר
ת
 
ב
ר
י
ת
 
ל
י
ו
ש
ב
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ע
ל
י
ו
 
פ
ן
 
י
ה
י
ה
 
ל
מ
ו
ק
ש
 
ב
ק
ר
ב
ך
 
כ
י
 
א
ת
 
מ
ז
ב
ח
ת
י
ה
ם
 
ת
ת
צ
ו
ן
 
ו
מ
צ
ב
ת
י
ה
ם
 
ת
ש
ב
ר
ו
ן
 
ו
א
ש
ר
י
ה
ם
 
ת
כ
ר
ת
ו
ן
 
כ
י
 
ל
א
 
ת
ש
ת
ח
ו
י
 
ל
א
ל
 
א
ח
ר
 
כ
י
 
י
ה
ו
ה
 
ק
נ
א
 
ש
מ
ו
 
א
ל
 
ק
נ
א
 
ה
ו
א
 
פ
ן
 
ת
כ
ר
ת
 
ב
ר
י
ת
 
ל
י
ו
ש
ב
 
ה
א
ר
ץ
 
ו
ז
נ
ו
 
א
ח
ר
י
 
א
ל
ה
י
ה
ם
 
ו
ז
ב
ח
ו
 
ל
א
ל
ה
י
ה
ם
 
ו
ק
ר
א
 
ל
ך
 
ו
א
כ
ל
ת
 
מ
ז
ב
ח
ו
 
ו
ל
ק
ח
ת
 
מ
ב
נ
ת
י
ו
 
ל
ב
נ
י
ך
 
ו
ז
נ
ו
 
ב
נ
ת
י
ו
 
א
ח
ר
י
 
א
ל
ה
י
ה
ן
 
ו
ה
ז
נ
ו
 
א
ת
 
ב
נ
י
ך
 
א
ח
ר
י
 
א
ל
ה
י
ה
ן
 
א
ל
ה
י
 
מ
ס
כ
ה
 
ל
א
 
ת
ע
ש
ה
 
ל
ך
 
א
ת
 
ח
ג
 
ה
מ
צ
ו
ת
 
ת
ש
מ
ר
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
א
כ
ל
 
מ
צ
ו
ת
 
כ
א
ש
ר
 
צ
ו
י
ת
י
ך
 
ל
מ
ו
ע
ד
 
ח
ד
ש
 
ה
א
ב
י
ב
 
כ
י
 
ב
ו
 
י
צ
א
ת
 
מ
מ
צ
ר
י
ם
 
כ
ל
 
פ
ט
ר
 
ר
ח
ם
 
ל
י
 
ו
כ
ל
 
מ
ק
נ
י
ך
 
ת
ז
כ
י
ר
 
פ
ט
ר
 
ש
ו
ר
 
ו
ש
ה
 
ו
פ
ט
ר
 
ח
מ
ו
ר
 
ת
פ
ד
ה
 
ב
ש
ה
 
ו
א
ם
 
ל
א
 
ת
פ
ד
נ
ו
 
ו
ע
ר
פ
ת
ו
 
ו
כ
ל
 
ב
כ
ו
ר
 
א
ד
ם
 
ב
ב
נ
י
ך
 
ת
פ
ד
ה
 
ו
ל
א
 
י
ר
א
ו
 
פ
נ
י
 
ר
ק
י
ם
 
ש
ש
ת
 
י
מ
י
ם
 
ת
ע
ב
ד
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ת
ש
ב
ת
 
ב
ח
ר
י
ש
 
ו
ב
ק
צ
י
ר
 
ת
ש
ב
ת
 
ו
ח
ג
 
ש
ב
ע
ו
ת
 
ת
ע
ש
ה
 
ל
ך
 
ב
כ
ו
ר
י
 
ק
צ
י
ר
 
ח
ט
י
ם
 
ו
ח
ג
 
ה
א
ס
ף
 
ת
ק
ו
פ
ת
 
ה
ש
נ
ה
 
ש
ל
ש
 
פ
ע
מ
י
ם
 
ב
ש
נ
ה
 
י
ר
א
ה
 
כ
ל
 
ז
כ
ו
ר
ך
 
א
ת
 
פ
נ
י
 
ה
א
ר
ו
ן
 
י
ה
ו
ה
 
א
ל
ה
י
 
י
ש
ר
א
ל
 
כ
י
 
א
ו
ר
י
ש
 
ג
ו
י
ם
 
ר
ב
י
ם
 
מ
פ
נ
י
ך
 
ו
ה
ר
ח
ב
ת
י
 
א
ת
 
ג
ב
ו
ל
ך
 
ו
ל
א
 
י
ח
מ
ד
 
א
י
ש
 
א
ת
 
א
ר
צ
ך
 
ב
ה
ע
ל
ו
ת
ך
 
ל
ה
ר
א
ו
ת
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ש
ל
ש
 
פ
ע
מ
י
ם
 
ב
ש
נ
ה
 
ל
א
 
ת
ש
ח
ט
 
ע
ל
 
ח
מ
ץ
 
ד
ם
 
ז
ב
ח
י
 
ו
ל
א
 
י
ל
י
ן
 
ל
ב
ק
ר
 
ז
ב
ח
 
ח
ג
 
ה
פ
ס
ח
 
ר
א
ש
י
ת
 
ב
כ
ו
ר
י
 
א
ד
מ
ת
ך
 
ת
ב
י
א
 
ב
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ב
ש
ל
 
ג
ד
י
 
ב
ח
ל
ב
 
א
מ
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
כ
ת
ב
 
ל
ך
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
כ
י
 
ע
ל
 
פ
י
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
כ
ר
ת
י
 
א
ת
ך
 
ב
ר
י
ת
 
ו
א
ת
 
י
ש
ר
א
ל
 
ו
י
ה
י
 
ש
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ל
ח
ם
 
ל
א
 
א
כ
ל
 
ו
מ
י
ם
 
ל
א
 
ש
ת
ה
 
ו
י
כ
ת
ב
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
א
ת
 
ד
ב
ר
י
 
ה
ב
ר
י
ת
 
ע
ש
ר
ת
 
ה
ד
ב
ר
י
ם
 
ו
י
ה
י
 
ב
ר
ד
ת
 
מ
ש
ה
 
מ
ה
ר
 
ס
י
נ
י
 
ו
ש
נ
י
 
ל
ו
ח
ת
 
ה
ע
ד
ו
ת
 
ב
י
ד
ו
 
ב
ר
ד
ת
ו
 
מ
ן
 
ה
ה
ר
 
ו
מ
ש
ה
 
ל
א
 
י
ד
ע
 
כ
י
 
ק
ר
ן
 
ע
ו
ר
 
פ
נ
י
ו
 
ב
ד
ב
ר
ו
 
א
ת
ו
 
ו
י
ר
א
 
א
ה
ר
ן
 
ו
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
מ
ש
ה
 
ו
ה
נ
ה
 
ק
ר
ן
 
ע
ו
ר
 
פ
נ
י
ו
 
ו
י
י
ר
א
ו
 
מ
ג
ש
ת
 
א
ל
י
ו
 
ו
י
ק
ר
א
 
א
ל
י
ה
ם
 
מ
ש
ה
 
ו
י
ש
ב
ו
 
א
ל
י
ו
 
א
ה
ר
ן
 
ו
כ
ל
 
ה
נ
ש
י
א
י
ם
 
ב
ע
ד
ה
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
י
ה
ם
 
ו
א
ח
ר
י
 
כ
ן
 
נ
ג
ש
ו
 
א
ל
י
ו
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
צ
ו
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ת
ו
 
ב
ה
ר
 
ס
י
נ
י
 
ו
י
כ
ל
 
מ
ש
ה
 
מ
ד
ב
ר
 
א
ת
ם
 
ו
י
ת
ן
 
ע
ל
 
פ
נ
י
ו
 
מ
ס
ו
ה
 
ו
ב
ב
א
 
מ
ש
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
ד
ב
ר
 
א
ת
ו
 
י
ס
י
ר
 
א
ת
 
ה
מ
ס
ו
ה
 
ע
ד
 
צ
א
ת
ו
 
ו
י
צ
א
 
ו
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
כ
ל
 
א
ש
ר
 
י
צ
ו
ה
ו
 
ו
ר
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
פ
נ
י
 
מ
ש
ה
 
כ
י
 
ק
ר
ן
 
ע
ו
ר
 
פ
נ
י
 
מ
ש
ה
 
ו
ה
ש
י
ב
 
א
ת
 
ה
מ
ס
ו
ה
 
ע
ל
 
פ
נ
י
ו
 
ע
ד
 
ב
א
ו
 
ל
ד
ב
ר
 
א
ת
ו
 
ו
י
ק
ה
ל
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
ל
ה
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
א
ת
ם
 
ש
ש
ת
 
י
מ
י
ם
 
י
ע
ש
ה
 
מ
ל
א
כ
ה
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
י
ה
י
ה
 
ל
כ
ם
 
ק
ד
ש
 
ש
ב
ת
 
ש
ב
ת
ו
ן
 
ל
י
ה
ו
ה
 
כ
ל
 
ה
ע
ש
ה
 
ב
ו
 
מ
ל
א
כ
ה
 
י
ו
מ
ת
 
ל
א
 
ת
ב
ע
י
ר
ו
 
א
ש
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ב
י
ו
ם
 
ה
ש
ב
ת
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
א
מ
ר
 
ק
ח
ו
 
מ
א
ת
כ
ם
 
ת
ר
ו
מ
ה
 
ל
י
ה
ו
ה
 
כ
ל
 
נ
ד
י
ב
 
ל
ב
ו
 
י
ב
י
א
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ז
ה
ב
 
כ
ס
ף
 
ו
נ
ח
ש
ת
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
ו
ע
ז
י
ם
 
ו
ע
ו
ר
ת
 
א
י
ל
י
ם
 
מ
א
ד
מ
י
ם
 
ו
ע
ו
ר
ת
 
ת
ח
ש
י
ם
 
ו
ע
צ
י
 
ש
ט
י
ם
 
ו
ש
מ
ן
 
ל
מ
א
ו
ר
 
ו
ב
ש
מ
י
ם
 
ל
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
ל
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ו
א
ב
נ
י
 
ש
ה
ם
 
ו
א
ב
נ
י
 
מ
ל
א
י
ם
 
ל
א
פ
ו
ד
 
ו
ל
ח
ש
ן
 
ו
כ
ל
 
ח
כ
ם
 
ל
ב
 
ב
כ
ם
 
י
ב
ו
א
 
ו
ע
ש
ה
 
א
ת
 
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
א
ה
ל
ו
 
ו
א
ת
 
מ
כ
ס
ה
ו
 
ו
א
ת
 
ק
ר
ס
י
ו
 
ו
א
ת
 
ק
ר
ש
י
ו
 
ו
א
ת
 
ב
ר
י
ח
י
ו
 
ו
א
ת
 
ע
מ
ו
ד
י
ו
 
ו
א
ת
 
א
ד
נ
י
ו
 
א
ת
 
ה
א
ר
ו
ן
 
ו
א
ת
 
ב
ד
י
ו
 
ו
א
ת
 
ה
כ
פ
ר
ת
 
ו
א
ת
 
פ
ר
כ
ת
 
ה
מ
ס
ך
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
א
ת
 
ב
ד
י
ו
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
א
ת
 
ל
ח
ם
 
ה
פ
נ
י
ם
 
א
ת
 
מ
נ
ו
ר
ת
 
ה
מ
א
ו
ר
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ה
 
ו
א
ת
 
ש
מ
ן
 
ה
מ
א
ו
ר
 
א
ת
 
מ
ז
ב
ח
 
ה
ק
ט
ר
ת
 
ו
א
ת
 
ב
ד
י
ו
 
ו
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
א
ת
 
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ו
א
ת
 
מ
ס
ך
 
ה
פ
ת
ח
 
ל
פ
ת
ח
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
מ
כ
ב
ר
 
ה
נ
ח
ש
ת
 
א
ש
ר
 
ל
ו
 
ו
א
ת
 
ב
ד
י
ו
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
א
ת
 
ק
ל
ע
י
 
ה
ח
צ
ר
 
ו
א
ת
 
ע
מ
ו
ד
י
ה
 
ו
א
ת
 
א
ד
נ
י
ה
 
ו
א
ת
 
מ
ס
ך
 
ש
ע
ר
 
ה
ח
צ
ר
 
א
ת
 
י
ת
ד
ו
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
י
ת
ד
ו
ת
 
ה
ח
צ
ר
 
ו
א
ת
 
מ
י
ת
ר
י
ה
ם
 
א
ת
 
ב
ג
ד
י
 
ה
ש
ר
ד
 
ל
ש
ר
ת
 
ב
ק
ד
ש
 
ו
א
ת
 
ב
ג
ד
י
 
ה
ק
ד
ש
 
ל
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
א
ת
 
ב
ג
ד
י
 
ב
נ
י
ו
 
ל
כ
ה
ן
 
ו
י
צ
א
ו
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ל
פ
נ
י
 
מ
ש
ה
 
ו
י
ב
י
א
ו
 
כ
ל
 
א
י
ש
 
א
ש
ר
 
נ
ש
א
ו
 
ל
ב
ו
 
ו
כ
ל
 
א
י
ש
 
א
ש
ר
 
נ
ד
ב
ה
 
ר
ו
ח
ו
 
א
ת
ו
 
ה
ב
י
א
ו
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ל
מ
ל
א
כ
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
כ
ל
 
ע
ב
ד
ת
ו
 
ו
ל
ב
ג
ד
י
 
ה
ק
ד
ש
 
ו
י
ב
י
א
ו
 
ה
א
נ
ש
י
ם
 
ע
ל
 
ה
נ
ש
י
ם
 
כ
ל
 
נ
ד
י
ב
 
ל
ב
 
ה
ב
י
א
 
ח
ח
 
ו
נ
ז
ם
 
ט
ב
ע
ת
 
ע
ג
י
ל
 
ו
כ
ו
מ
ז
 
כ
ל
 
כ
ל
י
 
ז
ה
ב
 
ו
כ
ל
 
א
ש
ר
 
ה
נ
י
ף
 
ת
נ
ו
פ
ת
 
ז
ה
ב
 
ל
י
ה
ו
ה
 
ו
כ
ל
 
א
י
ש
 
א
ש
ר
 
נ
מ
צ
א
 
א
ת
ו
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
ו
ע
ז
י
ם
 
ו
ע
ו
ר
ת
 
א
י
ל
י
ם
 
מ
א
ד
מ
י
ם
 
ו
ע
ו
ר
ת
 
ת
ח
ש
י
ם
 
ה
ב
י
א
ו
 
ו
כ
ל
 
מ
ר
י
ם
 
ת
ר
ו
מ
ת
 
כ
ס
ף
 
ו
נ
ח
ש
ת
 
ה
ב
י
א
ו
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ו
כ
ל
 
א
ש
ר
 
נ
מ
צ
א
 
א
ת
ו
 
ע
צ
י
 
ש
ט
י
ם
 
ל
מ
ל
א
כ
ת
 
ה
ע
ב
ד
ה
 
ה
ב
י
א
ו
 
ו
כ
ל
 
א
ש
ה
 
ח
כ
מ
ת
 
ל
ב
 
ב
י
ד
ה
 
ט
ו
ה
 
ו
י
ב
י
א
ו
 
מ
ט
ו
ה
 
א
ת
 
ה
ת
כ
ל
ת
 
ו
א
ת
 
ה
א
ר
ג
מ
ן
 
ו
א
ת
 
ה
ת
ו
ל
ע
ת
 
ה
ש
נ
י
 
ו
א
ת
 
ה
ש
ש
 
ו
כ
ל
 
ה
נ
ש
י
ם
 
א
ש
ר
 
נ
ש
א
 
ל
ב
ה
ן
 
א
ת
ה
ן
 
ב
ח
כ
מ
ה
 
ט
ו
ו
 
א
ת
 
ה
ע
ז
י
ם
 
ו
ה
נ
ש
י
א
י
ם
 
ה
ב
י
א
ו
 
א
ת
 
א
ב
נ
י
 
ה
ש
ה
ם
 
ו
א
ת
 
א
ב
נ
י
 
ה
מ
ל
א
י
ם
 
ל
א
פ
ו
ד
 
ו
ל
ח
ש
ן
 
ו
א
ת
 
ה
ב
ש
מ
י
ם
 
ו
א
ת
 
ש
מ
ן
 
ה
מ
א
ו
ר
 
ל
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
ל
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ו
כ
ל
 
א
י
ש
 
ו
א
ש
ה
 
א
ש
ר
 
נ
ד
ב
 
א
ת
ם
 
ל
ב
ם
 
ל
ה
ב
י
א
 
ל
כ
ל
 
ה
מ
ל
א
כ
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
ב
י
ד
 
מ
ש
ה
 
ה
ב
י
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
נ
ד
ב
ה
 
ל
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ר
א
ו
 
ק
ר
א
 
י
ה
ו
ה
 
ב
ש
ם
 
ב
צ
ל
א
ל
 
ב
ן
 
א
ו
ר
י
 
ב
ן
 
ח
ו
ר
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
ו
י
מ
ל
א
 
א
ת
ו
 
ר
ו
ח
 
א
ל
ה
י
ם
 
ב
ח
כ
מ
ה
 
ו
ב
ת
ב
ו
נ
ה
 
ו
ב
ד
ע
ת
 
ו
ב
כ
ל
 
מ
ל
א
כ
ה
 
ו
ל
ח
ש
ב
 
מ
ח
ש
ב
ו
ת
 
ל
ע
ש
ו
ת
 
ב
ז
ה
ב
 
ו
ב
כ
ס
ף
 
ו
ב
נ
ח
ש
ת
 
ו
ב
ח
ר
ש
ת
 
א
ב
ן
 
ל
מ
ל
א
ת
 
ו
ב
ח
ר
ש
ת
 
ע
ץ
 
ל
ע
ש
ו
ת
 
ב
כ
ל
 
מ
ל
א
כ
ת
 
מ
ח
ש
ב
ו
ת
 
ו
ל
ה
ו
ר
ו
ת
 
נ
ת
ן
 
ב
ל
ב
ו
 
ה
ו
א
 
ו
א
ה
ל
י
א
ב
 
ב
ן
 
א
ח
י
ס
מ
ך
 
ל
מ
ט
ה
 
ד
ן
 
מ
ל
א
 
א
ת
ם
 
ח
כ
מ
ת
 
ל
ב
 
ל
ע
ש
ו
ת
 
ב
כ
ל
 
מ
ל
א
כ
ת
 
ח
ר
ש
 
ו
ח
ש
ב
 
ו
ר
ק
ם
 
ב
ת
כ
ל
ת
 
ו
ב
א
ר
ג
מ
ן
 
ו
ב
ת
ו
ל
ע
ת
 
ה
ש
נ
י
 
ו
ב
ש
ש
 
ו
א
ר
ג
 
ע
ש
ו
 
כ
ל
 
ה
מ
ל
א
כ
ה
 
ו
ח
ש
ב
י
 
מ
ח
ש
ב
ו
ת
 
ו
ע
ש
ה
 
ב
צ
ל
א
ל
 
ו
א
ה
ל
י
א
ב
 
ו
כ
ל
 
א
י
ש
 
ח
כ
ם
 
ל
ב
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ב
ה
ם
 
ח
כ
מ
ה
 
ו
ת
ב
ו
נ
ה
 
ל
ד
ע
ת
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ת
 
ה
ק
ד
ש
 
ל
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
י
ק
ר
א
 
מ
ש
ה
 
א
ל
 
ב
צ
ל
א
ל
 
ו
א
ל
 
א
ה
ל
י
א
ב
 
ו
א
ל
 
כ
ל
 
א
י
ש
 
ח
כ
ם
 
ל
ב
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ח
כ
מ
ה
 
ב
ל
ב
ו
 
כ
ל
 
א
ש
ר
 
נ
ש
א
ו
 
ל
ב
ו
 
ל
ק
ר
ב
 
א
ל
 
ה
מ
ל
א
כ
ה
 
ל
ע
ש
ו
ת
 
א
ת
ה
 
ו
י
ק
ח
ו
 
מ
ל
פ
נ
י
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ה
ת
ר
ו
מ
ה
 
א
ש
ר
 
ה
ב
י
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
מ
ל
א
כ
ת
 
ע
ב
ד
ת
 
ה
ק
ד
ש
 
ל
ע
ש
ו
ת
 
א
ת
ה
 
ו
ה
ם
 
ה
ב
י
א
ו
 
א
ל
י
ו
 
ע
ו
ד
 
נ
ד
ב
ה
 
ב
ב
ק
ר
 
ב
ב
ק
ר
 
ו
י
ב
י
א
ו
 
כ
ל
 
ה
ח
כ
מ
י
ם
 
ה
ע
ש
י
ם
 
א
ת
 
כ
ל
 
מ
ל
א
כ
ת
 
ה
ק
ד
ש
 
א
י
ש
 
א
י
ש
 
מ
מ
ל
א
כ
ת
ו
 
א
ש
ר
 
ה
ם
 
ע
ש
י
ם
 
ו
י
ד
ב
ר
ו
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
מ
ר
ב
י
ם
 
ה
ע
ם
 
ל
ה
ב
י
א
 
מ
ד
י
 
ה
ע
ב
ד
ה
 
ל
מ
ל
א
כ
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
א
ת
ה
 
ו
י
צ
ו
 
מ
ש
ה
 
ו
י
ע
ב
ר
ו
 
ק
ו
ל
 
ב
מ
ח
נ
ה
 
ל
א
מ
ר
 
א
י
ש
 
ו
א
ש
ה
 
א
ל
 
י
ע
ש
ה
 
ע
ו
ד
 
מ
ל
א
כ
ה
 
ל
ת
ר
ו
מ
ת
 
ה
ק
ד
ש
 
ו
י
כ
ל
 
ה
ע
ם
 
מ
ה
ב
י
א
 
ו
ה
מ
ל
א
כ
ה
 
ה
י
ת
ה
 
ד
י
ם
 
ל
כ
ל
 
ה
מ
ל
א
כ
ה
 
ל
ע
ש
ו
ת
 
א
ת
ה
 
ו
ה
ו
ת
י
ר
ו
 
ו
י
ע
ש
ו
 
כ
ל
 
ח
כ
מ
י
 
ל
ב
 
ב
ע
ש
א
י
 
ה
מ
ל
א
כ
ה
 
א
ת
 
ה
מ
ש
כ
ן
 
ע
ש
ו
 
ע
ש
ר
 
י
ר
י
ע
ו
ת
 
ש
ש
 
מ
ש
ז
ר
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
כ
ר
ו
ב
י
ם
 
מ
ע
ש
ה
 
ח
ש
ב
 
ע
ש
ה
 
א
ת
ם
 
א
ר
ך
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ש
מ
נ
ה
 
ו
ע
ש
ר
י
ם
 
ב
א
מ
ה
 
ו
ר
ח
ב
 
א
ר
ב
ע
 
ב
א
מ
ה
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
מ
ד
ה
 
א
ח
ת
 
ל
כ
ל
 
ה
י
ר
י
ע
ו
ת
 
ו
י
ח
ב
ר
 
א
ת
 
ח
מ
ש
 
ה
י
ר
י
ע
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ו
ח
מ
ש
 
ה
י
ר
י
ע
ו
ת
 
ח
ב
ר
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ו
י
ע
ש
 
ל
ל
א
ו
ת
 
ת
כ
ל
ת
 
ע
ל
 
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ב
ק
צ
ה
 
ב
מ
ח
ב
ר
ת
 
ו
כ
ן
 
ע
ש
ה
 
ב
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
ק
צ
ו
נ
ה
 
ב
מ
ח
ב
ר
ת
 
ה
ש
נ
י
ת
 
ח
מ
ש
י
ם
 
ל
ל
א
ו
ת
 
ע
ש
ה
 
ב
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ו
ח
מ
ש
י
ם
 
ל
ל
א
ו
ת
 
ע
ש
ה
 
ב
ק
צ
ה
 
ה
י
ר
י
ע
ה
 
א
ש
ר
 
ב
מ
ח
ב
ר
ת
 
ה
ש
נ
י
ת
 
מ
ק
ב
ל
ו
ת
 
ה
ל
ל
א
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ו
י
ע
ש
 
ח
מ
ש
י
ם
 
ק
ר
ס
י
 
ז
ה
ב
 
ו
י
ח
ב
ר
 
א
ת
 
ה
י
ר
י
ע
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
ב
ק
ר
ס
י
ם
 
ו
י
ה
י
 
ה
מ
ש
כ
ן
 
א
ח
ד
 
ו
י
ע
ש
 
י
ר
י
ע
ו
ת
 
ע
ז
י
ם
 
ל
א
ה
ל
 
ע
ל
 
ה
מ
ש
כ
ן
 
ע
ש
ת
ה
 
ע
ש
ר
ה
 
י
ר
י
ע
ו
ת
 
ע
ש
ה
 
א
ת
ם
 
א
ר
ך
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ש
ל
ש
י
ם
 
ב
א
מ
ה
 
ו
א
ר
ב
ע
 
א
מ
ו
ת
 
ר
ח
ב
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
מ
ד
ה
 
א
ח
ת
 
ל
ע
ש
ת
ה
 
ע
ש
ר
ה
 
ה
י
ר
י
ע
ו
ת
 
ו
י
ח
ב
ר
 
א
ת
 
ח
מ
ש
 
ה
י
ר
י
ע
ו
ת
 
ל
ב
ד
 
ו
א
ת
 
ש
ש
 
ה
י
ר
י
ע
ו
ת
 
ל
ב
ד
 
ו
י
ע
ש
 
ל
ל
א
ו
ת
 
ח
מ
ש
י
ם
 
ע
ל
 
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
א
ח
ת
 
ה
ק
צ
ו
נ
ה
 
ב
מ
ח
ב
ר
ת
 
ו
ח
מ
ש
י
ם
 
ל
ל
א
ו
ת
 
ע
ש
ה
 
ע
ל
 
ש
פ
ת
 
ה
י
ר
י
ע
ה
 
ה
ח
ב
ר
ת
 
ה
ש
נ
י
ת
 
ו
י
ע
ש
 
ק
ר
ס
י
 
נ
ח
ש
ת
 
ח
מ
ש
י
ם
 
ל
ח
ב
ר
 
א
ת
 
ה
א
ה
ל
 
ל
ה
י
ו
ת
 
א
ח
ד
 
ו
י
ע
ש
 
מ
כ
ס
ה
 
ל
א
ה
ל
 
ע
ו
ר
ת
 
א
י
ל
י
ם
 
מ
א
ד
מ
י
ם
 
ו
מ
כ
ס
ה
 
ע
ו
ר
ת
 
ת
ח
ש
י
ם
 
מ
ל
מ
ע
ל
ה
 
ו
י
ע
ש
 
א
ת
 
ה
ק
ר
ש
י
ם
 
ל
מ
ש
כ
ן
 
ע
צ
י
 
ש
ט
י
ם
 
ע
מ
ד
י
ם
 
ע
ש
ר
 
א
מ
ו
ת
 
א
ר
ך
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
א
מ
ה
 
ו
ח
צ
י
 
ה
א
מ
ה
 
ר
ח
ב
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ש
ת
י
 
י
ד
ו
ת
 
ל
ק
ר
ש
 
ה
א
ח
ד
 
מ
ש
ל
ב
ו
ת
 
א
ח
ת
 
א
ל
 
א
ח
ת
 
כ
ן
 
ע
ש
ה
 
ל
כ
ל
 
ק
ר
ש
י
 
ה
מ
ש
כ
ן
 
ו
י
ע
ש
 
א
ת
 
ה
ק
ר
ש
י
ם
 
ל
מ
ש
כ
ן
 
ע
ש
ר
י
ם
 
ק
ר
ש
י
ם
 
ל
פ
א
ת
 
נ
ג
ב
ה
 
ת
י
מ
נ
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ד
נ
י
 
כ
ס
ף
 
ע
ש
ה
 
ת
ח
ת
 
ע
ש
ר
י
ם
 
ה
ק
ר
ש
י
ם
 
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ל
ש
ת
י
 
י
ת
ד
ת
י
ו
 
ו
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ל
ש
ת
י
 
י
ת
ד
ת
י
ו
 
ו
ל
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ה
ש
נ
י
ת
 
ל
פ
א
ת
 
צ
פ
ו
נ
ה
 
ע
ש
ה
 
ע
ש
ר
י
ם
 
ק
ר
ש
י
ם
 
ו
א
ר
ב
ע
י
ם
 
א
ד
נ
י
ה
ם
 
כ
ס
ף
 
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ו
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ו
ל
י
ר
כ
ת
י
 
ה
מ
ש
כ
ן
 
י
מ
ה
 
ע
ש
ה
 
ש
ש
ה
 
ק
ר
ש
י
ם
 
ו
ש
נ
י
 
ק
ר
ש
י
ם
 
ע
ש
ה
 
ל
מ
ק
צ
ע
ו
ת
 
ה
מ
ש
כ
ן
 
ב
י
ר
כ
ת
י
ם
 
ו
ה
י
ו
 
ת
א
מ
י
ם
 
מ
ל
מ
ט
ה
 
י
ח
ד
ו
 
ה
י
ו
 
ת
א
מ
י
ם
 
א
ל
 
ר
א
ש
ו
 
א
ל
 
ה
ט
ב
ע
ת
 
ה
א
ח
ת
 
כ
ן
 
ע
ש
ה
 
ל
ש
נ
י
ה
ם
 
ל
ש
נ
י
 
ה
מ
ק
צ
ע
ו
ת
 
ו
ה
י
ו
 
ש
מ
נ
ה
 
ק
ר
ש
י
ם
 
ו
א
ד
נ
י
ה
ם
 
כ
ס
ף
 
ש
ש
ה
 
ע
ש
ר
 
א
ד
נ
י
ם
 
ש
נ
י
 
א
ד
נ
י
ם
 
ש
נ
י
 
א
ד
נ
י
ם
 
ת
ח
ת
 
ה
ק
ר
ש
 
ה
א
ח
ד
 
ו
י
ע
ש
ו
 
ב
ר
י
ח
י
 
ע
צ
י
 
ש
ט
י
ם
 
ח
מ
ש
ה
 
ל
ק
ר
ש
י
 
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ה
א
ח
ד
 
ו
ח
מ
ש
ה
 
ב
ר
י
ח
י
ם
 
ל
ק
ר
ש
י
 
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ה
ש
נ
י
ת
 
ו
ח
מ
ש
ה
 
ב
ר
י
ח
י
ם
 
ל
ק
ר
ש
י
 
צ
ל
ע
 
ה
מ
ש
כ
ן
 
ל
י
ר
כ
ת
י
ם
 
י
מ
ה
 
ו
י
ע
ש
 
א
ת
 
ה
ב
ר
י
ח
 
ה
ת
י
כ
ו
ן
 
ל
ב
ר
ח
 
ב
ת
ו
ך
 
ה
ק
ר
ש
י
ם
 
מ
ן
 
ה
ק
צ
ה
 
א
ל
 
ה
ק
צ
ה
 
ו
א
ת
 
ה
ק
ר
ש
י
ם
 
צ
פ
ה
 
ז
ה
ב
 
ו
א
ת
 
ט
ב
ע
ת
י
ה
ם
 
ע
ש
ה
 
ז
ה
ב
 
ב
ת
י
ם
 
ל
ב
ר
י
ח
י
ם
 
ו
י
צ
ף
 
א
ת
 
ה
ב
ר
י
ח
י
ם
 
ז
ה
ב
 
ו
י
ע
ש
 
פ
ר
כ
ת
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
מ
ע
ש
ה
 
ח
ש
ב
 
ע
ש
ה
 
א
ת
ה
 
כ
ר
ו
ב
י
ם
 
ו
י
ע
ש
 
ל
ה
 
א
ר
ב
ע
ה
 
ע
מ
ו
ד
י
 
ש
ט
י
ם
 
ו
י
צ
פ
ם
 
ז
ה
ב
 
ו
ו
י
ה
ם
 
ז
ה
ב
 
ו
י
צ
ק
 
ל
ה
ם
 
א
ר
ב
ע
ה
 
א
ד
נ
י
 
כ
ס
ף
 
ו
י
ע
ש
 
מ
ס
ך
 
ל
פ
ת
ח
 
ה
א
ה
ל
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
מ
ע
ש
ה
 
ר
ק
ם
 
א
ת
 
ע
מ
ו
ד
י
ו
 
ח
מ
ש
ה
 
ו
א
ת
 
ו
ו
י
ה
ם
 
ו
צ
פ
ה
 
ר
א
ש
י
ה
ם
 
ו
ח
ש
ק
י
ה
ם
 
ז
ה
ב
 
ו
א
ד
נ
י
ה
ם
 
ח
מ
ש
ה
 
נ
ח
ש
ת
 
ו
י
ע
ש
 
ב
צ
ל
א
ל
 
א
ת
 
ה
א
ר
ו
ן
 
ע
צ
י
 
ש
ט
י
ם
 
א
מ
ת
י
ם
 
ו
ח
צ
י
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ר
ח
ב
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ק
ו
מ
ת
ו
 
ו
י
צ
פ
ה
ו
 
ז
ה
ב
 
ט
ה
ו
ר
 
מ
ב
י
ת
 
ו
מ
ח
ו
ץ
 
ו
י
ע
ש
 
ל
ו
 
ז
ר
 
ז
ה
ב
 
ס
ב
י
ב
 
ו
י
צ
ק
 
ל
ו
 
א
ר
ב
ע
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ע
ל
 
א
ר
ב
ע
 
פ
ע
מ
ת
י
ו
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
 
ה
א
ח
ד
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
 
ה
ש
נ
י
 
ו
י
ע
ש
 
ב
ד
י
 
ע
צ
י
 
ש
ט
י
ם
 
ו
י
צ
ף
 
א
ת
ם
 
ז
ה
ב
 
ו
י
ב
א
 
א
ת
 
ה
ב
ד
י
ם
 
ב
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
ת
 
ה
א
ר
ו
ן
 
ל
ש
א
ת
 
א
ת
 
ה
א
ר
ו
ן
 
ב
ה
ם
 
ו
י
ע
ש
 
כ
פ
ר
ת
 
ז
ה
ב
 
ט
ה
ו
ר
 
א
מ
ת
י
ם
 
ו
ח
צ
י
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ר
ח
ב
ו
 
ו
י
ע
ש
 
ש
נ
י
 
כ
ר
ו
ב
י
ם
 
ז
ה
ב
 
מ
ק
ש
ה
 
ע
ש
ה
 
א
ת
ם
 
מ
ש
נ
י
 
ק
צ
ו
ת
 
ה
כ
פ
ר
ת
 
כ
ר
ו
ב
 
א
ח
ד
 
מ
ק
צ
ה
 
מ
ז
ה
 
ו
כ
ר
ו
ב
 
א
ח
ד
 
מ
ק
צ
ה
 
מ
ז
ה
 
מ
ן
 
ה
כ
פ
ר
ת
 
ע
ש
ה
 
א
ת
 
ה
כ
ר
ו
ב
י
ם
 
מ
ש
נ
י
 
ק
צ
ת
י
ו
 
ו
ה
י
ו
 
ה
כ
ר
ו
ב
י
ם
 
פ
ר
ש
י
 
כ
נ
פ
י
ם
 
ל
מ
ע
ל
ה
 
ס
כ
כ
י
ם
 
ב
כ
נ
פ
י
ה
ם
 
ע
ל
 
ה
כ
פ
ר
ת
 
ו
פ
נ
י
ה
ם
 
א
ח
ד
 
א
ל
 
א
ח
ד
 
א
ל
 
ה
כ
פ
ר
ת
 
ה
י
ו
 
פ
נ
י
 
ה
כ
ר
ו
ב
י
ם
 
ו
י
ע
ש
 
א
ת
 
ה
ש
ל
ח
ן
 
ע
צ
י
 
ש
ט
י
ם
 
א
מ
ת
י
ם
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ר
ח
ב
ו
 
ו
א
מ
ה
 
ו
ח
צ
י
 
ק
ו
מ
ת
ו
 
ו
י
צ
ף
 
א
ת
ו
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
י
ע
ש
 
ל
ו
 
ז
ר
 
ז
ה
ב
 
ס
ב
י
ב
 
ו
י
ע
ש
 
ל
ו
 
מ
ס
ג
ר
ת
 
ט
פ
ח
 
ס
ב
י
ב
 
ו
י
ע
ש
 
ז
ר
 
ז
ה
ב
 
ל
מ
ס
ג
ר
ת
ו
 
ס
ב
י
ב
 
ו
י
צ
ק
 
א
ר
ב
ע
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
י
ת
ן
 
א
ת
 
ה
ט
ב
ע
ו
ת
 
ע
ל
 
א
ר
ב
ע
 
ה
פ
א
ו
ת
 
א
ש
ר
 
ל
א
ר
ב
ע
 
ר
ג
ל
י
ו
 
ל
ע
מ
ת
 
ה
מ
ס
ג
ר
ת
 
ה
י
ו
 
ה
ט
ב
ע
ו
ת
 
ב
ת
י
ם
 
ל
ב
ד
י
ם
 
ל
ש
א
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
י
ע
ש
 
א
ת
 
ה
ב
ד
י
ם
 
ע
צ
י
 
ש
ט
י
ם
 
ו
י
צ
ף
 
א
ת
ם
 
ז
ה
ב
 
ל
ש
א
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
י
ע
ש
 
א
ת
 
ה
כ
ל
י
ם
 
א
ש
ר
 
ע
ל
 
ה
ש
ל
ח
ן
 
א
ת
 
ק
ע
ר
ת
י
ו
 
ו
א
ת
 
כ
פ
ת
י
ו
 
ו
א
ת
 
מ
נ
ק
י
ת
י
ו
 
ו
א
ת
 
ה
ק
ש
ו
ת
 
א
ש
ר
 
י
ו
ס
ך
 
ב
ה
ם
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
י
ע
ש
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ז
ה
ב
 
ט
ה
ו
ר
 
מ
ק
ש
ה
 
ע
ש
ה
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
י
ר
כ
י
ה
 
ק
נ
י
ה
 
ג
ב
ע
י
ה
 
כ
פ
ת
ר
י
ה
 
ו
פ
ר
ח
י
ה
 
מ
מ
נ
ה
 
ה
י
ו
 
ו
ש
ש
ה
 
ק
נ
י
ם
 
י
ו
צ
א
י
ם
 
מ
צ
ד
י
ה
 
ש
ל
ש
ה
 
ק
נ
י
 
מ
נ
ו
ר
ה
 
מ
צ
ד
ה
 
ה
א
ח
ד
 
ו
ש
ל
ש
ה
 
ק
נ
י
 
מ
נ
ו
ר
ה
 
מ
צ
ד
ה
 
ה
ש
נ
י
 
ש
ל
ש
ה
 
ג
ב
ע
י
ם
 
מ
ש
ק
ד
י
ם
 
ב
ק
נ
ה
 
א
ח
ד
 
כ
פ
ת
ר
 
ו
פ
ר
ח
 
ו
ש
ל
ש
ה
 
ג
ב
ע
י
ם
 
מ
ש
ק
ד
י
ם
 
ב
ק
נ
ה
 
א
ח
ד
 
כ
פ
ת
ר
 
ו
פ
ר
ח
 
כ
ן
 
ל
ש
ש
ת
 
ה
ק
נ
י
ם
 
ה
י
ו
צ
א
י
ם
 
מ
ן
 
ה
מ
נ
ו
ר
ה
 
ו
ב
מ
נ
ו
ר
ה
 
א
ר
ב
ע
ה
 
ג
ב
ע
י
ם
 
מ
ש
ק
ד
י
ם
 
כ
פ
ת
ר
י
ה
 
ו
פ
ר
ח
י
ה
 
ו
כ
פ
ת
ר
 
ת
ח
ת
 
ש
נ
י
 
ה
ק
נ
י
ם
 
מ
מ
נ
ה
 
ו
כ
פ
ת
ר
 
ת
ח
ת
 
ש
נ
י
 
ה
ק
נ
י
ם
 
מ
מ
נ
ה
 
ו
כ
פ
ת
ר
 
ת
ח
ת
 
ש
נ
י
 
ה
ק
נ
י
ם
 
מ
מ
נ
ה
 
ל
ש
ש
ת
 
ה
ק
נ
י
ם
 
ה
י
צ
א
י
ם
 
מ
מ
נ
ה
 
כ
פ
ת
ר
י
ה
ם
 
ו
ק
נ
ו
ת
ם
 
מ
מ
נ
ה
 
ה
י
ו
 
כ
ל
ה
 
מ
ק
ש
ה
 
א
ח
ד
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
י
ע
ש
 
א
ת
 
נ
ר
ת
י
ה
 
ש
ב
ע
ה
 
ו
מ
ל
ק
ח
י
ה
 
ו
מ
ח
ת
י
ת
י
ה
 
ז
ה
ב
 
ט
ה
ו
ר
 
כ
כ
ר
 
ז
ה
ב
 
ט
ה
ו
ר
 
ע
ש
ה
 
א
ת
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ה
 
ו
י
ע
ש
 
א
ת
 
מ
ז
ב
ח
 
ה
ק
ט
ר
ת
 
ע
צ
י
 
ש
ט
י
ם
 
א
מ
ה
 
א
ר
כ
ו
 
ו
א
מ
ה
 
ר
ח
ב
ו
 
ר
ב
ו
ע
 
ו
א
מ
ת
י
ם
 
ק
ו
מ
ת
ו
 
מ
מ
נ
ו
 
ה
י
ו
 
ק
ר
נ
ת
י
ו
 
ו
י
צ
ף
 
א
ת
ו
 
ז
ה
ב
 
ט
ה
ו
ר
 
א
ת
 
ג
ג
ו
 
ו
א
ת
 
ק
י
ר
ת
י
ו
 
ס
ב
י
ב
 
ו
א
ת
 
ק
ר
נ
ת
י
ו
 
ו
י
ע
ש
 
ל
ו
 
ז
ר
 
ז
ה
ב
 
ס
ב
י
ב
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ע
ש
ה
 
ל
ו
 
מ
ת
ח
ת
 
ל
ז
ר
ו
 
ע
ל
 
ש
ת
י
 
צ
ל
ע
ת
י
ו
 
ע
ל
 
ש
נ
י
 
צ
ד
י
ו
 
ל
ב
ת
י
ם
 
ל
ב
ד
י
ם
 
ל
ש
א
ת
 
א
ת
ו
 
ב
ה
ם
 
ו
י
ע
ש
 
א
ת
 
ה
ב
ד
י
ם
 
ע
צ
י
 
ש
ט
י
ם
 
ו
י
צ
ף
 
א
ת
ם
 
ז
ה
ב
 
ו
י
ע
ש
 
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ק
ד
ש
 
ו
א
ת
 
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ט
ה
ו
ר
 
מ
ע
ש
ה
 
ר
ק
ח
 
ו
י
ע
ש
 
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ע
צ
י
 
ש
ט
י
ם
 
ח
מ
ש
 
א
מ
ו
ת
 
א
ר
ך
 
ו
ח
מ
ש
 
א
מ
ו
ת
 
ר
ח
ב
 
ו
ש
ל
ש
 
א
מ
ו
ת
 
ק
ו
מ
ת
ו
 
ו
י
ע
ש
 
ק
ר
נ
ת
י
ו
 
ע
ל
 
א
ר
ב
ע
 
פ
נ
ת
י
ו
 
מ
מ
נ
ו
 
ה
י
ו
 
ק
ר
נ
ת
י
ו
 
ו
י
צ
ף
 
א
ת
ו
 
נ
ח
ש
ת
 
ו
י
ע
ש
 
א
ת
 
כ
ל
 
כ
ל
י
 
ה
מ
ז
ב
ח
 
א
ת
 
ה
ס
י
ר
ו
ת
 
ו
א
ת
 
ה
י
ע
י
ם
 
ו
א
ת
 
ה
מ
ז
ר
ק
ו
ת
 
ו
א
ת
 
ה
מ
ז
ל
ג
ו
ת
 
ו
א
ת
 
ה
מ
ח
ת
ו
ת
 
כ
ל
 
כ
ל
י
ו
 
ע
ש
ה
 
נ
ח
ש
ת
 
ו
י
ע
ש
 
ל
מ
ז
ב
ח
 
מ
כ
ב
ר
 
מ
ע
ש
ה
 
ר
ש
ת
 
נ
ח
ש
ת
 
ת
ח
ת
 
כ
ר
כ
ב
ו
 
מ
ל
מ
ט
ה
 
ע
ד
 
ח
צ
י
ו
 
ו
י
צ
ק
 
א
ר
ב
ע
 
ט
ב
ע
ו
ת
 
ב
א
ר
ב
ע
 
ה
ק
צ
ו
ת
 
ל
מ
כ
ב
ר
 
ה
נ
ח
ש
ת
 
ב
ת
י
ם
 
ל
ב
ד
י
ם
 
ו
י
ע
ש
 
א
ת
 
ה
ב
ד
י
ם
 
ע
צ
י
 
ש
ט
י
ם
 
ו
י
צ
ף
 
א
ת
ם
 
נ
ח
ש
ת
 
ו
י
ב
א
 
א
ת
 
ה
ב
ד
י
ם
 
ב
ט
ב
ע
ו
ת
 
ע
ל
 
צ
ל
ע
ו
ת
 
ה
מ
ז
ב
ח
 
ל
ש
א
ת
 
א
ת
ו
 
ב
ה
ם
 
נ
ב
ו
ב
 
ל
ו
ח
ת
 
ע
ש
ה
 
א
ת
ו
 
ו
י
ע
ש
 
א
ת
 
ה
כ
י
ו
ר
 
נ
ח
ש
ת
 
ו
א
ת
 
כ
נ
ו
 
נ
ח
ש
ת
 
ב
מ
ר
א
ו
ת
 
ה
צ
ב
א
ו
ת
 
א
ש
ר
 
צ
ב
א
ו
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ע
ש
 
א
ת
 
ה
ח
צ
ר
 
ל
פ
א
ת
 
נ
ג
ב
ה
 
ת
י
מ
נ
ה
 
ק
ל
ע
י
 
ה
ח
צ
ר
 
ש
ש
 
מ
ש
ז
ר
 
מ
א
ה
 
ב
א
מ
ה
 
ו
ע
מ
ו
ד
י
ו
 
ע
ש
ר
י
ם
 
ו
א
ד
נ
י
ה
ם
 
ע
ש
ר
י
ם
 
ו
ו
י
 
ה
ע
מ
ו
ד
י
ם
 
ו
ח
ש
ק
י
ה
ם
 
כ
ס
ף
 
ו
ל
פ
א
ת
 
צ
פ
ו
נ
ה
 
מ
א
ה
 
ב
א
מ
ה
 
ע
מ
ו
ד
י
ה
ם
 
ע
ש
ר
י
ם
 
ו
א
ד
נ
י
ה
ם
 
ע
ש
ר
י
ם
 
נ
ח
ש
ת
 
ו
ו
י
 
ה
ע
מ
ו
ד
י
ם
 
ו
ח
ש
ק
י
ה
ם
 
כ
ס
ף
 
ו
ל
פ
א
ת
 
י
מ
ה
 
ק
ל
ע
י
ם
 
ח
מ
ש
י
ם
 
א
מ
ה
 
ע
מ
ו
ד
י
ה
ם
 
ע
ש
ר
ה
 
ו
א
ד
נ
י
ה
ם
 
ע
ש
ר
ה
 
ו
ו
י
 
ה
ע
מ
ו
ד
י
ם
 
ו
ח
ש
ק
י
ה
ם
 
כ
ס
ף
 
ו
ל
פ
א
ת
 
ק
ד
מ
ה
 
מ
ז
ר
ח
ה
 
ח
מ
ש
י
ם
 
א
מ
ה
 
ק
ל
ע
י
ם
 
ח
מ
ש
 
ע
ש
ר
ה
 
א
מ
ה
 
א
ל
 
ה
כ
ת
ף
 
ע
מ
ו
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
א
ד
נ
י
ה
ם
 
ש
ל
ש
ה
 
ו
ל
כ
ת
ף
 
ה
ש
נ
י
ת
 
מ
ז
ה
 
ו
מ
ז
ה
 
ל
ש
ע
ר
 
ה
ח
צ
ר
 
ק
ל
ע
י
ם
 
ח
מ
ש
 
ע
ש
ר
ה
 
א
מ
ה
 
ע
מ
ו
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
א
ד
נ
י
ה
ם
 
ש
ל
ש
ה
 
כ
ל
 
ק
ל
ע
י
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ש
ש
 
מ
ש
ז
ר
 
ו
ה
א
ד
נ
י
ם
 
ל
ע
מ
ו
ד
י
ם
 
נ
ח
ש
ת
 
ו
ו
י
ה
ם
 
כ
ס
ף
 
ו
צ
פ
ו
י
 
ר
א
ש
י
ה
ם
 
כ
ס
ף
 
ו
ה
ם
 
מ
ח
ש
ק
י
ם
 
כ
ס
ף
 
ל
כ
ל
 
ע
מ
ו
ד
י
 
ה
ח
צ
ר
 
ו
מ
ס
ך
 
ש
ע
ר
 
ה
ח
צ
ר
 
מ
ע
ש
ה
 
ר
ק
ם
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ו
ע
ש
ר
י
ם
 
א
מ
ה
 
א
ר
ך
 
ו
ק
ו
מ
ה
 
ב
ר
ח
ב
 
ח
מ
ש
 
א
מ
ו
ת
 
ל
ע
מ
ת
 
ק
ל
ע
י
 
ה
ח
צ
ר
 
ע
מ
ו
ד
י
ה
ם
 
א
ר
ב
ע
ה
 
ו
א
ד
נ
י
ה
ם
 
א
ר
ב
ע
ה
 
נ
ח
ש
ת
 
ו
ו
י
ה
ם
 
כ
ס
ף
 
ו
צ
פ
ו
י
 
ר
א
ש
י
ה
ם
 
ו
ח
ש
ק
י
ה
ם
 
כ
ס
ף
 
ו
כ
ל
 
י
ת
ד
ו
ת
 
ל
מ
ש
כ
ן
 
ו
ל
ח
צ
ר
 
ס
ב
י
ב
 
נ
ח
ש
ת
 
א
ל
ה
 
פ
ק
ד
י
 
ה
מ
ש
כ
ן
 
מ
ש
כ
ן
 
ה
ע
ד
ו
ת
 
א
ש
ר
 
פ
ק
ד
 
ע
ל
 
פ
י
 
מ
ש
ה
 
ע
ב
ד
ת
 
ה
ל
ו
י
ם
 
ב
י
ד
 
א
י
ת
מ
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
ב
צ
ל
א
ל
 
ב
ן
 
א
ו
ר
י
 
ב
ן
 
ח
ו
ר
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
ע
ש
ה
 
א
ת
 
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
א
ת
ו
 
א
ה
ל
י
א
ב
 
ב
ן
 
א
ח
י
ס
מ
ך
 
ל
מ
ט
ה
 
ד
ן
 
ח
ר
ש
 
ו
ח
ש
ב
 
ו
ר
ק
ם
 
ב
ת
כ
ל
ת
 
ו
ב
א
ר
ג
מ
ן
 
ו
ב
ת
ו
ל
ע
ת
 
ה
ש
נ
י
 
ו
ב
ש
ש
 
כ
ל
 
ז
ה
ב
 
ה
ע
ש
ו
י
 
ל
מ
ל
א
כ
ה
 
ב
כ
ל
 
מ
ל
א
כ
ת
 
ה
ק
ד
ש
 
ו
י
ה
י
 
ז
ה
ב
 
ה
ת
נ
ו
פ
ה
 
ת
ש
ע
 
ו
ע
ש
ר
י
ם
 
כ
כ
ר
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
ש
ל
ש
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ו
כ
ס
ף
 
פ
ק
ד
י
 
ה
ע
ד
ה
 
מ
א
ת
 
כ
כ
ר
 
ו
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ח
מ
ש
ה
 
ו
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ק
ע
 
ל
ג
ל
ג
ל
ת
 
מ
ח
צ
י
ת
 
ה
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ל
כ
ל
 
ה
ע
ב
ר
 
ע
ל
 
ה
פ
ק
ד
י
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ל
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
ש
ל
ש
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
ו
י
ה
י
 
מ
א
ת
 
כ
כ
ר
 
ה
כ
ס
ף
 
ל
ק
צ
ת
 
א
ת
 
א
ד
נ
י
 
ה
ק
ד
ש
 
ו
א
ת
 
א
ד
נ
י
 
ה
פ
ר
כ
ת
 
מ
א
ת
 
ה
א
ד
נ
י
ם
 
ל
מ
א
ת
 
ה
כ
כ
ר
 
כ
כ
ר
 
ל
א
ד
ן
 
ו
א
ת
 
ה
א
ל
ף
 
ו
ש
ב
ע
 
ה
מ
א
ו
ת
 
ח
מ
ש
ה
 
ו
ש
ב
ע
י
ם
 
ע
ש
ה
 
ו
ו
י
ם
 
ל
ע
מ
ו
ד
י
ם
 
ו
צ
פ
ה
 
ר
א
ש
י
ה
ם
 
ו
ח
ש
ק
 
א
ת
ם
 
ו
נ
ח
ש
ת
 
ה
ת
נ
ו
פ
ה
 
ש
ב
ע
י
ם
 
כ
כ
ר
 
ו
א
ל
פ
י
ם
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ש
ק
ל
 
ו
י
ע
ש
 
ב
ה
 
א
ת
 
א
ד
נ
י
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
מ
ז
ב
ח
 
ה
נ
ח
ש
ת
 
ו
א
ת
 
מ
כ
ב
ר
 
ה
נ
ח
ש
ת
 
א
ש
ר
 
ל
מ
ז
ב
ח
 
ו
א
ת
 
כ
ל
 
כ
ל
י
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
א
ד
נ
י
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ו
א
ת
 
א
ד
נ
י
 
ש
ע
ר
 
ה
ח
צ
ר
 
ו
א
ת
 
כ
ל
 
י
ת
ד
ו
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
כ
ל
 
י
ת
ד
ו
ת
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ו
מ
ן
 
ה
ת
כ
ל
ת
 
ו
ה
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ה
ש
נ
י
 
ע
ש
ו
 
ב
ג
ד
י
 
ש
ר
ד
 
ל
ש
ר
ת
 
ב
ק
ד
ש
 
ו
י
ע
ש
ו
 
א
ת
 
ב
ג
ד
י
 
ה
ק
ד
ש
 
א
ש
ר
 
ל
א
ה
ר
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
ה
א
פ
ו
ד
 
ז
ה
ב
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ו
י
ר
ק
ע
ו
 
א
ת
 
פ
ח
י
 
ה
ז
ה
ב
 
ו
ק
צ
צ
ו
 
פ
ת
י
ל
י
ם
 
ל
ע
ש
ו
ת
 
ב
ת
ו
ך
 
ה
ת
כ
ל
ת
 
ו
ב
ת
ו
ך
 
ה
א
ר
ג
מ
ן
 
ו
ב
ת
ו
ך
 
ה
ת
ו
ל
ע
ת
 
ה
ש
נ
י
 
ו
ב
ת
ו
ך
 
ה
ש
ש
 
מ
ע
ש
ה
 
ח
ש
ב
 
כ
ת
פ
ו
ת
 
ע
ש
ה
 
ל
ו
 
ח
ב
ר
ו
ת
 
ע
ל
 
ש
נ
י
 
ק
צ
ת
י
ו
 
ח
ב
ר
 
ו
ח
ש
ב
 
א
פ
ד
ת
ו
 
א
ש
ר
 
ע
ל
י
ו
 
מ
מ
נ
ו
 
ה
ו
א
 
כ
מ
ע
ש
ה
ו
 
ז
ה
ב
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
א
ב
נ
י
 
ה
ש
ה
ם
 
מ
ו
ס
ב
ו
ת
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
מ
פ
ת
ח
ו
ת
 
פ
ת
ו
ח
י
 
ח
ו
ת
ם
 
ע
ל
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ש
מ
ו
 
א
ת
ם
 
ע
ל
 
כ
ת
פ
ו
ת
 
ה
א
פ
ו
ד
 
א
ב
נ
י
 
ז
כ
ר
ו
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
ה
ח
ש
ן
 
מ
ע
ש
ה
 
ח
ש
ב
 
כ
מ
ע
ש
ה
 
ה
א
פ
ו
ד
 
ז
ה
ב
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ר
ב
ו
ע
 
ה
י
ה
 
כ
פ
ו
ל
 
ע
ש
ה
 
א
ת
 
ה
ח
ש
ן
 
ז
ר
ת
 
א
ר
כ
ו
 
ו
ז
ר
ת
 
ר
ח
ב
ו
 
ו
י
מ
ל
א
ו
 
ב
ו
 
א
ר
ב
ע
ה
 
ט
ו
ר
י
 
א
ב
ן
 
ט
ו
ר
 
א
ד
ם
 
פ
ט
ד
ה
 
ו
ב
ר
ק
ת
 
ה
ט
ו
ר
 
ה
א
ח
ד
 
ו
ה
ט
ו
ר
 
ה
ש
נ
י
 
נ
פ
ך
 
ס
פ
י
ר
 
ו
י
ה
ל
ם
 
ו
ה
ט
ו
ר
 
ה
ש
ל
י
ש
י
 
ל
ש
ם
 
ש
ב
ו
 
ו
א
ח
ל
מ
ה
 
ו
ה
ט
ו
ר
 
ה
ר
ב
י
ע
י
 
ת
ר
ש
י
ש
 
ש
ה
ם
 
ו
י
ש
פ
ה
 
מ
ו
ס
ב
ו
ת
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
ב
מ
ל
א
ו
ת
ם
 
ו
ה
א
ב
נ
י
ם
 
ע
ל
 
ש
מ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ה
נ
ה
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ע
ל
 
ש
מ
ו
ת
ם
 
פ
ת
ו
ח
י
 
ח
ו
ת
ם
 
א
י
ש
 
ע
ל
 
ש
מ
ו
 
ל
ש
נ
י
ם
 
ע
ש
ר
 
ש
ב
ט
 
ו
י
ע
ש
ו
 
ע
ל
 
ה
ח
ש
ן
 
ש
ר
ש
ר
ו
ת
 
ג
ב
ל
ו
ת
 
מ
ע
ש
ה
 
ע
ב
ו
ת
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
י
ע
ש
ו
 
ש
ת
י
 
מ
ש
ב
צ
ו
ת
 
ז
ה
ב
 
ו
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
י
ת
נ
ו
 
א
ת
 
ש
ת
י
 
ה
ט
ב
ע
ו
ת
 
ע
ל
 
ש
נ
י
 
ק
צ
ו
ת
 
ה
ח
ש
ן
 
ו
י
ת
נ
ו
 
א
ת
 
ש
ת
י
 
ה
ע
ב
ת
ו
ת
 
ה
ז
ה
ב
 
ע
ל
 
ש
ת
י
 
ה
ט
ב
ע
ו
ת
 
ע
ל
 
ק
צ
ו
ת
 
ה
ח
ש
ן
 
ו
א
ת
 
ש
ת
י
 
ה
ק
צ
ו
ת
 
ש
ת
י
 
ה
ע
ב
ת
ו
ת
 
נ
ת
נ
ו
 
ע
ל
 
ש
ת
י
 
ה
מ
ש
ב
צ
ו
ת
 
ו
י
ת
נ
ו
ם
 
ע
ל
 
כ
ת
פ
ו
ת
 
ה
א
פ
ו
ד
 
א
ל
 
מ
ו
ל
 
פ
נ
י
ו
 
ו
י
ע
ש
ו
 
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
י
ש
מ
ו
 
ע
ל
 
ש
נ
י
 
ק
צ
ו
ת
 
ה
ח
ש
ן
 
ע
ל
 
ש
פ
ת
ו
 
א
ש
ר
 
ע
ל
 
ח
ב
ר
 
ה
א
פ
ו
ד
 
ב
י
ת
ה
 
ו
י
ע
ש
ו
 
ש
ת
י
 
ט
ב
ע
ו
ת
 
ז
ה
ב
 
ו
י
ת
נ
ו
ם
 
ע
ל
 
ש
ת
י
 
כ
ת
פ
ו
ת
 
ה
א
פ
ו
ד
 
מ
ל
מ
ט
ה
 
מ
מ
ו
ל
 
פ
נ
י
ו
 
ל
ע
מ
ת
 
מ
ח
ב
ר
ת
ו
 
מ
מ
ע
ל
 
ל
ח
ש
ב
 
ה
א
פ
ו
ד
 
ו
י
ר
כ
ס
ו
 
א
ת
 
ה
ח
ש
ן
 
מ
ט
ב
ע
ת
ו
 
א
ל
 
ט
ב
ע
ת
 
ה
א
פ
ו
ד
 
ב
פ
ת
י
ל
 
ת
כ
ל
ת
 
ל
ה
י
ו
ת
 
ע
ל
 
ח
ש
ב
 
ה
א
פ
ו
ד
 
ו
ל
א
 
י
ז
ה
 
ה
ח
ש
ן
 
מ
ע
ל
 
ה
א
פ
ו
ד
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
ה
א
ר
י
ם
 
ו
א
ת
 
ה
ת
מ
י
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
ה
מ
ע
י
ל
 
מ
ע
ש
ה
 
א
ר
ג
 
כ
ל
י
ל
 
ת
כ
ל
ת
 
ו
פ
י
 
ה
מ
ע
י
ל
 
ב
ת
ו
כ
ו
 
כ
פ
י
 
ת
ח
ר
ה
 
ש
פ
ה
 
ל
פ
י
ו
 
ס
ב
י
ב
 
ל
א
 
י
ק
ר
ע
 
ו
י
ע
ש
ו
 
ע
ל
 
ש
ו
ל
י
 
ה
מ
ע
י
ל
 
ר
מ
ו
נ
י
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
ש
ש
 
מ
ש
ז
ר
 
ו
י
ע
ש
ו
 
פ
ע
מ
ו
נ
י
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
י
ת
נ
ו
 
א
ת
 
ה
פ
ע
מ
ו
נ
י
ם
 
ע
ל
 
ש
ו
ל
י
 
ה
מ
ע
י
ל
 
ס
ב
י
ב
 
ב
ת
ו
ך
 
ה
ר
מ
ו
נ
י
ם
 
פ
ע
מ
ו
ן
 
ז
ה
ב
 
ו
ר
מ
ו
ן
 
פ
ע
מ
ו
ן
 
ז
ה
ב
 
ו
ר
מ
ו
ן
 
ע
ל
 
ש
ו
ל
י
 
ה
מ
ע
י
ל
 
ס
ב
י
ב
 
ל
ש
ר
ת
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
ה
כ
י
ת
נ
ת
 
ש
ש
 
מ
ע
ש
ה
 
א
ר
ג
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ו
א
ת
 
ה
מ
צ
נ
פ
ת
 
ש
ש
 
ו
א
ת
 
פ
א
ר
י
 
ה
מ
ג
ב
ע
ו
ת
 
ש
ש
 
ו
א
ת
 
מ
כ
נ
ס
י
 
ה
ב
ד
 
ש
ש
 
מ
ש
ז
ר
 
ו
א
ת
 
ה
א
ב
נ
י
ט
 
ש
ש
 
מ
ש
ז
ר
 
ת
כ
ל
ת
 
ו
א
ר
ג
מ
ן
 
ו
ת
ו
ל
ע
ת
 
ש
נ
י
 
מ
ע
ש
ה
 
ר
ק
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
א
ת
 
צ
י
ץ
 
נ
ז
ר
 
ה
ק
ד
ש
 
ז
ה
ב
 
ט
ה
ו
ר
 
ו
י
כ
ת
ב
ו
 
ע
ל
י
ו
 
מ
כ
ת
ב
 
פ
ת
ו
ח
י
 
ח
ו
ת
ם
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
ו
י
ת
נ
ו
 
ע
ל
י
ו
 
פ
ת
י
ל
 
ת
כ
ל
ת
 
ל
ת
ת
 
ע
ל
 
ה
מ
צ
נ
פ
ת
 
מ
ל
מ
ע
ל
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
ת
כ
ל
 
כ
ל
 
ע
ב
ד
ת
 
ה
מ
ש
כ
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ע
ש
ו
 
ו
י
ב
י
א
ו
 
א
ת
 
ה
מ
ש
כ
ן
 
א
ל
 
מ
ש
ה
 
א
ת
 
ה
א
ה
ל
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ק
ר
ס
י
ו
 
ק
ר
ש
י
ו
 
ב
ר
י
ח
י
ו
 
ע
מ
ו
ד
י
ו
 
ו
א
ד
נ
י
ה
ם
 
ו
א
ת
 
מ
כ
ס
ה
 
ע
ו
ר
ת
 
ה
א
י
ל
י
ם
 
ה
מ
א
ד
מ
י
ם
 
ו
א
ת
 
מ
כ
ס
ה
 
ע
ו
ר
ת
 
ה
ת
ח
ש
י
ם
 
ו
א
ת
 
פ
ר
כ
ת
 
ה
מ
ס
ך
 
א
ת
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
ו
א
ת
 
ב
ד
י
ו
 
ו
א
ת
 
ה
כ
פ
ר
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
א
ת
 
ל
ח
ם
 
ה
פ
נ
י
ם
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ה
ט
ה
ר
ה
 
ו
א
ת
 
נ
ר
ת
י
ה
 
נ
ר
ו
ת
 
ה
מ
ע
ר
כ
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ה
 
ו
א
ת
 
ש
מ
ן
 
ה
מ
א
ו
ר
 
א
ת
 
מ
ז
ב
ח
 
ה
ז
ה
ב
 
ו
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
א
ת
 
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ו
א
ת
 
מ
ס
ך
 
פ
ת
ח
 
ה
א
ה
ל
 
ו
א
ת
 
מ
ז
ב
ח
 
ה
נ
ח
ש
ת
 
ו
א
ת
 
מ
כ
ב
ר
 
ה
נ
ח
ש
ת
 
א
ש
ר
 
ל
ו
 
ו
א
ת
 
ב
ד
י
ו
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
א
ת
 
ק
ל
ע
י
 
ה
ח
צ
ר
 
ו
א
ת
 
ע
מ
ו
ד
י
ה
 
ו
א
ת
 
א
ד
נ
י
ה
 
ו
א
ת
 
ה
מ
ס
ך
 
ל
ש
ע
ר
 
ה
ח
צ
ר
 
א
ת
 
מ
י
ת
ר
י
ה
 
ו
א
ת
 
י
ת
ד
ת
י
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
 
ע
ב
ד
ת
 
ה
מ
ש
כ
ן
 
ל
א
ה
ל
 
מ
ו
ע
ד
 
א
ת
 
ב
ג
ד
י
 
ה
ש
ר
ד
 
ל
ש
ר
ת
 
ב
ק
ד
ש
 
ו
א
ת
 
ב
ג
ד
י
 
ה
ק
ד
ש
 
ל
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
א
ת
 
ב
ג
ד
י
 
ב
נ
י
ו
 
ל
כ
ה
ן
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
כ
ל
 
ה
ע
ב
ד
ה
 
ו
י
ר
א
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ה
מ
ל
א
כ
ה
 
ו
ה
נ
ה
 
ע
ש
ו
 
א
ת
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
כ
ן
 
ע
ש
ו
 
ו
י
ב
ר
ך
 
א
ת
ם
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ב
י
ו
ם
 
ה
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ת
ק
י
ם
 
א
ת
 
ה
מ
ש
כ
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ש
מ
ת
 
ש
ם
 
א
ת
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
ו
ס
כ
ת
 
ע
ל
 
ה
א
ר
ו
ן
 
א
ת
 
ה
כ
פ
ר
ת
 
ו
ה
ב
א
ת
 
א
ת
 
ה
ש
ל
ח
ן
 
ו
ע
ר
כ
ת
 
א
ת
 
ע
ר
כ
ו
 
ו
ה
ב
א
ת
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ו
ה
ע
ל
י
ת
 
א
ת
 
נ
ר
ת
י
ה
 
ו
נ
ת
ת
ה
 
א
ת
 
מ
ז
ב
ח
 
ה
ז
ה
ב
 
ל
ק
ט
ר
ת
 
ל
פ
נ
י
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
ו
ש
מ
ת
 
א
ת
 
מ
ס
ך
 
ה
פ
ת
ח
 
ל
מ
ש
כ
ן
 
ו
נ
ת
ת
ה
 
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ל
פ
נ
י
 
פ
ת
ח
 
ה
מ
ש
כ
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
כ
י
ו
ר
 
ב
י
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ב
י
ן
 
ה
מ
ז
ב
ח
 
ו
נ
ת
ת
ה
 
ש
ם
 
מ
י
ם
 
ו
ש
מ
ת
 
א
ת
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ו
נ
ת
ת
ה
 
א
ת
 
מ
ס
ך
 
ש
ע
ר
 
ה
ח
צ
ר
 
ו
ל
ק
ח
ת
 
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
מ
ש
ח
ת
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ו
 
ו
ק
ד
ש
ת
 
א
ת
ו
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
ה
י
ה
 
ק
ד
ש
 
ו
מ
ש
ח
ת
 
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
ק
ד
ש
ת
 
א
ת
 
ה
מ
ז
ב
ח
 
ו
ה
י
ה
 
ה
מ
ז
ב
ח
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ו
מ
ש
ח
ת
 
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
ו
ק
ד
ש
ת
 
א
ת
ו
 
ו
ה
ק
ר
ב
ת
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ר
ח
צ
ת
 
א
ת
ם
 
ב
מ
י
ם
 
ו
ה
ל
ב
ש
ת
 
א
ת
 
א
ה
ר
ן
 
א
ת
 
ב
ג
ד
י
 
ה
ק
ד
ש
 
ו
מ
ש
ח
ת
 
א
ת
ו
 
ו
ק
ד
ש
ת
 
א
ת
ו
 
ו
כ
ה
ן
 
ל
י
 
ו
א
ת
 
ב
נ
י
ו
 
ת
ק
ר
י
ב
 
ו
ה
ל
ב
ש
ת
ם
 
כ
י
ת
נ
ו
ת
 
ו
מ
ש
ח
ת
 
א
ת
ם
 
כ
א
ש
ר
 
מ
ש
ח
ת
 
א
ת
 
א
ב
י
ה
ם
 
ו
כ
ה
נ
ו
 
ל
י
 
ו
ה
י
ת
ה
 
ל
ה
י
ו
ת
 
ל
ה
ם
 
מ
ש
ח
ת
ם
 
ל
כ
ה
נ
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ו
ת
ם
 
ו
י
ע
ש
 
מ
ש
ה
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
כ
ן
 
ע
ש
ה
 
ו
י
ה
י
 
ב
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ב
ש
נ
ה
 
ה
ש
נ
י
ת
 
ל
צ
א
ת
ם
 
מ
מ
צ
ר
י
ם
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ה
ו
ק
ם
 
ה
מ
ש
כ
ן
 
ו
י
ק
ם
 
מ
ש
ה
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
י
ת
ן
 
א
ת
 
א
ד
נ
י
ו
 
ו
י
ש
ם
 
א
ת
 
ק
ר
ש
י
ו
 
ו
י
ת
ן
 
א
ת
 
ב
ר
י
ח
י
ו
 
ו
י
ק
ם
 
א
ת
 
ע
מ
ו
ד
י
ו
 
ו
י
פ
ר
ש
 
א
ת
 
ה
א
ה
ל
 
ע
ל
 
ה
מ
ש
כ
ן
 
ו
י
ש
ם
 
א
ת
 
מ
כ
ס
ה
 
ה
א
ה
ל
 
ע
ל
י
ו
 
מ
ל
מ
ע
ל
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ק
ח
 
ו
י
ת
ן
 
א
ת
 
ה
ע
ד
ו
ת
 
א
ל
 
ה
א
ר
ו
ן
 
ו
י
ש
ם
 
א
ת
 
ה
ב
ד
י
ם
 
ע
ל
 
ה
א
ר
ו
ן
 
ו
י
ת
ן
 
א
ת
 
ה
כ
פ
ר
ת
 
ע
ל
 
ה
א
ר
ו
ן
 
מ
ל
מ
ע
ל
ה
 
ו
י
ב
א
 
א
ת
 
ה
א
ר
ו
ן
 
א
ל
 
ה
מ
ש
כ
ן
 
ו
י
ש
ם
 
א
ת
 
פ
ר
כ
ת
 
ה
מ
ס
ך
 
ו
י
ס
ך
 
ע
ל
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ש
ם
 
א
ת
 
ה
ש
ל
ח
ן
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ע
ל
 
י
ר
ך
 
ה
מ
ש
כ
ן
 
צ
פ
ו
נ
ה
 
מ
ח
ו
ץ
 
ל
פ
ר
כ
ת
 
ו
י
ע
ר
ך
 
ע
ל
י
ו
 
ע
ר
ך
 
ל
ח
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ש
ם
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
נ
כ
ח
 
ה
ש
ל
ח
ן
 
ע
ל
 
י
ר
ך
 
ה
מ
ש
כ
ן
 
נ
ג
ב
ה
 
ו
י
ע
ל
 
א
ת
 
ה
נ
ר
ו
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ש
ם
 
א
ת
 
מ
ז
ב
ח
 
ה
ז
ה
ב
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ל
פ
נ
י
 
ה
פ
ר
כ
ת
 
ו
י
ק
ט
ר
 
ע
ל
י
ו
 
ק
ט
ר
ת
 
ס
מ
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ש
ם
 
א
ת
 
מ
ס
ך
 
ה
פ
ת
ח
 
ל
מ
ש
כ
ן
 
ו
א
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ש
ם
 
ל
פ
נ
י
 
פ
ת
ח
 
ה
מ
ש
כ
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ע
ל
 
ע
ל
י
ו
 
א
ת
 
ה
ע
ל
ה
 
ו
א
ת
 
ה
מ
נ
ח
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ש
ם
 
א
ת
 
ה
כ
י
ו
ר
 
ב
י
ן
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ב
י
ן
 
ה
מ
ז
ב
ח
 
ו
י
ת
ן
 
ש
ם
 
מ
י
ם
 
ל
ר
ח
צ
ה
 
ו
י
ר
ח
ץ
 
מ
מ
נ
ו
 
מ
ש
ה
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ו
א
ת
 
ר
ג
ל
י
ה
ם
 
ב
ב
א
ם
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ב
ק
ר
ב
ת
ם
 
א
ל
 
ה
מ
ז
ב
ח
 
י
ר
ח
צ
ו
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ק
ם
 
א
ת
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ל
מ
ש
כ
ן
 
ו
ל
מ
ז
ב
ח
 
ו
י
ת
ן
 
א
ת
 
מ
ס
ך
 
ש
ע
ר
 
ה
ח
צ
ר
 
ו
י
כ
ל
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ה
מ
ל
א
כ
ה
 
ו
י
כ
ס
 
ה
ע
נ
ן
 
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
כ
ב
ו
ד
 
י
ה
ו
ה
 
מ
ל
א
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
ל
א
 
י
כ
ל
 
מ
ש
ה
 
ל
ב
ו
א
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
כ
י
 
ש
כ
ן
 
ע
ל
י
ו
 
ה
ע
נ
ן
 
ו
כ
ב
ו
ד
 
י
ה
ו
ה
 
מ
ל
א
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
ב
ה
ע
ל
ו
ת
 
ה
ע
נ
ן
 
מ
ע
ל
 
ה
מ
ש
כ
ן
 
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
כ
ל
 
מ
ס
ע
י
ה
ם
 
ו
א
ם
 
ל
א
 
י
ע
ל
ה
 
ה
ע
נ
ן
 
ל
א
 
י
ס
ע
ו
 
ע
ד
 
י
ו
ם
 
ה
ע
ל
ו
ת
ו
 
כ
י
 
ע
נ
ן
 
י
ה
ו
ה
 
ע
ל
 
ה
מ
ש
כ
ן
 
י
ו
מ
ם
 
ו
א
ש
 
ת
ה
י
ה
 
ב
ו
 
ל
י
ל
ה
 
ל
ע
י
נ
י
 
כ
ל
 
ב
י
ת
 
י
ש
ר
א
ל
 
ב
כ
ל
 
מ
ס
ע
י
ה
ם
 
ו
י
ק
ר
א
 
א
ל
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
ו
 
מ
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
ד
ם
 
כ
י
 
י
ק
ר
י
ב
 
מ
כ
ם
 
ק
ר
ב
ן
 
ל
י
ה
ו
ה
 
מ
ן
 
ה
ב
ה
מ
ה
 
מ
ן
 
ה
ב
ק
ר
 
א
ו
 
מ
ן
 
ה
צ
א
ן
 
ת
ק
ר
י
ב
ו
 
א
ת
 
ק
ר
ב
נ
י
כ
ם
 
א
ם
 
ע
ל
ה
 
ק
ר
ב
נ
ו
 
מ
ן
 
ה
ב
ק
ר
 
ז
כ
ר
 
ת
מ
י
ם
 
י
ק
ר
י
ב
נ
ו
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
י
ק
ר
י
ב
 
א
ת
ו
 
ל
ר
צ
ו
נ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ה
ע
ל
ה
 
ו
נ
ר
צ
ה
 
ל
ו
 
ל
כ
פ
ר
 
ע
ל
י
ו
 
ו
ש
ח
ט
 
א
ת
 
ב
ן
 
ה
ב
ק
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ה
ק
ר
י
ב
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
א
ת
 
ה
ד
ם
 
ו
ז
ר
ק
ו
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
א
ש
ר
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
פ
ש
י
ט
ו
 
א
ת
 
ה
ע
ל
ה
 
ו
נ
ת
ח
ו
 
א
ת
ה
 
ל
נ
ת
ח
י
ה
 
ו
נ
ת
נ
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
א
ש
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ע
ר
כ
ו
 
ע
צ
י
ם
 
ע
ל
 
ה
א
ש
 
ו
ע
ר
כ
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
א
ת
 
ה
נ
ת
ח
י
ם
 
ו
א
ת
 
ה
ר
א
ש
 
ו
א
ת
 
ה
פ
ד
ר
 
ע
ל
 
ה
ע
צ
י
ם
 
א
ש
ר
 
ע
ל
 
ה
א
ש
 
א
ש
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ק
ר
ב
ו
 
ו
כ
ר
ע
י
ו
 
י
ר
ח
צ
ו
 
ב
מ
י
ם
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
ה
כ
ל
 
ה
מ
ז
ב
ח
ה
 
ע
ל
ה
 
ה
ו
א
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
א
ם
 
מ
ן
 
ה
צ
א
ן
 
ע
ל
ה
 
ק
ר
ב
נ
ו
 
ל
י
ה
ו
ה
 
מ
ן
 
ה
כ
ש
ב
י
ם
 
א
ו
 
מ
ן
 
ה
ע
ז
י
ם
 
ז
כ
ר
 
ת
מ
י
ם
 
י
ק
ר
י
ב
נ
ו
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
י
ק
ר
י
ב
 
א
ת
ו
 
ו
ש
ח
ט
 
א
ת
ו
 
ע
ל
 
י
ר
ך
 
ה
מ
ז
ב
ח
 
צ
פ
ו
נ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ז
ר
ק
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
א
ת
 
ד
מ
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
נ
ת
ח
ו
 
א
ת
ו
 
ל
נ
ת
ח
י
ו
 
ו
א
ת
 
ר
א
ש
ו
 
ו
א
ת
 
פ
ד
ר
ו
 
י
ע
ר
י
ך
 
ה
כ
ה
ן
 
א
ת
ם
 
ע
ל
 
ה
ע
צ
י
ם
 
א
ש
ר
 
ע
ל
 
ה
א
ש
 
א
ש
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ה
ק
ר
ב
 
ו
ה
כ
ר
ע
י
ם
 
י
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ה
ק
ר
י
ב
 
ה
כ
ה
ן
 
א
ת
 
ה
כ
ל
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
ע
ל
ה
 
ה
ו
א
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
א
ם
 
מ
ן
 
ה
ע
ו
ף
 
ע
ל
ה
 
ק
ר
ב
נ
ו
 
ל
י
ה
ו
ה
 
ו
ה
ק
ר
י
ב
 
מ
ן
 
ה
ת
ר
י
ם
 
א
ו
 
מ
ב
נ
י
 
ה
י
ו
נ
ה
 
א
ת
 
ק
ר
ב
נ
ו
 
ו
ה
ק
ר
י
ב
ו
 
ה
כ
ה
ן
 
א
ל
 
ה
מ
ז
ב
ח
 
ו
מ
ל
ק
 
א
ת
 
ר
א
ש
ו
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
ו
נ
מ
צ
א
 
ד
מ
ו
 
א
ל
 
ק
י
ר
 
ה
מ
ז
ב
ח
 
ו
ה
ס
י
ר
 
א
ת
 
מ
ר
ת
ו
 
ב
נ
צ
ת
ו
 
ו
ה
ש
ל
י
ך
 
א
ת
ו
 
א
צ
ל
 
ה
מ
ז
ב
ח
 
ק
ד
מ
ה
 
א
ל
 
מ
ק
ו
ם
 
ה
ד
ש
ן
 
ו
ש
ס
ע
 
א
ת
ו
 
ב
כ
נ
פ
י
ו
 
ו
ל
א
 
י
ב
ד
ל
 
ו
ה
ק
ט
י
ר
 
א
ת
ו
 
ה
כ
ה
ן
 
ה
מ
ז
ב
ח
ה
 
ע
ל
 
ה
ע
צ
י
ם
 
א
ש
ר
 
ע
ל
 
ה
א
ש
 
ע
ל
ה
 
ה
ו
א
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
נ
פ
ש
 
כ
י
 
ת
ק
ר
י
ב
 
ק
ר
ב
ן
 
מ
נ
ח
ה
 
ל
י
ה
ו
ה
 
ס
ל
ת
 
י
ה
י
ה
 
ק
ר
ב
נ
ו
 
ו
י
צ
ק
 
ע
ל
י
ה
 
ש
מ
ן
 
ו
נ
ת
ן
 
ע
ל
י
ה
 
ל
ב
ו
נ
ה
 
מ
נ
ח
ה
 
ה
י
א
 
ו
ה
ב
י
א
ה
 
א
ל
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
ו
ק
מ
ץ
 
מ
מ
נ
ה
 
מ
ל
ו
א
 
ק
מ
צ
ו
 
מ
ס
ל
ת
ה
 
ו
מ
ש
מ
נ
ה
 
ע
ל
 
כ
ל
 
ל
ב
ו
נ
ת
ה
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
א
ת
 
א
ז
כ
ר
ת
ה
 
ה
מ
ז
ב
ח
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
ה
נ
ו
ת
ר
ת
 
מ
ן
 
ה
מ
נ
ח
ה
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
מ
א
ש
י
 
י
ה
ו
ה
 
ו
כ
י
 
ת
ק
ר
י
ב
 
ק
ר
ב
ן
 
מ
נ
ח
ה
 
מ
א
פ
ה
 
ת
נ
ו
ר
 
ס
ל
ת
 
ח
ל
ו
ת
 
מ
צ
ו
ת
 
ב
ל
ל
ו
ת
 
ב
ש
מ
ן
 
ו
ר
ק
י
ק
י
 
מ
צ
ו
ת
 
מ
ש
ח
י
ם
 
ב
ש
מ
ן
 
ו
א
ם
 
מ
נ
ח
ה
 
ע
ל
 
מ
ח
ב
ת
 
ק
ר
ב
נ
ך
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
מ
צ
ה
 
ת
ה
י
ה
 
פ
ת
ת
 
א
ת
ה
 
פ
ת
י
ם
 
ו
י
צ
ק
ת
 
ע
ל
י
ה
 
ש
מ
ן
 
מ
נ
ח
ה
 
ה
י
א
 
ו
א
ם
 
מ
נ
ח
ה
 
מ
ר
ח
ש
ת
 
ק
ר
ב
נ
ך
 
ס
ל
ת
 
ב
ש
מ
ן
 
ת
ע
ש
ה
 
ו
ה
ב
א
ת
 
א
ת
 
ה
מ
נ
ח
ה
 
א
ש
ר
 
י
ע
ש
ה
 
מ
א
ל
ה
 
ל
י
ה
ו
ה
 
ו
ה
ק
ר
י
ב
ה
 
א
ל
 
ה
כ
ה
ן
 
ו
ה
ג
י
ש
ה
 
א
ל
 
ה
מ
ז
ב
ח
 
ו
ה
ר
י
ם
 
ה
כ
ה
ן
 
מ
ן
 
ה
מ
נ
ח
ה
 
א
ת
 
א
ז
כ
ר
ת
ה
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
ה
נ
ו
ת
ר
ת
 
מ
ן
 
ה
מ
נ
ח
ה
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
מ
א
ש
י
 
י
ה
ו
ה
 
כ
ל
 
ה
מ
נ
ח
ה
 
א
ש
ר
 
ת
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
ל
א
 
ת
ע
ש
ה
 
ח
מ
ץ
 
כ
י
 
כ
ל
 
ש
א
ר
 
ו
כ
ל
 
ד
ב
ש
 
ל
א
 
ת
ק
ר
י
ב
ו
 
מ
מ
נ
ו
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ק
ר
ב
ן
 
ר
א
ש
י
ת
 
ת
ק
ר
י
ב
ו
 
א
ת
ם
 
ל
י
ה
ו
ה
 
ו
א
ל
 
ה
מ
ז
ב
ח
 
ל
א
 
י
ע
ל
ו
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ו
כ
ל
 
ק
ר
ב
ן
 
מ
נ
ח
ת
ך
 
ב
מ
ל
ח
 
ת
מ
ל
ח
 
ו
ל
א
 
ת
ש
ב
י
ת
 
מ
ל
ח
 
ב
ר
י
ת
 
א
ל
ה
י
ך
 
מ
ע
ל
 
מ
נ
ח
ת
ך
 
ע
ל
 
כ
ל
 
ק
ר
ב
נ
י
ך
 
ת
ק
ר
י
ב
 
מ
ל
ח
 
ו
א
ם
 
ת
ק
ר
י
ב
 
מ
נ
ח
ת
 
ב
כ
ו
ר
י
ם
 
ל
י
ה
ו
ה
 
א
ב
י
ב
 
ק
ל
י
 
ב
א
ש
 
ג
ר
ש
 
כ
ר
מ
ל
 
ת
ק
ר
י
ב
 
א
ת
 
מ
נ
ח
ת
 
ב
כ
ו
ר
י
ך
 
ו
נ
ת
ת
ה
 
ע
ל
י
ה
 
ש
מ
ן
 
ו
ש
מ
ת
 
ע
ל
י
ה
 
ל
ב
ו
נ
ה
 
מ
נ
ח
ה
 
ה
י
א
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
א
ת
 
א
ז
כ
ר
ת
ה
 
מ
ג
ר
ש
ה
 
ו
מ
ש
מ
נ
ה
 
ע
ל
 
כ
ל
 
ל
ב
ו
נ
ת
ה
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
א
ם
 
ז
ב
ח
 
ש
ל
מ
י
ם
 
ק
ר
ב
נ
ו
 
א
ם
 
מ
ן
 
ה
ב
ק
ר
 
ה
ו
א
 
מ
ק
ר
י
ב
 
א
ם
 
ז
כ
ר
 
א
ם
 
נ
ק
ב
ה
 
ת
מ
י
ם
 
י
ק
ר
י
ב
נ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ק
ר
ב
נ
ו
 
ו
ש
ח
ט
ו
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ז
ר
ק
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
ה
ק
ר
י
ב
 
מ
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
א
ת
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
א
ש
ר
 
ע
ל
 
ה
כ
ס
ל
י
ם
 
ו
א
ת
 
ה
י
ו
ת
ר
ת
 
ע
ל
 
ה
כ
ב
ד
 
ע
ל
 
ה
כ
ל
י
ו
ת
 
י
ס
י
ר
נ
ה
 
ו
ה
ק
ט
י
ר
ו
 
א
ת
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
מ
ז
ב
ח
ה
 
ע
ל
 
ה
ע
ל
ה
 
א
ש
ר
 
ע
ל
 
ה
ע
צ
י
ם
 
א
ש
ר
 
ע
ל
 
ה
א
ש
 
א
ש
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
א
ם
 
מ
ן
 
ה
צ
א
ן
 
ק
ר
ב
נ
ו
 
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
ז
כ
ר
 
א
ו
 
נ
ק
ב
ה
 
ת
מ
י
ם
 
י
ק
ר
י
ב
נ
ו
 
א
ם
 
כ
ש
ב
 
ה
ו
א
 
מ
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
נ
ו
 
ו
ה
ק
ר
י
ב
 
א
ת
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ק
ר
ב
נ
ו
 
ו
ש
ח
ט
 
א
ת
ו
 
ל
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ז
ר
ק
ו
 
ב
נ
י
 
א
ה
ר
ן
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
ה
ק
ר
י
ב
 
מ
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ח
ל
ב
ו
 
ה
א
ל
י
ה
 
ת
מ
י
מ
ה
 
ל
ע
מ
ת
 
ה
ע
צ
ה
 
י
ס
י
ר
נ
ה
 
א
ת
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
א
ש
ר
 
ע
ל
 
ה
כ
ס
ל
י
ם
 
ו
א
ת
 
ה
י
ו
ת
ר
ת
 
ע
ל
 
ה
כ
ב
ד
 
ע
ל
 
ה
כ
ל
י
ו
ת
 
י
ס
י
ר
נ
ה
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
ה
מ
ז
ב
ח
ה
 
ל
ח
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
א
ם
 
ע
ז
 
ק
ר
ב
נ
ו
 
ו
ה
ק
ר
י
ב
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
ו
 
ו
ש
ח
ט
 
א
ת
ו
 
ל
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ז
ר
ק
ו
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
א
ת
 
ד
מ
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
ה
ק
ר
י
ב
 
מ
מ
נ
ו
 
ק
ר
ב
נ
ו
 
א
ש
ה
 
ל
י
ה
ו
ה
 
א
ת
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
א
ש
ר
 
ע
ל
 
ה
כ
ס
ל
י
ם
 
ו
א
ת
 
ה
י
ו
ת
ר
ת
 
ע
ל
 
ה
כ
ב
ד
 
ע
ל
 
ה
כ
ל
י
ו
ת
 
י
ס
י
ר
נ
ה
 
ו
ה
ק
ט
י
ר
ם
 
ה
כ
ה
ן
 
ה
מ
ז
ב
ח
ה
 
ל
ח
ם
 
א
ש
ה
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
כ
ל
 
ח
ל
ב
 
ל
י
ה
ו
ה
 
ח
ק
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
כ
ל
 
ח
ל
ב
 
ו
כ
ל
 
ד
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
נ
פ
ש
 
כ
י
 
ת
ח
ט
א
 
ב
ש
ג
ג
ה
 
מ
כ
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ש
ר
 
ל
א
 
ת
ע
ש
י
ה
ן
 
ו
ע
ש
ה
 
מ
א
ח
ת
 
מ
ה
ן
 
א
ם
 
ה
כ
ה
ן
 
ה
מ
ש
י
ח
 
י
ח
ט
א
 
ל
א
ש
מ
ת
 
ה
ע
ם
 
ו
ה
ק
ר
י
ב
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
פ
ר
 
ב
ן
 
ב
ק
ר
 
ת
מ
י
ם
 
ל
י
ה
ו
ה
 
ל
ח
ט
א
ת
 
ו
ה
ב
י
א
 
א
ת
 
ה
פ
ר
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ה
פ
ר
 
ו
ש
ח
ט
 
א
ת
 
ה
פ
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
ה
מ
ש
י
ח
 
א
ש
ר
 
מ
ל
א
 
א
ת
 
י
ד
ו
 
מ
ד
ם
 
ה
פ
ר
 
ו
ה
ב
י
א
 
א
ת
ו
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ט
ב
ל
 
ה
כ
ה
ן
 
א
ת
 
א
צ
ב
ע
ו
 
ב
ד
ם
 
ו
ה
ז
ה
 
מ
ן
 
ה
ד
ם
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ב
א
צ
ב
ע
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ת
 
פ
נ
י
 
פ
ר
כ
ת
 
ה
ק
ד
ש
 
ו
נ
ת
ן
 
ה
כ
ה
ן
 
מ
ן
 
ה
ד
ם
 
ע
ל
 
ק
ר
נ
ו
ת
 
ה
מ
ז
ב
ח
 
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ש
ר
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
כ
ל
 
ה
ד
ם
 
י
ש
פ
ך
 
א
ל
 
י
ס
ו
ד
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
א
ש
ר
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
כ
ל
 
ח
ל
ב
 
פ
ר
 
ה
ח
ט
א
ת
 
י
ר
י
ם
 
מ
מ
נ
ו
 
א
ת
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
א
ש
ר
 
ע
ל
 
ה
כ
ס
ל
י
ם
 
ו
א
ת
 
ה
י
ו
ת
ר
ת
 
ע
ל
 
ה
כ
ב
ד
 
ע
ל
 
ה
כ
ל
י
ו
ת
 
י
ס
י
ר
נ
ה
 
כ
א
ש
ר
 
י
ו
ר
ם
 
מ
ש
ו
ר
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ו
ה
ק
ט
י
ר
ם
 
ה
כ
ה
ן
 
ע
ל
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
ע
ו
ר
 
ה
פ
ר
 
ו
א
ת
 
כ
ל
 
ב
ש
ר
ו
 
ע
ל
 
ר
א
ש
ו
 
ו
ע
ל
 
כ
ר
ע
י
ו
 
ו
ק
ר
ב
ו
 
ו
פ
ר
ש
ו
 
ו
ה
ו
צ
י
א
ו
 
א
ת
 
כ
ל
 
ה
פ
ר
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
א
ל
 
מ
ק
ו
ם
 
ט
ה
ו
ר
 
ע
ל
 
ש
פ
ך
 
ה
ד
ש
ן
 
ו
ש
ר
פ
ו
 
א
ת
ו
 
ע
ל
 
ה
ע
צ
י
ם
 
ב
א
ש
 
ע
ל
 
ש
פ
ך
 
ה
ד
ש
ן
 
י
ש
ר
ף
 
ו
א
ם
 
כ
ל
 
ע
ד
ת
 
י
ש
ר
א
ל
 
י
ש
ג
ו
 
ו
נ
ע
ל
ם
 
ד
ב
ר
 
מ
ע
י
נ
י
 
ה
ק
ה
ל
 
ו
ע
ש
ו
 
א
ח
ת
 
מ
כ
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ש
ר
 
ל
א
 
ת
ע
ש
י
ה
ן
 
ו
א
ש
מ
ו
 
ו
נ
ו
ד
ע
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ח
ט
א
ו
 
ע
ל
י
ה
 
ו
ה
ק
ר
י
ב
ו
 
ה
ק
ה
ל
 
פ
ר
 
ב
ן
 
ב
ק
ר
 
ת
מ
י
ם
 
ל
ח
ט
א
ת
 
ו
ה
ב
י
א
ו
 
א
ת
ו
 
ל
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ס
מ
כ
ו
 
ז
ק
נ
י
 
ה
ע
ד
ה
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
פ
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ש
ח
ט
 
א
ת
 
ה
פ
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ה
ב
י
א
 
ה
כ
ה
ן
 
ה
מ
ש
י
ח
 
מ
ד
ם
 
ה
פ
ר
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ט
ב
ל
 
ה
כ
ה
ן
 
א
ת
 
א
צ
ב
ע
ו
 
מ
ן
 
ה
ד
ם
 
ו
ה
ז
ה
 
מ
ן
 
ה
ד
ם
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ת
 
פ
נ
י
 
פ
ר
כ
ת
 
ה
ק
ד
ש
 
ו
מ
ן
 
ה
ד
ם
 
י
ת
ן
 
ה
כ
ה
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
ה
מ
ז
ב
ח
 
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
א
ש
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ש
ר
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
כ
ל
 
ה
ד
ם
 
י
ש
פ
ך
 
א
ל
 
י
ס
ו
ד
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
א
ש
ר
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
כ
ל
 
ח
ל
ב
ו
 
י
ר
י
ם
 
מ
מ
נ
ו
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
ו
ע
ש
ה
 
ל
פ
ר
 
כ
א
ש
ר
 
ע
ש
ה
 
ל
פ
ר
 
ה
ח
ט
א
ת
 
כ
ן
 
י
ע
ש
ה
 
ל
ו
 
ו
כ
פ
ר
 
ע
ל
י
ה
ם
 
ה
כ
ה
ן
 
ו
נ
ס
ל
ח
 
ל
ה
ם
 
ו
ה
ו
צ
י
א
 
א
ת
 
ה
פ
ר
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
ש
ר
ף
 
א
ת
ו
 
כ
א
ש
ר
 
ש
ר
ף
 
א
ת
 
ה
פ
ר
 
ה
ר
א
י
ש
ו
ן
 
ח
ט
א
ת
 
ה
ק
ה
ל
 
ה
י
א
 
א
ש
ר
 
נ
ש
י
א
 
י
ח
ט
א
 
ו
ע
ש
ה
 
א
ח
ת
 
מ
כ
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ו
 
א
ש
ר
 
ל
א
 
ת
ע
ש
י
ה
ן
 
ב
ש
ג
ג
ה
 
ו
א
ש
ם
 
א
ו
 
ה
ו
ד
ע
 
א
ל
י
ו
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ב
ה
 
ו
ה
ב
י
א
 
א
ת
 
ק
ר
ב
נ
ו
 
ש
ע
י
ר
 
ע
ז
י
ם
 
ז
כ
ר
 
ת
מ
י
ם
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ה
ש
ע
י
ר
 
ו
ש
ח
ט
 
א
ת
ו
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ש
ח
ט
ו
 
א
ת
 
ה
ע
ל
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ח
ט
א
ת
 
ה
י
א
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
ד
ם
 
ה
ח
ט
א
ת
 
ב
א
צ
ב
ע
ו
 
ו
נ
ת
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
ד
מ
ו
 
י
ש
פ
ך
 
א
ל
 
י
ס
ו
ד
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
ח
ל
ב
ו
 
י
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
כ
ח
ל
ב
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
מ
ח
ט
א
ת
ו
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
א
ם
 
נ
פ
ש
 
א
ח
ת
 
ת
ח
ט
א
 
ב
ש
ג
ג
ה
 
מ
ע
ם
 
ה
א
ר
ץ
 
ב
ע
ש
ו
ת
ה
 
א
ח
ת
 
מ
כ
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ש
ר
 
ל
א
 
ת
ע
ש
י
ה
ן
 
ו
א
ש
ם
 
א
ו
 
ה
ו
ד
ע
 
א
ל
י
ו
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ע
ל
י
ה
 
ו
ה
ב
י
א
 
א
ת
 
ק
ר
ב
נ
ו
 
ש
ע
י
ר
ת
 
ע
ז
י
ם
 
נ
ק
ב
ה
 
ת
מ
י
מ
ה
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ה
ח
ט
א
ת
 
ו
ש
ח
ט
 
א
ת
 
ה
ח
ט
א
ת
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ש
ח
ט
ו
 
א
ת
 
ה
ע
ל
ה
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
ד
מ
ה
 
ב
א
צ
ב
ע
ו
 
ו
נ
ת
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
ד
מ
ה
 
י
ש
פ
ך
 
א
ל
 
י
ס
ו
ד
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
ח
ל
ב
ה
 
י
ס
י
ר
 
כ
א
ש
ר
 
י
ס
י
ר
 
ה
ח
ל
ב
 
מ
ע
ל
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
ה
מ
ז
ב
ח
ה
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
א
ם
 
כ
ש
ב
ה
 
י
ב
י
א
 
ק
ר
ב
נ
ו
 
ל
ח
ט
א
ת
 
נ
ק
ב
ה
 
ת
מ
י
מ
ה
 
י
ב
י
א
נ
ה
 
ו
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
 
ר
א
ש
 
ה
ח
ט
א
ת
 
ו
ש
ח
ט
 
א
ת
ה
 
ל
ח
ט
א
ת
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ש
ח
ט
ו
 
א
ת
 
ה
ע
ל
ה
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
ד
ם
 
ה
ח
ט
א
ת
 
ב
א
צ
ב
ע
ו
 
ו
נ
ת
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
ד
מ
ה
 
י
ש
פ
ך
 
א
ל
 
י
ס
ו
ד
 
מ
ז
ב
ח
 
ה
ע
ל
ה
 
ו
א
ת
 
כ
ל
 
ח
ל
ב
ה
 
י
ס
י
ר
 
כ
א
ש
ר
 
י
ס
י
ר
 
ח
ל
ב
 
ה
כ
ש
ב
 
מ
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
ה
מ
ז
ב
ח
ה
 
ע
ל
 
א
ש
י
 
י
ה
ו
ה
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
נ
פ
ש
 
כ
י
 
ת
ח
ט
א
 
ו
ש
מ
ע
ה
 
ק
ו
ל
 
א
ל
ה
 
ו
ה
ו
א
 
ע
ד
 
א
ו
 
ר
א
ה
 
א
ו
 
י
ד
ע
 
א
ם
 
ל
א
 
י
ג
י
ד
 
ו
נ
ש
א
 
ע
ו
נ
ו
 
א
ו
 
נ
פ
ש
 
כ
י
 
ת
ג
ע
 
ב
כ
ל
 
ד
ב
ר
 
ט
מ
א
 
א
ו
 
ב
נ
ב
ל
ת
 
ח
י
ה
 
ט
מ
א
ה
 
א
ו
 
ב
נ
ב
ל
ת
 
ב
ה
מ
ה
 
ט
מ
א
ה
 
א
ו
 
ב
נ
ב
ל
ת
 
ש
ר
ץ
 
ט
מ
א
 
ו
נ
ע
ל
ם
 
מ
מ
נ
ו
 
ו
ה
ו
א
 
ט
מ
א
 
ו
א
ש
ם
 
א
ו
 
כ
י
 
י
ג
ע
 
ב
ט
מ
א
ת
 
א
ד
ם
 
ל
כ
ל
 
ט
מ
א
ת
ו
 
א
ש
ר
 
י
ט
מ
א
 
ב
ה
 
ו
נ
ע
ל
ם
 
מ
מ
נ
ו
 
ו
ה
ו
א
 
י
ד
ע
 
ו
א
ש
ם
 
ו
נ
פ
ש
 
כ
י
 
ת
ש
ב
ע
 
ל
ב
ט
א
 
ב
ש
פ
ת
י
ם
 
ל
ה
ר
י
ע
 
א
ו
 
ל
ה
ט
י
ב
 
ל
כ
ל
 
א
ש
ר
 
י
ב
ט
א
 
ה
א
ד
ם
 
ב
ש
ב
ו
ע
ה
 
ו
נ
ע
ל
ם
 
מ
מ
נ
ו
 
ו
ה
ו
א
 
י
ד
ע
 
ו
א
ש
ם
 
ל
א
ח
ת
 
מ
א
ל
ה
 
ו
ה
י
ה
 
כ
י
 
י
ח
ט
א
 
ל
א
ח
ת
 
מ
א
ל
ה
 
ו
ה
ת
ו
ד
ה
 
א
ת
 
א
ש
ר
 
ח
ט
א
 
ע
ל
י
ה
 
ו
ה
ב
י
א
 
א
ת
 
א
ש
מ
ו
 
ל
י
ה
ו
ה
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
נ
ק
ב
ה
 
מ
ן
 
ה
צ
א
ן
 
כ
ש
ב
ה
 
א
ו
 
ש
ע
י
ר
ת
 
ע
ז
י
ם
 
ל
ח
ט
א
ת
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
א
ם
 
ל
א
 
ת
ש
י
ג
 
י
ד
ו
 
ד
י
 
ש
ה
 
ו
ה
ב
י
א
 
ע
ל
 
א
ש
מ
ו
 
א
ש
ר
 
ח
ט
א
 
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
ל
י
ה
ו
ה
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
א
ח
ד
 
ל
ע
ל
ה
 
ו
ה
ב
י
א
 
א
ת
ם
 
א
ל
 
ה
כ
ה
ן
 
ו
ה
ק
ר
י
ב
 
א
ת
 
א
ש
ר
 
ל
ח
ט
א
ת
 
ר
א
י
ש
ו
ן
 
ו
מ
ל
ק
 
ה
כ
ה
ן
 
א
ת
 
ר
א
ש
ו
 
מ
מ
ו
ל
 
ע
ר
פ
ו
 
ו
ל
א
 
י
ב
ד
ל
 
ו
ה
ז
ה
 
מ
ד
ם
 
ה
ח
ט
א
ת
 
א
ל
 
ק
י
ר
 
ה
מ
ז
ב
ח
 
ו
ה
נ
ש
א
ר
 
ב
ד
ם
 
י
מ
צ
א
 
א
ל
 
י
ס
ו
ד
 
ה
מ
ז
ב
ח
 
ח
ט
א
ת
 
ה
י
א
 
ו
א
ת
 
ה
ש
נ
י
 
י
ע
ש
ה
 
ע
ל
ה
 
כ
מ
ש
פ
ט
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
מ
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
א
ם
 
ל
א
 
ת
ש
י
ג
 
י
ד
ו
 
ל
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ל
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
ו
ה
ב
י
א
 
א
ת
 
ק
ר
ב
נ
ו
 
א
ש
ר
 
ח
ט
א
 
ע
ש
י
ר
ת
 
ה
א
י
פ
ה
 
ס
ל
ת
 
ל
ח
ט
א
ת
 
ל
א
 
י
צ
ק
 
ע
ל
י
ה
 
ש
מ
ן
 
ו
ל
א
 
י
ת
ן
 
ע
ל
י
ה
 
ל
ב
ו
נ
ה
 
כ
י
 
ח
ט
א
ת
 
ה
י
א
 
ו
ה
ב
י
א
ה
 
א
ל
 
ה
כ
ה
ן
 
ו
ק
מ
ץ
 
מ
מ
נ
ה
 
מ
ל
ו
א
 
ק
מ
צ
ו
 
א
ת
 
א
ז
כ
ר
ת
ה
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
ע
ל
 
א
ש
י
 
י
ה
ו
ה
 
ח
ט
א
ת
 
ה
י
א
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
מ
א
ח
ת
 
מ
א
ל
ה
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
ה
י
ת
ה
 
ל
כ
ה
ן
 
כ
מ
נ
ח
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
נ
פ
ש
 
כ
י
 
ת
מ
ע
ל
 
מ
ע
ל
 
ו
ח
ט
א
ה
 
ב
ש
ג
ג
ה
 
מ
ק
ד
ש
י
 
י
ה
ו
ה
 
ו
ה
ב
י
א
 
א
ת
 
א
ש
מ
ו
 
ל
י
ה
ו
ה
 
א
י
ל
 
ת
מ
י
ם
 
מ
ן
 
ה
צ
א
ן
 
ב
ע
ר
כ
ך
 
כ
ס
ף
 
ש
ק
ל
י
ם
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ל
א
ש
ם
 
ו
א
ת
 
א
ש
ר
 
ח
ט
א
 
מ
ן
 
ה
ק
ד
ש
 
י
ש
ל
ם
 
ו
א
ת
 
ח
מ
י
ש
ת
ו
 
י
ס
ף
 
ע
ל
י
ו
 
ו
נ
ת
ן
 
א
ת
ו
 
ל
כ
ה
ן
 
ו
ה
כ
ה
ן
 
י
כ
פ
ר
 
ע
ל
י
ו
 
ב
א
י
ל
 
ה
א
ש
ם
 
ו
נ
ס
ל
ח
 
ל
ו
 
ו
א
ם
 
נ
פ
ש
 
א
ח
ת
 
ת
ח
ט
א
 
ו
ע
ש
ת
ה
 
א
ח
ת
 
מ
כ
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ש
ר
 
ל
א
 
ת
ע
ש
י
ה
ן
 
ו
ל
א
 
י
ד
ע
 
ו
א
ש
ם
 
ו
נ
ש
א
 
ע
ו
נ
ו
 
ו
ה
ב
י
א
 
א
י
ל
 
ת
מ
י
ם
 
מ
ן
 
ה
צ
א
ן
 
ב
ע
ר
כ
ך
 
ל
א
ש
ם
 
א
ל
 
ה
כ
ה
ן
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ע
ל
 
ש
ג
ג
ת
ו
 
א
ש
ר
 
ש
ג
ג
 
ו
ה
ו
א
 
ל
א
 
י
ד
ע
 
ו
נ
ס
ל
ח
 
ל
ו
 
א
ש
ם
 
ה
ו
א
 
א
ש
ם
 
א
ש
ם
 
ל
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
נ
פ
ש
 
כ
י
 
ת
ח
ט
א
 
ו
מ
ע
ל
ה
 
מ
ע
ל
 
ב
י
ה
ו
ה
 
ו
כ
ח
ש
 
ב
ע
מ
י
ת
ו
 
ב
פ
ק
ד
ו
ן
 
א
ו
 
ב
ת
ש
ו
מ
ת
 
י
ד
 
א
ו
 
ב
ג
ז
ל
 
א
ו
 
ע
ש
ק
 
א
ת
 
ע
מ
י
ת
ו
 
א
ו
 
מ
צ
א
 
א
ב
ד
ה
 
ו
כ
ח
ש
 
ב
ה
 
ו
נ
ש
ב
ע
 
ע
ל
 
ש
ק
ר
 
ע
ל
 
א
ח
ת
 
מ
כ
ל
 
א
ש
ר
 
י
ע
ש
ה
 
ה
א
ד
ם
 
ל
ח
ט
א
 
ב
ה
ן
 
ו
ה
י
ה
 
כ
י
 
י
ח
ט
א
 
ו
א
ש
ם
 
ו
ה
ש
י
ב
 
א
ת
 
ה
ג
ז
ל
 
א
ש
ר
 
ג
ז
ל
 
א
ו
 
א
ת
 
ה
ע
ש
ו
ק
 
א
ש
ר
 
ע
ש
ק
 
א
ו
 
א
ת
 
ה
פ
ק
ד
ו
ן
 
א
ש
ר
 
ה
פ
ק
ד
 
א
ת
ו
 
א
ו
 
א
ת
 
ה
א
ב
ד
ה
 
א
ש
ר
 
מ
צ
א
 
א
ו
 
מ
כ
ל
 
ד
ב
ר
 
א
ש
ר
 
י
ש
ב
ע
 
ע
ל
י
ו
 
ל
ש
ק
ר
 
ו
ש
ל
ם
 
א
ת
ו
 
ב
ר
א
ש
ו
 
ו
ח
מ
י
ש
ת
ו
 
י
ס
ף
 
ע
ל
י
ו
 
ל
א
ש
ר
 
ה
ו
א
 
ל
ו
 
י
ת
נ
נ
ו
 
ב
י
ו
ם
 
א
ש
מ
ת
ו
 
ו
א
ת
 
א
ש
מ
ו
 
י
ב
י
א
 
ל
י
ה
ו
ה
 
א
י
ל
 
ת
מ
י
ם
 
מ
ן
 
ה
צ
א
ן
 
ב
ע
ר
כ
ך
 
ל
א
ש
ם
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
נ
ס
ל
ח
 
ל
ו
 
ע
ל
 
א
ח
ת
 
מ
כ
ל
 
א
ש
ר
 
י
ע
ש
ה
 
ל
א
ש
מ
ה
 
ב
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
צ
ו
י
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
ל
א
מ
ר
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
ע
ל
ה
 
ה
י
א
 
ה
ע
ל
ה
 
ע
ל
 
ה
מ
ו
ק
ד
ה
 
ע
ל
 
ה
מ
ז
ב
ח
 
כ
ל
 
ה
ל
י
ל
ה
 
ע
ד
 
ב
ק
ר
 
ו
א
ש
 
ה
מ
ז
ב
ח
 
ת
ו
ק
ד
 
ב
ו
 
ו
ל
ב
ש
 
ה
כ
ה
ן
 
מ
ד
י
 
ב
ד
 
ו
מ
כ
נ
ס
י
 
ב
ד
 
י
ל
ב
ש
 
ע
ל
 
ב
ש
ר
ו
 
ו
ה
ר
י
ם
 
א
ת
 
ה
ד
ש
ן
 
א
ש
ר
 
ת
א
כ
ל
 
ה
א
ש
 
א
ת
 
ה
ע
ל
ה
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ש
מ
ו
 
א
צ
ל
 
ה
מ
ז
ב
ח
 
ו
פ
ש
ט
 
א
ת
 
ב
ג
ד
י
ו
 
ו
ל
ב
ש
 
ב
ג
ד
י
ם
 
א
ח
ר
י
ם
 
ו
ה
ו
צ
י
א
 
א
ת
 
ה
ד
ש
ן
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
א
ל
 
מ
ק
ו
ם
 
ט
ה
ו
ר
 
ו
ה
א
ש
 
ע
ל
 
ה
מ
ז
ב
ח
 
ת
ו
ק
ד
 
ב
ו
 
ל
א
 
ת
כ
ב
ה
 
ו
ב
ע
ר
 
ע
ל
י
ה
 
ה
כ
ה
ן
 
ע
צ
י
ם
 
ב
ב
ק
ר
 
ב
ב
ק
ר
 
ו
ע
ר
ך
 
ע
ל
י
ה
 
ה
ע
ל
ה
 
ו
ה
ק
ט
י
ר
 
ע
ל
י
ה
 
ח
ל
ב
י
 
ש
ל
מ
י
ם
 
א
ש
 
ת
מ
י
ד
 
ת
ו
ק
ד
 
ע
ל
 
ה
מ
ז
ב
ח
 
ל
א
 
ת
כ
ב
ה
 
ו
ז
א
ת
 
ת
ו
ר
ת
 
ה
מ
נ
ח
ה
 
ה
ק
ר
י
ב
ו
 
א
ת
ה
 
ב
נ
י
 
א
ה
ר
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
 
פ
נ
י
 
ה
מ
ז
ב
ח
 
ו
ה
ר
י
ם
 
מ
מ
נ
ה
 
ב
ק
מ
צ
ו
 
מ
ס
ל
ת
 
ה
מ
נ
ח
ה
 
ו
מ
ש
מ
נ
ה
 
ו
א
ת
 
כ
ל
 
ה
ל
ב
ו
נ
ה
 
א
ש
ר
 
ע
ל
 
ה
מ
נ
ח
ה
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
א
ז
כ
ר
ת
ה
 
ל
י
ה
ו
ה
 
ו
ה
נ
ו
ת
ר
ת
 
מ
מ
נ
ה
 
י
א
כ
ל
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
מ
צ
ו
ת
 
ת
א
כ
ל
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
ב
ח
צ
ר
 
א
ה
ל
 
מ
ו
ע
ד
 
י
א
כ
ל
ו
ה
 
ל
א
 
ת
א
פ
ה
 
ח
מ
ץ
 
ח
ל
ק
ם
 
נ
ת
ת
י
 
א
ת
ה
 
מ
א
ש
י
 
י
ה
ו
ה
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
י
א
 
כ
ח
ט
א
ת
 
כ
א
ש
ם
 
כ
ל
 
ז
כ
ר
 
ב
ב
נ
י
 
א
ה
ר
ן
 
י
א
כ
ל
נ
ה
 
ח
ק
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
מ
א
ש
י
 
י
ה
ו
ה
 
כ
ל
 
א
ש
ר
 
י
ג
ע
 
ב
ה
ם
 
י
ק
ד
ש
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ז
ה
 
ק
ר
ב
ן
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
ב
י
ו
ם
 
ה
מ
ש
י
ח
 
א
ת
ו
 
ע
ש
י
ר
ת
 
ה
א
י
פ
ה
 
ס
ל
ת
 
ל
מ
נ
ח
ה
 
ת
מ
י
ד
 
מ
ח
צ
י
ת
ה
 
ב
ב
ק
ר
 
ו
מ
ח
צ
י
ת
ה
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ע
ל
 
ה
מ
ח
ב
ת
 
ב
ש
מ
ן
 
ת
ע
ש
ה
 
מ
ר
ב
כ
ת
 
ת
ב
י
א
נ
ה
 
ת
ו
פ
נ
י
 
מ
נ
ח
ת
 
פ
ת
י
ם
 
ת
ק
ר
י
ב
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ה
כ
ה
ן
 
ה
מ
ש
י
ח
 
ת
ח
ת
י
ו
 
מ
ב
נ
י
ו
 
י
ע
ש
ה
 
א
ת
ה
 
ח
ק
 
ע
ו
ל
ם
 
ל
י
ה
ו
ה
 
כ
ל
י
ל
 
ת
ק
ט
י
ר
 
ו
כ
ל
 
מ
נ
ח
ת
 
כ
ה
ן
 
כ
ל
י
ל
 
ת
ה
י
ה
 
ל
א
 
ת
א
כ
ל
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ל
א
מ
ר
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
ח
ט
א
ת
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ת
ש
ח
ט
 
ה
ע
ל
ה
 
ת
ש
ח
ט
 
ה
ח
ט
א
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
י
א
 
ה
כ
ה
ן
 
ה
מ
ח
ט
א
 
א
ת
ה
 
י
א
כ
ל
נ
ה
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
ת
א
כ
ל
 
ב
ח
צ
ר
 
א
ה
ל
 
מ
ו
ע
ד
 
כ
ל
 
א
ש
ר
 
י
ג
ע
 
ב
ב
ש
ר
ה
 
י
ק
ד
ש
 
ו
א
ש
ר
 
י
ז
ה
 
מ
ד
מ
ה
 
ע
ל
 
ה
ב
ג
ד
 
א
ש
ר
 
ת
ז
ה
 
ע
ל
י
ו
 
י
כ
ב
ס
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
ו
כ
ל
י
 
ח
ר
ש
 
א
ש
ר
 
ת
ב
ש
ל
 
ב
ו
 
י
ש
ב
ר
 
ו
א
ם
 
ב
כ
ל
י
 
נ
ח
ש
ת
 
ב
ש
ל
ה
 
ו
מ
ר
ק
 
ו
ש
ט
ף
 
ב
מ
י
ם
 
כ
ל
 
ז
כ
ר
 
ב
כ
ה
נ
י
ם
 
י
א
כ
ל
 
א
ת
ה
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
י
א
 
ו
כ
ל
 
ח
ט
א
ת
 
א
ש
ר
 
י
ב
ו
א
 
מ
ד
מ
ה
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
כ
פ
ר
 
ב
ק
ד
ש
 
ל
א
 
ת
א
כ
ל
 
ב
א
ש
 
ת
ש
ר
ף
 
ו
ז
א
ת
 
ת
ו
ר
ת
 
ה
א
ש
ם
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
ו
א
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ש
ח
ט
ו
 
א
ת
 
ה
ע
ל
ה
 
י
ש
ח
ט
ו
 
א
ת
 
ה
א
ש
ם
 
ו
א
ת
 
ד
מ
ו
 
י
ז
ר
ק
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
כ
ל
 
ח
ל
ב
ו
 
י
ק
ר
י
ב
 
מ
מ
נ
ו
 
א
ת
 
ה
א
ל
י
ה
 
ו
א
ת
 
ה
ח
ל
ב
 
ה
מ
כ
ס
ה
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
י
ה
ן
 
א
ש
ר
 
ע
ל
 
ה
כ
ס
ל
י
ם
 
ו
א
ת
 
ה
י
ו
ת
ר
ת
 
ע
ל
 
ה
כ
ב
ד
 
ע
ל
 
ה
כ
ל
י
ו
ת
 
י
ס
י
ר
נ
ה
 
ו
ה
ק
ט
י
ר
 
א
ת
ם
 
ה
כ
ה
ן
 
ה
מ
ז
ב
ח
ה
 
א
ש
ה
 
ל
י
ה
ו
ה
 
א
ש
ם
 
ה
ו
א
 
כ
ל
 
ז
כ
ר
 
ב
כ
ה
נ
י
ם
 
י
א
כ
ל
נ
ו
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
י
א
כ
ל
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
ו
א
 
כ
ח
ט
א
ת
 
כ
א
ש
ם
 
ת
ו
ר
ה
 
א
ח
ת
 
ל
ה
ם
 
ה
כ
ה
ן
 
א
ש
ר
 
י
כ
פ
ר
 
ב
ו
 
ל
ו
 
י
ה
י
ה
 
ו
ה
כ
ה
ן
 
ה
מ
ק
ר
י
ב
 
א
ת
 
ע
ל
ת
 
א
י
ש
 
ע
ו
ר
 
ה
ע
ל
ה
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
ל
כ
ה
ן
 
ל
ו
 
י
ה
י
ה
 
ו
כ
ל
 
מ
נ
ח
ה
 
א
ש
ר
 
ת
א
פ
ה
 
ב
ת
נ
ו
ר
 
ו
כ
ל
 
נ
ע
ש
ה
 
ב
מ
ר
ח
ש
ת
 
ו
ע
ל
 
ה
מ
ח
ב
ת
 
ל
כ
ה
ן
 
ה
מ
ק
ר
י
ב
 
א
ת
ה
 
ל
ו
 
ת
ה
י
ה
 
ו
כ
ל
 
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ו
ח
ר
ב
ה
 
ל
כ
ל
 
ב
נ
י
 
א
ה
ר
ן
 
ת
ה
י
ה
 
א
י
ש
 
כ
א
ח
י
ו
 
ו
ז
א
ת
 
ת
ו
ר
ת
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
א
ם
 
ע
ל
 
ת
ו
ד
ה
 
י
ק
ר
י
ב
נ
ו
 
ו
ה
ק
ר
י
ב
 
ע
ל
 
ז
ב
ח
 
ה
ת
ו
ד
ה
 
ח
ל
ו
ת
 
מ
צ
ו
ת
 
ב
ל
ל
ו
ת
 
ב
ש
מ
ן
 
ו
ר
ק
י
ק
י
 
מ
צ
ו
ת
 
מ
ש
ח
י
ם
 
ב
ש
מ
ן
 
ו
ס
ל
ת
 
מ
ר
ב
כ
ת
 
ח
ל
ו
ת
 
ב
ל
ל
ו
ת
 
ב
ש
מ
ן
 
ע
ל
 
ח
ל
ת
 
ל
ח
ם
 
ח
מ
ץ
 
י
ק
ר
י
ב
 
ק
ר
ב
נ
ו
 
ע
ל
 
ז
ב
ח
 
ת
ו
ד
ת
 
ש
ל
מ
י
ו
 
ו
ה
ק
ר
י
ב
 
מ
מ
נ
ו
 
א
ח
ד
 
מ
כ
ל
 
ק
ר
ב
ן
 
ת
ר
ו
מ
ה
 
ל
י
ה
ו
ה
 
ל
כ
ה
ן
 
ה
ז
ר
ק
 
א
ת
 
ד
ם
 
ה
ש
ל
מ
י
ם
 
ל
ו
 
י
ה
י
ה
 
ו
ב
ש
ר
 
ז
ב
ח
 
ת
ו
ד
ת
 
ש
ל
מ
י
ו
 
ב
י
ו
ם
 
ק
ר
ב
נ
ו
 
י
א
כ
ל
 
ל
א
 
י
נ
י
ח
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
ו
א
ם
 
נ
ד
ר
 
א
ו
 
נ
ד
ב
ה
 
ז
ב
ח
 
ק
ר
ב
נ
ו
 
ב
י
ו
ם
 
ה
ק
ר
י
ב
ו
 
א
ת
 
ז
ב
ח
ו
 
י
א
כ
ל
 
ו
מ
מ
ח
ר
ת
 
ו
ה
נ
ו
ת
ר
 
מ
מ
נ
ו
 
י
א
כ
ל
 
ו
ה
נ
ו
ת
ר
 
מ
ב
ש
ר
 
ה
ז
ב
ח
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ב
א
ש
 
י
ש
ר
ף
 
ו
א
ם
 
א
כ
ל
 
י
א
כ
ל
 
מ
ב
ש
ר
 
ז
ב
ח
 
ש
ל
מ
י
ו
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ל
א
 
י
ר
צ
ה
 
ה
מ
ק
ר
י
ב
 
א
ת
ו
 
ל
א
 
י
ח
ש
ב
 
ל
ו
 
פ
ג
ו
ל
 
י
ה
י
ה
 
ו
ה
נ
פ
ש
 
ה
א
כ
ל
ת
 
מ
מ
נ
ו
 
ע
ו
נ
ה
 
ת
ש
א
 
ו
ה
ב
ש
ר
 
א
ש
ר
 
י
ג
ע
 
ב
כ
ל
 
ט
מ
א
 
ל
א
 
י
א
כ
ל
 
ב
א
ש
 
י
ש
ר
ף
 
ה
ב
ש
ר
 
כ
ל
 
ט
ה
ו
ר
 
י
א
כ
ל
 
ב
ש
ר
 
ו
ה
נ
פ
ש
 
א
ש
ר
 
ת
א
כ
ל
 
ב
ש
ר
 
מ
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ר
 
ל
י
ה
ו
ה
 
ו
ט
מ
א
ת
ו
 
ע
ל
י
ו
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
מ
י
ה
 
ו
נ
פ
ש
 
כ
י
 
ת
ג
ע
 
ב
כ
ל
 
ט
מ
א
 
ב
ט
מ
א
ת
 
א
ד
ם
 
א
ו
 
ב
ב
ה
מ
ה
 
ט
מ
א
ה
 
א
ו
 
ב
כ
ל
 
ש
ר
ץ
 
ט
מ
א
 
ו
א
כ
ל
 
מ
ב
ש
ר
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ר
 
ל
י
ה
ו
ה
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
מ
י
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
כ
ל
 
ח
ל
ב
 
ש
ו
ר
 
ו
כ
ש
ב
 
ו
ע
ז
 
ל
א
 
ת
א
כ
ל
ו
 
ו
ח
ל
ב
 
נ
ב
ל
ה
 
ו
ח
ל
ב
 
ט
ר
פ
ה
 
י
ע
ש
ה
 
ל
כ
ל
 
ה
מ
ל
א
כ
ה
 
ו
א
כ
ל
 
ל
א
 
ת
א
כ
ל
ה
ו
 
כ
י
 
כ
ל
 
א
כ
ל
 
ח
ל
ב
 
מ
ן
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
מ
מ
נ
ה
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
א
כ
ל
ת
 
מ
ע
מ
י
ה
 
ו
כ
ל
 
ד
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ל
ע
ו
ף
 
ו
ל
ב
ה
מ
ה
 
ו
כ
ל
 
ה
נ
פ
ש
 
א
ש
ר
 
ת
א
כ
ל
 
כ
ל
 
ד
ם
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
מ
י
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ד
ב
ר
 
ל
א
מ
ר
 
ה
מ
ק
ר
י
ב
 
א
ת
 
ז
ב
ח
 
ש
ל
מ
י
ו
 
ל
י
ה
ו
ה
 
י
ב
י
א
 
א
ת
 
ק
ר
ב
נ
ו
 
ל
י
ה
ו
ה
 
מ
ז
ב
ח
 
ש
ל
מ
י
ו
 
י
ד
י
ו
 
ת
ב
י
א
נ
ה
 
א
ת
 
א
ש
י
 
י
ה
ו
ה
 
א
ת
 
ה
ח
ל
ב
 
ע
ל
 
ה
ח
ז
ה
 
י
ב
י
א
נ
ו
 
א
ת
 
ה
ח
ז
ה
 
ל
ה
נ
י
ף
 
א
ת
ו
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ה
ק
ט
י
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
ח
ל
ב
 
ה
מ
ז
ב
ח
ה
 
ו
ה
י
ה
 
ה
ח
ז
ה
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ו
א
ת
 
ש
ו
ק
 
ה
י
מ
י
ן
 
ת
ת
נ
ו
 
ת
ר
ו
מ
ה
 
ל
כ
ה
ן
 
מ
ז
ב
ח
י
 
ש
ל
מ
י
כ
ם
 
ה
מ
ק
ר
י
ב
 
א
ת
 
ד
ם
 
ה
ש
ל
מ
י
ם
 
ו
א
ת
 
ה
ח
ל
ב
 
מ
ב
נ
י
 
א
ה
ר
ן
 
ל
ו
 
ת
ה
י
ה
 
ש
ו
ק
 
ה
י
מ
י
ן
 
ל
מ
נ
ה
 
כ
י
 
א
ת
 
ח
ז
ה
 
ה
ת
נ
ו
פ
ה
 
ו
א
ת
 
ש
ו
ק
 
ה
ת
ר
ו
מ
ה
 
ל
ק
ח
ת
י
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ז
ב
ח
י
 
ש
ל
מ
י
ה
ם
 
ו
א
ת
ן
 
א
ת
ם
 
ל
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
ל
ב
נ
י
ו
 
ל
ח
ק
 
ע
ו
ל
ם
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ז
א
ת
 
מ
ש
ח
ת
 
א
ה
ר
ן
 
ו
מ
ש
ח
ת
 
ב
נ
י
ו
 
מ
א
ש
י
 
י
ה
ו
ה
 
ב
י
ו
ם
 
ה
ק
ר
י
ב
ו
 
א
ת
ם
 
ל
כ
ה
ן
 
ל
י
ה
ו
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ת
ת
 
ל
ה
ם
 
ב
י
ו
ם
 
מ
ש
ח
ו
 
א
ת
ם
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ח
ק
 
ע
ו
ל
ם
 
ל
ד
ר
ו
ת
ם
 
ז
א
ת
 
ה
ת
ו
ר
ה
 
ל
ע
ל
ה
 
ו
ל
מ
נ
ח
ה
 
ו
ל
ח
ט
א
ת
 
ו
ל
א
ש
ם
 
ו
ל
מ
ל
א
י
ם
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ב
ה
ר
 
ס
י
נ
י
 
ב
י
ו
ם
 
צ
ו
ת
ו
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ה
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
נ
י
ה
ם
 
ל
י
ה
ו
ה
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ח
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
א
ת
ו
 
ו
א
ת
 
ה
ב
ג
ד
י
ם
 
ו
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
א
ת
 
פ
ר
 
ה
ח
ט
א
ת
 
ו
א
ת
 
ש
נ
י
 
ה
א
י
ל
י
ם
 
ו
א
ת
 
ס
ל
 
ה
מ
צ
ו
ת
 
ו
א
ת
 
כ
ל
 
ה
ע
ד
ה
 
ה
ק
ה
ל
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ע
ש
 
מ
ש
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
ו
ת
ק
ה
ל
 
ה
ע
ד
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ד
ה
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
ו
י
ק
ר
י
ב
 
מ
ש
ה
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
ו
י
ר
ח
ץ
 
א
ת
ם
 
ב
מ
י
ם
 
ו
י
ת
ן
 
ע
ל
י
ו
 
א
ת
 
ה
כ
י
ת
נ
ת
 
ו
י
ח
ג
ר
 
א
ת
ו
 
ב
א
ב
נ
י
ט
 
ו
י
ל
ב
ש
 
א
ת
ו
 
א
ת
 
ה
מ
ע
י
ל
 
ו
י
ת
ן
 
ע
ל
י
ו
 
א
ת
 
ה
א
פ
ו
ד
 
ו
י
ח
ג
ר
 
א
ת
ו
 
ב
ח
ש
ב
 
ה
א
פ
ו
ד
 
ו
י
א
פ
ד
 
ל
ו
 
ב
ו
 
ו
י
ש
ם
 
ע
ל
י
ו
 
א
ת
 
ה
ח
ש
ן
 
ו
י
ת
ן
 
ע
ל
 
ה
ח
ש
ן
 
א
ת
 
ה
א
ר
י
ם
 
ו
א
ת
 
ה
ת
מ
י
ם
 
ו
י
ש
ם
 
א
ת
 
ה
מ
צ
נ
פ
ת
 
ע
ל
 
ר
א
ש
ו
 
ו
י
ת
ן
 
ע
ל
 
ה
מ
צ
נ
פ
ת
 
א
ל
 
מ
ו
ל
 
פ
נ
י
ו
 
א
ת
 
צ
י
ץ
 
ה
ז
ה
ב
 
נ
ז
ר
 
ה
ק
ד
ש
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
י
מ
ש
ח
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ו
 
ו
י
ק
ד
ש
 
א
ת
ם
 
ו
י
ז
 
מ
מ
נ
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ו
י
מ
ש
ח
 
א
ת
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
ל
ק
ד
ש
ם
 
ו
י
צ
ק
 
מ
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ע
ל
 
ר
א
ש
 
א
ה
ר
ן
 
ו
י
מ
ש
ח
 
א
ת
ו
 
ל
ק
ד
ש
ו
 
ו
י
ק
ר
י
ב
 
מ
ש
ה
 
א
ת
 
ב
נ
י
 
א
ה
ר
ן
 
ו
י
ל
ב
ש
ם
 
כ
י
ת
נ
ו
ת
 
ו
י
ח
ג
ר
 
א
ת
ם
 
א
ב
נ
י
ט
י
ם
 
ו
י
ח
ב
ש
 
ל
ה
ם
 
מ
ג
ב
ע
ו
ת
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ג
ש
 
א
ת
 
פ
ר
 
ה
ח
ט
א
ת
 
ו
י
ס
מ
ך
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
פ
ר
 
ה
ח
ט
א
ת
 
ו
י
ש
ח
ט
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ה
ד
ם
 
ו
י
ת
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ב
א
צ
ב
ע
ו
 
ו
י
ח
ט
א
 
א
ת
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
ה
ד
ם
 
י
צ
ק
 
א
ל
 
י
ס
ו
ד
 
ה
מ
ז
ב
ח
 
ו
י
ק
ד
ש
ה
ו
 
ל
כ
פ
ר
 
ע
ל
י
ו
 
ו
י
ק
ח
 
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
י
ו
ת
ר
ת
 
ה
כ
ב
ד
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ח
ל
ב
י
ה
ן
 
ו
י
ק
ט
ר
 
מ
ש
ה
 
ה
מ
ז
ב
ח
ה
 
ו
א
ת
 
ה
פ
ר
 
ו
א
ת
 
ע
ו
ר
ו
 
ו
א
ת
 
ב
ש
ר
ו
 
ו
א
ת
 
פ
ר
ש
ו
 
ש
ר
ף
 
ב
א
ש
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ג
ש
 
א
ת
 
א
י
ל
 
ה
ע
ל
ה
 
ו
י
ס
מ
כ
ו
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
א
י
ל
 
ו
י
ש
ח
ט
 
ו
י
ז
ר
ק
 
מ
ש
ה
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
ה
א
י
ל
 
נ
ת
ח
 
ל
נ
ת
ח
י
ו
 
ו
י
ק
ט
ר
 
מ
ש
ה
 
א
ת
 
ה
ר
א
ש
 
ו
א
ת
 
ה
נ
ת
ח
י
ם
 
ו
א
ת
 
ה
פ
ד
ר
 
ו
א
ת
 
ה
ק
ר
ב
 
ו
ה
כ
ר
ע
י
ם
 
ר
ח
ץ
 
ב
מ
י
ם
 
ו
י
ק
ט
ר
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ה
א
י
ל
 
ה
מ
ז
ב
ח
ה
 
ע
ל
ה
 
ה
ו
א
 
ל
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ה
ו
א
 
ל
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ק
ר
י
ב
 
א
ת
 
א
י
ל
 
ה
ש
נ
י
 
א
י
ל
 
ה
מ
ל
א
י
ם
 
ו
י
ס
מ
כ
ו
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
א
י
ל
 
ו
י
ש
ח
ט
 
ו
י
ק
ח
 
מ
ש
ה
 
מ
ד
מ
ו
 
ו
י
ת
ן
 
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
א
ה
ר
ן
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ו
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ו
 
ה
י
מ
נ
י
ת
 
ו
י
ק
ר
י
ב
 
א
ת
 
ב
נ
י
 
א
ה
ר
ן
 
ו
י
ת
ן
 
מ
ש
ה
 
מ
ן
 
ה
ד
ם
 
ע
ל
 
ת
נ
ך
 
א
ז
נ
ם
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ם
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ם
 
ה
י
מ
נ
י
ת
 
ו
י
ז
ר
ק
 
מ
ש
ה
 
א
ת
 
ה
ד
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
י
ק
ח
 
א
ת
 
ה
ח
ל
ב
 
א
ת
 
ה
א
ל
י
ה
 
ו
א
ת
 
כ
ל
 
ה
ח
ל
ב
 
א
ש
ר
 
ע
ל
 
ה
ק
ר
ב
 
ו
א
ת
 
י
ו
ת
ר
ת
 
ה
כ
ב
ד
 
ו
א
ת
 
ש
ת
י
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ח
ל
ב
י
ה
ן
 
ו
א
ת
 
ש
ו
ק
 
ה
י
מ
י
ן
 
ו
מ
ס
ל
 
ה
מ
צ
ו
ת
 
א
ש
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
ק
ח
 
ח
ל
ת
 
מ
צ
ה
 
א
ח
ת
 
ו
ח
ל
ת
 
ל
ח
ם
 
ש
מ
ן
 
א
ח
ת
 
ו
ר
ק
י
ק
 
א
ח
ד
 
ו
י
ש
ם
 
ע
ל
 
ה
ח
ל
ב
י
ם
 
ו
ע
ל
 
ש
ו
ק
 
ה
י
מ
י
ן
 
ו
י
ת
ן
 
א
ת
 
ה
כ
ל
 
ע
ל
 
כ
פ
י
 
א
ה
ר
ן
 
ו
ע
ל
 
כ
פ
י
 
ב
נ
י
ו
 
ו
י
נ
ף
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
ם
 
מ
ע
ל
 
כ
פ
י
ה
ם
 
ו
י
ק
ט
ר
 
ה
מ
ז
ב
ח
ה
 
ע
ל
 
ה
ע
ל
ה
 
מ
ל
א
י
ם
 
ה
ם
 
ל
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ה
ח
ז
ה
 
ו
י
נ
פ
ה
ו
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
מ
א
י
ל
 
ה
מ
ל
א
י
ם
 
ל
מ
ש
ה
 
ה
י
ה
 
ל
מ
נ
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ק
ח
 
מ
ש
ה
 
מ
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
מ
ן
 
ה
ד
ם
 
א
ש
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
י
ז
 
ע
ל
 
א
ה
ר
ן
 
ו
ע
ל
 
ב
ג
ד
י
ו
 
ו
ע
ל
 
ב
נ
י
ו
 
ו
ע
ל
 
ב
ג
ד
י
 
ב
נ
י
ו
 
א
ת
ו
 
ו
י
ק
ד
ש
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
ג
ד
י
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ו
א
ת
 
ב
ג
ד
י
 
ב
נ
י
ו
 
א
ת
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ב
ש
ל
ו
 
א
ת
 
ה
ב
ש
ר
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ב
מ
ק
ו
ם
 
ה
ק
ד
ש
 
ו
ש
ם
 
ת
א
כ
ל
ו
 
א
ת
ו
 
ו
א
ת
 
ה
ל
ח
ם
 
א
ש
ר
 
ב
ס
ל
 
ה
מ
ל
א
י
ם
 
כ
א
ש
ר
 
צ
ו
י
ת
י
 
ל
א
מ
ר
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
י
א
כ
ל
ה
ו
 
ו
ה
נ
ו
ת
ר
 
ב
ב
ש
ר
 
ו
ב
ל
ח
ם
 
ב
א
ש
 
ת
ש
ר
פ
ו
 
ו
מ
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
 
ת
צ
א
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ע
ד
 
י
ו
ם
 
מ
ל
א
ת
 
י
מ
י
 
מ
ל
א
י
כ
ם
 
כ
י
 
ש
ב
ע
ת
 
י
מ
י
ם
 
י
מ
ל
א
 
א
ת
 
י
ד
י
כ
ם
 
כ
א
ש
ר
 
ע
ש
ה
 
ב
י
ו
ם
 
ה
ז
ה
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
ל
כ
פ
ר
 
ע
ל
י
כ
ם
 
ו
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ת
ש
ב
ו
 
י
ו
מ
ם
 
ו
ל
י
ל
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
מ
ש
מ
ר
ת
 
י
ה
ו
ה
 
ו
ל
א
 
ת
מ
ו
ת
ו
 
כ
י
 
כ
ן
 
צ
ו
י
ת
י
 
ו
י
ע
ש
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ו
י
ה
י
 
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ק
ר
א
 
מ
ש
ה
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ו
ל
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
 
א
ה
ר
ן
 
ק
ח
 
ל
ך
 
ע
ג
ל
 
ב
ן
 
ב
ק
ר
 
ל
ח
ט
א
ת
 
ו
א
י
ל
 
ל
ע
ל
ה
 
ת
מ
י
מ
ם
 
ו
ה
ק
ר
י
ב
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
א
ל
 
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ת
ד
ב
ר
 
ל
א
מ
ר
 
ק
ח
ו
 
ש
ע
י
ר
 
ע
ז
י
ם
 
ל
ח
ט
א
ת
 
ו
ע
ג
ל
 
ו
כ
ב
ש
 
ב
נ
י
 
ש
נ
ה
 
ת
מ
י
מ
ם
 
ל
ע
ל
ה
 
ו
ש
ו
ר
 
ו
א
י
ל
 
ל
ש
ל
מ
י
ם
 
ל
ז
ב
ח
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
כ
י
 
ה
י
ו
ם
 
י
ה
ו
ה
 
נ
ר
א
ה
 
א
ל
י
כ
ם
 
ו
י
ק
ח
ו
 
א
ת
 
א
ש
ר
 
צ
ו
ה
 
מ
ש
ה
 
א
ל
 
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ק
ר
ב
ו
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
ע
מ
ד
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ת
ע
ש
ו
ן
 
ו
י
ר
א
ה
 
א
ל
י
כ
ם
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ק
ר
ב
 
א
ל
 
ה
מ
ז
ב
ח
 
ו
ע
ש
ה
 
א
ת
 
ח
ט
א
ת
ך
 
ו
א
ת
 
ע
ל
ת
ך
 
ו
כ
פ
ר
 
ב
ע
ד
ך
 
ו
ב
ע
ד
 
ה
ע
ם
 
ו
ע
ש
ה
 
א
ת
 
ק
ר
ב
ן
 
ה
ע
ם
 
ו
כ
פ
ר
 
ב
ע
ד
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
י
ק
ר
ב
 
א
ה
ר
ן
 
א
ל
 
ה
מ
ז
ב
ח
 
ו
י
ש
ח
ט
 
א
ת
 
ע
ג
ל
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ל
ו
 
ו
י
ק
ר
י
ב
ו
 
ב
נ
י
 
א
ה
ר
ן
 
א
ת
 
ה
ד
ם
 
א
ל
י
ו
 
ו
י
ט
ב
ל
 
א
צ
ב
ע
ו
 
ב
ד
ם
 
ו
י
ת
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
ה
ד
ם
 
י
צ
ק
 
א
ל
 
י
ס
ו
ד
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
ה
ח
ל
ב
 
ו
א
ת
 
ה
כ
ל
י
ו
ת
 
ו
א
ת
 
ה
י
ו
ת
ר
ת
 
מ
ן
 
ה
כ
ב
ד
 
מ
ן
 
ה
ח
ט
א
ת
 
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
א
ת
 
ה
ב
ש
ר
 
ו
א
ת
 
ה
ע
ו
ר
 
ש
ר
ף
 
ב
א
ש
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
ש
ח
ט
 
א
ת
 
ה
ע
ל
ה
 
ו
י
מ
צ
י
א
ו
 
ב
נ
י
 
א
ה
ר
ן
 
א
ל
י
ו
 
א
ת
 
ה
ד
ם
 
ו
י
ז
ר
ק
ה
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
ה
ע
ל
ה
 
ה
מ
צ
י
א
ו
 
א
ל
י
ו
 
ל
נ
ת
ח
י
ה
 
ו
א
ת
 
ה
ר
א
ש
 
ו
י
ק
ט
ר
 
ה
מ
ז
ב
ח
ה
 
ו
י
ר
ח
ץ
 
א
ת
 
ה
ק
ר
ב
 
ו
א
ת
 
ה
כ
ר
ע
י
ם
 
ו
י
ק
ט
ר
 
ע
ל
 
ה
ע
ל
ה
 
ה
מ
ז
ב
ח
ה
 
ו
י
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
ן
 
ה
ע
ם
 
ו
י
ק
ח
 
א
ת
 
ש
ע
י
ר
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ל
ע
ם
 
ו
י
ש
ח
ט
ה
ו
 
ו
י
ח
ט
א
ה
ו
 
כ
ר
א
י
ש
ו
ן
 
ו
י
ק
ר
ב
 
א
ת
 
ה
ע
ל
ה
 
ו
י
ע
ש
ה
 
כ
מ
ש
פ
ט
 
ו
י
ק
ר
ב
 
א
ת
 
ה
מ
נ
ח
ה
 
ו
י
מ
ל
א
 
כ
פ
י
ו
 
מ
מ
נ
ה
 
ו
י
ק
ט
ר
 
ע
ל
 
ה
מ
ז
ב
ח
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ב
ק
ר
 
ו
י
ש
ח
ט
 
א
ת
 
ה
ש
ו
ר
 
ו
א
ת
 
ה
א
י
ל
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
א
ש
ר
 
ל
ע
ם
 
ו
י
מ
צ
י
א
ו
 
ב
נ
י
 
א
ה
ר
ן
 
א
ת
 
ה
ד
ם
 
א
ל
י
ו
 
ו
י
ז
ר
ק
ה
ו
 
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
ה
ח
ל
ב
י
ם
 
מ
ן
 
ה
ש
ו
ר
 
ו
מ
ן
 
ה
א
י
ל
 
ה
א
ל
י
ה
 
ו
ה
מ
כ
ס
ה
 
ו
ה
כ
ל
י
ו
ת
 
ו
י
ו
ת
ר
ת
 
ה
כ
ב
ד
 
ו
י
ש
ם
 
א
ת
 
ה
ח
ל
ב
י
ם
 
ע
ל
 
ה
ח
ז
ו
ת
 
ו
י
ק
ט
ר
 
ה
ח
ל
ב
י
ם
 
ה
מ
ז
ב
ח
ה
 
ו
א
ת
 
ה
ח
ז
ו
ת
 
ו
א
ת
 
ש
ו
ק
 
ה
י
מ
י
ן
 
ה
נ
י
ף
 
א
ה
ר
ן
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ש
א
 
א
ה
ר
ן
 
א
ת
 
י
ד
ו
 
ע
ל
 
ה
ע
ם
 
ו
י
ב
ר
כ
ם
 
ו
י
ר
ד
 
מ
ע
ש
ו
ת
 
ה
ח
ט
א
ת
 
ו
ה
ע
ל
ה
 
ו
ה
ש
ל
מ
י
ם
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
צ
א
ו
 
ו
י
ב
ר
כ
ו
 
א
ת
 
ה
ע
ם
 
ו
י
ר
א
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
א
ל
 
כ
ל
 
ה
ע
ם
 
ו
ת
צ
א
 
א
ש
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ת
א
כ
ל
 
ע
ל
 
ה
מ
ז
ב
ח
 
א
ת
 
ה
ע
ל
ה
 
ו
א
ת
 
ה
ח
ל
ב
י
ם
 
ו
י
ר
א
ו
 
כ
ל
 
ה
ע
ם
 
ו
י
ר
נ
ו
 
ו
י
פ
ל
ו
 
ע
ל
 
פ
נ
י
ה
ם
 
ו
י
ק
ח
ו
 
ב
נ
י
 
א
ה
ר
ן
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
א
י
ש
 
מ
ח
ת
ת
ו
 
ו
י
ת
נ
ו
 
ב
ה
ן
 
א
ש
 
ו
י
ש
מ
ו
 
ע
ל
י
ה
ן
 
ק
ט
ר
ת
 
ו
י
ק
ר
י
ב
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ש
 
ז
ר
ה
 
א
ש
ר
 
ל
א
 
צ
ו
ה
 
א
ת
ם
 
ו
ת
צ
א
 
א
ש
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ת
א
כ
ל
 
א
ת
ם
 
ו
י
מ
ת
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ה
ו
א
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ל
א
מ
ר
 
ב
ק
ר
י
ב
י
 
א
ק
ד
ש
 
ו
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
ע
ם
 
א
כ
ב
ד
 
ו
י
ד
ם
 
א
ה
ר
ן
 
ו
י
ק
ר
א
 
מ
ש
ה
 
א
ל
 
מ
י
ש
א
ל
 
ו
א
ל
 
א
ל
י
צ
פ
ן
 
ב
נ
י
 
ע
ז
י
א
ל
 
ד
ד
 
א
ה
ר
ן
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ק
ר
ב
ו
 
ש
א
ו
 
א
ת
 
א
ח
י
כ
ם
 
מ
א
ת
 
פ
נ
י
 
ה
ק
ד
ש
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
ק
ר
ב
ו
 
ו
י
ש
א
ו
 
א
ת
ם
 
ב
כ
י
ת
נ
ו
ת
ם
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
כ
א
ש
ר
 
ד
ב
ר
 
מ
ש
ה
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
א
ל
ע
ז
ר
 
ו
א
ל
 
א
י
ת
מ
ר
 
ב
נ
י
ו
 
ר
א
ש
י
כ
ם
 
ל
א
 
ת
פ
ר
ע
ו
 
ו
ב
ג
ד
י
כ
ם
 
ל
א
 
ת
פ
ר
מ
ו
 
ו
ל
א
 
ת
מ
ו
ת
ו
 
ו
ע
ל
 
כ
ל
 
ה
ע
ד
ה
 
י
ק
צ
ף
 
ו
א
ח
י
כ
ם
 
כ
ל
 
ב
י
ת
 
י
ש
ר
א
ל
 
י
ב
כ
ו
 
א
ת
 
ה
ש
ר
פ
ה
 
א
ש
ר
 
ש
ר
ף
 
י
ה
ו
ה
 
ו
מ
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
 
ת
צ
א
ו
 
פ
ן
 
ת
מ
ו
ת
ו
 
כ
י
 
ש
מ
ן
 
מ
ש
ח
ת
 
י
ה
ו
ה
 
ע
ל
י
כ
ם
 
ו
י
ע
ש
ו
 
כ
ד
ב
ר
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
י
י
ן
 
ו
ש
כ
ר
 
א
ל
 
ת
ש
ת
ה
 
א
ת
ה
 
ו
ב
נ
י
ך
 
א
ת
ך
 
ב
ב
א
כ
ם
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
א
 
ת
מ
ו
ת
ו
 
ח
ק
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ו
ל
ה
ב
ד
י
ל
 
ב
י
ן
 
ה
ק
ד
ש
 
ו
ב
י
ן
 
ה
ח
ל
 
ו
ב
י
ן
 
ה
ט
מ
א
 
ו
ב
י
ן
 
ה
ט
ה
ו
ר
 
ו
ל
ה
ו
ר
ו
ת
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
כ
ל
 
ה
ח
ק
י
ם
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
ה
ם
 
ב
י
ד
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
א
ל
ע
ז
ר
 
ו
א
ל
 
א
י
ת
מ
ר
 
ב
נ
י
ו
 
ה
נ
ו
ת
ר
י
ם
 
ק
ח
ו
 
א
ת
 
ה
מ
נ
ח
ה
 
ה
נ
ו
ת
ר
ת
 
מ
א
ש
י
 
י
ה
ו
ה
 
ו
א
כ
ל
ו
ה
 
מ
צ
ו
ת
 
א
צ
ל
 
ה
מ
ז
ב
ח
 
כ
י
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
י
א
 
ו
א
כ
ל
ת
ם
 
א
ת
ה
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
כ
י
 
ח
ק
ך
 
ו
ח
ק
 
ב
נ
י
ך
 
ה
י
א
 
מ
א
ש
י
 
י
ה
ו
ה
 
כ
י
 
כ
ן
 
צ
ו
י
ת
י
 
ו
א
ת
 
ח
ז
ה
 
ה
ת
נ
ו
פ
ה
 
ו
א
ת
 
ש
ו
ק
 
ה
ת
ר
ו
מ
ה
 
ת
א
כ
ל
ו
 
ב
מ
ק
ו
ם
 
ט
ה
ו
ר
 
א
ת
ה
 
ו
ב
נ
י
ך
 
ו
ב
נ
ת
י
ך
 
א
ת
ך
 
כ
י
 
ח
ק
ך
 
ו
ח
ק
 
ב
נ
י
ך
 
נ
ת
נ
ו
 
מ
ז
ב
ח
י
 
ש
ל
מ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ש
ו
ק
 
ה
ת
ר
ו
מ
ה
 
ו
ח
ז
ה
 
ה
ת
נ
ו
פ
ה
 
ע
ל
 
א
ש
י
 
ה
ח
ל
ב
י
ם
 
י
ב
י
א
ו
 
ל
ה
נ
י
ף
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ה
י
ה
 
ל
ך
 
ו
ל
ב
נ
י
ך
 
ו
ל
ב
נ
ת
י
ך
 
א
ת
ך
 
ל
ח
ק
 
ע
ו
ל
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
א
ת
 
ש
ע
י
ר
 
ה
ח
ט
א
ת
 
ד
ר
ש
 
ד
ר
ש
 
מ
ש
ה
 
ו
ה
נ
ה
 
ש
ר
ו
ף
 
ו
י
ק
צ
ף
 
ע
ל
 
א
ל
ע
ז
ר
 
ו
ע
ל
 
א
י
ת
מ
ר
 
ב
נ
י
 
א
ה
ר
ן
 
ה
נ
ו
ת
ר
י
ם
 
ל
א
מ
ר
 
מ
ד
ו
ע
 
ל
א
 
א
כ
ל
ת
ם
 
א
ת
 
ה
ח
ט
א
ת
 
ב
מ
ק
ו
ם
 
ה
ק
ד
ש
 
כ
י
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
י
א
 
ו
א
ת
ה
 
נ
ת
ן
 
ל
כ
ם
 
ל
ש
א
ת
 
א
ת
 
ע
ו
ן
 
ה
ע
ד
ה
 
ל
כ
פ
ר
 
ע
ל
י
ה
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ה
ן
 
ל
א
 
ה
ו
ב
א
 
א
ת
 
ד
מ
ה
 
א
ל
 
ה
ק
ד
ש
 
פ
נ
י
מ
ה
 
א
כ
ל
 
ת
א
כ
ל
ו
 
א
ת
ה
 
ב
ק
ד
ש
 
כ
א
ש
ר
 
צ
ו
י
ת
י
 
ו
י
ד
ב
ר
 
א
ה
ר
ן
 
א
ל
 
מ
ש
ה
 
ה
ן
 
ה
י
ו
ם
 
ה
ק
ר
י
ב
ו
 
א
ת
 
ח
ט
א
ת
ם
 
ו
א
ת
 
ע
ל
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ת
ק
ר
א
נ
ה
 
א
ת
י
 
כ
א
ל
ה
 
ו
א
כ
ל
ת
י
 
ח
ט
א
ת
 
ה
י
ו
ם
 
ה
י
י
ט
ב
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ו
י
ש
מ
ע
 
מ
ש
ה
 
ו
י
י
ט
ב
 
ב
ע
י
נ
י
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
א
ל
י
ה
ם
 
ד
ב
ר
ו
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ז
א
ת
 
ה
ח
י
ה
 
א
ש
ר
 
ת
א
כ
ל
ו
 
מ
כ
ל
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
ע
ל
 
ה
א
ר
ץ
 
כ
ל
 
מ
פ
ר
י
ס
ת
 
פ
ר
ס
ה
 
ו
ש
ס
ע
ת
 
ש
ס
ע
 
ש
ת
י
 
פ
ר
ס
ו
ת
 
מ
ע
ל
ו
ת
 
ג
ר
ה
 
ב
ב
ה
מ
ה
 
א
ת
ה
 
ת
א
כ
ל
ו
 
א
ך
 
א
ת
 
ז
ה
 
ל
א
 
ת
א
כ
ל
ו
 
מ
מ
ע
ל
י
 
ה
ג
ר
ה
 
ו
מ
מ
פ
ר
י
ס
י
 
ה
פ
ר
ס
ה
 
א
ת
 
ה
ג
מ
ל
 
כ
י
 
מ
ע
ל
י
 
ג
ר
ה
 
ה
ו
א
 
ו
פ
ר
ס
ה
 
א
י
נ
נ
ו
 
מ
פ
ר
י
ס
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
ו
א
ת
 
ה
ש
פ
ן
 
כ
י
 
מ
ע
ל
י
 
ג
ר
ה
 
ה
ו
א
 
ו
פ
ר
ס
ה
 
ל
א
 
ה
פ
ר
י
ס
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
ו
א
ת
 
ה
א
ר
נ
ב
ת
 
כ
י
 
מ
ע
ל
ת
 
ג
ר
ה
 
ה
י
א
 
ו
פ
ר
ס
ה
 
ל
א
 
ה
פ
ר
י
ס
ה
 
ט
מ
א
ה
 
ה
י
א
 
ל
כ
ם
 
ו
א
ת
 
ה
ח
ז
י
ר
 
כ
י
 
מ
פ
ר
י
ס
 
פ
ר
ס
ה
 
ה
ו
א
 
ו
ש
ס
ע
 
ש
ס
ע
 
פ
ר
ס
ה
 
ו
ה
ו
א
 
ג
ר
ה
 
ל
א
 
י
ג
ו
ר
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
מ
ב
ש
ר
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ו
ב
נ
ב
ל
ת
ם
 
ל
א
 
ת
ג
ע
ו
 
ט
מ
א
י
ם
 
ה
ם
 
ל
כ
ם
 
ו
א
ת
 
ז
ה
 
ת
א
כ
ל
ו
 
מ
כ
ל
 
א
ש
ר
 
ב
מ
י
ם
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ס
נ
פ
י
ר
 
ו
ק
ש
ק
ש
ת
 
ב
מ
י
ם
 
ב
י
מ
י
ם
 
ו
ב
נ
ח
ל
י
ם
 
א
ת
ם
 
ת
א
כ
ל
ו
 
ו
כ
ל
 
א
ש
ר
 
א
י
ן
 
ל
ו
 
ס
נ
פ
י
ר
 
ו
ק
ש
ק
ש
ת
 
ב
מ
י
ם
 
ב
י
מ
י
ם
 
ו
ב
נ
ח
ל
י
ם
 
מ
כ
ל
 
ש
ר
ץ
 
ה
מ
י
ם
 
ו
מ
כ
ל
 
נ
פ
ש
 
ה
ח
י
ה
 
א
ש
ר
 
ב
מ
י
ם
 
ש
ק
ץ
 
ה
ם
 
ל
כ
ם
 
ו
ש
ק
ץ
 
י
ה
י
ו
 
ל
כ
ם
 
מ
ב
ש
ר
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ו
א
ת
 
נ
ב
ל
ת
ם
 
ת
ש
ק
צ
ו
 
ו
כ
ל
 
א
ש
ר
 
א
י
ן
 
ל
ו
 
ס
נ
פ
י
ר
 
ו
ק
ש
ק
ש
ת
 
ב
מ
י
ם
 
ש
ק
ץ
 
ה
ו
א
 
ל
כ
ם
 
ו
א
ת
 
א
ל
ה
 
ת
ש
ק
צ
ו
 
מ
ן
 
ה
ע
ו
ף
 
ל
א
 
ת
א
כ
ל
ו
 
ש
ק
ץ
 
ה
ם
 
א
ת
 
ה
נ
ש
ר
 
ו
א
ת
 
ה
פ
ר
ס
 
ו
א
ת
 
ה
ע
ז
נ
י
ה
 
ו
א
ת
 
ה
ד
א
ה
 
ו
א
ת
 
ה
א
י
ה
 
ל
מ
י
נ
ה
 
ו
א
ת
 
כ
ל
 
ע
ר
ב
 
ל
מ
י
נ
ו
 
ו
א
ת
 
ב
ת
 
ה
י
ע
נ
ה
 
ו
א
ת
 
ה
ת
ח
מ
ו
ס
 
ו
א
ת
 
ה
ש
ח
ף
 
ל
מ
י
נ
ו
 
ו
א
ת
 
ה
נ
ץ
 
ו
א
ת
 
ה
כ
ו
ס
 
ו
א
ת
 
ה
ש
ל
ך
 
ו
א
ת
 
ה
י
נ
ש
ו
ף
 
ו
א
ת
 
ה
ת
נ
ש
מ
ת
 
ו
א
ת
 
ה
ק
א
ת
 
ו
א
ת
 
ה
ר
ח
מ
ה
 
ו
א
ת
 
ה
ח
ס
י
ד
ה
 
ו
ה
א
נ
פ
ה
 
ל
מ
י
נ
ה
 
ו
א
ת
 
ה
ד
ג
י
פ
ת
 
ו
א
ת
 
ה
ע
ט
ל
ף
 
כ
ל
 
ש
ר
ץ
 
ה
ע
ו
ף
 
ה
ה
ל
ך
 
ע
ל
 
א
ר
ב
ע
 
ש
ק
ץ
 
ה
ו
א
 
ל
כ
ם
 
א
ך
 
א
ת
 
ז
ה
 
ת
א
כ
ל
ו
 
מ
כ
ל
 
ש
ר
ץ
 
ה
ע
ו
ף
 
ה
ה
ל
ך
 
ע
ל
 
א
ר
ב
ע
 
א
ש
ר
 
ל
ו
 
כ
ר
ע
י
ם
 
מ
מ
ע
ל
 
ל
ר
ג
ל
י
ו
 
ל
נ
ת
ר
 
ב
ה
ם
 
ע
ל
 
ה
א
ר
ץ
 
א
ת
 
א
ל
ה
 
מ
ה
ם
 
ת
א
כ
ל
ו
 
א
ת
 
ה
א
ר
ב
ה
 
ל
מ
י
נ
ה
ו
 
ו
א
ת
 
ה
ס
ל
ע
ם
 
ל
מ
י
נ
ה
ו
 
ו
א
ת
 
ה
ח
ר
ג
ל
 
ל
מ
י
נ
ה
 
ו
א
ת
 
ה
ח
ג
ב
 
ל
מ
י
נ
ה
ו
 
ו
כ
ל
 
ש
ר
ץ
 
ה
ע
ו
ף
 
א
ש
ר
 
ל
ו
 
א
ר
ב
ע
 
ר
ג
ל
י
ם
 
ש
ק
ץ
 
ה
ו
א
 
ל
כ
ם
 
ו
ל
א
ל
ה
 
ת
ט
מ
א
ו
 
כ
ל
 
ה
נ
ג
ע
 
ב
נ
ב
ל
ת
ם
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
ה
נ
ש
א
 
מ
נ
ב
ל
ת
ם
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ל
כ
ל
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
ה
י
א
 
מ
פ
ר
י
ס
ת
 
פ
ר
ס
ה
 
ו
ש
ס
ע
ה
 
א
י
נ
נ
ה
 
ש
ס
ע
 
ו
ג
ר
ה
 
א
י
נ
נ
ה
 
מ
ע
ל
ה
 
ט
מ
א
י
ם
 
ה
ם
 
ל
כ
ם
 
כ
ל
 
ה
נ
ג
ע
 
ב
ה
ם
 
י
ט
מ
א
 
ו
כ
ל
 
ה
ה
ל
ך
 
ע
ל
 
כ
פ
י
ו
 
ב
כ
ל
 
ה
ח
י
ה
 
ה
ה
ל
כ
ת
 
ע
ל
 
א
ר
ב
ע
 
ט
מ
א
י
ם
 
ה
ם
 
ל
כ
ם
 
כ
ל
 
ה
נ
ג
ע
 
ב
נ
ב
ל
ת
ם
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
נ
ש
א
 
מ
נ
ב
ל
ת
ם
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ט
מ
א
י
ם
 
ה
ם
 
ל
כ
ם
 
ו
ז
ה
 
ל
כ
ם
 
ה
ט
מ
א
 
ב
ש
ר
ץ
 
ה
ש
ר
ץ
 
ע
ל
 
ה
א
ר
ץ
 
ה
ח
ל
ד
 
ו
ה
ע
כ
ב
ו
ר
 
ו
ה
צ
ב
 
ל
מ
י
נ
ו
 
ו
ה
א
נ
ק
ה
 
ו
ה
כ
ח
 
ו
ה
ל
א
ט
ה
 
ו
ה
מ
ט
 
ו
ה
ת
נ
ש
מ
ת
 
א
ל
ה
 
ה
ט
מ
א
י
ם
 
ל
כ
ם
 
מ
כ
ל
 
ה
ש
ר
ץ
 
כ
ל
 
ה
נ
ג
ע
 
ב
ה
ם
 
ב
מ
ו
ת
ם
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
א
ש
ר
 
י
פ
ל
 
ע
ל
י
ו
 
מ
ה
ם
 
ב
מ
ו
ת
ם
 
י
ט
מ
א
 
מ
כ
ל
 
כ
ל
י
 
ע
ץ
 
א
ו
 
ב
ג
ד
 
א
ו
 
ע
ו
ר
 
א
ו
 
ש
ק
 
כ
ל
 
כ
ל
י
 
א
ש
ר
 
י
ע
ש
ה
 
מ
ל
א
כ
ה
 
ב
ה
ם
 
ב
מ
י
ם
 
י
ב
ו
א
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ט
ה
ר
 
ו
כ
ל
 
כ
ל
י
 
ח
ר
ש
 
א
ש
ר
 
י
פ
ל
 
מ
ה
ם
 
א
ל
 
ת
ו
כ
ו
 
כ
ל
 
א
ש
ר
 
ב
ת
ו
כ
ו
 
י
ט
מ
א
 
ו
א
ת
ו
 
ת
ש
ב
ר
ו
 
מ
כ
ל
 
ה
א
כ
ל
 
א
ש
ר
 
י
א
כ
ל
 
א
ש
ר
 
י
ב
ו
א
 
ע
ל
י
ו
 
מ
י
ם
 
י
ט
מ
א
 
ו
כ
ל
 
מ
ש
ק
ה
 
א
ש
ר
 
י
ש
ת
ה
 
ב
כ
ל
 
כ
ל
י
 
י
ט
מ
א
 
ו
כ
ל
 
א
ש
ר
 
י
פ
ל
 
מ
נ
ב
ל
ת
ם
 
ע
ל
י
ו
 
י
ט
מ
א
 
ת
נ
ו
ר
 
ו
כ
ר
י
ם
 
י
ת
צ
ו
 
ט
מ
א
י
ם
 
ה
ם
 
ו
ט
מ
א
י
ם
 
י
ה
י
ו
 
ל
כ
ם
 
א
ך
 
מ
ע
י
ן
 
מ
י
ם
 
ו
ב
ו
ר
 
מ
ק
ו
ה
 
מ
י
ם
 
י
ה
י
ה
 
ט
ה
ו
ר
 
ו
נ
ג
ע
 
ב
נ
ב
ל
ת
ם
 
י
ט
מ
א
 
ו
כ
י
 
י
פ
ל
 
מ
נ
ב
ל
ת
ם
 
ע
ל
 
ז
ר
ע
 
ז
ר
ע
 
א
ש
ר
 
י
ז
ר
ע
 
ט
ה
ו
ר
 
ה
ו
א
 
ו
כ
י
 
י
ת
ן
 
מ
י
ם
 
ע
ל
 
ה
ז
ר
ע
 
ו
נ
פ
ל
 
מ
נ
ב
ל
ת
ם
 
ע
ל
י
ו
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
ו
כ
י
 
י
מ
ו
ת
 
מ
ן
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
ה
י
א
 
ל
כ
ם
 
ל
א
כ
ל
ה
 
ה
נ
ג
ע
 
ב
נ
ב
ל
ת
ה
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
א
כ
ל
 
מ
נ
ב
ל
ת
ה
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
נ
ש
א
 
א
ת
 
נ
ב
ל
ת
ה
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
ה
ש
ר
ץ
 
ה
ש
ר
ץ
 
ע
ל
 
ה
א
ר
ץ
 
ש
ק
ץ
 
ה
ו
א
 
ל
א
 
י
א
כ
ל
 
כ
ל
 
ה
ה
ל
ך
 
ע
ל
 
ג
ח
ו
ן
 
ו
כ
ל
 
ה
ה
ל
ך
 
ע
ל
 
א
ר
ב
ע
 
ע
ד
 
כ
ל
 
מ
ר
ב
ה
 
ר
ג
ל
י
ם
 
ל
כ
ל
 
ה
ש
ר
ץ
 
ה
ש
ר
ץ
 
ע
ל
 
ה
א
ר
ץ
 
ל
א
 
ת
א
כ
ל
ו
ם
 
כ
י
 
ש
ק
ץ
 
ה
ם
 
א
ל
 
ת
ש
ק
צ
ו
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ב
כ
ל
 
ה
ש
ר
ץ
 
ה
ש
ר
ץ
 
ו
ל
א
 
ת
ט
מ
א
ו
 
ב
ה
ם
 
ו
נ
ט
מ
א
ת
ם
 
ב
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ה
ת
ק
ד
ש
ת
ם
 
ו
ה
י
י
ת
ם
 
ק
ד
י
ש
י
ם
 
כ
י
 
ק
ד
ו
ש
 
א
נ
י
 
ו
ל
א
 
ת
ט
מ
א
ו
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ב
כ
ל
 
ה
ש
ר
ץ
 
ה
ר
מ
ש
 
ע
ל
 
ה
א
ר
ץ
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
מ
ע
ל
ה
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ה
י
ו
ת
 
ל
כ
ם
 
ל
א
ל
ה
י
ם
 
ו
ה
י
י
ת
ם
 
ק
ד
י
ש
י
ם
 
כ
י
 
ק
ד
ו
ש
 
א
נ
י
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
ב
ה
מ
ה
 
ו
ה
ע
ו
ף
 
ו
כ
ל
 
ה
נ
פ
ש
 
ה
ח
י
ה
 
ה
ר
מ
ש
ת
 
ב
מ
י
ם
 
ל
כ
ל
 
ה
נ
פ
ש
 
ה
ש
ר
צ
ת
 
ע
ל
 
ה
א
ר
ץ
 
ל
ה
ב
ד
י
ל
 
ב
י
ן
 
ה
ט
מ
א
 
ו
ב
י
ן
 
ה
ט
ה
ו
ר
 
ו
ב
י
ן
 
ה
ח
י
ה
 
ה
נ
א
כ
ל
ת
 
ו
ב
י
ן
 
ה
ח
י
ה
 
א
ש
ר
 
ל
א
 
ת
א
כ
ל
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
א
ש
ה
 
כ
י
 
ת
ז
ר
ע
 
ו
י
ל
ד
ה
 
ז
כ
ר
 
ו
ט
מ
א
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
כ
י
מ
י
 
נ
ד
ת
 
ד
ו
ת
ה
 
ת
ט
מ
א
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
י
מ
ו
ל
 
א
ת
 
ב
ש
ר
 
ע
ר
ל
ת
ו
 
ו
ש
ל
ש
י
ם
 
י
ו
ם
 
ו
ש
ל
ש
ת
 
י
מ
י
ם
 
ת
ש
ב
 
ב
ד
ם
 
ט
ה
ר
ה
 
ב
כ
ל
 
ק
ד
ש
 
ל
א
 
ת
ג
ע
 
ו
א
ל
 
ה
מ
ק
ד
ש
 
ל
א
 
ת
ב
ו
א
 
ע
ד
 
מ
ל
א
ת
 
י
מ
י
 
ט
ה
ר
ה
 
ו
א
ם
 
נ
ק
ב
ה
 
ת
ל
ד
 
ו
ט
מ
א
ה
 
ש
ב
ו
ע
י
ם
 
כ
נ
ד
ת
ה
 
ו
ש
ש
י
ם
 
י
ו
ם
 
ו
ש
ש
ת
 
י
מ
י
ם
 
ת
ש
ב
 
ע
ל
 
ד
מ
י
 
ט
ה
ר
ה
 
ו
ב
מ
ל
א
ת
 
י
מ
י
 
ט
ה
ר
ה
 
ל
ב
ן
 
א
ו
 
ל
ב
ת
 
ת
ב
י
א
 
כ
ב
ש
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
א
ו
 
ב
ן
 
י
ו
נ
ה
 
א
ו
 
ת
ר
 
ל
ח
ט
א
ת
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
א
ל
 
ה
כ
ה
ן
 
ו
ה
ק
ר
י
ב
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
כ
פ
ר
 
ע
ל
י
ה
 
ה
כ
ה
ן
 
ו
ט
ה
ר
ה
 
מ
מ
ק
ו
ר
 
ד
מ
י
ה
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
י
ל
ד
ת
 
ל
ז
כ
ר
 
ו
ל
נ
ק
ב
ה
 
ו
א
ם
 
ל
א
 
ת
מ
צ
א
 
י
ד
ה
 
ד
י
 
ש
ה
 
ו
ל
ק
ח
ה
 
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
א
ח
ד
 
ל
ע
ל
ה
 
ו
כ
פ
ר
 
ע
ל
י
ה
 
ה
כ
ה
ן
 
ו
ט
ה
ר
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
א
ד
ם
 
כ
י
 
י
ה
י
ה
 
ב
ע
ו
ר
 
ב
ש
ר
ו
 
ש
א
ת
 
א
ו
 
ס
פ
ח
ת
 
א
ו
 
ב
ה
ר
ת
 
ו
ה
י
ה
 
ב
ע
ו
ר
 
ב
ש
ר
ו
 
ל
נ
ג
ע
 
צ
ר
ע
ת
 
ו
ה
ו
ב
א
 
א
ל
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
א
ו
 
א
ל
 
א
ח
ד
 
מ
ב
נ
י
ו
 
ה
כ
ה
נ
י
ם
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ג
ע
 
ב
ע
ו
ר
 
ה
ב
ש
ר
 
ו
ש
ע
ר
 
ב
נ
ג
ע
 
ה
פ
ך
 
ל
ב
ן
 
ו
מ
ר
א
ה
 
ה
נ
ג
ע
 
ע
מ
ק
 
מ
ע
ו
ר
 
ב
ש
ר
ו
 
נ
ג
ע
 
צ
ר
ע
ת
 
ה
ו
א
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ט
מ
א
 
א
ת
ו
 
ו
א
ם
 
ב
ה
ר
ת
 
ל
ב
נ
ה
 
ה
י
א
 
ב
ע
ו
ר
 
ב
ש
ר
ו
 
ו
ע
מ
ק
 
א
י
ן
 
מ
ר
א
ה
 
מ
ן
 
ה
ע
ו
ר
 
ו
ש
ע
ר
ה
 
ל
א
 
ה
פ
ך
 
ל
ב
ן
 
ו
ה
ס
ג
י
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ג
ע
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ה
נ
ה
 
ה
נ
ג
ע
 
ע
מ
ד
 
ב
ע
י
נ
י
ו
 
ל
א
 
פ
ש
ה
 
ה
נ
ג
ע
 
ב
ע
ו
ר
 
ו
ה
ס
ג
י
ר
ו
 
ה
כ
ה
ן
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ש
נ
י
ת
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
נ
י
ת
 
ו
ה
נ
ה
 
כ
ה
ה
 
ה
נ
ג
ע
 
ל
א
 
פ
ש
ה
 
ה
נ
ג
ע
 
ב
ע
ו
ר
 
ו
ט
ה
ר
ו
 
ה
כ
ה
ן
 
ה
מ
ס
פ
ח
ת
 
ה
י
א
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ט
ה
ר
 
ו
א
ם
 
פ
ש
ה
 
ת
פ
ש
ה
 
ה
מ
ס
פ
ח
ת
 
ב
ע
ו
ר
 
א
ח
ר
י
 
ה
ר
א
ת
ו
 
א
ל
 
ה
כ
ה
ן
 
ל
ט
ה
ר
ת
ו
 
ו
נ
ר
א
ה
 
ש
נ
י
ת
 
א
ל
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
פ
ש
ת
ה
 
ה
מ
ס
פ
ח
ת
 
ב
ע
ו
ר
 
ו
ט
מ
א
ו
 
ה
כ
ה
ן
 
צ
ר
ע
ת
 
ה
י
א
 
ו
נ
ג
ע
 
צ
ר
ע
ת
 
כ
י
 
ת
ה
י
ה
 
ב
א
ד
ם
 
ו
ה
ו
ב
א
 
א
ל
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
ש
א
ת
 
ל
ב
נ
ה
 
ב
ע
ו
ר
 
ו
ה
י
א
 
ה
פ
ך
 
ש
ע
ר
 
ל
ב
ן
 
ו
מ
ח
י
ת
 
ב
ש
ר
 
ח
י
 
ב
ש
א
ת
 
צ
ר
ע
ת
 
נ
ו
ש
נ
ת
 
ה
י
א
 
ב
ע
ו
ר
 
ב
ש
ר
ו
 
ו
ט
מ
א
ו
 
ה
כ
ה
ן
 
ל
א
 
י
ס
ג
י
ר
נ
ו
 
כ
י
 
ט
מ
א
 
ה
ו
א
 
ו
א
ם
 
פ
ר
ח
 
ת
פ
ר
ח
 
ה
צ
ר
ע
ת
 
ב
ע
ו
ר
 
ו
כ
ס
ת
ה
 
ה
צ
ר
ע
ת
 
א
ת
 
כ
ל
 
ע
ו
ר
 
ה
נ
ג
ע
 
מ
ר
א
ש
ו
 
ע
ד
 
ר
ג
ל
י
ו
 
ל
כ
ל
 
מ
ר
א
ה
 
ע
י
נ
י
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
כ
ס
ת
ה
 
ה
צ
ר
ע
ת
 
א
ת
 
כ
ל
 
ב
ש
ר
ו
 
ו
ט
ה
ר
 
א
ת
 
ה
נ
ג
ע
 
כ
ל
ו
 
ה
פ
ך
 
ל
ב
ן
 
ט
ה
ו
ר
 
ה
ו
א
 
ו
ב
י
ו
ם
 
ה
ר
א
ו
ת
 
ב
ו
 
ב
ש
ר
 
ח
י
 
י
ט
מ
א
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
ב
ש
ר
 
ה
ח
י
 
ו
ט
מ
א
ו
 
ה
ב
ש
ר
 
ה
ח
י
 
ט
מ
א
 
ה
ו
א
 
צ
ר
ע
ת
 
ה
י
א
 
א
ו
 
כ
י
 
י
ש
ו
ב
 
ה
ב
ש
ר
 
ה
ח
י
 
ו
נ
ה
פ
ך
 
ל
ל
ב
ן
 
ו
ב
א
 
א
ל
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
נ
ה
פ
ך
 
ה
נ
ג
ע
 
ל
ל
ב
ן
 
ו
ט
ה
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ג
ע
 
ט
ה
ו
ר
 
ה
ו
א
 
ו
ב
ש
ר
 
כ
י
 
י
ה
י
ה
 
ב
ו
 
ש
ח
י
ן
 
ו
נ
ר
פ
א
 
ו
ה
י
ה
 
ב
מ
ק
ו
ם
 
ה
ש
ח
י
ן
 
ש
א
ת
 
ל
ב
נ
ה
 
א
ו
 
ב
ה
ר
ת
 
ל
ב
נ
ה
 
א
ד
מ
ד
מ
ת
 
ו
נ
ר
א
ה
 
א
ל
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
מ
ר
א
ה
ו
 
ש
פ
ל
 
מ
ן
 
ה
ע
ו
ר
 
ו
ש
ע
ר
ו
 
ה
פ
ך
 
ל
ב
ן
 
ו
ט
מ
א
ו
 
ה
כ
ה
ן
 
נ
ג
ע
 
צ
ר
ע
ת
 
ה
י
א
 
ב
ש
ח
י
ן
 
פ
ר
ח
ה
 
ו
א
ם
 
י
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
א
י
ן
 
ב
ה
 
ש
ע
ר
 
ל
ב
ן
 
ו
ש
פ
ל
ה
 
א
י
נ
נ
ה
 
מ
ן
 
ה
ע
ו
ר
 
ו
ה
י
א
 
כ
ה
ה
 
ו
ה
ס
ג
י
ר
ו
 
ה
כ
ה
ן
 
ש
ב
ע
ת
 
י
מ
י
ם
 
א
ם
 
פ
ש
ה
 
ת
פ
ש
ה
 
ב
ע
ו
ר
 
ו
ט
מ
א
 
ה
כ
ה
ן
 
א
ת
ו
 
נ
ג
ע
 
ה
ו
א
 
ו
א
ם
 
ת
ח
ת
י
ה
 
ת
ע
מ
ד
 
ה
ב
ה
ר
ת
 
ל
א
 
פ
ש
ת
ה
 
צ
ר
ב
ת
 
ה
ש
ח
י
ן
 
ה
י
א
 
ו
ט
ה
ר
ו
 
ה
כ
ה
ן
 
א
ו
 
ב
ש
ר
 
כ
י
 
י
ה
י
ה
 
ב
ע
ו
ר
ו
 
מ
כ
ו
ת
 
א
ש
 
ו
ה
י
ת
ה
 
מ
ח
י
ת
 
ה
מ
כ
ו
ה
 
ב
ה
ר
ת
 
ל
ב
נ
ה
 
א
ד
מ
ד
מ
ת
 
א
ו
 
ל
ב
נ
ה
 
ו
ר
א
ה
 
א
ת
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
ה
פ
ך
 
ש
ע
ר
 
ל
ב
ן
 
ב
ב
ה
ר
ת
 
ו
מ
ר
א
ה
 
ע
מ
ק
 
מ
ן
 
ה
ע
ו
ר
 
צ
ר
ע
ת
 
ה
י
א
 
ב
מ
כ
ו
ה
 
פ
ר
ח
ה
 
ו
ט
מ
א
 
א
ת
ו
 
ה
כ
ה
ן
 
נ
ג
ע
 
צ
ר
ע
ת
 
ה
י
א
 
ו
א
ם
 
י
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
א
י
ן
 
ב
ב
ה
ר
ת
 
ש
ע
ר
 
ל
ב
ן
 
ו
ש
פ
ל
ה
 
א
י
נ
נ
ה
 
מ
ן
 
ה
ע
ו
ר
 
ו
ה
י
א
 
כ
ה
ה
 
ו
ה
ס
ג
י
ר
ו
 
ה
כ
ה
ן
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
א
ם
 
פ
ש
ה
 
ת
פ
ש
ה
 
ב
ע
ו
ר
 
ו
ט
מ
א
 
א
ת
ו
 
ה
כ
ה
ן
 
נ
ג
ע
 
צ
ר
ע
ת
 
ה
י
א
 
ו
א
ם
 
ת
ח
ת
י
ה
 
ת
ע
מ
ד
 
ה
ב
ה
ר
ת
 
ל
א
 
פ
ש
ת
ה
 
ב
ע
ו
ר
 
ו
ה
י
א
 
כ
ה
ה
 
ש
א
ת
 
ה
מ
כ
ו
ה
 
ה
י
א
 
ו
ט
ה
ר
ו
 
ה
כ
ה
ן
 
כ
י
 
צ
ר
ב
ת
 
ה
מ
כ
ו
ה
 
ה
י
א
 
ו
א
י
ש
 
א
ו
 
א
ש
ה
 
כ
י
 
י
ה
י
ה
 
ב
ו
 
נ
ג
ע
 
ב
ר
א
ש
 
א
ו
 
ב
ז
ק
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ג
ע
 
ו
ה
נ
ה
 
מ
ר
א
ה
ו
 
ע
מ
ק
 
מ
ן
 
ה
ע
ו
ר
 
ו
ב
ו
 
ש
ע
ר
 
צ
ה
ב
 
ד
ק
 
ו
ט
מ
א
 
ה
כ
ה
ן
 
א
ת
ו
 
נ
ת
ק
 
ה
ו
א
 
צ
ר
ע
ת
 
ה
ר
א
ש
 
א
ו
 
ה
ז
ק
ן
 
ה
י
א
 
א
ו
 
כ
י
 
י
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
נ
ג
ע
 
ה
נ
ת
ק
 
ו
ה
נ
ה
 
א
י
ן
 
מ
ר
א
ה
ו
 
ע
מ
ק
 
מ
ן
 
ה
ע
ו
ר
 
ו
ש
ע
ר
 
ש
ח
ר
 
א
י
ן
 
ב
ו
 
ו
ה
ס
ג
י
ר
 
ה
כ
ה
ן
 
א
ת
 
נ
ג
ע
 
ה
נ
ת
ק
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ת
ק
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ה
נ
ה
 
ל
א
 
פ
ש
ה
 
ה
נ
ת
ק
 
ו
ל
א
 
ה
י
ה
 
ב
ו
 
ש
ע
ר
 
צ
ה
ב
 
ו
מ
ר
א
ה
 
ה
נ
ת
ק
 
א
י
ן
 
ע
מ
ק
 
מ
ן
 
ה
ע
ו
ר
 
ו
ה
ת
ג
ל
ח
 
ו
א
ת
 
ה
נ
ת
ק
 
ל
א
 
י
ג
ל
ח
 
ו
ה
ס
ג
י
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ת
ק
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ש
נ
י
ת
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ת
ק
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ה
נ
ה
 
ל
א
 
פ
ש
ה
 
ה
נ
ת
ק
 
ב
ע
ו
ר
 
ו
מ
ר
א
ה
ו
 
א
י
נ
נ
ו
 
ע
מ
ק
 
מ
ן
 
ה
ע
ו
ר
 
ו
ט
ה
ר
ו
 
ה
כ
ה
ן
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ט
ה
ר
 
ו
א
ם
 
פ
ש
ה
 
י
פ
ש
ה
 
ה
נ
ת
ק
 
ב
ע
ו
ר
 
א
ח
ר
י
 
ט
ה
ר
ת
ו
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
פ
ש
ה
 
ה
נ
ת
ק
 
ב
ע
ו
ר
 
ל
א
 
י
ב
ק
ר
 
ה
כ
ה
ן
 
ל
ש
ע
ר
 
ה
צ
ה
ב
 
ט
מ
א
 
ה
ו
א
 
ו
א
ם
 
ב
ע
י
נ
י
ו
 
ע
מ
ד
 
ה
נ
ת
ק
 
ו
ש
ע
ר
 
ש
ח
ר
 
צ
מ
ח
 
ב
ו
 
נ
ר
פ
א
 
ה
נ
ת
ק
 
ט
ה
ו
ר
 
ה
ו
א
 
ו
ט
ה
ר
ו
 
ה
כ
ה
ן
 
ו
א
י
ש
 
א
ו
 
א
ש
ה
 
כ
י
 
י
ה
י
ה
 
ב
ע
ו
ר
 
ב
ש
ר
ם
 
ב
ה
ר
ו
ת
 
ב
ה
ר
ו
ת
 
ל
ב
נ
ו
ת
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
ב
ע
ו
ר
 
ב
ש
ר
ם
 
ב
ה
ר
ו
ת
 
כ
ה
ו
ת
 
ל
ב
נ
ו
ת
 
ב
ח
ק
 
ה
ו
א
 
פ
ר
ח
 
ב
ע
ו
ר
 
ט
ה
ו
ר
 
ה
ו
א
 
ו
א
י
ש
 
כ
י
 
י
מ
ר
ט
 
ר
א
ש
ו
 
ק
ר
ח
 
ה
ו
א
 
ט
ה
ו
ר
 
ה
ו
א
 
ו
א
ם
 
מ
פ
א
ת
 
פ
נ
י
ו
 
י
מ
ר
ט
 
ר
א
ש
ו
 
ג
ב
ח
 
ה
ו
א
 
ט
ה
ו
ר
 
ה
ו
א
 
א
ו
 
כ
י
 
י
ה
י
ה
 
ב
ק
ר
ח
ת
ו
 
א
ו
 
ב
ג
ב
ח
ת
ו
 
נ
ג
ע
 
ל
ב
ן
 
א
ד
מ
ד
ם
 
צ
ר
ע
ת
 
פ
ר
ח
ת
 
ה
י
א
 
ב
ק
ר
ח
ת
ו
 
א
ו
 
ב
ג
ב
ח
ת
ו
 
ו
ר
א
ה
 
א
ת
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
ש
א
ת
 
ה
נ
ג
ע
 
ל
ב
נ
ה
 
א
ד
מ
ד
מ
ת
 
ב
ק
ר
ח
ת
ו
 
א
ו
 
ב
ג
ב
ח
ת
ו
 
כ
מ
ר
א
ה
 
צ
ר
ע
ת
 
ע
ו
ר
 
ב
ש
ר
 
א
י
ש
 
צ
ר
ו
ע
 
ה
ו
א
 
ט
מ
א
 
ה
ו
א
 
ט
מ
א
 
י
ט
מ
א
נ
ו
 
ה
כ
ה
ן
 
ב
ר
א
ש
ו
 
נ
ג
ע
ו
 
ו
ה
צ
ר
ו
ע
 
א
ש
ר
 
ב
ו
 
ה
נ
ג
ע
 
ב
ג
ד
י
ו
 
י
ה
י
ו
 
פ
ר
ו
מ
י
ם
 
ו
ר
א
ש
ו
 
י
ה
י
ה
 
פ
ר
ו
ע
 
ו
ע
ל
 
ש
פ
ם
 
י
ע
ט
א
 
ו
ט
מ
א
 
ט
מ
א
 
י
ק
ר
א
 
כ
ל
 
י
מ
י
 
א
ש
ר
 
ה
נ
ג
ע
 
ב
ו
 
י
ט
מ
א
 
ט
מ
א
 
ה
ו
א
 
ב
ד
ד
 
י
ש
ב
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
מ
ו
ש
ב
ו
 
ו
ה
ב
ג
ד
 
כ
י
 
י
ה
י
ה
 
ב
ו
 
נ
ג
ע
 
צ
ר
ע
ת
 
ב
ב
ג
ד
 
צ
מ
ר
 
א
ו
 
ב
ב
ג
ד
 
פ
ש
ת
י
ם
 
א
ו
 
ב
ש
ת
י
 
א
ו
 
ב
ע
ר
ב
 
ל
פ
ש
ת
י
ם
 
ו
ל
צ
מ
ר
 
א
ו
 
ב
ע
ו
ר
 
א
ו
 
ב
כ
ל
 
מ
ל
א
כ
ת
 
ע
ו
ר
 
ו
ה
י
ה
 
ה
נ
ג
ע
 
י
ר
ק
ר
ק
 
א
ו
 
א
ד
מ
ד
ם
 
ב
ב
ג
ד
 
א
ו
 
ב
ע
ו
ר
 
א
ו
 
ב
ש
ת
י
 
א
ו
 
ב
ע
ר
ב
 
א
ו
 
ב
כ
ל
 
כ
ל
י
 
ע
ו
ר
 
נ
ג
ע
 
צ
ר
ע
ת
 
ה
ו
א
 
ו
ה
ר
א
ה
 
א
ת
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ג
ע
 
ו
ה
ס
ג
י
ר
 
א
ת
 
ה
נ
ג
ע
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ר
א
ה
 
א
ת
 
ה
נ
ג
ע
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
כ
י
 
פ
ש
ה
 
ה
נ
ג
ע
 
ב
ב
ג
ד
 
א
ו
 
ב
ש
ת
י
 
א
ו
 
ב
ע
ר
ב
 
א
ו
 
ב
ע
ו
ר
 
ל
כ
ל
 
א
ש
ר
 
י
ע
ש
ה
 
ה
ע
ו
ר
 
ל
מ
ל
א
כ
ה
 
צ
ר
ע
ת
 
מ
מ
ר
א
ת
 
ה
נ
ג
ע
 
ט
מ
א
 
ה
ו
א
 
ו
ש
ר
ף
 
א
ת
 
ה
ב
ג
ד
 
א
ו
 
א
ת
 
ה
ש
ת
י
 
א
ו
 
א
ת
 
ה
ע
ר
ב
 
ב
צ
מ
ר
 
א
ו
 
ב
פ
ש
ת
י
ם
 
א
ו
 
א
ת
 
כ
ל
 
כ
ל
י
 
ה
ע
ו
ר
 
א
ש
ר
 
י
ה
י
ה
 
ב
ו
 
ה
נ
ג
ע
 
כ
י
 
צ
ר
ע
ת
 
מ
מ
ר
א
ת
 
ה
י
א
 
ב
א
ש
 
ת
ש
ר
ף
 
ו
א
ם
 
י
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
ל
א
 
פ
ש
ה
 
ה
נ
ג
ע
 
ב
ב
ג
ד
 
א
ו
 
ב
ש
ת
י
 
א
ו
 
ב
ע
ר
ב
 
א
ו
 
ב
כ
ל
 
כ
ל
י
 
ע
ו
ר
 
ו
צ
ו
ה
 
ה
כ
ה
ן
 
ו
כ
ב
ס
ו
 
א
ת
 
א
ש
ר
 
ב
ו
 
ה
נ
ג
ע
 
ו
ה
ס
ג
י
ר
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ש
נ
י
ת
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ח
ר
י
 
ה
כ
ב
ס
 
א
ת
 
ה
נ
ג
ע
 
ו
ה
נ
ה
 
ל
א
 
ה
פ
ך
 
ה
נ
ג
ע
 
א
ת
 
ע
י
נ
י
ו
 
ו
ה
נ
ג
ע
 
ל
א
 
פ
ש
ה
 
ט
מ
א
 
ה
ו
א
 
ב
א
ש
 
ת
ש
ר
פ
נ
ו
 
פ
ח
ת
ת
 
ה
י
א
 
ב
ק
ר
ח
ת
ו
 
א
ו
 
ב
ג
ב
ח
ת
ו
 
ו
א
ם
 
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
כ
ה
ה
 
ה
נ
ג
ע
 
א
ח
ר
י
 
ה
כ
ב
ס
ו
 
א
ת
ו
 
ו
ק
ר
ע
ו
 
א
ת
ו
 
מ
ן
 
ה
ב
ג
ד
 
א
ו
 
מ
ן
 
ה
ע
ו
ר
 
א
ו
 
מ
ן
 
ה
ש
ת
י
 
א
ו
 
מ
ן
 
ה
ע
ר
ב
 
ו
א
ם
 
ת
ר
א
ה
 
ע
ו
ד
 
ב
ב
ג
ד
 
א
ו
 
ב
ש
ת
י
 
א
ו
 
ב
ע
ר
ב
 
א
ו
 
ב
כ
ל
 
כ
ל
י
 
ע
ו
ר
 
פ
ר
ח
ת
 
ה
י
א
 
ב
א
ש
 
ת
ש
ר
פ
נ
ו
 
א
ת
 
א
ש
ר
 
ב
ו
 
ה
נ
ג
ע
 
ו
ה
ב
ג
ד
 
א
ו
 
ה
ש
ת
י
 
א
ו
 
ה
ע
ר
ב
 
א
ו
 
כ
ל
 
כ
ל
י
 
ה
ע
ו
ר
 
א
ש
ר
 
ת
כ
ב
ס
 
ו
ס
ר
 
מ
ה
ם
 
ה
נ
ג
ע
 
ו
כ
ב
ס
 
ש
נ
י
ת
 
ו
ט
ה
ר
 
ז
א
ת
 
ת
ו
ר
ת
 
נ
ג
ע
 
ה
צ
ר
ע
ת
 
ב
ג
ד
 
ה
צ
מ
ר
 
א
ו
 
ה
פ
ש
ת
י
ם
 
א
ו
 
ה
ש
ת
י
 
א
ו
 
ה
ע
ר
ב
 
א
ו
 
כ
ל
 
כ
ל
י
 
ה
ע
ו
ר
 
ל
ט
ה
ר
ו
 
א
ו
 
ל
ט
מ
א
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ז
א
ת
 
ת
ה
י
ה
 
ת
ו
ר
ת
 
ה
מ
צ
ר
ע
 
ב
י
ו
ם
 
ט
ה
ר
ת
ו
 
ו
ה
ו
ב
א
 
א
ל
 
ה
כ
ה
ן
 
ו
י
צ
א
 
ה
כ
ה
ן
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
ו
ה
נ
ה
 
נ
ר
פ
א
 
נ
ג
ע
 
ה
צ
ר
ע
ת
 
מ
ן
 
ה
צ
ר
ו
ע
 
ו
צ
ו
ה
 
ה
כ
ה
ן
 
ו
ל
ק
ח
ו
 
ל
מ
ט
ה
ר
 
ש
ת
י
 
צ
פ
ו
ר
י
ם
 
ח
י
ו
ת
 
ט
ה
ר
ו
ת
 
ו
ע
ץ
 
א
ר
ז
 
ו
ש
נ
י
 
ת
ו
ל
ע
ת
 
ו
א
ז
ו
ב
 
ו
צ
ו
ה
 
ה
כ
ה
ן
 
ו
ש
ח
ט
ו
 
א
ת
 
ה
צ
פ
ו
ר
 
ה
א
ח
ת
 
א
ל
 
כ
ל
י
 
ח
ר
ש
 
ע
ל
 
מ
י
ם
 
ח
י
י
ם
 
ו
א
ת
 
ה
צ
פ
ו
ר
 
ה
ח
י
ה
 
י
ק
ח
 
א
ת
ה
 
ו
א
ת
 
ע
ץ
 
ה
א
ר
ז
 
ו
א
ת
 
ש
נ
י
 
ה
ת
ו
ל
ע
ת
 
ו
א
ת
 
ה
א
ז
ו
ב
 
ו
ט
ב
ל
 
א
ת
ם
 
ו
א
ת
 
ה
צ
פ
ו
ר
 
ה
ח
י
ה
 
ב
ד
ם
 
ה
צ
פ
ו
ר
 
ה
ש
ח
ו
ט
ה
 
ע
ל
 
מ
י
ם
 
ה
ח
י
י
ם
 
ו
ה
ז
ה
 
ע
ל
 
ה
מ
ט
ה
ר
 
מ
ן
 
ה
צ
ר
ע
ת
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ו
ט
ה
ר
ו
 
ו
ש
ל
ח
 
א
ת
 
ה
צ
פ
ו
ר
 
ה
ח
י
ה
 
ע
ל
 
פ
נ
י
 
ה
ש
ד
ה
 
ו
כ
ב
ס
 
ה
מ
ט
ה
ר
 
א
ת
 
ב
ג
ד
י
ו
 
ו
ג
ל
ח
 
א
ת
 
כ
ל
 
ש
ע
ר
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
ה
ר
 
ו
א
ח
ר
 
י
ב
ו
א
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
י
ש
ב
 
מ
ח
ו
ץ
 
ל
א
ה
ל
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ה
י
ה
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
י
ג
ל
ח
 
א
ת
 
כ
ל
 
ש
ע
ר
ו
 
א
ת
 
ר
א
ש
ו
 
ו
א
ת
 
ז
ק
נ
ו
 
ו
א
ת
 
ג
ב
ו
ת
 
ע
י
נ
י
ו
 
ו
א
ת
 
כ
ל
 
ש
ע
ר
ו
 
י
ג
ל
ח
 
ו
כ
ב
ס
 
א
ת
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
ט
ה
ר
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
י
ק
ח
 
ש
נ
י
 
כ
ב
ש
י
ם
 
ת
מ
י
מ
ם
 
ב
נ
י
 
ש
נ
ה
 
ו
כ
ב
ש
ה
 
א
ח
ת
 
ב
ת
 
ש
נ
ת
ה
 
ת
מ
י
מ
ה
 
ו
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ס
ל
ת
 
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ו
ל
ג
 
ש
מ
ן
 
א
ח
ד
 
ו
ה
ע
מ
י
ד
 
ה
כ
ה
ן
 
ה
מ
ט
ה
ר
 
א
ת
 
ה
א
י
ש
 
ה
מ
ט
ה
ר
 
ו
א
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
א
ת
 
ה
כ
ב
ש
 
ה
א
ח
ד
 
ו
ה
ק
ר
י
ב
 
א
ת
ו
 
ל
א
ש
ם
 
ו
א
ת
 
ל
ג
 
ה
ש
מ
ן
 
ו
ה
נ
י
ף
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ש
ח
ט
 
א
ת
 
ה
כ
ב
ש
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ש
ח
ט
ו
 
א
ת
 
ה
ח
ט
א
ת
 
ו
א
ת
 
ה
ע
ל
ה
 
ב
מ
ק
ו
ם
 
ה
ק
ד
ש
 
כ
י
 
כ
ח
ט
א
ת
 
כ
א
ש
ם
 
ה
ו
א
 
ל
כ
ה
ן
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
ו
א
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
ד
ם
 
ה
א
ש
ם
 
ו
נ
ת
ן
 
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
ה
מ
ט
ה
ר
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ו
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ו
 
ה
י
מ
נ
י
ת
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
ל
ג
 
ה
ש
מ
ן
 
ו
י
צ
ק
 
ע
ל
 
כ
ף
 
ה
כ
ה
ן
 
ה
ש
מ
א
ל
י
ת
 
ו
ט
ב
ל
 
ה
כ
ה
ן
 
א
ת
 
א
צ
ב
ע
ו
 
ה
י
מ
נ
י
ת
 
מ
ן
 
ה
ש
מ
ן
 
א
ש
ר
 
ע
ל
 
כ
פ
ו
 
ה
ש
מ
א
ל
י
ת
 
ו
ה
ז
ה
 
מ
ן
 
ה
ש
מ
ן
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
מ
י
ת
ר
 
ה
ש
מ
ן
 
א
ש
ר
 
ע
ל
 
כ
פ
ו
 
י
ת
ן
 
ה
כ
ה
ן
 
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
ה
מ
ט
ה
ר
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ו
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ו
 
ה
י
מ
נ
י
ת
 
ע
ל
 
ד
ם
 
ה
א
ש
ם
 
ו
ה
נ
ו
ת
ר
 
ב
ש
מ
ן
 
א
ש
ר
 
ע
ל
 
כ
ף
 
ה
כ
ה
ן
 
י
ת
ן
 
ע
ל
 
ר
א
ש
 
ה
מ
ט
ה
ר
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ע
ש
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
ח
ט
א
ת
 
ו
כ
פ
ר
 
ע
ל
 
ה
מ
ט
ה
ר
 
מ
ט
מ
א
ת
ו
 
ו
א
ח
ר
 
י
ש
ח
ט
 
א
ת
 
ה
ע
ל
ה
 
ו
ה
ע
ל
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
ע
ל
ה
 
ו
א
ת
 
ה
מ
נ
ח
ה
 
ה
מ
ז
ב
ח
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ו
ט
ה
ר
 
ו
א
ם
 
ד
ל
 
ה
ו
א
 
ו
א
י
ן
 
י
ד
ו
 
מ
ש
ג
ת
 
ו
ל
ק
ח
 
כ
ב
ש
 
א
ח
ד
 
א
ש
ם
 
ל
ת
נ
ו
פ
ה
 
ל
כ
פ
ר
 
ע
ל
י
ו
 
ו
ע
ש
ר
ו
ן
 
ס
ל
ת
 
א
ח
ד
 
ב
ל
ו
ל
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
ו
ל
ג
 
ש
מ
ן
 
ו
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
א
ש
ר
 
ת
ש
י
ג
 
י
ד
ו
 
ו
ה
י
ה
 
א
ח
ד
 
ח
ט
א
ת
 
ו
א
ח
ד
 
ע
ל
ה
 
ו
ה
ב
י
א
 
א
ת
ם
 
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ל
ט
ה
ר
ת
ו
 
א
ל
 
ה
כ
ה
ן
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
א
ת
 
כ
ב
ש
 
ה
א
ש
ם
 
ו
א
ת
 
ל
ג
 
ה
ש
מ
ן
 
ו
ה
נ
י
ף
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ש
ח
ט
 
א
ת
 
כ
ב
ש
 
ה
א
ש
ם
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
ד
ם
 
ה
א
ש
ם
 
ו
נ
ת
ן
 
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
ה
מ
ט
ה
ר
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ו
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ו
 
ה
י
מ
נ
י
ת
 
ו
מ
ן
 
ה
ש
מ
ן
 
י
צ
ק
 
ה
כ
ה
ן
 
ע
ל
 
כ
ף
 
ה
כ
ה
ן
 
ה
ש
מ
א
ל
י
ת
 
ו
ה
ז
ה
 
ה
כ
ה
ן
 
ב
א
צ
ב
ע
ו
 
ה
י
מ
נ
י
ת
 
מ
ן
 
ה
ש
מ
ן
 
א
ש
ר
 
ע
ל
 
כ
פ
ו
 
ה
ש
מ
א
ל
י
ת
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
נ
ת
ן
 
ה
כ
ה
ן
 
מ
ן
 
ה
ש
מ
ן
 
א
ש
ר
 
ע
ל
 
כ
פ
ו
 
ע
ל
 
ת
נ
ך
 
א
ז
ן
 
ה
מ
ט
ה
ר
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
י
ד
ו
 
ה
י
מ
נ
י
ת
 
ו
ע
ל
 
ב
ה
ו
ן
 
ר
ג
ל
ו
 
ה
י
מ
נ
י
ת
 
ע
ל
 
מ
ק
ו
ם
 
ד
ם
 
ה
א
ש
ם
 
ו
ה
נ
ו
ת
ר
 
ב
ש
מ
ן
 
א
ש
ר
 
ע
ל
 
כ
ף
 
ה
כ
ה
ן
 
י
ת
ן
 
ע
ל
 
ר
א
ש
 
ה
מ
ט
ה
ר
 
ל
כ
פ
ר
 
ע
ל
י
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ע
ש
ה
 
א
ת
 
ה
א
ח
ד
 
מ
ן
 
ה
ת
ר
י
ם
 
א
ו
 
מ
ב
נ
י
 
ה
י
ו
נ
ה
 
מ
א
ש
ר
 
ת
ש
י
ג
 
י
ד
ו
 
א
ת
 
א
ש
ר
 
ת
ש
י
ג
 
י
ד
ו
 
א
ת
 
ה
א
ח
ד
 
ח
ט
א
ת
 
ו
א
ת
 
ה
א
ח
ד
 
ע
ל
ה
 
ע
ל
 
ה
מ
נ
ח
ה
 
ו
כ
פ
ר
 
ע
ל
 
ה
מ
ט
ה
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ז
א
ת
 
ת
ו
ר
ת
 
א
ש
ר
 
ב
ו
 
נ
ג
ע
 
צ
ר
ע
ת
 
א
ש
ר
 
ל
א
 
ת
ש
י
ג
 
י
ד
ו
 
ב
ט
ה
ר
ת
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
כ
י
 
ת
ב
א
ו
 
א
ל
 
א
ר
ץ
 
כ
נ
ע
ן
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
כ
ם
 
ל
א
ח
ז
ה
 
ו
נ
ת
ת
י
 
נ
ג
ע
 
צ
ר
ע
ת
 
ב
ב
י
ת
 
א
ר
ץ
 
א
ח
ז
ת
כ
ם
 
ו
ב
א
 
א
ש
ר
 
ל
ו
 
ה
ב
י
ת
 
ו
ה
ג
י
ד
 
ל
כ
ה
ן
 
ל
א
מ
ר
 
כ
נ
ג
ע
 
נ
ר
א
ה
 
ל
י
 
ב
ב
י
ת
 
ו
צ
ו
ה
 
ה
כ
ה
ן
 
ו
פ
נ
ו
 
א
ת
 
ה
ב
י
ת
 
ב
ט
ר
ם
 
י
ב
ו
א
 
ה
כ
ה
ן
 
ל
ר
א
ו
ת
 
א
ת
 
ה
נ
ג
ע
 
ו
ל
א
 
י
ט
מ
א
 
כ
ל
 
א
ש
ר
 
ב
ב
י
ת
 
ו
א
ח
ר
י
 
כ
ן
 
י
ב
ו
א
 
ה
כ
ה
ן
 
ל
ר
א
ו
ת
 
א
ת
 
ה
ב
י
ת
 
ו
ר
א
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
נ
ג
ע
 
ו
ה
נ
ה
 
ה
נ
ג
ע
 
ב
ק
י
ר
ו
ת
 
ה
ב
י
ת
 
ש
ק
ע
ר
ר
ו
ת
 
י
ר
ק
ר
ק
ו
ת
 
א
ו
 
א
ד
מ
ד
מ
ו
ת
 
ו
מ
ר
א
ה
ן
 
ש
פ
ל
 
מ
ן
 
ה
ק
י
ר
 
ו
י
צ
א
 
ה
כ
ה
ן
 
מ
ן
 
ה
ב
י
ת
 
א
ל
 
פ
ת
ח
 
ה
ב
י
ת
 
ו
ה
ס
ג
י
ר
 
א
ת
 
ה
ב
י
ת
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ש
ב
 
ה
כ
ה
ן
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ר
א
ה
 
ו
ה
נ
ה
 
פ
ש
ה
 
ה
נ
ג
ע
 
ב
ק
י
ר
ו
ת
 
ה
ב
י
ת
 
ו
צ
ו
ה
 
ה
כ
ה
ן
 
ו
ח
ל
צ
ו
 
א
ת
 
ה
א
ב
נ
י
ם
 
א
ש
ר
 
ב
ה
ן
 
ה
נ
ג
ע
 
ו
ה
ש
ל
י
כ
ו
 
א
ת
ה
ן
 
א
ל
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
א
ל
 
מ
ק
ו
ם
 
ט
מ
א
 
ו
א
ת
 
ה
ב
י
ת
 
י
ק
צ
ע
ו
 
מ
ב
י
ת
 
ס
ב
י
ב
 
ו
ש
פ
כ
ו
 
א
ת
 
ה
ע
פ
ר
 
א
ש
ר
 
ה
ק
י
צ
ו
 
א
ל
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
א
ל
 
מ
ק
ו
ם
 
ט
מ
א
 
ו
ל
ק
ח
ו
 
א
ב
נ
י
ם
 
א
ח
ר
ו
ת
 
ו
ה
ב
י
א
ו
 
א
ל
 
ת
ח
ת
 
ה
א
ב
נ
י
ם
 
ו
ע
פ
ר
 
א
ח
ר
 
י
ק
ח
ו
 
ו
ט
ח
ו
 
א
ת
 
ה
ב
י
ת
 
ו
א
ם
 
י
ש
ו
ב
 
ה
נ
ג
ע
 
ו
פ
ר
ח
 
ב
ב
י
ת
 
א
ח
ר
י
 
ח
ל
צ
ו
 
א
ת
 
ה
א
ב
נ
י
ם
 
ו
א
ח
ר
י
 
ה
ק
צ
ו
ת
 
א
ת
 
ה
ב
י
ת
 
ו
א
ח
ר
י
 
ה
ט
ח
 
ו
ב
א
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ו
ה
נ
ה
 
פ
ר
ח
 
ה
נ
ג
ע
 
ב
ב
י
ת
 
צ
ר
ע
ת
 
מ
מ
ר
א
ת
 
ב
ב
י
ת
 
ט
מ
א
 
ה
ו
א
 
ו
נ
ת
צ
ו
 
א
ת
 
ה
ב
י
ת
 
א
ת
 
א
ב
נ
י
ו
 
ו
א
ת
 
ע
צ
י
ו
 
ו
א
ת
 
כ
ל
 
ע
פ
ר
 
ה
ב
י
ת
 
ו
ה
ו
צ
י
א
ו
 
א
ל
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
א
ל
 
מ
ק
ו
ם
 
ט
מ
א
 
ו
ה
ב
א
 
א
ל
 
ה
ב
י
ת
 
כ
ל
 
י
מ
י
 
ה
ס
ג
י
ר
 
א
ת
ו
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
ש
כ
ב
 
ב
ב
י
ת
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ה
א
כ
ל
 
ב
ב
י
ת
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
א
ם
 
ב
א
 
י
ב
ו
א
 
ה
כ
ה
ן
 
ו
ר
א
ה
 
ו
ה
נ
ה
 
ל
א
 
פ
ר
ח
 
ה
נ
ג
ע
 
ב
ב
י
ת
 
א
ח
ר
י
 
ה
ט
ח
 
א
ת
 
ה
ב
י
ת
 
ו
ט
ה
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
ב
י
ת
 
כ
י
 
נ
ר
פ
א
 
ה
נ
ג
ע
 
ו
ל
ק
ח
ו
 
ל
ח
ט
א
 
א
ת
 
ה
ב
י
ת
 
ש
ת
י
 
צ
פ
ו
ר
י
ם
 
ו
ע
ץ
 
א
ר
ז
 
ו
ש
נ
י
 
ת
ו
ל
ע
ת
 
ו
א
ז
ו
ב
 
ו
ש
ח
ט
 
א
ת
 
ה
צ
פ
ו
ר
 
ה
א
ח
ת
 
א
ל
 
כ
ל
י
 
ח
ר
ש
 
ע
ל
 
מ
י
ם
 
ח
י
י
ם
 
ו
ל
ק
ח
 
א
ת
 
ע
ץ
 
ה
א
ר
ז
 
ו
א
ת
 
ש
נ
י
 
ה
ת
ו
ל
ע
ת
 
ו
א
ת
 
ה
א
ז
ו
ב
 
ו
א
ת
 
ה
צ
פ
ו
ר
 
ה
ח
י
ה
 
ו
ט
ב
ל
 
א
ת
ם
 
ב
ד
ם
 
ה
צ
פ
ו
ר
 
ה
ש
ח
ו
ט
ה
 
ו
ב
מ
י
ם
 
ה
ח
י
י
ם
 
ו
ה
ז
ה
 
ע
ל
 
ה
ב
י
ת
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ו
ח
ט
א
 
א
ת
 
ה
ב
י
ת
 
ב
ד
ם
 
ה
צ
פ
ו
ר
 
ו
ב
מ
י
ם
 
ה
ח
י
י
ם
 
ו
ב
צ
פ
ו
ר
 
ה
ח
י
ה
 
ו
ב
ע
ץ
 
ה
א
ר
ז
 
ו
ב
ש
נ
י
 
ה
ת
ו
ל
ע
ת
 
ו
ב
א
ז
ו
ב
 
ו
ש
ל
ח
 
א
ת
 
ה
צ
פ
ו
ר
 
ה
ח
י
ה
 
א
ל
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
ע
ל
 
פ
נ
י
 
ה
ש
ד
ה
 
ו
כ
פ
ר
 
ע
ל
 
ה
ב
י
ת
 
ו
ט
ה
ר
 
ז
א
ת
 
ה
ת
ו
ר
ה
 
ל
כ
ל
 
נ
ג
ע
 
ה
צ
ר
ע
ת
 
ו
ל
נ
ת
ק
 
ו
ל
צ
ר
ע
ת
 
ה
ב
ג
ד
 
ו
ל
ב
י
ת
 
ו
ל
ש
א
ת
 
ו
ל
ס
פ
ח
ת
 
ו
ל
ב
ה
ר
ת
 
ל
ה
ו
ר
ו
ת
 
ב
י
ו
ם
 
ה
ט
מ
א
 
ו
ב
י
ו
ם
 
ה
ט
ה
ו
ר
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
צ
ר
ע
ת
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
ד
ב
ר
ו
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
ם
 
א
ל
י
ה
ם
 
א
י
ש
 
א
י
ש
 
כ
י
 
י
ה
י
ה
 
ז
ב
 
מ
ב
ש
ר
ו
 
ז
ו
ב
ו
 
ט
מ
א
 
ה
ו
א
 
ו
ז
א
ת
 
ת
ה
י
ה
 
ט
מ
א
ת
ו
 
ב
ז
ו
ב
ו
 
ר
ר
 
ב
ש
ר
ו
 
א
ת
 
ז
ו
ב
ו
 
א
ו
 
ח
ת
ו
ם
 
ב
ש
ר
ו
 
מ
ז
ו
ב
ו
 
ט
מ
א
 
ה
ו
א
 
כ
ל
 
י
מ
י
 
ז
ב
 
ב
ש
ר
ו
 
א
ו
 
ה
ח
ת
י
ם
 
ב
ש
ר
ו
 
מ
ז
ו
ב
ו
 
ט
מ
א
ת
ו
 
ה
י
א
 
כ
ל
 
ה
מ
ש
כ
ב
 
א
ש
ר
 
י
ש
כ
ב
 
ע
ל
י
ו
 
ה
ז
ב
 
י
ט
מ
א
 
ו
כ
ל
 
ה
כ
ל
י
 
א
ש
ר
 
י
ש
ב
 
ע
ל
י
ו
 
י
ט
מ
א
 
ו
א
י
ש
 
א
ש
ר
 
י
ג
ע
 
ב
מ
ש
כ
ב
ו
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
י
ש
ב
 
ע
ל
 
ה
כ
ל
י
 
א
ש
ר
 
י
ש
ב
 
ע
ל
י
ו
 
ה
ז
ב
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
נ
ג
ע
 
ב
ב
ש
ר
 
ה
ז
ב
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
י
 
י
ר
ק
 
ה
ז
ב
 
ב
ט
ה
ו
ר
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
ה
מ
ר
כ
ב
 
א
ש
ר
 
י
ר
כ
ב
 
ע
ל
י
ו
 
ה
ז
ב
 
י
ט
מ
א
 
ו
כ
ל
 
ה
נ
ג
ע
 
ב
כ
ל
 
א
ש
ר
 
י
ה
י
ה
 
ת
ח
ת
י
ו
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
נ
ו
ש
א
 
א
ת
ם
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
א
ש
ר
 
י
ג
ע
 
ב
ו
 
ה
ז
ב
 
ו
י
ד
ו
 
ל
א
 
ש
ט
ף
 
ב
מ
י
ם
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
י
 
ח
ר
ש
 
א
ש
ר
 
י
ג
ע
 
ב
ו
 
ה
ז
ב
 
י
ש
ב
ר
 
ו
כ
ל
 
כ
ל
י
 
ע
ץ
 
י
ש
ט
ף
 
ב
מ
י
ם
 
ו
כ
י
 
י
ט
ה
ר
 
ה
ז
ב
 
מ
ז
ו
ב
ו
 
ו
ס
פ
ר
 
ל
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ל
ט
ה
ר
ת
ו
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ח
י
י
ם
 
ו
ט
ה
ר
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
י
ק
ח
 
ל
ו
 
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
ו
ב
א
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
נ
ת
נ
ם
 
א
ל
 
ה
כ
ה
ן
 
ו
ע
ש
ה
 
א
ת
ם
 
ה
כ
ה
ן
 
א
ח
ד
 
ח
ט
א
ת
 
ו
א
ח
ד
 
ע
ל
ה
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
מ
ז
ו
ב
ו
 
ו
א
י
ש
 
כ
י
 
ת
צ
א
 
מ
מ
נ
ו
 
ש
כ
ב
ת
 
ז
ר
ע
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
א
ת
 
כ
ל
 
ב
ש
ר
ו
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
ב
ג
ד
 
ו
כ
ל
 
ע
ו
ר
 
א
ש
ר
 
י
ה
י
ה
 
ע
ל
י
ו
 
ש
כ
ב
ת
 
ז
ר
ע
 
ו
כ
ב
ס
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ש
ה
 
א
ש
ר
 
י
ש
כ
ב
 
א
י
ש
ה
 
א
ת
ה
 
ש
כ
ב
ת
 
ז
ר
ע
 
ו
ר
ח
צ
ו
 
ב
מ
י
ם
 
ו
ט
מ
א
ו
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ש
ה
 
כ
י
 
ת
ה
י
ה
 
ז
ב
ה
 
ד
ם
 
י
ה
י
ה
 
ז
ו
ב
ה
 
ב
ב
ש
ר
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
ה
י
ה
 
ב
נ
ד
ת
ה
 
כ
ל
 
ה
נ
ג
ע
 
ב
ה
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
א
ש
ר
 
ת
ש
כ
ב
 
ע
ל
י
ו
 
ב
נ
ד
ת
ה
 
י
ט
מ
א
 
ו
כ
ל
 
א
ש
ר
 
ת
ש
ב
 
ע
ל
י
ו
 
י
ט
מ
א
 
ו
כ
ל
 
ה
נ
ג
ע
 
ב
מ
ש
כ
ב
ה
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
ה
נ
ג
ע
 
ב
כ
ל
 
ה
כ
ל
י
 
א
ש
ר
 
ת
ש
ב
 
ע
ל
י
ו
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ם
 
ע
ל
 
ה
מ
ש
כ
ב
ה
 
ה
י
א
 
א
ו
 
ע
ל
 
ה
כ
ל
י
 
א
ש
ר
 
ה
י
א
 
י
ש
ב
ת
 
ע
ל
י
ו
 
ב
נ
ג
ע
ו
 
ב
ו
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ם
 
ש
כ
ב
 
י
ש
כ
ב
 
א
י
ש
ה
 
א
ת
ה
 
ו
ת
ה
י
 
נ
ד
ת
ה
 
ע
ל
י
ו
 
י
ט
מ
א
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
כ
ל
 
ה
מ
ש
כ
ב
 
א
ש
ר
 
י
ש
כ
ב
 
ע
ל
י
ו
 
י
ט
מ
א
 
ו
א
ש
ה
 
כ
י
 
י
ז
ו
ב
 
ז
ו
ב
 
ד
מ
ה
 
י
מ
י
ם
 
ר
ב
י
ם
 
ב
ל
א
 
ע
ת
 
נ
ד
ת
ה
 
א
ו
 
כ
י
 
ת
ז
ו
ב
 
ע
ל
 
נ
ד
ת
ה
 
כ
ל
 
י
מ
י
 
ז
ו
ב
 
ט
מ
א
ת
ה
 
כ
י
מ
י
 
נ
ד
ת
ה
 
ת
ה
י
ה
 
ט
מ
א
ה
 
ה
י
א
 
כ
ל
 
ה
מ
ש
כ
ב
 
א
ש
ר
 
ת
ש
כ
ב
 
ע
ל
י
ו
 
כ
ל
 
י
מ
י
 
ז
ו
ב
ה
 
כ
מ
ש
כ
ב
 
נ
ד
ת
ה
 
י
ה
י
ה
 
ל
ה
 
ו
כ
ל
 
ה
כ
ל
י
 
א
ש
ר
 
ת
ש
ב
 
ע
ל
י
ו
 
ט
מ
א
 
י
ה
י
ה
 
כ
ט
מ
א
ת
 
נ
ד
ת
ה
 
כ
ל
 
ה
נ
ג
ע
 
ב
ם
 
י
ט
מ
א
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ם
 
ט
ה
ר
ה
 
מ
ז
ו
ב
ה
 
ו
ס
פ
ר
ה
 
ל
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
א
ח
ר
 
ת
ט
ה
ר
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ת
ק
ח
 
ל
ה
 
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
ו
ה
ב
י
א
ה
 
א
ת
ם
 
א
ל
 
ה
כ
ה
ן
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ע
ש
ה
 
ה
כ
ה
ן
 
א
ת
 
ה
א
ח
ד
 
ח
ט
א
ת
 
ו
א
ת
 
ה
א
ח
ד
 
ע
ל
ה
 
ו
כ
פ
ר
 
ע
ל
י
ה
 
ה
כ
ה
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
מ
ז
ו
ב
 
ט
מ
א
ת
ה
 
ו
ה
ז
ה
ר
ת
ם
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ט
מ
א
ת
ם
 
ו
ל
א
 
י
מ
ו
ת
ו
 
ב
ט
מ
א
ת
ם
 
ב
ט
מ
א
ם
 
א
ת
 
מ
ש
כ
נ
י
 
א
ש
ר
 
ב
ת
ו
כ
ם
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
ז
ב
 
ו
א
ש
ר
 
ת
צ
א
 
מ
מ
נ
ו
 
ש
כ
ב
ת
 
ז
ר
ע
 
ל
ט
מ
א
ה
 
ב
ה
 
ו
ה
ד
ו
ה
 
ב
נ
ד
ת
ה
 
ו
ה
ז
ב
 
א
ת
 
ז
ו
ב
ו
 
ל
ז
כ
ר
 
ו
ל
נ
ק
ב
ה
 
ו
ל
א
י
ש
 
א
ש
ר
 
י
ש
כ
ב
 
ע
ם
 
ט
מ
א
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ח
ר
י
 
מ
ו
ת
 
ש
נ
י
 
ב
נ
י
 
א
ה
ר
ן
 
ב
ק
ר
ב
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
מ
ת
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
א
ח
י
ך
 
ו
א
ל
 
י
ב
ו
א
 
ב
כ
ל
 
ע
ת
 
א
ל
 
ה
ק
ד
ש
 
מ
ב
י
ת
 
ל
פ
ר
כ
ת
 
א
ל
 
פ
נ
י
 
ה
כ
פ
ר
ת
 
א
ש
ר
 
ע
ל
 
ה
א
ר
ו
ן
 
ו
ל
א
 
י
מ
ו
ת
 
כ
י
 
ב
ע
נ
ן
 
א
ר
א
ה
 
א
ל
 
ה
כ
פ
ר
ת
 
ב
ז
א
ת
 
י
ב
ו
א
 
א
ה
ר
ן
 
א
ל
 
ה
ק
ד
ש
 
ב
פ
ר
 
ב
ן
 
ב
ק
ר
 
ל
ח
ט
א
ת
 
ו
א
י
ל
 
ל
ע
ל
ה
 
ו
כ
י
ת
נ
ת
 
ב
ד
 
ק
ד
ש
 
י
ל
ב
ש
 
ו
מ
כ
נ
ס
י
 
ב
ד
 
י
ה
י
ו
 
ע
ל
 
ב
ש
ר
ו
 
ו
ב
א
ב
נ
י
ט
 
ב
ד
 
י
ח
ג
ר
 
ו
ב
מ
צ
נ
פ
ת
 
ב
ד
 
י
צ
נ
ף
 
ב
ג
ד
י
 
ק
ד
ש
 
ה
ם
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
א
ת
 
כ
ל
 
ב
ש
ר
ו
 
ו
ל
ב
ש
ם
 
ו
מ
א
ת
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
י
ק
ח
 
ש
נ
י
 
ש
ע
י
ר
י
 
ע
ז
י
ם
 
ל
ח
ט
א
ת
 
ו
א
י
ל
 
א
ח
ד
 
ל
ע
ל
ה
 
ו
ה
ק
ר
י
ב
 
א
ה
ר
ן
 
א
ת
 
פ
ר
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ל
ו
 
ו
כ
פ
ר
 
ב
ע
ד
ו
 
ו
ב
ע
ד
 
ב
י
ת
ו
 
ו
ל
ק
ח
 
א
ת
 
ש
נ
י
 
ה
ש
ע
י
ר
י
ם
 
ו
ה
ע
מ
י
ד
 
א
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
נ
ת
ן
 
א
ה
ר
ן
 
ע
ל
 
ש
נ
י
 
ה
ש
ע
י
ר
י
ם
 
ג
ו
ר
ל
ו
ת
 
ג
ו
ר
ל
 
א
ח
ד
 
ל
י
ה
ו
ה
 
ו
ג
ו
ר
ל
 
א
ח
ד
 
ל
ע
ז
ז
א
ל
 
ו
ה
ק
ר
י
ב
 
א
ה
ר
ן
 
א
ת
 
ה
ש
ע
י
ר
 
א
ש
ר
 
ע
ל
ה
 
ע
ל
י
ו
 
ה
ג
ו
ר
ל
 
ל
י
ה
ו
ה
 
ו
ע
ש
ה
ו
 
ח
ט
א
ת
 
ו
ה
ש
ע
י
ר
 
א
ש
ר
 
ע
ל
ה
 
ע
ל
י
ו
 
ה
ג
ו
ר
ל
 
ל
ע
ז
ז
א
ל
 
י
ע
מ
י
ד
 
ח
י
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
כ
פ
ר
 
ע
ל
י
ו
 
ל
ש
ל
ח
 
א
ת
ו
 
ל
ע
ז
ז
א
ל
 
ה
מ
ד
ב
ר
ה
 
ו
ה
ק
ר
י
ב
 
א
ה
ר
ן
 
א
ת
 
פ
ר
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ל
ו
 
ו
כ
פ
ר
 
ב
ע
ד
ו
 
ו
ב
ע
ד
 
ב
י
ת
ו
 
ו
ש
ח
ט
 
א
ת
 
פ
ר
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ל
ו
 
ו
ל
ק
ח
 
מ
ל
ו
א
 
ה
מ
ח
ת
ה
 
ג
ח
ל
י
 
א
ש
 
מ
ע
ל
 
ה
מ
ז
ב
ח
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
מ
ל
ו
א
 
ח
פ
נ
י
ו
 
ק
ט
ר
ת
 
ס
מ
י
ם
 
ד
ק
ה
 
ו
ה
ב
י
א
 
מ
ב
י
ת
 
ל
פ
ר
כ
ת
 
ו
נ
ת
ן
 
א
ת
 
ה
ק
ט
ר
ת
 
ע
ל
 
ה
א
ש
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
כ
ס
ה
 
ע
נ
ן
 
ה
ק
ט
ר
ת
 
א
ת
 
ה
כ
פ
ר
ת
 
א
ש
ר
 
ע
ל
 
ה
ע
ד
ו
ת
 
ו
ל
א
 
י
מ
ו
ת
 
ו
ל
ק
ח
 
מ
ד
ם
 
ה
פ
ר
 
ו
ה
ז
ה
 
ב
א
צ
ב
ע
ו
 
א
ל
 
פ
נ
י
 
ה
כ
פ
ר
ת
 
ק
ד
מ
ה
 
ו
ל
פ
נ
י
 
ה
כ
פ
ר
ת
 
י
ז
ה
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
מ
ן
 
ה
ד
ם
 
ב
א
צ
ב
ע
ו
 
ו
ש
ח
ט
 
א
ת
 
ש
ע
י
ר
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ל
ע
ם
 
ו
ה
ב
י
א
 
א
ת
 
ד
מ
ו
 
א
ל
 
מ
ב
י
ת
 
ל
פ
ר
כ
ת
 
ו
ע
ש
ה
 
א
ת
 
ד
מ
ו
 
כ
א
ש
ר
 
ע
ש
ה
 
ל
ד
ם
 
ה
פ
ר
 
ו
ה
ז
ה
 
א
ת
ו
 
ע
ל
 
ה
כ
פ
ר
ת
 
ו
ל
פ
נ
י
 
ה
כ
פ
ר
ת
 
ו
כ
פ
ר
 
ע
ל
 
ה
ק
ד
ש
 
מ
ט
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
מ
פ
ש
ע
י
ה
ם
 
ל
כ
ל
 
ח
ט
א
ת
ם
 
ו
כ
ן
 
י
ע
ש
ה
 
ל
א
ה
ל
 
מ
ו
ע
ד
 
ה
ש
כ
ן
 
א
ת
ם
 
ב
ת
ו
ך
 
ט
מ
א
ת
ם
 
ו
כ
ל
 
א
ד
ם
 
ל
א
 
י
ה
י
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ב
ב
א
ו
 
ל
כ
פ
ר
 
ב
ק
ד
ש
 
ע
ד
 
צ
א
ת
ו
 
ו
כ
פ
ר
 
ב
ע
ד
ו
 
ו
ב
ע
ד
 
ב
י
ת
ו
 
ו
ב
ע
ד
 
כ
ל
 
ק
ה
ל
 
י
ש
ר
א
ל
 
ו
י
צ
א
 
א
ל
 
ה
מ
ז
ב
ח
 
א
ש
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ו
ל
ק
ח
 
מ
ד
ם
 
ה
פ
ר
 
ו
מ
ד
ם
 
ה
ש
ע
י
ר
 
ו
נ
ת
ן
 
ע
ל
 
ק
ר
נ
ו
ת
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
ה
ז
ה
 
ע
ל
י
ו
 
מ
ן
 
ה
ד
ם
 
ב
א
צ
ב
ע
ו
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ו
ט
ה
ר
ו
 
ו
ק
ד
ש
ו
 
מ
ט
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
כ
ל
ה
 
מ
כ
פ
ר
 
א
ת
 
ה
ק
ד
ש
 
ו
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
ה
מ
ז
ב
ח
 
ו
ה
ק
ר
י
ב
 
א
ת
 
ה
ש
ע
י
ר
 
ה
ח
י
 
ו
ס
מ
ך
 
א
ה
ר
ן
 
א
ת
 
ש
ת
י
 
י
ד
י
ו
 
ע
ל
 
ר
א
ש
 
ה
ש
ע
י
ר
 
ה
ח
י
 
ו
ה
ת
ו
ד
ה
 
ע
ל
י
ו
 
א
ת
 
כ
ל
 
ע
ו
נ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
 
כ
ל
 
פ
ש
ע
י
ה
ם
 
ל
כ
ל
 
ח
ט
א
ת
ם
 
ו
נ
ת
ן
 
א
ת
ם
 
ע
ל
 
ר
א
ש
 
ה
ש
ע
י
ר
 
ו
ש
ל
ח
 
ב
י
ד
 
א
י
ש
 
ע
ת
י
 
ה
מ
ד
ב
ר
ה
 
ו
נ
ש
א
 
ה
ש
ע
י
ר
 
ע
ל
י
ו
 
א
ת
 
כ
ל
 
ע
ו
נ
ת
ם
 
א
ל
 
א
ר
ץ
 
ג
ז
ר
ה
 
ו
ש
ל
ח
 
א
ת
 
ה
ש
ע
י
ר
 
ב
מ
ד
ב
ר
 
ו
ב
א
 
א
ה
ר
ן
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
פ
ש
ט
 
א
ת
 
ב
ג
ד
י
 
ה
ב
ד
 
א
ש
ר
 
ל
ב
ש
 
ב
ב
א
ו
 
א
ל
 
ה
ק
ד
ש
 
ו
ה
נ
י
ח
ם
 
ש
ם
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
ו
ל
ב
ש
 
ב
ג
ד
י
ו
 
ו
י
צ
א
 
ו
ע
ש
ה
 
א
ת
 
ע
ל
ת
ו
 
ו
א
ת
 
ע
ל
ת
 
ה
ע
ם
 
ו
כ
פ
ר
 
ב
ע
ד
ו
 
ו
ב
ע
ד
 
ה
ע
ם
 
ו
א
ת
 
ח
ל
ב
 
ה
ח
ט
א
ת
 
י
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
ו
ה
מ
ש
ל
ח
 
א
ת
 
ה
ש
ע
י
ר
 
ל
ע
ז
ז
א
ל
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
א
ח
ר
י
 
כ
ן
 
י
ב
ו
א
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
א
ת
 
פ
ר
 
ה
ח
ט
א
ת
 
ו
א
ת
 
ש
ע
י
ר
 
ה
ח
ט
א
ת
 
א
ש
ר
 
ה
ו
ב
א
 
א
ת
 
ד
מ
ם
 
ל
כ
פ
ר
 
ב
ק
ד
ש
 
י
ו
צ
א
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
ש
ר
ף
 
ב
א
ש
 
א
ת
 
ע
ו
ר
ת
ם
 
ו
א
ת
 
ב
ש
ר
ם
 
ו
א
ת
 
פ
ר
ש
ם
 
ו
ה
ש
ר
ף
 
א
ת
ם
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
א
ח
ר
י
 
כ
ן
 
י
ב
ו
א
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
ה
י
ת
ה
 
ל
כ
ם
 
ל
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ב
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ב
ע
ש
ו
ר
 
ל
ח
ד
ש
 
ת
ע
נ
ו
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ו
כ
ל
 
מ
ל
א
כ
ה
 
ל
א
 
ת
ע
ש
ו
 
ה
א
ז
ר
ח
 
ו
ה
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
כ
ם
 
כ
י
 
ב
י
ו
ם
 
ה
ז
ה
 
י
כ
פ
ר
 
ע
ל
י
כ
ם
 
ל
ט
ה
ר
 
א
ת
כ
ם
 
מ
כ
ל
 
ח
ט
א
ת
י
כ
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ת
ט
ה
ר
ו
 
ש
ב
ת
 
ש
ב
ת
ו
ן
 
ה
ו
א
 
ל
כ
ם
 
ו
ע
נ
י
ת
ם
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
י
כ
פ
ר
 
ה
כ
ה
ן
 
א
ש
ר
 
י
מ
ש
ח
 
א
ת
ו
 
ו
א
ש
ר
 
י
מ
ל
א
 
א
ת
 
י
ד
ו
 
ל
כ
ה
ן
 
ת
ח
ת
 
א
ב
י
ו
 
ו
ל
ב
ש
 
א
ת
 
ב
ג
ד
י
 
ה
ב
ד
 
ב
ג
ד
י
 
ה
ק
ד
ש
 
ו
כ
פ
ר
 
א
ת
 
מ
ק
ד
ש
 
ה
ק
ד
ש
 
ו
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
ה
מ
ז
ב
ח
 
י
כ
פ
ר
 
ע
ל
 
ה
כ
ה
נ
י
ם
 
ו
ע
ל
 
כ
ל
 
ע
ם
 
ה
ק
ה
ל
 
י
כ
פ
ר
 
ו
ה
י
ת
ה
 
ז
א
ת
 
ל
כ
ם
 
ל
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
כ
פ
ר
 
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
כ
ל
 
ח
ט
א
ת
ם
 
א
ח
ת
 
ב
ש
נ
ה
 
ו
י
ע
ש
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ו
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
א
מ
ר
 
א
י
ש
 
א
י
ש
 
מ
ב
י
ת
 
י
ש
ר
א
ל
 
א
ש
ר
 
י
ש
ח
ט
 
ש
ו
ר
 
א
ו
 
כ
ש
ב
 
א
ו
 
ע
ז
 
ב
מ
ח
נ
ה
 
א
ו
 
א
ש
ר
 
י
ש
ח
ט
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
 
ה
ב
י
א
ו
 
ל
ע
ש
ו
ת
 
א
ת
ו
 
ע
ל
ה
 
א
ו
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
ל
ר
צ
ו
נ
כ
ם
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ו
י
ש
ח
ט
ה
ו
 
ב
ח
ו
ץ
 
ו
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
 
ה
ב
י
א
ו
 
ל
ה
ק
ר
י
ב
ו
 
ק
ר
ב
ן
 
ל
י
ה
ו
ה
 
ל
פ
נ
י
 
מ
ש
כ
ן
 
י
ה
ו
ה
 
ד
ם
 
י
ח
ש
ב
 
ל
א
י
ש
 
ה
ה
ו
א
 
ד
ם
 
ש
פ
ך
 
ו
נ
כ
ר
ת
 
ה
א
י
ש
 
ה
ה
ו
א
 
מ
ק
ר
ב
 
ע
מ
י
ו
 
ל
מ
ע
ן
 
א
ש
ר
 
י
ב
י
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ז
ב
ח
י
ה
ם
 
א
ש
ר
 
ה
ם
 
ז
ב
ח
י
ם
 
ע
ל
 
פ
נ
י
 
ה
ש
ד
ה
 
ו
ה
ב
א
ו
ם
 
ל
י
ה
ו
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
א
ל
 
ה
כ
ה
ן
 
ו
ז
ב
ח
ו
 
ז
ב
ח
י
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
א
ת
ם
 
ו
ז
ר
ק
 
ה
כ
ה
ן
 
א
ת
 
ה
ד
ם
 
ע
ל
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ש
ר
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
ק
ט
י
ר
 
ה
ח
ל
ב
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
ל
א
 
י
ז
ב
ח
ו
 
ע
ו
ד
 
א
ת
 
ז
ב
ח
י
ה
ם
 
ל
ש
ע
ר
י
ם
 
א
ש
ר
 
ה
ם
 
ז
נ
י
ם
 
א
ח
ר
י
ה
ם
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ת
ה
י
ה
 
ז
א
ת
 
ל
ה
ם
 
ל
ד
ר
ו
ת
ם
 
ו
א
ל
י
ה
ם
 
ת
א
מ
ר
 
א
י
ש
 
א
י
ש
 
מ
ב
י
ת
 
י
ש
ר
א
ל
 
ו
מ
ן
 
ה
ג
ר
 
א
ש
ר
 
י
ג
ו
ר
 
ב
ת
ו
כ
ם
 
א
ש
ר
 
י
ע
ש
ה
 
ע
ל
ה
 
א
ו
 
ז
ב
ח
 
ו
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
 
י
ב
י
א
נ
ו
 
ל
ע
ש
ו
ת
 
א
ת
ו
 
ל
י
ה
ו
ה
 
ו
נ
כ
ר
ת
 
ה
א
י
ש
 
ה
ה
ו
א
 
מ
ע
מ
י
ו
 
ו
א
י
ש
 
א
י
ש
 
מ
ב
י
ת
 
י
ש
ר
א
ל
 
ו
מ
ן
 
ה
ג
ר
 
א
ש
ר
 
י
ג
ו
ר
 
ב
ת
ו
כ
ם
 
א
ש
ר
 
י
א
כ
ל
 
כ
ל
 
ד
ם
 
ו
נ
ת
ת
י
 
א
ת
 
פ
נ
י
 
ב
נ
פ
ש
 
ה
א
כ
ל
ת
 
א
ת
 
ה
ד
ם
 
ו
ה
כ
ר
ת
י
 
א
ת
ה
 
מ
ק
ר
ב
 
ע
מ
ה
 
כ
י
 
נ
פ
ש
 
ה
ב
ש
ר
 
ב
ד
ם
 
ה
ו
א
 
ו
א
נ
י
 
נ
ת
ת
י
ו
 
ל
כ
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ל
כ
פ
ר
 
ע
ל
 
נ
פ
ש
ת
י
כ
ם
 
כ
י
 
ה
ד
ם
 
ה
ו
א
 
ב
נ
פ
ש
 
י
כ
פ
ר
 
ע
ל
 
כ
ן
 
א
מ
ר
ת
י
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
כ
ל
 
נ
פ
ש
 
מ
כ
ם
 
ל
א
 
ת
א
כ
ל
 
ד
ם
 
ו
ה
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
כ
ם
 
ל
א
 
י
א
כ
ל
 
ד
ם
 
ו
א
י
ש
 
א
י
ש
 
מ
ב
י
ת
 
י
ש
ר
א
ל
 
ו
מ
ן
 
ה
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
כ
ם
 
א
ש
ר
 
י
צ
ו
ד
 
צ
י
ד
 
ח
י
ה
 
א
ו
 
ע
ו
ף
 
א
ש
ר
 
י
א
כ
ל
 
ו
ש
פ
ך
 
א
ת
 
ד
מ
ו
 
ו
כ
ס
ה
ו
 
ב
ע
פ
ר
 
כ
י
 
נ
פ
ש
 
כ
ל
 
ב
ש
ר
 
ד
מ
ו
 
ב
נ
פ
ש
ו
 
ה
ו
א
 
ו
א
מ
ר
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ד
ם
 
כ
ל
 
ב
ש
ר
 
ל
א
 
ת
א
כ
ל
ו
 
כ
י
 
נ
פ
ש
 
כ
ל
 
ב
ש
ר
 
ד
מ
ו
 
ה
ו
א
 
כ
ל
 
א
כ
ל
ו
 
י
כ
ר
ת
 
ו
כ
ל
 
ה
נ
פ
ש
 
א
ש
ר
 
ת
א
כ
ל
 
נ
ב
ל
ה
 
ו
ט
ר
פ
ה
 
ב
א
ז
ר
ח
 
ו
ב
ג
ר
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ם
 
ל
א
 
י
כ
ב
ס
 
ו
ב
ש
ר
ו
 
ל
א
 
י
ר
ח
ץ
 
ו
נ
ש
א
 
ע
ו
נ
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
כ
מ
ע
ש
ה
 
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
ש
ר
 
י
ש
ב
ת
ם
 
ב
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
כ
מ
ע
ש
ה
 
א
ר
ץ
 
כ
נ
ע
ן
 
א
ש
ר
 
א
נ
י
 
מ
ב
י
א
 
א
ת
כ
ם
 
ש
מ
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ב
ח
ק
ת
י
ה
ם
 
ל
א
 
ת
ל
כ
ו
 
א
ת
 
מ
ש
פ
ט
י
 
ת
ע
ש
ו
 
ו
א
ת
 
ח
ק
ו
ת
י
 
ת
ש
מ
ר
ו
 
ל
ל
כ
ת
 
ב
ה
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ח
ק
ו
ת
י
 
ו
א
ת
 
מ
ש
פ
ט
י
 
א
ש
ר
 
י
ע
ש
ה
 
א
ת
ם
 
ה
א
ד
ם
 
ו
ח
י
ה
 
ב
ה
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
י
ש
 
א
י
ש
 
א
ל
 
כ
ל
 
ש
א
ר
 
ב
ש
ר
ו
 
ל
א
 
ת
ק
ר
ב
ו
 
ל
ג
ל
ו
ת
 
ע
ר
ו
ה
 
א
נ
י
 
י
ה
ו
ה
 
ע
ר
ו
ת
 
א
ב
י
ך
 
ו
ע
ר
ו
ת
 
א
מ
ך
 
ל
א
 
ת
ג
ל
ה
 
א
מ
ך
 
ה
י
א
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
ה
 
ע
ר
ו
ת
 
א
ש
ת
 
א
ב
י
ך
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
 
א
ב
י
ך
 
ה
י
א
 
ע
ר
ו
ת
 
א
ח
ו
ת
ך
 
ב
ת
 
א
ב
י
ך
 
א
ו
 
ב
ת
 
א
מ
ך
 
מ
ו
ל
ד
ת
 
ב
י
ת
 
א
ו
 
מ
ו
ל
ד
ת
 
ח
ו
ץ
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
ה
 
ע
ר
ו
ת
 
ב
ת
 
ב
נ
ך
 
א
ו
 
ב
ת
 
ב
ת
ך
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
ן
 
כ
י
 
ע
ר
ו
ת
ך
 
ה
נ
ה
 
ע
ר
ו
ת
 
ב
ת
 
א
ש
ת
 
א
ב
י
ך
 
מ
ו
ל
ד
ת
 
א
ב
י
ך
 
א
ח
ו
ת
ך
 
ה
י
א
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
ה
 
ע
ר
ו
ת
 
א
ח
ו
ת
 
א
ב
י
ך
 
ל
א
 
ת
ג
ל
ה
 
ש
א
ר
 
א
ב
י
ך
 
ה
י
א
 
ע
ר
ו
ת
 
א
ח
ו
ת
 
א
מ
ך
 
ל
א
 
ת
ג
ל
ה
 
ש
א
ר
 
א
מ
ך
 
ה
י
א
 
ע
ר
ו
ת
 
א
ח
י
 
א
ב
י
ך
 
ל
א
 
ת
ג
ל
ה
 
ו
א
ל
 
א
ש
ת
ו
 
ל
א
 
ת
ק
ר
ב
 
ד
ד
ת
ך
 
ה
י
א
 
ע
ר
ו
ת
 
כ
ל
ת
ך
 
ל
א
 
ת
ג
ל
ה
 
א
ש
ת
 
ב
נ
ך
 
ה
י
א
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
ה
 
ע
ר
ו
ת
 
א
ש
ת
 
א
ח
י
ך
 
ל
א
 
ת
ג
ל
ה
 
ע
ר
ו
ת
 
א
ח
י
ך
 
ה
י
א
 
ע
ר
ו
ת
 
א
ש
ה
 
ו
ב
ת
ה
 
ל
א
 
ת
ג
ל
ה
 
א
ת
 
ב
ת
 
ב
נ
ה
 
ו
א
ת
 
ב
ת
 
ב
ת
ה
 
ל
א
 
ת
ק
ח
 
ל
ג
ל
ו
ת
 
ע
ר
ו
ת
ה
 
ש
א
ר
ה
 
ה
נ
ה
 
ז
מ
ה
 
ה
י
א
 
ו
א
ש
ה
 
ע
ל
 
א
ח
ו
ת
ה
 
ל
א
 
ת
ק
ח
 
ל
צ
ר
ר
 
ל
ג
ל
ו
ת
 
ע
ר
ו
ת
ה
 
ע
ל
י
ה
 
ב
ח
י
י
ה
 
ו
א
ל
 
א
ש
ה
 
ב
נ
ד
ת
 
ט
מ
א
ת
ה
 
ל
א
 
ת
ק
ר
ב
 
ל
ג
ל
ו
ת
 
ע
ר
ו
ת
ה
 
ו
א
ל
 
א
ש
ת
 
ע
מ
י
ת
ך
 
ל
א
 
ת
ת
ן
 
ש
כ
ב
ת
ך
 
ל
ז
ר
ע
 
ל
ט
מ
א
ה
 
ב
ה
 
ו
מ
ז
ר
ע
ך
 
ל
א
 
ת
ת
ן
 
ל
ה
ע
ב
י
ד
 
ל
מ
ל
ך
 
ו
ל
א
 
ת
ח
ל
ל
 
א
ת
 
ש
ם
 
א
ל
ה
י
ך
 
א
נ
י
 
י
ה
ו
ה
 
ו
א
ת
 
ז
כ
ר
 
ל
א
 
ת
ש
כ
ב
 
מ
ש
כ
ב
י
 
א
ש
ה
 
ת
ו
ע
ב
ה
 
ה
י
א
 
ו
ב
כ
ל
 
ב
ה
מ
ה
 
ל
א
 
ת
ת
ן
 
ש
כ
ב
ת
ך
 
ל
ט
מ
א
ה
 
ב
ה
 
ו
א
ש
ה
 
ל
א
 
ת
ע
מ
ד
 
ל
פ
נ
י
 
ב
ה
מ
ה
 
ל
ר
ב
ע
ה
 
ת
ב
ל
 
ה
ו
א
 
א
ל
 
ת
ט
מ
א
ו
 
ב
כ
ל
 
א
ל
ה
 
כ
י
 
ב
כ
ל
 
א
ל
ה
 
נ
ט
מ
א
ו
 
ה
ג
ו
י
ם
 
א
ש
ר
 
א
נ
י
 
מ
ש
ל
ח
 
מ
פ
נ
י
כ
ם
 
ו
ת
ט
מ
א
 
ה
א
ר
ץ
 
ו
א
פ
ק
ד
 
ע
ו
נ
ה
 
ע
ל
י
ה
 
ו
ת
ק
י
א
 
ה
א
ר
ץ
 
א
ת
 
י
ש
ב
י
ה
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ח
ק
ו
ת
י
 
ו
א
ת
 
מ
ש
פ
ט
י
 
ו
ל
א
 
ת
ע
ש
ו
 
מ
כ
ל
 
ה
ת
ו
ע
ב
ו
ת
 
ה
א
ל
ה
 
ה
א
ז
ר
ח
 
ו
ה
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
כ
ם
 
כ
י
 
א
ת
 
כ
ל
 
ה
ת
ו
ע
ב
ו
ת
 
ה
א
ל
ה
 
ע
ש
ו
 
א
נ
ש
י
 
ה
א
ר
ץ
 
א
ש
ר
 
ל
פ
נ
י
כ
ם
 
ו
ת
ט
מ
א
 
ה
א
ר
ץ
 
ו
ל
א
 
ת
ק
י
א
 
ה
א
ר
ץ
 
א
ת
כ
ם
 
ב
ט
מ
א
כ
ם
 
א
ת
ה
 
כ
א
ש
ר
 
ק
א
ה
 
א
ת
 
ה
ג
ו
י
 
א
ש
ר
 
ל
פ
נ
י
כ
ם
 
כ
י
 
כ
ל
 
א
ש
ר
 
י
ע
ש
ה
 
מ
כ
ל
 
ה
ת
ו
ע
ב
ו
ת
 
ה
א
ל
ה
 
ו
נ
כ
ר
ת
ו
 
ה
נ
פ
ש
ו
ת
 
ה
ע
ש
ו
ת
 
מ
ק
ר
ב
 
ע
מ
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
מ
ש
מ
ר
ת
י
 
ל
ב
ל
ת
י
 
ע
ש
ו
ת
 
מ
ח
ק
ו
ת
 
ה
ת
ו
ע
ב
ו
ת
 
א
ש
ר
 
נ
ע
ש
ו
 
ל
פ
נ
י
כ
ם
 
ו
ל
א
 
ת
ט
מ
א
ו
 
ב
ה
ן
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ק
ד
י
ש
י
ם
 
ת
ה
י
ו
 
כ
י
 
ק
ד
ו
ש
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
י
ש
 
א
מ
ו
 
ו
א
ב
י
ו
 
ת
י
ר
א
ו
 
ו
א
ת
 
ש
ב
ת
ת
י
 
ת
ש
מ
ר
ו
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ל
 
ת
פ
נ
ו
 
א
ל
 
ה
א
ל
י
ל
י
ם
 
ו
א
ל
ה
י
 
מ
ס
כ
ה
 
ל
א
 
ת
ע
ש
ו
 
ל
כ
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
כ
י
 
ת
ז
ב
ח
ו
 
ז
ב
ח
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
ל
ר
צ
ו
נ
כ
ם
 
ת
ז
ב
ח
ה
ו
 
ב
י
ו
ם
 
ז
ב
ח
כ
ם
 
י
א
כ
ל
 
ו
מ
מ
ח
ר
ת
 
ו
ה
נ
ו
ת
ר
 
ע
ד
 
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ב
א
ש
 
י
ש
ר
ף
 
ו
א
ם
 
א
כ
ל
 
י
א
כ
ל
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
פ
ג
ו
ל
 
ה
ו
א
 
ל
א
 
י
ר
צ
ה
 
ו
א
כ
ל
ו
 
ע
ו
נ
ו
 
י
ש
א
 
כ
י
 
א
ת
 
ק
ד
ש
 
י
ה
ו
ה
 
ח
ל
ל
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
מ
י
ה
 
ו
ב
ק
צ
י
ר
כ
ם
 
א
ת
 
ק
צ
י
ר
 
א
ר
צ
כ
ם
 
ל
א
 
ת
כ
ל
ה
 
פ
א
ת
 
ש
ד
ך
 
ל
ק
צ
ר
 
ו
ל
ק
ט
 
ק
צ
י
ר
ך
 
ל
א
 
ת
ל
ק
ט
 
ו
כ
ר
מ
ך
 
ל
א
 
ת
ע
ו
ל
ל
 
ו
פ
ר
ט
 
כ
ר
מ
ך
 
ל
א
 
ת
ל
ק
ט
 
ל
ע
נ
י
 
ו
ל
ג
ר
 
ת
ע
ז
ב
 
א
ת
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
א
 
ת
ג
נ
ב
ו
 
ו
ל
א
 
ת
כ
ח
ש
ו
 
ו
ל
א
 
ת
ש
ק
ר
ו
 
א
י
ש
 
ב
ע
מ
י
ת
ו
 
ו
ל
א
 
ת
ש
ב
ע
ו
 
ב
ש
מ
י
 
ל
ש
ק
ר
 
ו
ח
ל
ל
ת
 
א
ת
 
ש
ם
 
א
ל
ה
י
ך
 
א
נ
י
 
י
ה
ו
ה
 
ל
א
 
ת
ע
ש
ק
 
א
ת
 
ר
ע
ך
 
ו
ל
א
 
ת
ג
ז
ל
 
ל
א
 
ת
ל
י
ן
 
פ
ע
ל
ת
 
ש
כ
י
ר
 
א
ת
ך
 
ע
ד
 
ב
ק
ר
 
ל
א
 
ת
ק
ל
ל
 
ח
ר
ש
 
ו
ל
פ
נ
י
 
ע
ו
ר
 
ל
א
 
ת
ת
ן
 
מ
כ
ש
ו
ל
 
ו
י
ר
א
ת
 
מ
א
ל
ה
י
ך
 
א
נ
י
 
י
ה
ו
ה
 
ל
א
 
ת
ע
ש
ה
 
ע
ו
ל
 
ב
מ
ש
פ
ט
 
ל
א
 
ת
ש
א
 
פ
נ
י
 
ד
ל
 
ו
ל
א
 
ת
ה
ד
ר
 
פ
נ
י
 
ג
ד
ו
ל
 
ב
צ
ד
ק
 
ת
ש
פ
ט
 
א
ת
 
ע
מ
י
ת
ך
 
ל
א
 
ת
ל
ך
 
ר
כ
י
ל
 
ב
ע
מ
ך
 
ו
ל
א
 
ת
ע
מ
ד
 
ע
ל
 
ד
ם
 
ר
ע
ך
 
א
נ
י
 
י
ה
ו
ה
 
ל
א
 
ת
ש
נ
א
 
א
ת
 
א
ח
י
ך
 
ב
ל
ב
ב
ך
 
ה
ו
כ
י
ח
 
ת
ו
כ
י
ח
 
א
ת
 
ע
מ
י
ת
ך
 
ו
ל
א
 
ת
ש
א
 
ע
ל
י
ו
 
ח
ט
א
 
ל
א
 
ת
ק
ו
ם
 
ו
ל
א
 
ת
ה
ט
ר
 
א
ת
 
ב
נ
י
 
ע
מ
ך
 
ו
א
ה
ב
ת
 
ל
ר
ע
ך
 
כ
מ
ו
ך
 
א
נ
י
 
י
ה
ו
ה
 
א
ת
 
ח
ק
ו
ת
י
 
ת
ש
מ
ר
ו
 
ב
ה
מ
ת
ך
 
ל
א
 
ת
ר
ב
י
ע
 
כ
ל
א
י
ם
 
ו
ש
ד
ך
 
ל
א
 
ת
ז
ר
ע
 
כ
ל
א
י
ם
 
ו
ב
ג
ד
 
כ
ל
א
י
ם
 
ש
ע
ט
נ
י
ז
 
ל
א
 
י
ע
ל
ה
 
ע
ל
י
ך
 
ו
א
י
ש
 
כ
י
 
י
ש
כ
ב
 
א
ת
 
א
ש
ה
 
ש
כ
ב
ת
 
ז
ר
ע
 
ו
ה
י
א
 
ש
פ
ח
ה
 
נ
ח
ר
פ
ת
 
ל
א
י
ש
 
ו
ה
פ
ד
ה
 
ל
א
 
נ
פ
ד
ת
ה
 
א
ו
 
ח
פ
ש
י
 
ל
א
 
נ
ת
ן
 
ל
ה
 
ב
ק
ר
ת
 
ת
ה
י
ה
 
ל
ו
 
ל
א
 
י
ו
מ
ת
 
כ
י
 
ל
א
 
ח
פ
ש
ה
 
ו
ה
ב
י
א
 
א
ת
 
א
ש
מ
ו
 
ל
י
ה
ו
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
א
י
ל
 
א
ש
ם
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
ה
כ
ה
ן
 
ב
א
י
ל
 
ה
א
ש
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ל
 
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ו
נ
ס
ל
ח
 
ל
ו
 
מ
ח
ט
א
ת
ו
 
א
ש
ר
 
ח
ט
א
 
ו
כ
י
 
ת
ב
א
ו
 
א
ל
 
ה
א
ר
ץ
 
ו
נ
ט
ע
ת
ם
 
כ
ל
 
ע
ץ
 
מ
א
כ
ל
 
ו
ע
ר
ל
ת
ם
 
א
ת
 
ע
ר
ל
ת
ו
 
א
ת
 
פ
ר
י
ו
 
ש
ל
ש
 
ש
נ
י
ם
 
י
ה
י
ה
 
ל
כ
ם
 
ע
ר
ל
י
ם
 
ל
א
 
י
א
כ
ל
 
ו
ב
ש
נ
ה
 
ה
ר
ב
י
ע
י
ת
 
י
ה
י
ו
 
כ
ל
 
פ
ר
י
ו
 
ק
ד
ש
 
ח
ל
ל
י
ם
 
ל
י
ה
ו
ה
 
ו
ב
ש
נ
ה
 
ה
ח
מ
י
ש
י
ת
 
ת
א
כ
ל
ו
 
א
ת
 
פ
ר
י
ו
 
ל
ה
ס
י
ף
 
ל
כ
ם
 
ת
ב
ו
א
ת
ו
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ע
ל
 
ה
ד
ם
 
ו
ל
א
 
ת
נ
ח
ש
ו
 
ו
ל
א
 
ת
ע
נ
נ
ו
 
ו
ל
א
 
ת
ק
י
פ
ו
 
א
ת
 
פ
א
ת
 
ר
א
ש
כ
ם
 
ו
ל
א
 
ת
ש
ח
י
ת
ו
 
א
ת
 
פ
א
ת
 
ז
ק
נ
כ
ם
 
ו
ש
ר
ט
ה
 
ל
נ
פ
ש
 
ל
א
 
ת
ת
נ
ו
 
ב
ב
ש
ר
כ
ם
 
ו
כ
ת
ב
ת
 
ק
ע
ק
ע
 
ל
א
 
ת
ת
נ
ו
 
ב
כ
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
 
ת
ח
ל
ל
 
א
ת
 
ב
ת
ך
 
ל
ה
ז
נ
ו
ת
ה
 
ו
ל
א
 
ת
ז
נ
ה
 
ה
א
ר
ץ
 
ו
מ
ל
א
ה
 
ה
א
ר
ץ
 
ז
מ
ה
 
א
ת
 
ש
ב
ת
ת
י
 
ת
ש
מ
ר
ו
 
ו
מ
ק
ד
ש
י
 
ת
י
ר
א
ו
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
 
ת
פ
נ
ו
 
א
ל
 
ה
א
ו
ב
ו
ת
 
ו
א
ל
 
ה
י
ד
ע
ו
נ
י
ם
 
א
ל
 
ת
ב
ק
ש
ו
 
ל
ט
מ
א
ה
 
ב
ה
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
מ
פ
נ
י
 
ש
י
ב
ה
 
ת
ק
ו
ם
 
ו
ה
ד
ר
ת
 
פ
נ
י
 
ז
ק
ן
 
ו
י
ר
א
ת
 
מ
א
ל
ה
י
ך
 
א
נ
י
 
י
ה
ו
ה
 
ו
כ
י
 
י
ג
ו
ר
 
א
ת
כ
ם
 
ג
ר
 
ב
א
ר
צ
כ
ם
 
ל
א
 
ת
ו
נ
ו
 
א
ת
ו
 
כ
א
ז
ר
ח
 
מ
כ
ם
 
י
ה
י
ה
 
ל
כ
ם
 
ה
ג
ר
 
ה
ג
ר
 
א
ת
כ
ם
 
ו
א
ה
ב
ת
 
ל
ו
 
כ
מ
ו
ך
 
כ
י
 
ג
ר
י
ם
 
ה
י
י
ת
ם
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
א
 
ת
ע
ש
ו
 
ע
ו
ל
 
ב
מ
ש
פ
ט
 
ב
מ
ד
ה
 
ב
מ
ש
ק
ו
ל
 
ו
ב
מ
ש
ו
ר
ה
 
מ
א
ז
נ
י
 
צ
ד
ק
 
א
ב
נ
י
 
צ
ד
ק
 
א
י
פ
ת
 
צ
ד
ק
 
ו
ה
י
ן
 
צ
ד
ק
 
י
ה
י
ה
 
ל
כ
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
כ
ל
 
ח
ק
ו
ת
י
 
ו
א
ת
 
כ
ל
 
מ
ש
פ
ט
י
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
א
נ
י
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ד
ב
ר
 
א
י
ש
 
א
י
ש
 
מ
ב
י
ת
 
י
ש
ר
א
ל
 
ו
מ
ן
 
ה
ג
ר
 
ה
ג
ר
 
ב
י
ש
ר
א
ל
 
א
ש
ר
 
י
ת
ן
 
מ
ז
ר
ע
ו
 
ל
מ
ל
ך
 
מ
ו
ת
 
י
ו
מ
ת
 
ע
ם
 
ה
א
ר
ץ
 
י
ר
ג
מ
ה
ו
 
ב
א
ב
ן
 
ו
א
נ
י
 
א
ת
ן
 
א
ת
 
פ
נ
י
 
ב
א
י
ש
 
ה
ה
ו
א
 
ו
ה
כ
ר
ת
י
 
א
ת
ו
 
מ
ק
ר
ב
 
ע
מ
ו
 
כ
י
 
מ
ז
ר
ע
ו
 
נ
ת
ן
 
ל
מ
ל
ך
 
ל
מ
ע
ן
 
ט
מ
א
 
א
ת
 
מ
ק
ד
ש
י
 
ו
ח
ל
ל
 
א
ת
 
ש
ם
 
ק
ד
ש
י
 
ו
א
ם
 
ה
ע
ל
ם
 
י
ע
ל
מ
ו
 
ע
ם
 
ה
א
ר
ץ
 
א
ת
 
ע
י
נ
י
ה
ם
 
מ
ן
 
ה
א
י
ש
 
ה
ה
ו
א
 
ב
ת
ת
ו
 
מ
ז
ר
ע
ו
 
ל
מ
ל
ך
 
ל
ב
ל
ת
י
 
ה
מ
י
ת
 
א
ת
ו
 
ו
ש
מ
ת
י
 
א
נ
י
 
א
ת
 
פ
נ
י
 
ב
א
י
ש
 
ה
ה
ו
א
 
ו
ב
מ
ש
פ
ח
ת
ו
 
ו
ה
כ
ר
ת
י
 
א
ת
ו
 
ו
א
ת
 
כ
ל
 
ה
ז
נ
י
ם
 
א
ח
ר
י
ו
 
ל
ז
נ
ו
ת
 
א
ח
ר
י
 
ה
מ
ל
ך
 
מ
ק
ר
ב
 
ע
מ
ם
 
ו
ה
נ
פ
ש
 
א
ש
ר
 
ת
פ
נ
ה
 
א
ל
 
ה
א
ו
ב
ו
ת
 
ו
א
ל
 
ה
י
ד
ע
ו
נ
י
ם
 
ל
ז
נ
ו
ת
 
א
ח
ר
י
ה
ם
 
ו
נ
ת
ת
י
 
א
ת
 
פ
נ
י
 
ב
נ
פ
ש
 
ה
ה
י
א
 
ו
ה
כ
ר
ת
י
 
א
ת
ה
 
מ
ק
ר
ב
 
ע
מ
ה
 
ו
ה
י
י
ת
ם
 
ק
ד
י
ש
י
ם
 
כ
י
 
ק
ד
ו
ש
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
כ
ל
 
ח
ק
ו
ת
י
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
כ
ם
 
כ
י
 
א
י
ש
 
א
י
ש
 
א
ש
ר
 
י
ק
ל
ל
 
א
ת
 
א
ב
י
ו
 
ו
א
ת
 
א
מ
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
א
ב
י
ו
 
ו
א
מ
ו
 
ק
ל
ל
 
ד
מ
ו
 
ב
ו
 
ו
א
י
ש
 
א
ש
ר
 
י
נ
א
ף
 
א
ת
 
א
ש
ת
 
א
י
ש
 
א
ש
ר
 
י
נ
א
ף
 
א
ת
 
א
ש
ת
 
ר
ע
ה
ו
 
מ
ו
ת
 
י
ו
מ
ת
 
ה
נ
א
ף
 
ו
ה
נ
א
פ
ת
 
ו
א
י
ש
 
א
ש
ר
 
י
ש
כ
ב
 
א
ת
 
א
ש
ת
 
א
ב
י
ו
 
ע
ר
ו
ת
 
א
ב
י
ו
 
ג
ל
ה
 
מ
ו
ת
 
י
ו
מ
ת
ו
 
ש
נ
י
ה
ם
 
ד
מ
י
ה
ם
 
ב
ם
 
ו
א
י
ש
 
א
ש
ר
 
י
ש
כ
ב
 
א
ת
 
כ
ל
ת
ו
 
מ
ו
ת
 
י
ו
מ
ת
ו
 
ש
נ
י
ה
ם
 
ת
ב
ל
 
ע
ש
ו
 
ד
מ
י
ה
ם
 
ב
ם
 
ו
א
י
ש
 
א
ש
ר
 
י
ש
כ
ב
 
א
ת
 
ז
כ
ר
 
מ
ש
כ
ב
י
 
א
ש
ה
 
ת
ו
ע
ב
ה
 
ע
ש
ו
 
מ
ו
ת
 
י
ו
מ
ת
ו
 
ש
נ
י
ה
ם
 
ד
מ
י
ה
ם
 
ב
ם
 
ו
א
י
ש
 
א
ש
ר
 
י
ק
ח
 
א
ת
 
א
ש
ה
 
ו
א
ת
 
א
מ
ה
 
ז
מ
ה
 
ה
י
א
 
ב
א
ש
 
י
ש
ר
פ
ו
 
א
ת
ו
 
ו
א
ת
ה
ן
 
ו
ל
א
 
ת
ה
י
ה
 
ז
מ
ה
 
ב
ת
ו
כ
כ
ם
 
ו
א
י
ש
 
א
ש
ר
 
י
ת
ן
 
ש
כ
ב
ת
ו
 
ב
ב
ה
מ
ה
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
א
ת
 
ה
ב
ה
מ
ה
 
ת
ה
ר
ג
ו
 
ו
א
ש
ה
 
א
ש
ר
 
ת
ק
ר
ב
 
א
ל
 
כ
ל
 
ב
ה
מ
ה
 
ל
ר
ב
ע
ה
 
א
ת
ה
 
ו
ה
ר
ג
ת
 
א
ת
 
ה
א
ש
ה
 
ו
א
ת
 
ה
ב
ה
מ
ה
 
מ
ו
ת
 
י
ו
מ
ת
ו
 
ד
מ
י
ה
ם
 
ב
ם
 
ו
א
י
ש
 
א
ש
ר
 
י
ק
ח
 
א
ת
 
א
ח
ו
ת
ו
 
ב
ת
 
א
ב
י
ו
 
א
ו
 
ב
ת
 
א
מ
ו
 
ו
ר
א
ה
 
א
ת
 
ע
ר
ו
ת
ה
 
ו
ה
י
א
 
ת
ר
א
ה
 
א
ת
 
ע
ר
ו
ת
ו
 
ח
ס
ד
 
ה
ו
א
 
ו
נ
כ
ר
ת
ו
 
ל
ע
י
נ
י
 
ב
נ
י
 
ע
מ
ם
 
ע
ר
ו
ת
 
א
ח
ו
ת
ו
 
ג
ל
ה
 
ע
ו
נ
ו
 
י
ש
א
 
ו
א
י
ש
 
א
ש
ר
 
י
ש
כ
ב
 
א
ת
 
א
ש
ה
 
ד
ו
ה
 
ו
ג
ל
ה
 
א
ת
 
ע
ר
ו
ת
ה
 
א
ת
 
מ
ק
ו
ר
 
ה
ע
ר
ו
ה
 
ו
ה
י
א
 
ג
ל
ת
ה
 
א
ת
 
מ
ק
ו
ר
 
ד
מ
י
ה
 
ו
נ
כ
ר
ת
ו
 
ש
נ
י
ה
ם
 
מ
ק
ר
ב
 
ע
מ
ם
 
ע
ר
ו
ת
 
א
ח
ו
ת
 
א
ב
י
ך
 
ו
א
ח
ו
ת
 
א
מ
ך
 
ל
א
 
ת
ג
ל
ה
 
כ
י
 
א
ת
 
ש
א
ר
 
ה
ע
ר
ו
ה
 
ע
ו
נ
ם
 
י
ש
א
ו
 
ו
א
י
ש
 
א
ש
ר
 
י
ש
כ
ב
 
א
ת
 
ד
ד
ת
ו
 
א
ת
 
ע
ר
ו
ת
 
ד
ד
ו
 
ג
ל
ה
 
ח
ט
א
ם
 
י
ש
א
ו
 
ע
ר
ר
י
ם
 
י
ו
מ
ת
ו
 
ו
א
י
ש
 
א
ש
ר
 
י
ק
ח
 
א
ת
 
א
ש
ת
 
א
ח
י
ו
 
נ
ד
ה
 
ה
י
א
 
ע
ר
ו
ת
 
א
ח
י
ו
 
ג
ל
ה
 
ע
ר
ר
י
ם
 
י
ה
י
ו
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
כ
ל
 
ח
ק
ו
ת
י
 
ו
א
ת
 
כ
ל
 
מ
ש
פ
ט
י
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ו
ל
א
 
ת
ק
י
א
 
ה
א
ר
ץ
 
א
ת
כ
ם
 
א
ש
ר
 
א
נ
י
 
מ
ב
י
א
 
א
ת
כ
ם
 
ש
מ
ה
 
ל
ש
ב
ת
 
ב
ה
 
ו
ל
א
 
ת
ל
כ
ו
 
ב
ח
ק
ו
ת
 
ה
ג
ו
י
ם
 
א
ש
ר
 
א
נ
י
 
מ
ש
ל
ח
 
מ
פ
נ
י
כ
ם
 
כ
י
 
א
ת
 
כ
ל
 
א
ל
ה
 
ע
ש
ו
 
ו
א
ק
ץ
 
ב
ם
 
ו
א
מ
ר
 
ל
כ
ם
 
א
ת
ם
 
ת
י
ר
ש
ו
 
א
ת
 
א
ד
מ
ת
ם
 
ו
א
נ
י
 
א
ת
נ
נ
ה
 
ל
כ
ם
 
ל
ר
ש
ת
 
א
ת
ה
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
ה
ב
ד
ל
ת
י
 
א
ת
כ
ם
 
מ
ן
 
ה
ע
מ
י
ם
 
ו
ה
ב
ד
ל
ת
ם
 
ב
י
ן
 
ה
ב
ה
מ
ה
 
ה
ט
ה
ר
ה
 
ל
ט
מ
א
ה
 
ו
ב
י
ן
 
ה
ע
ו
ף
 
ה
ט
מ
א
 
ל
ט
ה
ו
ר
 
ו
ל
א
 
ת
ש
ק
צ
ו
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ב
ב
ה
מ
ה
 
ו
ב
ע
ו
ף
 
ו
ב
כ
ל
 
א
ש
ר
 
ת
ר
מ
ש
 
ה
א
ד
מ
ה
 
א
ש
ר
 
ה
ב
ד
ל
ת
י
 
ל
כ
ם
 
ל
ט
מ
א
ה
 
ו
ה
י
י
ת
ם
 
ל
י
 
ק
ד
י
ש
י
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ו
א
ב
ד
י
ל
 
א
ת
כ
ם
 
מ
ן
 
ה
ע
מ
י
ם
 
ל
ה
י
ו
ת
 
ל
י
 
ו
א
י
ש
 
א
ו
 
א
ש
ה
 
א
ש
ר
 
י
ה
י
ה
 
ב
ה
ם
 
א
ו
ב
 
א
ו
 
י
ד
ע
ו
נ
י
 
מ
ו
ת
 
י
ו
מ
ת
ו
 
ב
א
ב
נ
י
ם
 
ת
ר
ג
מ
ו
ם
 
ד
מ
י
ה
ם
 
ב
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
א
ל
 
ה
כ
ה
נ
י
ם
 
ב
נ
י
 
א
ה
ר
ן
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ל
נ
פ
ש
 
ל
א
 
י
ט
מ
א
 
ב
ע
מ
ו
 
כ
י
 
א
ם
 
ל
ש
א
ר
ו
 
ה
ק
ר
ו
ב
 
א
ל
י
ו
 
ל
א
ב
י
ו
 
ו
ל
א
מ
ו
 
ל
ב
נ
ו
 
ו
ל
ב
ת
ו
 
ל
א
ח
י
ו
 
ו
ל
א
ח
ו
ת
ו
 
ה
ב
ת
ו
ל
ה
 
ה
ק
ר
ו
ב
ה
 
א
ל
י
ו
 
א
ש
ר
 
ל
א
 
ה
י
ת
ה
 
ל
א
י
ש
 
ל
ה
 
י
ט
מ
א
 
ל
א
 
י
ט
מ
א
 
ב
ע
ל
 
ב
ע
מ
ו
 
ל
ה
ח
ל
ו
 
ו
ל
א
 
י
ק
ר
ח
ו
 
ק
ר
ח
ה
 
ב
ר
א
ש
ם
 
ו
פ
א
ת
 
ז
ק
נ
ם
 
ל
א
 
י
ג
ל
ח
ו
 
ו
ב
ב
ש
ר
ם
 
ל
א
 
י
ש
ר
ט
ו
 
ש
ר
ט
ה
 
ק
ד
י
ש
י
ם
 
י
ה
י
ו
 
ל
א
ל
ה
י
ה
ם
 
ו
ל
א
 
י
ח
ל
ל
ו
 
א
ת
 
ש
ם
 
א
ל
ה
י
ה
ם
 
כ
י
 
א
ת
 
א
ש
י
 
י
ה
ו
ה
 
ל
ח
ם
 
א
ל
ה
י
ה
ם
 
ה
ם
 
מ
ק
ר
ב
י
ם
 
ו
ה
י
ו
 
ק
ד
י
ש
י
ם
 
א
ש
ה
 
ז
ו
נ
ה
 
ו
ח
ל
ל
ה
 
ל
א
 
י
ק
ח
ו
 
ו
א
ש
ה
 
ג
ר
ו
ש
ה
 
מ
א
י
ש
ה
 
ל
א
 
י
ק
ח
ו
 
כ
י
 
ק
ד
ו
ש
 
ה
ו
א
 
ל
א
ל
ה
י
ו
 
ו
ק
ד
ש
ת
ו
 
כ
י
 
א
ת
 
ל
ח
ם
 
א
ל
ה
י
ך
 
ה
ו
א
 
מ
ק
ר
י
ב
 
ק
ד
ו
ש
 
י
ה
י
ה
 
ל
ך
 
כ
י
 
ק
ד
ו
ש
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
ם
 
ו
ב
ת
 
א
י
ש
 
כ
ה
ן
 
כ
י
 
ת
ח
ל
 
ל
ז
נ
ו
ת
 
א
ת
 
א
ב
י
ה
 
ה
י
א
 
מ
ח
ל
ל
ת
 
ב
א
ש
 
ת
ש
ר
ף
 
ו
ה
כ
ה
ן
 
ה
ג
ד
ו
ל
 
מ
א
ח
י
ו
 
א
ש
ר
 
י
ו
צ
ק
 
ע
ל
 
ר
א
ש
ו
 
ש
מ
ן
 
ה
מ
ש
ח
ה
 
ו
מ
ל
א
 
י
ד
ו
 
ל
ל
ב
ש
 
א
ת
 
ה
ב
ג
ד
י
ם
 
א
ת
 
ר
א
ש
ו
 
ל
א
 
י
פ
ר
ע
 
ו
ב
ג
ד
י
ו
 
ל
א
 
י
פ
ר
ם
 
ו
ע
ל
 
כ
ל
 
נ
פ
ש
ו
ת
 
מ
ת
 
ל
א
 
י
ב
ו
א
 
ל
א
ב
י
ו
 
ו
ל
א
מ
ו
 
ל
א
 
י
ט
מ
א
 
ו
מ
ן
 
ה
מ
ק
ד
ש
 
ל
א
 
י
צ
א
 
ו
ל
א
 
י
ח
ל
ל
 
א
ת
 
מ
ק
ד
ש
 
א
ל
ה
י
ו
 
כ
י
 
נ
ז
ר
 
ש
מ
ן
 
מ
ש
ח
ת
 
א
ל
ה
י
ו
 
ע
ל
י
ו
 
א
נ
י
 
י
ה
ו
ה
 
ו
ה
ו
א
 
א
ש
ה
 
ב
ב
ת
ו
ל
י
ה
 
י
ק
ח
 
א
ל
מ
נ
ה
 
ו
ג
ר
ו
ש
ה
 
ו
ח
ל
ל
ה
 
ו
ז
ו
נ
ה
 
א
ת
 
א
ל
ה
 
ל
א
 
י
ק
ח
 
כ
י
 
א
ם
 
ב
ת
ו
ל
ה
 
מ
ע
מ
ו
 
י
ק
ח
 
א
ש
ה
 
ו
ל
א
 
י
ח
ל
ל
 
ז
ר
ע
ו
 
ב
ע
מ
ו
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
א
י
ש
 
מ
ז
ר
ע
ך
 
ל
ד
ר
ו
ת
ם
 
א
ש
ר
 
י
ה
י
ה
 
ב
ו
 
מ
ו
ם
 
ל
א
 
י
ק
ר
ב
 
ל
ה
ג
י
ש
 
ל
ח
ם
 
א
ל
ה
י
ו
 
כ
י
 
כ
ל
 
א
י
ש
 
א
ש
ר
 
י
ה
י
ה
 
ב
ו
 
מ
ו
ם
 
ל
א
 
י
ק
ר
ב
 
א
י
ש
 
ע
ו
ר
 
א
ו
 
פ
ס
ח
 
א
ו
 
ח
ר
ו
ם
 
א
ו
 
ש
ר
ו
ע
 
א
ו
 
א
י
ש
 
א
ש
ר
 
י
ה
י
ה
 
ב
ו
 
ש
ב
ר
 
ר
ג
ל
 
א
ו
 
ש
ב
ר
 
י
ד
 
א
ו
 
ג
ב
ן
 
א
ו
 
ד
ק
 
א
ו
 
ת
ב
ל
ל
 
ב
ע
י
נ
י
ו
 
א
ו
 
ג
ר
ב
 
א
ו
 
י
ל
פ
ת
 
א
ו
 
מ
ר
ו
ח
 
א
ש
ך
 
כ
ל
 
א
י
ש
 
א
ש
ר
 
ב
ו
 
מ
ו
ם
 
מ
ז
ר
ע
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ל
א
 
י
ג
י
ש
 
א
ת
 
א
ש
י
 
י
ה
ו
ה
 
מ
ו
ם
 
ב
ו
 
ל
א
 
י
ג
ש
 
ל
ה
ק
ר
י
ב
 
ל
ח
ם
 
א
ל
ה
י
ו
 
מ
ק
ד
ש
י
 
ה
ק
ד
ש
י
ם
 
ו
מ
ן
 
ה
ק
ד
ש
י
ם
 
י
א
כ
ל
 
א
ך
 
א
ל
 
ה
פ
ר
כ
ת
 
ל
א
 
י
ב
ו
א
 
ו
א
ל
 
ה
מ
ז
ב
ח
 
ל
א
 
י
ג
ש
 
כ
י
 
מ
ו
ם
 
ב
ו
 
ו
ל
א
 
י
ח
ל
ל
 
א
ת
 
מ
ק
ד
ש
י
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
ם
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ו
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ו
י
נ
ז
ר
ו
 
מ
ק
ד
ש
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
א
 
י
ח
ל
ל
ו
 
א
ת
 
ש
ם
 
ק
ד
ש
י
 
א
ש
ר
 
ה
ם
 
מ
ק
ד
י
ש
י
ם
 
ל
י
 
א
נ
י
 
י
ה
ו
ה
 
א
מ
ר
 
א
ל
י
ה
ם
 
ל
ד
ר
ת
י
כ
ם
 
כ
ל
 
א
י
ש
 
א
ש
ר
 
י
ק
ר
ב
 
מ
כ
ל
 
ז
ר
ע
כ
ם
 
א
ל
 
ה
ק
ד
ש
י
ם
 
א
ש
ר
 
י
ק
ד
י
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
י
ה
ו
ה
 
ו
ט
מ
א
ת
ו
 
ע
ל
י
ו
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ל
פ
נ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
י
ש
 
א
י
ש
 
מ
ז
ר
ע
 
א
ה
ר
ן
 
ו
ה
ו
א
 
צ
ר
ו
ע
 
א
ו
 
ז
ב
 
ב
ק
ד
ש
י
ם
 
ל
א
 
י
א
כ
ל
 
ע
ד
 
א
ש
ר
 
י
ט
ה
ר
 
ו
ה
נ
ג
ע
 
ב
כ
ל
 
ט
מ
א
 
נ
פ
ש
 
א
ו
 
א
י
ש
 
א
ש
ר
 
ת
צ
א
 
מ
מ
נ
ו
 
ש
כ
ב
ת
 
ז
ר
ע
 
א
ו
 
א
י
ש
 
א
ש
ר
 
י
ג
ע
 
ב
כ
ל
 
ש
ר
ץ
 
ט
מ
א
 
א
ש
ר
 
י
ט
מ
א
 
ל
ו
 
א
ו
 
ב
א
ד
ם
 
א
ש
ר
 
י
ט
מ
א
 
ל
ו
 
ל
כ
ל
 
ט
מ
א
ת
ו
 
נ
פ
ש
 
א
ש
ר
 
ת
ג
ע
 
ב
ו
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ל
א
 
י
א
כ
ל
 
מ
ן
 
ה
ק
ד
ש
י
ם
 
כ
י
 
א
ם
 
ר
ח
ץ
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
ב
א
 
ה
ש
מ
ש
 
ו
ט
ה
ר
 
ו
א
ח
ר
 
י
א
כ
ל
 
מ
ן
 
ה
ק
ד
ש
י
ם
 
כ
י
 
ל
ח
מ
ו
 
ה
ו
א
 
נ
ב
ל
ה
 
ו
ט
ר
פ
ה
 
ל
א
 
י
א
כ
ל
ו
 
ל
ט
מ
א
ה
 
ב
ה
 
א
נ
י
 
י
ה
ו
ה
 
ו
ש
מ
ר
ו
 
א
ת
 
מ
ש
מ
ר
ת
י
 
ו
ל
א
 
י
ש
א
ו
 
ע
ל
י
ו
 
ח
ט
א
 
ו
מ
ת
ו
 
ב
ו
 
כ
י
 
י
ח
ל
ל
ה
ו
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
ם
 
ו
כ
ל
 
ז
ר
 
ל
א
 
י
א
כ
ל
 
ק
ד
ש
 
ת
ו
ש
ב
 
כ
ה
ן
 
ו
ש
כ
י
ר
 
ל
א
 
י
א
כ
ל
 
ק
ד
ש
 
ו
כ
ה
ן
 
כ
י
 
י
ק
נ
ה
 
נ
פ
ש
 
ק
נ
י
ן
 
כ
ס
פ
ו
 
ה
ו
א
 
י
א
כ
ל
 
ב
ו
 
ו
י
ל
י
ד
י
 
ב
י
ת
ו
 
ה
ם
 
י
א
כ
ל
ו
 
ב
ל
ח
מ
ו
 
ו
ב
ת
 
כ
ה
ן
 
כ
י
 
ת
ה
י
ה
 
ל
א
י
ש
 
ז
ר
 
ה
י
א
 
ב
ת
ר
ו
מ
ת
 
ה
ק
ד
ש
י
ם
 
ל
א
 
ת
א
כ
ל
 
ו
ב
ת
 
כ
ה
ן
 
כ
י
 
ת
ה
י
ה
 
א
ל
מ
נ
ה
 
ו
ג
ר
ו
ש
ה
 
ו
ז
ר
ע
 
א
י
ן
 
ל
ה
 
ו
ש
ב
ה
 
א
ל
 
ב
י
ת
 
א
ב
י
ה
 
כ
נ
ע
ר
י
ה
 
מ
ל
ח
ם
 
א
ב
י
ה
 
ת
א
כ
ל
 
ו
כ
ל
 
ז
ר
 
ל
א
 
י
א
כ
ל
 
ב
ו
 
ו
א
י
ש
 
כ
י
 
י
א
כ
ל
 
ק
ד
ש
 
ב
ש
ג
ג
ה
 
ו
י
ס
ף
 
ח
מ
י
ש
ת
ו
 
ע
ל
י
ו
 
ו
נ
ת
ן
 
ל
כ
ה
ן
 
א
ת
 
ה
ק
ד
ש
 
ו
ל
א
 
י
ח
ל
ל
ו
 
א
ת
 
ק
ד
ש
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
י
ר
י
מ
ו
 
ל
י
ה
ו
ה
 
ו
ה
ש
י
א
ו
 
א
ת
ם
 
ע
ו
ן
 
א
ש
מ
ה
 
ב
א
כ
ל
ם
 
א
ת
 
ק
ד
ש
י
ה
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ו
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
י
ש
 
א
י
ש
 
מ
ב
י
ת
 
י
ש
ר
א
ל
 
ו
מ
ן
 
ה
ג
ר
 
ה
ג
ר
 
ב
י
ש
ר
א
ל
 
א
ש
ר
 
י
ק
ר
י
ב
 
ק
ר
ב
נ
ו
 
ל
כ
ל
 
נ
ד
ר
י
ה
ם
 
ו
ל
כ
ל
 
נ
ד
ב
ת
ם
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
ל
ע
ל
ה
 
ל
ר
צ
ו
נ
כ
ם
 
ת
מ
י
ם
 
ז
כ
ר
 
ב
ב
ק
ר
 
א
ו
 
ב
כ
ש
ב
י
ם
 
א
ו
 
ב
ע
ז
י
ם
 
כ
ל
 
א
ש
ר
 
ב
ו
 
מ
ו
ם
 
ל
א
 
ת
ק
ר
י
ב
ו
 
כ
י
 
ל
א
 
ל
ר
צ
ו
ן
 
י
ה
י
ה
 
ל
כ
ם
 
ו
א
י
ש
 
כ
י
 
י
ק
ר
י
ב
 
ז
ב
ח
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
ל
פ
ל
א
 
נ
ד
ר
 
א
ו
 
נ
ד
ב
ה
 
ב
ב
ק
ר
 
א
ו
 
ב
צ
א
ן
 
ת
מ
י
ם
 
י
ה
י
ה
 
ל
ר
צ
ו
ן
 
ו
כ
ל
 
מ
ו
ם
 
ל
א
 
י
ה
י
ה
 
ב
ו
 
ע
ו
ר
ת
 
א
ו
 
ש
ב
ו
ר
 
א
ו
 
ח
ר
ו
ץ
 
א
ו
 
י
ב
ל
ת
 
א
ו
 
ג
ר
ב
 
א
ו
 
י
ל
פ
ת
 
ל
א
 
ת
ק
ר
י
ב
ו
 
א
ל
ה
 
ל
י
ה
ו
ה
 
ו
א
ש
ה
 
ל
א
 
ת
ת
נ
ו
 
מ
ה
ם
 
ע
ל
 
ה
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
ו
ש
ו
ר
 
ו
ש
ה
 
ש
ר
ו
ע
 
ו
ק
ל
ו
ט
 
נ
ד
ב
ה
 
ת
ע
ש
ו
 
א
ת
ו
 
ו
ל
נ
ד
ר
 
ל
א
 
י
ר
צ
ה
 
ו
מ
ע
ו
ך
 
ו
כ
ת
ו
ת
 
ו
נ
ת
ו
ק
 
ו
כ
ר
ו
ת
 
ל
א
 
ת
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
ו
ב
א
ר
צ
כ
ם
 
ל
א
 
ת
ע
ש
ו
 
ו
מ
י
ד
 
ב
ן
 
נ
כ
ר
 
ל
א
 
ת
ק
ר
י
ב
ו
 
א
ת
 
ל
ח
ם
 
א
ל
ה
י
כ
ם
 
מ
כ
ל
 
א
ל
ה
 
כ
י
 
מ
ש
ח
י
ת
י
ם
 
ב
ה
ם
 
מ
ו
ם
 
ב
ם
 
ל
א
 
י
ר
צ
ו
 
ל
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ש
ו
ר
 
א
ו
 
כ
ש
ב
 
א
ו
 
ע
ז
 
כ
י
 
י
ו
ל
ד
 
ו
ה
י
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
ח
ת
 
א
מ
ו
 
ו
מ
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ו
ה
ל
א
ה
 
י
ר
צ
ה
 
ל
ק
ר
ב
ן
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
ש
ו
ר
 
ו
ש
ה
 
א
ת
ו
 
ו
א
ת
 
ב
נ
ו
 
ל
א
 
ת
ש
ח
ט
ו
 
ב
י
ו
ם
 
א
ח
ד
 
ו
כ
י
 
ת
ז
ב
ח
ו
 
ז
ב
ח
 
ת
ו
ד
ה
 
ל
י
ה
ו
ה
 
ל
ר
צ
ו
נ
כ
ם
 
ת
ז
ב
ח
ה
ו
 
ב
י
ו
ם
 
ה
ה
ו
א
 
י
א
כ
ל
 
ל
א
 
ת
ו
ת
י
ר
ו
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
א
נ
י
 
י
ה
ו
ה
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
מ
צ
ו
ת
י
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ו
ל
א
 
ת
ח
ל
ל
ו
 
א
ת
 
ש
ם
 
ק
ד
ש
י
 
ו
נ
ק
ד
ש
ת
י
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
נ
י
 
י
ה
ו
ה
 
מ
ק
ד
ש
ם
 
ה
מ
ו
צ
א
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ה
י
ו
ת
 
ל
כ
ם
 
ל
א
ל
ה
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
מ
ו
ע
ד
י
 
י
ה
ו
ה
 
א
ש
ר
 
ת
ק
ר
א
ו
 
א
ת
ם
 
מ
ק
ר
א
י
 
ק
ד
ש
 
א
ל
ה
 
ה
ם
 
מ
ו
ע
ד
י
 
ש
ש
ת
 
י
מ
י
ם
 
י
ע
ש
ה
 
מ
ל
א
כ
ה
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
ב
ת
 
ש
ב
ת
ו
ן
 
מ
ק
ר
א
 
ק
ד
ש
 
כ
ל
 
מ
ל
א
כ
ה
 
ל
א
 
ת
ע
ש
ו
 
ש
ב
ת
 
ה
י
א
 
ל
י
ה
ו
ה
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ו
א
ל
ה
 
מ
ו
ע
ד
י
 
י
ה
ו
ה
 
מ
ק
ר
א
י
 
ק
ד
ש
 
א
ש
ר
 
ת
ק
ר
א
ו
 
א
ת
ם
 
ב
מ
ו
ע
ד
ם
 
ב
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ב
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
ו
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ז
ה
 
ח
ג
 
ה
מ
צ
ו
ת
 
ל
י
ה
ו
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
מ
צ
ו
ת
 
ת
א
כ
ל
ו
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ה
ק
ר
ב
ת
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
מ
ק
ר
א
 
ק
ד
ש
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
ת
ב
א
ו
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
כ
ם
 
ו
ק
צ
ר
ת
ם
 
א
ת
 
ק
צ
י
ר
ה
 
ו
ה
ב
א
ת
ם
 
א
ת
 
ה
ע
מ
ר
 
ר
א
ש
י
ת
 
ק
צ
י
ר
כ
ם
 
א
ל
 
ה
כ
ה
ן
 
ו
ה
נ
י
ף
 
א
ת
 
ה
ע
מ
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
ר
צ
ו
נ
כ
ם
 
מ
מ
ח
ר
ת
 
ה
ש
ב
ת
 
י
נ
י
פ
נ
ו
 
ה
כ
ה
ן
 
ו
ע
ש
י
ת
ם
 
ב
י
ו
ם
 
ה
נ
פ
כ
ם
 
א
ת
 
ה
ע
מ
ר
 
כ
ב
ש
 
ת
מ
י
ם
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ל
י
ה
ו
ה
 
ו
מ
נ
ח
ת
ו
 
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ו
נ
ס
כ
ו
 
י
י
ן
 
ר
ב
י
ע
י
ת
 
ה
ה
י
ן
 
ו
ל
ח
ם
 
ו
ק
ל
י
 
ו
כ
ר
מ
ל
 
ל
א
 
ת
א
כ
ל
ו
 
ע
ד
 
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ע
ד
 
ה
ב
א
כ
ם
 
א
ת
 
ק
ר
ב
ן
 
א
ל
ה
י
כ
ם
 
ח
ק
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ו
ס
פ
ר
ת
ם
 
ל
כ
ם
 
מ
מ
ח
ר
ת
 
ה
ש
ב
ת
 
מ
י
ו
ם
 
ה
ב
א
כ
ם
 
א
ת
 
ע
מ
ר
 
ה
ת
נ
ו
פ
ה
 
ש
ב
ע
 
ש
ב
ת
ו
ת
 
ת
מ
י
מ
ו
ת
 
ת
ה
י
י
נ
ה
 
ע
ד
 
מ
מ
ח
ר
ת
 
ה
ש
ב
ת
 
ה
ש
ב
י
ע
י
ת
 
ת
ס
פ
ר
ו
 
ח
מ
ש
י
ם
 
י
ו
ם
 
ו
ה
ק
ר
ב
ת
ם
 
מ
נ
ח
ה
 
ח
ד
ש
ה
 
ל
י
ה
ו
ה
 
מ
מ
ו
ש
ב
ת
י
כ
ם
 
ת
ב
י
א
ו
 
ל
ח
ם
 
ת
נ
ו
פ
ה
 
ש
ת
י
ם
 
ח
ל
ו
ת
 
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ס
ל
ת
 
ת
ה
י
נ
ה
 
ח
מ
ץ
 
ת
א
פ
י
נ
ה
 
ב
כ
ו
ר
י
ם
 
ל
י
ה
ו
ה
 
ו
ה
ק
ר
ב
ת
ם
 
ע
ל
 
ה
ל
ח
ם
 
ש
ב
ע
ה
 
כ
ב
ש
י
ם
 
ת
מ
י
מ
ם
 
ב
נ
י
 
ש
נ
ה
 
ו
פ
ר
 
ב
ן
 
ב
ק
ר
 
א
ח
ד
 
ו
א
י
ל
י
ם
 
ש
נ
י
ם
 
ת
מ
י
מ
ם
 
י
ה
י
ו
 
ע
ל
ה
 
ל
י
ה
ו
ה
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
ע
ש
י
ת
ם
 
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ש
נ
י
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ו
ה
נ
י
ף
 
ה
כ
ה
ן
 
א
ת
ם
 
ע
ל
 
ל
ח
ם
 
ה
ב
כ
ו
ר
י
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ל
 
ש
נ
י
 
ה
כ
ב
ש
י
ם
 
ק
ד
ש
 
י
ה
י
ו
 
ל
י
ה
ו
ה
 
ל
כ
ה
ן
 
ו
ק
ר
א
ת
ם
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ל
ד
ר
ת
י
כ
ם
 
ו
ב
ק
צ
י
ר
כ
ם
 
א
ת
 
ק
צ
י
ר
 
א
ר
צ
כ
ם
 
ל
א
 
ת
כ
ל
ה
 
פ
א
ת
 
ש
ד
ך
 
ל
ק
צ
ר
 
ו
ל
ק
ט
 
ק
צ
י
ר
ך
 
ל
א
 
ת
ל
ק
ט
 
ל
ע
נ
י
 
ו
ל
ג
ר
 
ת
ע
ז
ב
 
א
ת
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ב
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
ש
ב
ת
ו
ן
 
ז
כ
ר
ו
ן
 
ת
ר
ו
ע
ה
 
מ
ק
ר
א
 
ק
ד
ש
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ה
ק
ר
ב
ת
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
א
ך
 
ב
ע
ש
ו
ר
 
ל
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ה
ז
ה
 
י
ו
ם
 
כ
פ
ו
ר
י
ם
 
ה
ו
א
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
ו
ע
נ
י
ת
ם
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ו
ה
ק
ר
ב
ת
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
כ
ל
 
מ
ל
א
כ
ה
 
ל
א
 
ת
ע
ש
ו
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
כ
י
 
י
ו
ם
 
כ
פ
ו
ר
י
ם
 
ה
ו
א
 
ל
כ
פ
ר
 
ע
ל
י
כ
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
כ
י
 
כ
ל
 
ה
נ
פ
ש
 
א
ש
ר
 
ל
א
 
ת
ע
נ
ה
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
נ
כ
ר
ת
ה
 
מ
ע
מ
י
ה
 
ו
כ
ל
 
ה
נ
פ
ש
 
א
ש
ר
 
ת
ע
ש
ה
 
כ
ל
 
מ
ל
א
כ
ה
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
א
ב
ד
ת
י
 
א
ת
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ק
ר
ב
 
ע
מ
י
ה
 
ו
כ
ל
 
מ
ל
א
כ
ה
 
ל
א
 
ת
ע
ש
ו
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
ש
ב
ת
 
ש
ב
ת
ו
ן
 
ה
ו
א
 
ל
כ
ם
 
ו
ע
נ
י
ת
ם
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ב
ת
ש
ע
ה
 
ל
ח
ד
ש
 
ב
ע
ר
ב
 
מ
ע
ר
ב
 
ע
ד
 
ע
ר
ב
 
ת
ש
ב
י
ת
ו
 
ש
ב
ת
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ה
ז
ה
 
ח
ג
 
ה
ס
כ
ו
ת
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ל
י
ה
ו
ה
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
מ
ק
ר
א
 
ק
ד
ש
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
ק
ר
י
ב
ו
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
ו
ה
ק
ר
ב
ת
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ע
צ
ר
ת
 
ה
י
א
 
ו
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
א
ל
ה
 
מ
ו
ע
ד
י
 
י
ה
ו
ה
 
א
ש
ר
 
ת
ק
ר
א
ו
 
א
ת
ם
 
מ
ק
ר
א
י
 
ק
ד
ש
 
ל
ה
ק
ר
י
ב
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ע
ל
ה
 
ו
מ
נ
ח
ה
 
ז
ב
ח
 
ו
נ
ס
כ
י
ם
 
ד
ב
ר
 
י
ו
ם
 
ב
י
ו
מ
ו
 
מ
ל
ב
ד
 
ש
ב
ת
ו
ת
 
י
ה
ו
ה
 
ו
מ
ל
ב
ד
 
כ
ל
 
מ
ת
נ
ת
י
כ
ם
 
ו
מ
ל
ב
ד
 
כ
ל
 
נ
ד
ר
י
כ
ם
 
ו
מ
ל
ב
ד
 
כ
ל
 
נ
ד
ב
ת
י
כ
ם
 
א
ש
ר
 
ת
ת
נ
ו
 
ל
י
ה
ו
ה
 
א
ך
 
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ב
א
ס
פ
כ
ם
 
א
ת
 
ת
ב
ו
א
ת
 
ה
א
ר
ץ
 
ת
ח
ג
ו
 
א
ת
 
ח
ג
 
י
ה
ו
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
ש
ב
ת
ו
ן
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ש
ב
ת
ו
ן
 
ו
ל
ק
ח
ת
ם
 
ל
כ
ם
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
פ
ר
י
 
ע
ץ
 
ה
ד
ר
 
כ
פ
ו
ת
 
ת
מ
ר
י
ם
 
ו
ע
נ
פ
י
 
ע
ץ
 
ע
ב
ו
ת
 
ו
ע
ר
ב
י
 
נ
ח
ל
 
ו
ש
מ
ח
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ח
ג
ת
ם
 
א
ת
ו
 
ח
ג
 
ל
י
ה
ו
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ב
ש
נ
ה
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ב
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ת
ח
ג
ו
 
א
ת
ו
 
ב
ס
כ
ו
ת
 
ת
ש
ב
ו
 
ש
ב
ע
ת
 
י
מ
י
ם
 
כ
ל
 
ה
א
ז
ר
ח
 
ב
י
ש
ר
א
ל
 
י
ש
ב
 
ב
ס
כ
ו
ת
 
ל
מ
ע
ן
 
י
ד
ע
ו
 
ד
ר
ת
י
כ
ם
 
כ
י
 
ב
ס
כ
ו
ת
 
ה
ו
ש
ב
ת
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ה
ו
צ
א
י
 
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ת
 
מ
ו
ע
ד
י
 
י
ה
ו
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
צ
ו
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ח
ו
 
א
ל
י
ך
 
ש
מ
ן
 
ז
י
ת
 
ז
ך
 
כ
ת
י
ת
 
ל
מ
א
ו
ר
 
ל
ה
ע
ל
ו
ת
 
נ
ר
 
ת
מ
י
ד
 
מ
ח
ו
ץ
 
ל
פ
ר
כ
ת
 
ה
ע
ד
ו
ת
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
י
ע
ר
ך
 
א
ת
ו
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
מ
ע
ר
ב
 
ע
ד
 
ב
ק
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ת
מ
י
ד
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ע
ל
 
ה
מ
נ
ו
ר
ה
 
ה
ט
ה
ר
ה
 
י
ע
ר
י
ך
 
א
ת
 
ה
נ
ר
ו
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ד
 
ב
ק
ר
 
ו
ל
ק
ח
ת
 
ס
ל
ת
 
ו
א
פ
י
ת
 
א
ת
ה
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ח
ל
ו
ת
 
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
י
ה
י
ה
 
ה
ח
ל
ה
 
ה
א
ח
ת
 
ו
ש
מ
ת
 
א
ת
ם
 
ש
ת
י
 
מ
ע
ר
כ
ו
ת
 
ש
ש
 
ה
מ
ע
ר
כ
ת
 
ע
ל
 
ה
ש
ל
ח
ן
 
ה
ט
ה
ו
ר
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
נ
ת
ת
ה
 
ע
ל
 
ה
מ
ע
ר
כ
ת
 
ל
ב
ו
נ
ה
 
ז
כ
ה
 
ו
ה
י
ת
ה
 
ל
ל
ח
ם
 
ל
א
ז
כ
ר
ה
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ב
י
ו
ם
 
ה
ש
ב
ת
 
ב
י
ו
ם
 
ה
ש
ב
ת
 
י
ע
ר
כ
נ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ת
מ
י
ד
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ר
י
ת
 
ע
ו
ל
ם
 
ו
ה
י
ת
ה
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ו
א
כ
ל
ו
ה
 
ב
מ
ק
ו
ם
 
ק
ד
ו
ש
 
כ
י
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
י
א
 
ל
ו
 
מ
א
ש
י
 
י
ה
ו
ה
 
ח
ק
 
ע
ו
ל
ם
 
ו
י
צ
א
 
ב
ן
 
א
ש
ה
 
י
ש
ר
א
ל
י
ת
 
ו
ה
ו
א
 
ב
ן
 
א
י
ש
 
מ
צ
ר
י
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
נ
צ
ו
 
ב
מ
ח
נ
ה
 
ב
ן
 
ה
י
ש
ר
א
ל
י
ת
 
ו
א
י
ש
 
י
ש
ר
א
ל
י
 
ו
י
ק
ב
 
ב
ן
 
ה
א
ש
ה
 
ה
י
ש
ר
א
ל
י
ת
 
א
ת
 
ה
ש
ם
 
ו
י
ק
ל
ל
 
ו
י
ב
י
א
ו
 
א
ת
ו
 
א
ל
 
מ
ש
ה
 
ו
ש
ם
 
א
מ
ו
 
ש
ל
ו
מ
י
ת
 
ב
ת
 
ד
ב
ר
י
 
ל
מ
ט
ה
 
ד
ן
 
ו
י
נ
י
ח
ה
ו
 
ב
מ
ש
מ
ר
 
ל
פ
ר
ש
 
ל
ה
ם
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ה
ו
צ
י
א
 
א
ת
 
ה
מ
ק
ל
ל
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
ס
מ
כ
ו
 
כ
ל
 
ה
ש
מ
ע
י
ם
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
ו
 
ו
ר
ג
מ
ו
 
א
ת
ו
 
כ
ל
 
ה
ע
ד
ה
 
ו
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ד
ב
ר
 
ל
א
מ
ר
 
א
י
ש
 
א
י
ש
 
כ
י
 
י
ק
ל
ל
 
א
ל
ה
י
ו
 
ו
נ
ש
א
 
ח
ט
א
ו
 
ו
נ
ק
ב
 
ש
ם
 
י
ה
ו
ה
 
מ
ו
ת
 
י
ו
מ
ת
 
ר
ג
ם
 
י
ר
ג
מ
ו
 
ב
ו
 
כ
ל
 
ה
ע
ד
ה
 
כ
ג
ר
 
כ
א
ז
ר
ח
 
ב
נ
ק
ב
ו
 
ה
ש
ם
 
י
ו
מ
ת
 
ו
א
י
ש
 
כ
י
 
י
כ
ה
 
כ
ל
 
נ
פ
ש
 
א
ד
ם
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
מ
כ
ה
 
נ
פ
ש
 
ב
ה
מ
ה
 
י
ש
ל
מ
נ
ה
 
נ
פ
ש
 
ת
ח
ת
 
נ
פ
ש
 
ו
א
י
ש
 
כ
י
 
י
ת
ן
 
מ
ו
ם
 
ב
ע
מ
י
ת
ו
 
כ
א
ש
ר
 
ע
ש
ה
 
כ
ן
 
י
ע
ש
ה
 
ל
ו
 
ש
ב
ר
 
ת
ח
ת
 
ש
ב
ר
 
ע
י
ן
 
ת
ח
ת
 
ע
י
ן
 
ש
ן
 
ת
ח
ת
 
ש
ן
 
כ
א
ש
ר
 
י
ת
ן
 
מ
ו
ם
 
ב
א
ד
ם
 
כ
ן
 
י
נ
ת
ן
 
ב
ו
 
ו
מ
כ
ה
 
ב
ה
מ
ה
 
י
ש
ל
מ
נ
ה
 
ו
מ
כ
ה
 
א
ד
ם
 
י
ו
מ
ת
 
מ
ש
פ
ט
 
א
ח
ד
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ג
ר
 
כ
א
ז
ר
ח
 
י
ה
י
ה
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ו
צ
י
א
ו
 
א
ת
 
ה
מ
ק
ל
ל
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
ר
ג
מ
ו
 
א
ת
ו
 
א
ב
ן
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ש
ו
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
ה
ר
 
ס
י
נ
י
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
ת
ב
א
ו
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
כ
ם
 
ו
ש
ב
ת
ה
 
ה
א
ר
ץ
 
ש
ב
ת
 
ל
י
ה
ו
ה
 
ש
ש
 
ש
נ
י
ם
 
ת
ז
ר
ע
 
ש
ד
ך
 
ו
ש
ש
 
ש
נ
י
ם
 
ת
ז
מ
ר
 
כ
ר
מ
ך
 
ו
א
ס
פ
ת
 
א
ת
 
ת
ב
ו
א
ת
ה
 
ו
ב
ש
נ
ה
 
ה
ש
ב
י
ע
י
ת
 
ש
ב
ת
 
ש
ב
ת
ו
ן
 
י
ה
י
ה
 
ל
א
ר
ץ
 
ש
ב
ת
 
ל
י
ה
ו
ה
 
ש
ד
ך
 
ל
א
 
ת
ז
ר
ע
 
ו
כ
ר
מ
ך
 
ל
א
 
ת
ז
מ
ר
 
ו
א
ת
 
ס
פ
ח
י
 
ק
צ
י
ר
י
ך
 
ל
א
 
ת
ק
צ
ר
 
ו
א
ת
 
ע
נ
ב
י
 
נ
ז
י
ר
י
ך
 
ל
א
 
ת
ב
צ
ר
 
ש
נ
ת
 
ש
ב
ת
ו
ן
 
י
ה
י
ה
 
ל
א
ר
ץ
 
ו
ה
י
ת
ה
 
ש
ב
ת
 
ה
א
ר
ץ
 
ל
כ
ם
 
ל
א
כ
ל
ה
 
ל
ך
 
ו
ל
ע
ב
ד
י
ך
 
ו
ל
א
מ
ת
י
ך
 
ו
ל
ש
כ
י
ר
י
ך
 
ו
ל
ת
ו
ש
ב
י
ך
 
ה
ג
ר
י
ם
 
ע
מ
ך
 
ו
ל
ב
ה
מ
ת
ך
 
ו
ל
ח
י
ה
 
א
ש
ר
 
ב
א
ר
צ
ך
 
ת
ה
י
ה
 
כ
ל
 
ת
ב
ו
א
ת
ה
 
ל
א
כ
ל
 
ו
ס
פ
ר
ת
 
ל
ך
 
ש
ב
ע
 
ש
ב
ת
ו
ת
 
ש
נ
י
ם
 
ש
ב
ע
 
ש
נ
י
ם
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ו
ה
י
ו
 
ל
ך
 
י
מ
י
 
ש
ב
ע
 
ש
ב
ת
ו
ת
 
ה
ש
נ
י
ם
 
ת
ש
ע
 
ו
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
ה
ע
ב
ר
ת
 
ש
ו
פ
ר
 
ת
ר
ו
ע
ה
 
ב
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ב
ע
ש
ו
ר
 
ל
ח
ד
ש
 
ב
י
ו
ם
 
ה
כ
פ
ו
ר
י
ם
 
ת
ע
ב
י
ר
ו
 
ש
ו
פ
ר
 
ב
כ
ל
 
א
ר
צ
כ
ם
 
ו
ק
ד
ש
ת
ם
 
א
ת
 
ש
נ
ת
 
ה
ח
מ
ש
י
ם
 
ש
נ
ה
 
ו
ק
ר
א
ת
ם
 
ד
ר
ו
ר
 
ב
א
ר
ץ
 
ל
כ
ל
 
י
ש
ב
י
ה
 
י
ו
ב
ל
 
ה
ו
א
 
ת
ה
י
ה
 
ל
כ
ם
 
ו
ש
ב
ת
ם
 
א
י
ש
 
א
ל
 
א
ח
ז
ת
ו
 
ו
א
י
ש
 
א
ל
 
מ
ש
פ
ח
ת
ו
 
ת
ש
ו
ב
ו
 
י
ו
ב
ל
 
ה
ו
א
 
ש
נ
ת
 
ה
ח
מ
ש
י
ם
 
ש
נ
ה
 
ת
ה
י
ה
 
ל
כ
ם
 
ל
א
 
ת
ז
ר
ע
ו
 
ו
ל
א
 
ת
ק
צ
ר
ו
 
א
ת
 
ס
פ
ח
י
ה
 
ו
ל
א
 
ת
ב
צ
ר
ו
 
א
ת
 
נ
ז
י
ר
י
ה
 
כ
י
 
י
ו
ב
ל
 
ה
ו
א
 
ק
ד
ש
 
ת
ה
י
ה
 
ל
כ
ם
 
מ
ן
 
ה
ש
ד
ה
 
ת
א
כ
ל
ו
 
א
ת
 
ת
ב
ו
א
ת
ה
 
ב
ש
נ
ת
 
ה
י
ו
ב
ל
 
ה
ז
א
ת
 
ת
ש
ו
ב
ו
 
א
י
ש
 
א
ל
 
א
ח
ז
ת
ו
 
ו
כ
י
 
ת
מ
כ
ר
 
מ
מ
כ
ר
 
ל
ע
מ
י
ת
ך
 
א
ו
 
ק
נ
ה
 
מ
י
ד
 
ע
מ
י
ת
ך
 
א
ל
 
ת
ו
נ
ו
 
א
י
ש
 
א
ת
 
א
ח
י
ו
 
ב
מ
ס
פ
ר
 
ש
נ
י
ם
 
א
ח
ר
 
ה
י
ו
ב
ל
 
ת
ק
נ
ה
 
מ
א
ת
 
ע
מ
י
ת
ך
 
ב
מ
ס
פ
ר
 
ש
נ
י
 
ת
ב
ו
א
ת
 
י
מ
כ
ר
 
ל
ך
 
ל
פ
י
 
ר
ב
 
ה
ש
נ
י
ם
 
ת
ר
ב
ה
 
מ
ק
נ
ת
ו
 
ו
ל
פ
י
 
מ
ע
ט
 
ה
ש
נ
י
ם
 
ת
מ
ע
י
ט
 
מ
ק
נ
ת
ו
 
כ
י
 
מ
ס
פ
ר
 
ת
ב
ו
א
ת
 
ה
ו
א
 
מ
כ
ר
 
ל
ך
 
ו
ל
א
 
ת
ו
נ
ו
 
א
י
ש
 
א
ת
 
ע
מ
י
ת
ו
 
ו
י
ר
א
ת
 
מ
א
ל
ה
י
ך
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ע
ש
י
ת
ם
 
א
ת
 
ח
ק
ו
ת
י
 
ו
א
ת
 
מ
ש
פ
ט
י
 
ת
ש
מ
ר
ו
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ו
י
ש
ב
ת
ם
 
ע
ל
 
ה
א
ר
ץ
 
ל
ב
ט
ח
 
ו
נ
ת
נ
ה
 
ה
א
ר
ץ
 
פ
ר
י
ה
 
ו
א
כ
ל
ת
ם
 
ל
ש
ב
ע
 
ו
י
ש
ב
ת
ם
 
ל
ב
ט
ח
 
ע
ל
י
ה
 
ו
כ
י
 
ת
א
מ
ר
ו
 
מ
ה
 
נ
א
כ
ל
 
ב
ש
נ
ה
 
ה
ש
ב
י
ע
י
ת
 
ה
ן
 
ל
א
 
נ
ז
ר
ע
 
ו
ל
א
 
נ
א
ס
ף
 
א
ת
 
ת
ב
ו
א
ת
י
נ
ו
 
ו
צ
ו
י
ת
י
 
א
ת
 
ב
ר
כ
ת
י
 
ל
כ
ם
 
ב
ש
נ
ה
 
ה
ש
ש
י
ת
 
ו
ע
ש
ת
ה
 
א
ת
 
ת
ב
ו
א
ת
ה
 
ל
ש
ל
ש
 
ה
ש
נ
י
ם
 
ו
ז
ר
ע
ת
ם
 
א
ת
 
ה
ש
נ
ה
 
ה
ש
מ
י
נ
י
ת
 
ו
א
כ
ל
ת
ם
 
מ
ן
 
ה
ת
ב
ו
א
ת
ה
 
י
ש
ן
 
ע
ד
 
ה
ש
נ
ה
 
ה
ת
ש
ע
י
ת
 
ע
ד
 
ב
א
 
ת
ב
ו
א
ת
ה
 
ת
א
כ
ל
ו
 
י
ש
ן
 
ו
ה
א
ר
ץ
 
ל
א
 
ת
מ
כ
ר
 
ל
צ
מ
י
ת
ת
 
כ
י
 
ל
י
 
ה
א
ר
ץ
 
כ
י
 
ג
ר
י
ם
 
ו
ת
ו
ש
ב
י
ם
 
א
ת
ם
 
ע
מ
ד
י
 
ו
ב
כ
ל
 
א
ר
ץ
 
א
ח
ז
ת
כ
ם
 
ג
א
ל
ה
 
ת
ת
נ
ו
 
ל
א
ר
ץ
 
ו
כ
י
 
י
מ
ך
 
א
ח
י
ך
 
ו
מ
כ
ר
 
מ
א
ח
ז
ת
ו
 
ו
ב
א
 
ג
א
ל
ו
 
ה
ק
ר
ו
ב
 
א
ל
י
ו
 
ו
ג
א
ל
 
א
ת
 
מ
מ
כ
ר
 
א
ח
י
ו
 
ו
א
י
ש
 
כ
י
 
ל
א
 
י
ה
י
ה
 
ל
ו
 
ג
א
ל
 
ו
ה
ש
י
ג
ה
 
י
ד
ו
 
ו
מ
צ
א
 
כ
ד
י
 
ג
א
ל
ת
ו
 
ו
ח
ש
ב
 
א
ת
 
ש
נ
י
 
מ
מ
כ
ר
ו
 
ו
ה
ש
י
ב
 
א
ת
 
ה
ע
ד
ף
 
ל
א
י
ש
 
א
ש
ר
 
מ
כ
ר
 
ל
ו
 
ו
ש
ב
 
ל
א
ח
ז
ת
ו
 
ו
א
ם
 
ל
א
 
מ
צ
א
 
י
ד
ו
 
ד
י
 
ה
ש
י
ב
 
ל
ו
 
ו
ה
י
ה
 
מ
מ
כ
ר
ו
 
ב
י
ד
 
ה
ק
נ
ה
 
א
ת
ו
 
ע
ד
 
ש
נ
ת
 
ה
י
ו
ב
ל
 
ו
י
צ
א
 
ב
י
ו
ב
ל
 
ו
ש
ב
 
ל
א
ח
ז
ת
ו
 
ו
א
י
ש
 
כ
י
 
י
מ
כ
ר
 
ב
י
ת
 
מ
ו
ש
ב
 
ע
י
ר
 
ח
ו
מ
ה
 
ו
ה
י
ת
ה
 
ג
א
ל
ת
ו
 
ע
ד
 
ת
ם
 
ש
נ
ת
 
מ
מ
כ
ר
ו
 
י
מ
י
ם
 
ת
ה
י
ה
 
ג
א
ל
ת
ו
 
ו
א
ם
 
ל
א
 
י
ג
א
ל
 
ע
ד
 
מ
ל
א
ת
 
ל
ו
 
ש
נ
ה
 
ת
מ
י
מ
ה
 
ו
ק
ם
 
ה
ב
י
ת
 
א
ש
ר
 
ב
ע
י
ר
 
א
ש
ר
 
ל
ו
 
ח
ו
מ
ה
 
ל
צ
מ
י
ת
ת
 
ל
ק
נ
ה
 
א
ת
ו
 
ל
ד
ר
ת
י
ו
 
ל
א
 
י
צ
א
 
ב
י
ו
ב
ל
 
ו
ב
ת
י
 
ה
ח
צ
ר
י
ם
 
א
ש
ר
 
א
י
ן
 
ל
ה
ם
 
ח
ו
מ
ה
 
ס
ב
י
ב
 
ע
ל
 
ש
ד
ה
 
ה
א
ר
ץ
 
י
ח
ש
ב
ו
 
ג
א
ל
ה
 
ת
ה
י
ה
 
ל
ו
 
ו
ב
י
ו
ב
ל
 
י
צ
א
 
ו
ע
ר
י
 
ה
ל
ו
י
ם
 
ב
ת
י
 
ע
ר
י
 
א
ח
ז
ת
ם
 
ג
א
ל
ת
 
ע
ו
ל
ם
 
ת
ה
י
ה
 
ל
ל
ו
י
ם
 
ו
א
ש
ר
 
י
ג
א
ל
 
מ
ן
 
ה
ל
ו
י
ם
 
ו
י
צ
א
 
מ
מ
כ
ר
 
ב
י
ת
 
ו
ע
י
ר
 
א
ח
ז
ת
ו
 
ב
י
ו
ב
ל
 
כ
י
 
ב
ת
י
 
ע
ר
י
 
ה
ל
ו
י
ם
 
ה
י
א
 
א
ח
ז
ת
ם
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ש
ד
ה
 
מ
ג
ר
ש
 
ע
ר
י
ה
ם
 
ל
א
 
י
מ
כ
ר
ו
 
כ
י
 
א
ח
ז
ת
 
ע
ו
ל
ם
 
ה
י
א
 
ל
ה
ם
 
ו
כ
י
 
י
מ
ך
 
א
ח
י
ך
 
ו
מ
ט
ה
 
י
ד
ו
 
ע
מ
ך
 
ו
ח
ז
ק
ת
 
ב
ו
 
ג
ר
 
ו
ת
ו
ש
ב
 
ו
ח
י
 
א
ח
י
ך
 
ע
מ
ך
 
א
ל
 
ת
ק
ח
 
מ
א
ת
ו
 
נ
ש
ך
 
ו
ת
ר
ב
י
ת
 
ו
י
ר
א
ת
 
מ
א
ל
ה
י
ך
 
ו
ח
י
 
א
ח
י
ך
 
ע
מ
ך
 
א
ת
 
כ
ס
פ
ך
 
ל
א
 
ת
ת
ן
 
ל
ו
 
ב
נ
ש
ך
 
ו
ב
ת
ר
ב
י
ת
 
ל
א
 
ת
ת
ן
 
א
כ
ל
ך
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ת
ת
 
ל
כ
ם
 
א
ת
 
א
ר
ץ
 
כ
נ
ע
ן
 
ל
ה
י
ו
ת
 
ל
כ
ם
 
ל
א
ל
ה
י
ם
 
ו
כ
י
 
י
מ
ך
 
א
ח
י
ך
 
ע
מ
ך
 
ו
נ
מ
כ
ר
 
ל
ך
 
ל
א
 
ת
ע
ב
ד
 
ב
ו
 
ע
ב
ד
ת
 
ע
ב
ד
 
כ
ש
כ
י
ר
 
כ
ת
ו
ש
ב
 
י
ה
י
ה
 
ע
מ
ך
 
ע
ד
 
ש
נ
ת
 
ה
י
ו
ב
ל
 
י
ע
ב
ד
 
ע
מ
ך
 
ו
י
צ
א
 
מ
ע
מ
ך
 
ה
ו
א
 
ו
ב
נ
י
ו
 
ע
מ
ו
 
ו
ש
ב
 
א
ל
 
מ
ש
פ
ח
ת
ו
 
ו
א
ל
 
א
ח
ז
ת
 
א
ב
ת
י
ו
 
י
ש
ו
ב
 
כ
י
 
ע
ב
ד
י
ה
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
א
 
י
מ
כ
ר
ו
 
מ
מ
כ
ר
ת
 
ע
ב
ד
 
ל
א
 
ת
ר
ד
ה
 
ב
ו
 
ב
פ
ר
ך
 
ו
י
ר
א
ת
 
מ
א
ל
ה
י
ך
 
ו
ע
ב
ד
י
ך
 
ו
א
מ
ת
י
ך
 
א
ש
ר
 
י
ה
י
ו
 
ל
ך
 
מ
א
ת
 
ה
ג
ו
י
ם
 
א
ש
ר
 
ס
ב
י
ב
ת
י
כ
ם
 
מ
ה
ם
 
ת
ק
נ
ה
ו
 
ע
ב
ד
 
ו
א
מ
ה
 
ו
ג
ם
 
מ
ב
נ
י
 
ה
ת
ו
ש
ב
י
ם
 
ה
ג
ר
י
ם
 
ע
מ
כ
ם
 
מ
ה
ם
 
ת
ק
נ
ה
ו
 
ו
מ
מ
ש
פ
ח
ת
ם
 
א
ש
ר
 
ע
מ
כ
ם
 
א
ש
ר
 
ה
ו
ל
ד
ו
 
ב
א
ר
צ
כ
ם
 
ו
ה
י
ו
 
ל
כ
ם
 
ל
א
ח
ז
ה
 
ו
ה
ת
נ
ח
ל
ת
ם
 
א
ת
ם
 
ל
ב
נ
י
כ
ם
 
א
ח
ר
י
כ
ם
 
ל
ר
ש
ת
 
א
ח
ז
ה
 
ל
ע
ו
ל
ם
 
ב
ה
ם
 
ת
ע
ב
י
ד
ו
 
ו
ב
א
ח
י
כ
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
י
ש
 
ב
א
ח
י
ו
 
ל
א
 
ת
ר
ד
ה
 
ב
ו
 
ב
פ
ר
ך
 
ו
כ
י
 
ת
ש
י
ג
 
י
ד
 
ג
ר
 
ו
ת
ו
ש
ב
 
ע
מ
ך
 
ו
מ
ך
 
א
ח
י
ך
 
ע
מ
ו
 
ו
נ
מ
כ
ר
 
ל
ג
ר
 
ו
ת
ו
ש
ב
 
ע
מ
ך
 
א
ו
 
ל
ע
ק
ר
 
מ
ש
פ
ח
ת
 
ג
ר
 
א
ח
ר
י
 
נ
מ
כ
ר
 
ג
א
ל
ה
 
ת
ה
י
ה
 
ל
ו
 
א
ח
ד
 
מ
א
ח
י
ו
 
י
ג
א
ל
נ
ו
 
א
ו
 
ד
ד
ו
 
א
ו
 
ב
ן
 
ד
ד
ו
 
י
ג
א
ל
נ
ו
 
א
ו
 
מ
ש
א
ר
 
ב
ש
ר
ו
 
מ
מ
ש
פ
ח
ת
ו
 
י
ג
א
ל
נ
ו
 
א
ו
 
ה
ש
י
ג
ה
 
י
ד
ו
 
ו
נ
ג
א
ל
 
ו
ח
ש
ב
 
ע
ם
 
ק
נ
ה
ו
 
מ
ש
נ
ת
 
ה
מ
כ
ר
 
ל
ו
 
ע
ד
 
ש
נ
ת
 
ה
י
ו
ב
ל
 
ו
ה
י
ה
 
כ
ס
ף
 
מ
מ
כ
ר
ו
 
ב
מ
ס
פ
ר
 
ש
נ
י
ם
 
כ
י
מ
י
 
ש
כ
י
ר
 
י
ה
י
ה
 
ע
מ
ו
 
א
ם
 
ע
ו
ד
 
ר
ב
ו
ת
 
ב
ש
נ
י
ם
 
ל
פ
י
ה
ן
 
י
ש
י
ב
 
ג
א
ל
ת
ו
 
מ
כ
ס
ף
 
מ
ק
נ
ת
ו
 
ו
א
ם
 
מ
ע
ט
 
נ
ש
א
ר
 
ב
ש
נ
י
ם
 
ע
ד
 
ש
נ
ת
 
ה
י
ו
ב
ל
 
ו
ח
ש
ב
 
ל
ו
 
כ
פ
י
 
ש
נ
י
ו
 
י
ש
י
ב
 
א
ת
 
ג
א
ל
ת
ו
 
כ
ש
כ
י
ר
 
ש
נ
ה
 
ב
ש
נ
ה
 
י
ה
י
ה
 
ע
מ
ו
 
ל
א
 
י
ר
ד
נ
ו
 
ב
פ
ר
ך
 
ל
ע
י
נ
י
ך
 
ו
א
ם
 
ל
א
 
י
ג
א
ל
 
ב
א
ל
ה
 
ו
י
צ
א
 
ב
ש
נ
ת
 
ה
י
ו
ב
ל
 
ה
ו
א
 
ו
ב
נ
י
ו
 
ע
מ
ו
 
כ
י
 
ל
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ב
ד
י
ם
 
ע
ב
ד
י
 
ה
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
א
 
ת
ע
ש
ו
 
ל
כ
ם
 
א
ל
י
ל
י
ם
 
ו
פ
ס
ל
 
ו
מ
צ
ב
ה
 
ל
א
 
ת
ק
י
מ
ו
 
ל
כ
ם
 
ו
א
ב
ן
 
מ
ש
כ
י
ת
 
ל
א
 
ת
ת
נ
ו
 
ב
א
ר
צ
כ
ם
 
ל
ה
ש
ת
ח
ו
ת
 
ע
ל
י
ה
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ת
 
ש
ב
ת
ת
י
 
ת
ש
מ
ר
ו
 
ו
מ
ק
ד
ש
י
 
ת
י
ר
א
ו
 
א
נ
י
 
י
ה
ו
ה
 
א
ם
 
ב
ח
ק
ו
ת
י
 
ת
ל
כ
ו
 
ו
א
ת
 
מ
צ
ו
ת
י
 
ת
ש
מ
ר
ו
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ו
נ
ת
ת
י
 
ג
ש
מ
י
כ
ם
 
ב
ע
ת
ם
 
ו
נ
ת
נ
ה
 
ה
א
ר
ץ
 
י
ב
ו
ל
ה
 
ו
ע
ץ
 
ה
ש
ד
ה
 
י
ת
ן
 
פ
ר
י
ו
 
ו
ה
ש
י
ג
 
ל
כ
ם
 
ד
י
ש
 
א
ת
 
ב
צ
ר
 
ו
ב
צ
י
ר
 
י
ש
י
ג
 
א
ת
 
ה
ז
ר
ע
 
ו
א
כ
ל
ת
ם
 
ל
ח
מ
כ
ם
 
ל
ש
ב
ע
 
ו
י
ש
ב
ת
ם
 
ל
ב
ט
ח
 
ב
א
ר
צ
כ
ם
 
ו
נ
ת
ת
י
 
ש
ל
ו
ם
 
ב
א
ר
ץ
 
ו
ש
כ
ב
ת
ם
 
ו
א
י
ן
 
מ
ח
ר
י
ד
 
ו
ה
ש
ב
ת
י
 
ח
י
ה
 
ר
ע
ה
 
מ
ן
 
ה
א
ר
ץ
 
ו
ח
ר
ב
 
ל
א
 
ת
ע
ב
ר
 
ב
א
ר
צ
כ
ם
 
ו
ר
ד
פ
ת
ם
 
א
ת
 
א
י
ב
י
כ
ם
 
ו
נ
פ
ל
ו
 
ל
פ
נ
י
כ
ם
 
ל
ח
ר
ב
 
ו
ר
ד
פ
ו
 
מ
כ
ם
 
ח
מ
ש
ה
 
מ
א
ה
 
ו
מ
א
ה
 
מ
כ
ם
 
ר
ב
ב
ה
 
י
ר
ד
פ
ו
 
ו
נ
פ
ל
ו
 
א
י
ב
י
כ
ם
 
ל
פ
נ
י
כ
ם
 
ל
ח
ר
ב
 
ו
פ
נ
י
ת
י
 
א
ל
י
כ
ם
 
ו
ה
פ
ר
י
ת
י
 
א
ת
כ
ם
 
ו
ה
ר
ב
י
ת
י
 
א
ת
כ
ם
 
ו
ה
ק
מ
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
א
ת
כ
ם
 
ו
א
כ
ל
ת
ם
 
י
ש
ן
 
נ
ו
ש
ן
 
ו
י
ש
ן
 
מ
פ
נ
י
 
ח
ד
ש
 
ת
ו
צ
י
א
ו
 
ו
נ
ת
ת
י
 
מ
ש
כ
נ
י
 
ב
ת
ו
כ
כ
ם
 
ו
ל
א
 
ת
ג
ע
ל
 
נ
פ
ש
י
 
א
ת
כ
ם
 
ו
ה
ת
ה
ל
כ
ת
י
 
ב
ת
ו
כ
כ
ם
 
ו
ה
י
י
ת
י
 
ל
כ
ם
 
ל
א
ל
ה
י
ם
 
ו
א
ת
ם
 
ת
ה
י
ו
 
ל
י
 
ל
ע
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ה
י
ו
ת
 
ל
ה
ם
 
ע
ב
ד
י
ם
 
ו
א
ש
ב
ר
ה
 
מ
ט
ו
ת
 
ע
ו
ל
כ
ם
 
ו
א
ו
ל
י
ך
 
א
ת
כ
ם
 
ק
ו
מ
מ
י
ת
 
ו
א
ם
 
ל
א
 
ת
ש
מ
ע
ו
 
ל
י
 
ו
ל
א
 
ת
ע
ש
ו
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ת
 
ה
א
ל
ה
 
א
ם
 
ב
ח
ק
ו
ת
י
 
ת
מ
א
ס
ו
 
ו
א
ם
 
א
ת
 
מ
ש
פ
ט
י
 
ת
ג
ע
ל
 
נ
פ
ש
כ
ם
 
ל
ב
ל
ת
י
 
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
מ
צ
ו
ת
י
 
ל
ה
פ
ר
כ
ם
 
א
ת
 
ב
ר
י
ת
י
 
א
ף
 
א
נ
י
 
א
ע
ש
ה
 
ז
א
ת
 
ל
כ
ם
 
ו
ה
פ
ק
ד
ת
י
 
ע
ל
י
כ
ם
 
ב
ח
ל
ה
 
א
ת
 
ה
ש
ח
פ
ת
 
ו
א
ת
 
ה
ק
ד
ח
ת
 
מ
כ
ל
ו
ת
 
ע
י
נ
י
ם
 
ו
מ
ד
י
ב
ת
 
נ
פ
ש
 
ו
ז
ר
ע
ת
ם
 
ל
ר
י
ק
 
ז
ר
ע
כ
ם
 
ו
א
כ
ל
ה
ו
 
א
י
ב
י
כ
ם
 
ו
נ
ת
ת
י
 
פ
נ
י
 
ב
כ
ם
 
ו
נ
ג
פ
ת
ם
 
ל
פ
נ
י
 
א
י
ב
י
כ
ם
 
ו
ר
ד
ו
 
ב
כ
ם
 
ש
נ
א
י
כ
ם
 
ו
נ
ס
ת
ם
 
ו
א
י
ן
 
ר
ד
ף
 
א
ת
כ
ם
 
ו
א
ם
 
ע
ד
 
א
ל
ה
 
ל
א
 
ת
ש
מ
ע
ו
 
ל
י
 
ו
י
ס
פ
ת
י
 
ל
י
ס
ר
ה
 
א
ת
כ
ם
 
ש
ב
ע
 
ע
ל
 
ח
ט
א
ת
י
כ
ם
 
ו
ש
ב
ר
ת
י
 
א
ת
 
ג
א
ו
ן
 
ע
ז
כ
ם
 
ו
נ
ת
ת
י
 
א
ת
 
ש
מ
י
כ
ם
 
כ
ב
ר
ז
ל
 
ו
א
ת
 
א
ר
צ
כ
ם
 
כ
נ
ח
ש
ה
 
ו
ת
ם
 
ל
ר
י
ק
 
כ
ח
כ
ם
 
ו
ל
א
 
ת
ת
ן
 
א
ר
צ
כ
ם
 
א
ת
 
י
ב
ו
ל
ה
 
ו
ע
ץ
 
ה
ש
ד
ה
 
ל
א
 
י
ת
ן
 
פ
ר
י
ו
 
ו
א
ם
 
ת
ל
כ
ו
 
ע
מ
י
 
ק
ר
י
 
ו
ל
א
 
ת
ב
א
ו
 
ל
ש
מ
ע
 
ל
י
 
ו
י
ס
פ
ת
י
 
ע
ל
י
כ
ם
 
מ
כ
ה
 
ש
ב
ע
 
כ
ח
ט
א
ת
י
כ
ם
 
ו
ש
ל
ח
ת
י
 
ב
כ
ם
 
א
ת
 
ח
י
ת
 
ה
ש
ד
ה
 
ו
ש
כ
ל
ה
 
א
ת
כ
ם
 
ו
ה
כ
ר
י
ת
ה
 
א
ת
 
ב
ה
מ
ת
כ
ם
 
ו
ה
מ
ע
י
ט
ה
 
א
ת
כ
ם
 
ו
נ
ש
מ
ו
 
ד
ר
כ
כ
ם
 
ו
א
ם
 
ב
א
ל
ה
 
ל
א
 
ת
ו
ס
ר
ו
 
ל
י
 
ו
ה
ל
כ
ת
ם
 
ע
מ
י
 
ק
ר
י
 
ו
ה
ל
כ
ת
י
 
ג
ם
 
א
נ
י
 
ע
מ
כ
ם
 
ב
ק
ר
י
 
ו
ה
כ
י
ת
י
 
א
ת
כ
ם
 
ג
ם
 
א
נ
י
 
ש
ב
ע
 
ע
ל
 
ח
ט
א
ת
י
כ
ם
 
ו
ה
ב
א
ת
י
 
ע
ל
י
כ
ם
 
ח
ר
ב
 
נ
ק
מ
ת
 
נ
ק
ם
 
ב
ר
י
ת
 
ו
נ
א
ס
פ
ת
ם
 
א
ל
 
ע
ר
י
כ
ם
 
ו
ש
ל
ח
ת
י
 
ד
ב
ר
 
ב
ת
ו
כ
כ
ם
 
ו
נ
ת
ת
ם
 
ב
י
ד
 
א
ו
י
ב
 
ב
ש
ב
ר
י
 
ל
כ
ם
 
מ
ט
ה
 
ל
ח
ם
 
ו
א
פ
ו
 
ע
ש
ר
 
נ
ש
י
ם
 
ל
ח
מ
כ
ם
 
ב
ת
נ
ו
ר
 
א
ח
ד
 
ו
ה
ש
י
ב
 
ל
ח
מ
כ
ם
 
ב
מ
ש
ק
ו
ל
 
ו
א
כ
ל
ת
ם
 
ו
ל
א
 
ת
ש
ב
ע
ו
 
ו
א
ם
 
ב
ז
א
ת
 
ל
א
 
ת
ש
מ
ע
ו
 
ל
י
 
ו
ה
ל
כ
ת
ם
 
ע
מ
י
 
ק
ר
י
 
ו
ה
ל
כ
ת
י
 
ע
מ
כ
ם
 
ב
ח
מ
ת
 
ק
ר
י
 
ו
י
ס
ר
ת
י
 
א
ת
כ
ם
 
א
ף
 
א
נ
י
 
ש
ב
ע
 
ע
ל
 
ח
ט
א
ת
י
כ
ם
 
ו
א
כ
ל
ת
ם
 
ב
ש
ר
 
ב
נ
י
כ
ם
 
ו
ב
ש
ר
 
ב
נ
ת
י
כ
ם
 
ת
א
כ
ל
ו
 
ו
ה
ש
מ
ד
ת
י
 
א
ת
 
ב
מ
ת
י
כ
ם
 
ו
ה
כ
ר
ת
י
 
א
ת
 
ח
מ
נ
י
כ
ם
 
ו
נ
ת
ת
י
 
א
ת
 
פ
ג
ר
י
כ
ם
 
ע
ל
 
פ
ג
ר
י
 
ג
ל
ו
ל
י
כ
ם
 
ו
ג
ע
ל
ה
 
נ
פ
ש
י
 
א
ת
כ
ם
 
ו
נ
ת
ת
י
 
א
ת
 
ע
ר
י
כ
ם
 
ח
ר
ב
ה
 
ו
ה
ש
מ
ת
י
 
א
ת
 
מ
ק
ד
ש
כ
ם
 
ו
ל
א
 
א
ר
י
ח
 
ב
ר
י
ח
 
נ
י
ח
ח
כ
ם
 
ו
ה
ש
מ
ת
י
 
א
נ
י
 
א
ת
 
ה
א
ר
ץ
 
ו
ש
מ
מ
ו
 
ע
ל
י
ה
 
א
י
ב
י
כ
ם
 
ה
י
ש
ב
י
ם
 
ב
ה
 
ו
א
ת
כ
ם
 
א
ז
ר
ה
 
ב
ג
ו
י
ם
 
ו
ה
ר
ק
ת
י
 
א
ח
ר
י
כ
ם
 
ח
ר
ב
 
ו
ה
י
ת
ה
 
א
ר
צ
כ
ם
 
ש
מ
מ
ה
 
ו
ע
ר
י
כ
ם
 
י
ה
י
ו
 
ח
ר
ב
ה
 
א
ז
 
ת
ר
צ
ה
 
ה
א
ר
ץ
 
א
ת
 
ש
ב
ת
ת
י
ה
 
כ
ל
 
י
מ
י
 
א
ש
מ
ה
 
ו
א
ת
ם
 
ב
א
ר
ץ
 
א
י
ב
י
כ
ם
 
א
ז
 
ת
ש
ב
ת
 
ה
א
ר
ץ
 
ו
ה
ר
צ
ת
ה
 
א
ת
 
ש
ב
ת
ת
י
ה
 
כ
ל
 
י
מ
י
 
א
ש
מ
ה
 
ת
ש
ב
ת
 
א
ת
 
א
ש
ר
 
ל
א
 
ש
ב
ת
ה
 
ב
ש
ב
ת
ת
י
כ
ם
 
ב
ש
ב
ת
כ
ם
 
ע
ל
י
ה
 
ו
ה
נ
ש
א
ר
י
ם
 
ב
כ
ם
 
ו
ה
ב
א
ת
י
 
מ
ר
ך
 
ב
ל
ב
ב
ם
 
ב
א
ר
צ
ו
ת
 
א
י
ב
י
ה
ם
 
ו
ר
ד
ף
 
א
ת
ם
 
ק
ו
ל
 
ע
ל
י
 
נ
ד
ף
 
ו
נ
ס
ו
 
מ
נ
ו
ס
ת
 
ח
ר
ב
 
ו
נ
פ
ל
ו
 
ו
א
י
ן
 
ר
ד
ף
 
ו
כ
ש
ל
ו
 
א
י
ש
 
ב
א
ח
י
ו
 
כ
מ
פ
נ
י
 
ח
ר
ב
 
ו
ר
ד
ף
 
א
י
ן
 
ו
ל
א
 
ת
ה
י
ה
 
ל
כ
ם
 
ת
ק
ו
מ
ה
 
ל
פ
נ
י
 
א
י
ב
י
כ
ם
 
ו
א
ב
ד
ת
ם
 
ב
ג
ו
י
ם
 
ו
א
כ
ל
ה
 
א
ת
כ
ם
 
א
ר
ץ
 
א
י
ב
י
כ
ם
 
ו
ה
נ
ש
א
ר
י
ם
 
ב
כ
ם
 
י
מ
ק
ו
 
ב
ע
ו
נ
ם
 
ב
א
ר
צ
ו
ת
 
א
י
ב
י
ה
ם
 
ו
א
ף
 
ב
ע
ו
נ
ו
ת
 
א
ב
ו
ת
ם
 
א
ת
ם
 
י
מ
ק
ו
 
ו
ה
ת
ו
ד
ו
 
א
ת
 
ע
ו
נ
ם
 
ו
א
ת
 
ע
ו
ן
 
א
ב
ו
ת
ם
 
ב
מ
ע
ל
ם
 
א
ש
ר
 
מ
ע
ל
ו
 
ב
י
 
ו
א
ף
 
א
ש
ר
 
ה
ל
כ
ו
 
ע
מ
י
 
ב
ק
ר
י
 
א
ף
 
א
נ
י
 
ה
ל
ך
 
ע
מ
ם
 
ב
ק
ר
י
 
ו
ה
ב
א
ת
י
 
א
ת
ם
 
ב
א
ר
ץ
 
א
י
ב
י
ה
ם
 
א
ו
 
א
ז
 
י
כ
נ
ע
 
ל
ב
ב
ם
 
ה
ע
ר
ל
 
ו
א
ז
 
י
ר
צ
ו
 
א
ת
 
ע
ו
נ
ם
 
ו
ז
כ
ר
ת
י
 
א
ת
 
ב
ר
י
ת
י
 
י
ע
ק
ב
 
ו
א
ף
 
א
ת
 
ב
ר
י
ת
י
 
י
צ
ח
ק
 
ו
א
ף
 
א
ת
 
ב
ר
י
ת
י
 
א
ב
ר
ה
ם
 
א
ז
כ
ר
 
ו
ה
א
ר
ץ
 
א
ז
כ
ר
 
ו
ה
א
ר
ץ
 
ת
ע
ז
ב
 
מ
ה
ם
 
ו
ה
ר
צ
ת
ה
 
א
ת
 
ש
ב
ת
ת
י
ה
 
ב
א
ש
מ
ה
 
מ
ה
ם
 
ו
ה
ם
 
י
ר
צ
ו
 
א
ת
 
ע
ו
נ
ם
 
י
ע
ן
 
ב
י
ע
ן
 
ב
מ
ש
פ
ט
י
 
מ
א
ס
ו
 
ו
א
ת
 
ח
ק
ו
ת
י
 
ג
ע
ל
ה
 
נ
פ
ש
ם
 
ו
א
ף
 
ג
ם
 
ז
א
ת
 
ב
ה
י
ו
ת
ם
 
ב
א
ר
צ
ו
ת
 
א
י
ב
י
ה
ם
 
ל
א
 
מ
א
ס
ת
י
ם
 
ו
ל
א
 
ג
ע
ל
ת
י
ם
 
ל
כ
ל
ו
ת
ם
 
ל
ה
פ
ר
 
ב
ר
י
ת
י
 
א
ת
ם
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ה
ם
 
ו
ז
כ
ר
ת
י
 
ל
ה
ם
 
ב
ר
י
ת
 
ר
א
י
ש
ו
נ
י
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ע
י
נ
י
 
ה
ג
ו
י
ם
 
ל
ה
י
ו
ת
 
ל
ה
ם
 
ל
א
ל
ה
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
ו
ה
ת
ו
ר
ו
ת
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ב
י
נ
ו
 
ו
ב
י
ן
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ה
ר
 
ס
י
נ
י
 
ב
י
ד
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
י
ש
 
כ
י
 
י
פ
ל
א
 
נ
ד
ר
 
ב
ע
ר
כ
ך
 
נ
פ
ש
ו
ת
 
ל
י
ה
ו
ה
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ה
ז
כ
ר
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
ע
ד
 
ב
ן
 
ש
ש
י
ם
 
ש
נ
ה
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ח
מ
ש
י
ם
 
ש
ק
ל
 
כ
ס
ף
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ו
א
ם
 
נ
ק
ב
ה
 
ה
י
א
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ש
ל
ש
י
ם
 
ש
ק
ל
 
ו
א
ם
 
מ
ב
ן
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
ע
ד
 
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ה
ז
כ
ר
 
ע
ש
ר
י
ם
 
ש
ק
ל
י
ם
 
ו
ל
נ
ק
ב
ה
 
ע
ש
ר
ת
 
ש
ק
ל
י
ם
 
ו
א
ם
 
מ
ב
ן
 
ח
ד
ש
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
 
ש
נ
י
ם
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ה
ז
כ
ר
 
ח
מ
ש
ה
 
ש
ק
ל
י
ם
 
כ
ס
ף
 
ו
ל
נ
ק
ב
ה
 
ע
ר
כ
ך
 
ש
ל
ש
ת
 
ש
ק
ל
י
ם
 
כ
ס
ף
 
ו
א
ם
 
מ
ב
ן
 
ש
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
א
ם
 
ז
כ
ר
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ח
מ
ש
ה
 
ע
ש
ר
 
ש
ק
ל
 
ו
ל
נ
ק
ב
ה
 
ע
ש
ר
ת
 
ש
ק
ל
י
ם
 
ו
א
ם
 
מ
ך
 
ה
ו
א
 
מ
ע
ר
כ
ך
 
ו
ה
ע
מ
י
ד
ו
 
ל
פ
נ
י
 
ה
כ
ה
ן
 
ו
ה
ע
ר
י
ך
 
א
ת
ו
 
ה
כ
ה
ן
 
ע
ל
 
פ
י
 
א
ש
ר
 
ת
ש
י
ג
 
י
ד
 
ה
נ
ד
ר
 
י
ע
ר
י
כ
נ
ו
 
ה
כ
ה
ן
 
ו
א
ם
 
ב
ה
מ
ה
 
א
ש
ר
 
י
ק
ר
י
ב
 
מ
מ
נ
ה
 
ק
ר
ב
ן
 
ל
י
ה
ו
ה
 
כ
ל
 
א
ש
ר
 
י
ת
ן
 
מ
מ
נ
ו
 
ל
י
ה
ו
ה
 
י
ה
י
ה
 
ק
ד
ש
 
ל
א
 
י
ח
ל
פ
נ
ו
 
ו
ל
א
 
י
מ
י
ר
 
א
ת
ו
 
ט
ו
ב
 
ב
ר
ע
 
א
ו
 
ר
ע
 
ב
ט
ו
ב
 
ו
א
ם
 
ה
מ
ר
 
י
מ
י
ר
 
ב
ה
מ
ה
 
ב
ב
ה
מ
ה
 
ו
ה
י
ה
 
ה
ו
א
 
ו
ת
מ
י
ר
ת
ו
 
י
ה
י
ה
 
ק
ד
ש
 
ו
א
ם
 
כ
ל
 
ב
ה
מ
ה
 
ט
מ
א
ה
 
א
ש
ר
 
ל
א
 
י
ק
ר
י
ב
 
מ
מ
נ
ה
 
ק
ר
ב
ן
 
ל
י
ה
ו
ה
 
ו
ה
ע
מ
י
ד
 
א
ת
 
ה
ב
ה
מ
ה
 
ל
פ
נ
י
 
ה
כ
ה
ן
 
ו
ה
ע
ר
י
ך
 
ה
כ
ה
ן
 
א
ת
ו
 
ב
י
ן
 
ט
ו
ב
 
ו
ב
י
ן
 
ר
ע
 
כ
ע
ר
כ
ך
 
ה
כ
ה
ן
 
כ
ן
 
י
ה
י
ה
 
ו
א
ם
 
ג
א
ל
 
י
ג
א
ל
נ
ו
 
ו
י
ס
ף
 
ח
מ
י
ש
ת
ו
 
ע
ל
 
ע
ר
כ
ך
 
ו
א
י
ש
 
כ
י
 
י
ק
ד
י
ש
 
א
ת
 
ב
י
ת
ו
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
ו
ה
ע
ר
י
כ
ו
 
ה
כ
ה
ן
 
ב
י
ן
 
ט
ו
ב
 
ו
ב
י
ן
 
ר
ע
 
כ
א
ש
ר
 
י
ע
ר
י
ך
 
א
ת
ו
 
ה
כ
ה
ן
 
כ
ן
 
י
ק
ו
ם
 
ו
א
ם
 
ה
מ
ק
ד
י
ש
 
י
ג
א
ל
 
א
ת
 
ב
י
ת
ו
 
ו
י
ס
ף
 
ח
מ
י
ש
ת
 
כ
ס
ף
 
ע
ר
כ
ך
 
ע
ל
י
ו
 
ו
ה
י
ה
 
ל
ו
 
ו
א
ם
 
מ
ש
ד
ה
 
א
ח
ז
ת
ו
 
י
ק
ד
י
ש
 
א
י
ש
 
ל
י
ה
ו
ה
 
ו
ה
י
ה
 
ע
ר
כ
ך
 
ל
פ
י
 
ז
ר
ע
ו
 
ז
ר
ע
 
ח
מ
ר
 
ש
ע
ר
י
ם
 
ב
ח
מ
ש
י
ם
 
ש
ק
ל
 
כ
ס
ף
 
ו
א
ם
 
מ
ש
נ
ת
 
ה
י
ו
ב
ל
 
י
ק
ד
י
ש
 
ש
ד
ה
ו
 
כ
ע
ר
כ
ך
 
י
ק
ו
ם
 
ו
א
ם
 
א
ח
ר
 
ה
י
ו
ב
ל
 
י
ק
ד
י
ש
 
ש
ד
ה
ו
 
ו
ח
ש
ב
 
ל
ו
 
ה
כ
ה
ן
 
א
ת
 
ה
כ
ס
ף
 
ע
ל
 
פ
י
 
ה
ש
נ
י
ם
 
ה
נ
ו
ת
ר
ת
 
ע
ד
 
ש
נ
ת
 
ה
י
ו
ב
ל
 
ו
נ
ג
ר
ע
 
מ
ע
ר
כ
ך
 
ו
א
ם
 
ג
א
ל
 
י
ג
א
ל
 
א
ת
 
ה
ש
ד
ה
 
ה
מ
ק
ד
י
ש
 
א
ת
ו
 
ו
י
ס
ף
 
ח
מ
י
ש
ת
 
כ
ס
ף
 
ע
ר
כ
ך
 
ע
ל
י
ו
 
ו
ק
ם
 
ל
ו
 
ו
א
ם
 
ל
א
 
י
ג
א
ל
 
א
ת
 
ה
ש
ד
ה
 
ו
א
ם
 
מ
כ
ר
 
א
ת
 
ה
ש
ד
ה
 
ל
א
י
ש
 
א
ח
ר
 
ל
א
 
י
ג
א
ל
 
ע
ו
ד
 
ו
ה
י
ה
 
ה
ש
ד
ה
 
ב
צ
א
ת
ו
 
ב
י
ו
ב
ל
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
כ
ש
ד
ה
 
ה
ח
ר
ם
 
ל
כ
ה
ן
 
ת
ה
י
ה
 
א
ח
ז
ת
ו
 
ו
א
ם
 
א
ת
 
ש
ד
ה
 
מ
ק
נ
ת
ו
 
א
ש
ר
 
ל
א
 
מ
ש
ד
ה
 
א
ח
ז
ת
ו
 
י
ק
ד
י
ש
 
א
י
ש
 
ל
י
ה
ו
ה
 
ו
ח
ש
ב
 
ל
ו
 
ה
כ
ה
ן
 
א
ת
 
מ
כ
ס
ו
ת
 
ה
ע
ר
כ
ך
 
ע
ד
 
ש
נ
ת
 
ה
י
ו
ב
ל
 
ו
נ
ת
ן
 
א
ת
 
ה
ע
ר
כ
ך
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
ב
ש
נ
ת
 
ה
י
ו
ב
ל
 
י
ש
ו
ב
 
ה
ש
ד
ה
 
ל
א
ש
ר
 
ק
נ
ה
ו
 
מ
א
ת
ו
 
ל
א
ש
ר
 
ל
ו
 
א
ח
ז
ת
 
ה
א
ר
ץ
 
ו
כ
ל
 
ע
ר
כ
ך
 
י
ה
י
ה
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ע
ש
ר
י
ם
 
ג
ר
ה
 
ה
ש
ק
ל
 
א
ך
 
כ
ל
 
ב
כ
ו
ר
 
א
ש
ר
 
י
ב
כ
ר
 
ל
י
ה
ו
ה
 
ב
ב
ה
מ
ה
 
ל
א
 
י
ק
ד
י
ש
 
א
י
ש
 
א
ת
ו
 
א
ם
 
ש
ו
ר
 
א
ם
 
ש
ה
 
ל
י
ה
ו
ה
 
ה
ו
א
 
ו
א
ם
 
ב
ב
ה
מ
ה
 
ה
ט
מ
א
ה
 
ו
פ
ד
ה
 
ב
ע
ר
כ
ך
 
ו
י
ס
ף
 
ח
מ
י
ש
ת
ו
 
ע
ל
י
ו
 
ו
א
ם
 
ל
א
 
י
ג
א
ל
 
ו
נ
מ
כ
ר
 
ב
ע
ר
כ
ך
 
א
ך
 
כ
ל
 
ח
ר
ם
 
א
ש
ר
 
י
ח
ר
ם
 
א
י
ש
 
ל
י
ה
ו
ה
 
מ
כ
ל
 
א
ש
ר
 
ל
ו
 
מ
א
ד
ם
 
ו
ב
ה
מ
ה
 
ו
מ
ש
ד
ה
 
א
ח
ז
ת
ו
 
ל
א
 
י
מ
כ
ר
 
ו
ל
א
 
י
ג
א
ל
 
כ
ל
 
ח
ר
ם
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ה
ו
א
 
ל
י
ה
ו
ה
 
כ
ל
 
ח
ר
ם
 
א
ש
ר
 
י
ח
ר
ם
 
מ
ן
 
ה
א
ד
ם
 
ל
א
 
י
פ
ד
ה
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
כ
ל
 
מ
ע
ש
ר
 
ה
א
ר
ץ
 
מ
ז
ר
ע
 
ה
א
ר
ץ
 
ו
מ
פ
ר
י
 
ה
ע
ץ
 
ל
י
ה
ו
ה
 
ה
ו
א
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
ו
א
ם
 
ג
א
ל
 
י
ג
א
ל
 
א
י
ש
 
מ
מ
ע
ש
ר
ו
 
ח
מ
י
ש
ת
ו
 
י
ס
ף
 
ע
ל
י
ו
 
ו
כ
ל
 
מ
ע
ש
ר
 
ב
ק
ר
 
ו
צ
א
ן
 
כ
ל
 
א
ש
ר
 
י
ע
ב
ר
 
ת
ח
ת
 
ה
ש
ב
ט
 
ה
ע
ש
י
ר
י
 
י
ה
י
ה
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
ל
א
 
י
ב
ק
ר
 
ב
י
ן
 
ט
ו
ב
 
ל
ר
ע
 
ו
ל
א
 
י
מ
י
ר
נ
ו
 
ו
א
ם
 
ה
מ
ר
 
י
מ
י
ר
נ
ו
 
ו
ה
י
ה
 
ה
ו
א
 
ו
ת
מ
י
ר
ת
ו
 
י
ה
י
ה
 
ק
ד
ש
 
ל
א
 
י
ג
א
ל
 
א
ל
ה
 
ה
מ
צ
ו
ת
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ה
ר
 
ס
י
נ
י
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ה
ש
נ
י
 
ב
ש
נ
ה
 
ה
ש
נ
י
ת
 
ל
צ
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
א
מ
ר
 
ש
א
ו
 
א
ת
 
ר
א
ש
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
כ
ל
 
ז
כ
ר
 
ל
ג
ל
ג
ל
ו
ת
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
ב
י
ש
ר
א
ל
 
ת
פ
ק
ד
 
א
ת
ם
 
ל
צ
ב
א
ת
ם
 
א
ת
ה
 
ו
א
ה
ר
ן
 
ו
א
ת
כ
ם
 
י
ה
י
ו
 
א
י
ש
 
א
י
ש
 
ל
מ
ט
ה
 
א
י
ש
 
ר
א
ש
 
ל
ב
י
ת
 
א
ב
ת
י
ו
 
ה
ו
א
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
י
ע
מ
ד
ו
 
א
ת
כ
ם
 
ל
ר
א
ו
ב
ן
 
א
ל
י
צ
ו
ר
 
ב
ן
 
ש
ד
י
א
ו
ר
 
ל
ש
מ
ע
ו
ן
 
ש
ל
מ
י
א
ל
 
ב
ן
 
צ
ו
ר
י
ש
ד
ה
 
ל
י
ה
ו
ד
ה
 
נ
ח
ש
ו
ן
 
ב
ן
 
ע
מ
י
נ
ד
ב
 
ל
י
ש
ש
כ
ר
 
נ
ת
נ
א
ל
 
ב
ן
 
צ
ו
ע
ר
 
ל
ז
ב
ו
ל
ן
 
א
ל
י
א
ב
 
ב
ן
 
ח
י
ל
ן
 
ל
ב
נ
י
 
י
ו
ס
ף
 
ל
א
פ
ר
י
ם
 
א
ל
י
ש
מ
ע
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
ל
מ
נ
ש
ה
 
ג
מ
ל
א
ל
 
ב
ן
 
פ
ד
ה
צ
ו
ר
 
ל
ב
נ
י
מ
י
ם
 
א
ב
י
ד
ן
 
ב
ן
 
ג
ד
ע
ו
נ
י
 
ל
ד
ן
 
א
ח
י
ע
ז
ר
 
ב
ן
 
ע
מ
י
ש
ד
י
 
ל
א
ש
ר
 
פ
ג
ע
א
ל
 
ב
ן
 
ע
כ
ר
ן
 
ל
ג
ד
 
א
ל
י
ס
ף
 
ב
ן
 
ד
ע
ו
א
ל
 
ל
נ
פ
ת
ל
י
 
א
ח
י
ר
ע
 
ב
ן
 
ע
י
נ
ן
 
א
ל
ה
 
ק
ר
י
א
י
 
ה
ע
ד
ה
 
נ
ש
י
א
י
 
מ
ט
ו
ת
 
א
ב
ו
ת
ם
 
ר
א
ש
י
 
א
ל
פ
י
 
י
ש
ר
א
ל
 
ה
ם
 
ו
י
ק
ח
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ת
 
ה
א
נ
ש
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
נ
ק
ב
ו
 
ב
ש
מ
ו
ת
 
ו
א
ת
 
כ
ל
 
ה
ע
ד
ה
 
ה
ק
ה
ל
ו
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ה
ש
נ
י
 
ו
י
ת
י
ל
ד
ו
 
ע
ל
 
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ל
ג
ל
ג
ל
ו
ת
ם
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
פ
ק
ד
ם
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ה
י
ו
 
ב
נ
י
 
ר
א
ו
ב
ן
 
ב
כ
ו
ר
 
י
ש
ר
א
ל
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
כ
ל
 
ז
כ
ר
 
ל
ג
ל
ג
ל
ת
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
ר
א
ו
ב
ן
 
ש
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ל
ב
נ
י
 
ש
מ
ע
ו
ן
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
פ
ק
ד
י
ה
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
ל
ג
ל
ג
ל
ת
ם
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
ש
מ
ע
ו
ן
 
ת
ש
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ל
ב
נ
י
 
ג
ד
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
ג
ד
 
ח
מ
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ש
ש
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
ל
ב
נ
י
 
י
ה
ו
ד
ה
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
א
ר
ב
ע
ה
 
ו
ש
ב
ע
י
ם
 
א
ל
ף
 
ו
ש
ש
 
מ
א
ו
ת
 
ל
ב
נ
י
 
י
ש
ש
כ
ר
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
י
ש
ש
כ
ר
 
א
ר
ב
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ל
ב
נ
י
 
ז
ב
ו
ל
ן
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
ז
ב
ו
ל
ן
 
ש
ב
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ל
ב
נ
י
 
י
ו
ס
ף
 
ל
ב
נ
י
 
א
פ
ר
י
ם
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
א
פ
ר
י
ם
 
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ל
ב
נ
י
 
מ
נ
ש
ה
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
מ
נ
ש
ה
 
ש
נ
י
ם
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
מ
א
ת
י
ם
 
ל
ב
נ
י
 
ב
נ
י
מ
י
ם
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
ב
נ
י
מ
י
ם
 
ח
מ
ש
ה
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ל
ב
נ
י
 
ד
ן
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
ד
ן
 
ש
נ
י
ם
 
ו
ש
ש
י
ם
 
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ל
ב
נ
י
 
א
ש
ר
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
א
ש
ר
 
א
ח
ד
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ל
ב
נ
י
 
נ
פ
ת
ל
י
 
ת
ו
ל
ד
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
פ
ק
ד
י
ה
ם
 
ל
מ
ט
ה
 
נ
פ
ת
ל
י
 
ש
ל
ש
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
א
ל
ה
 
ה
פ
ק
ד
י
ם
 
א
ש
ר
 
פ
ק
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
נ
ש
י
א
י
 
י
ש
ר
א
ל
 
ש
נ
י
ם
 
ע
ש
ר
 
א
י
ש
 
א
י
ש
 
א
ח
ד
 
ל
מ
ט
ה
 
א
ח
ד
 
ל
מ
ט
ה
 
ב
י
ת
 
א
ב
ו
ת
ם
 
ה
י
ו
 
ו
י
ה
י
ו
 
כ
ל
 
פ
ק
ד
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
צ
ב
א
ת
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
ב
י
ש
ר
א
ל
 
ו
י
ה
י
ו
 
כ
ל
 
ה
פ
ק
ד
י
ם
 
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
ש
ל
ש
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
ו
ה
ל
ו
י
ם
 
ל
מ
ט
ה
 
א
ב
ו
ת
ם
 
ל
א
 
ה
ת
פ
ק
ד
ו
 
ב
ת
ו
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
א
ך
 
א
ת
 
מ
ט
ה
 
ה
ל
ו
י
 
ל
א
 
ת
פ
ק
ד
 
ו
א
ת
 
ר
א
ש
ם
 
ל
א
 
ת
ש
א
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
ה
 
ה
פ
ק
ד
 
א
ת
 
ה
ל
ו
י
ם
 
ע
ל
 
מ
ש
כ
ן
 
ה
ע
ד
ו
ת
 
ו
ע
ל
 
כ
ל
 
כ
ל
י
ו
 
ו
ע
ל
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ה
ם
 
י
ש
א
ו
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
ה
ם
 
י
ש
ר
ת
ה
ו
 
ו
ס
ב
י
ב
 
ל
מ
ש
כ
ן
 
י
ח
נ
ו
 
ו
ב
נ
ס
ע
 
ה
מ
ש
כ
ן
 
י
ו
ר
י
ד
ו
 
א
ת
ו
 
ה
ל
ו
י
ם
 
ו
ב
ה
ח
נ
ו
ת
 
ה
מ
ש
כ
ן
 
י
ק
י
מ
ו
 
א
ת
ו
 
ה
ל
ו
י
ם
 
ו
ה
ז
ר
 
ה
ק
ר
ב
 
י
ו
מ
ת
 
ו
ח
נ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
י
ש
 
ע
ל
 
מ
ח
נ
ה
ו
 
ו
א
י
ש
 
ע
ל
 
י
ד
ו
 
ל
צ
ב
א
ת
ם
 
ו
ה
ל
ו
י
ם
 
י
ח
נ
ו
 
ס
ב
י
ב
 
ל
מ
ש
כ
ן
 
ה
ע
ד
ו
ת
 
ו
ל
א
 
י
ה
י
ה
 
ק
צ
ף
 
ע
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ש
מ
ר
ו
 
ה
ל
ו
י
ם
 
א
ת
 
מ
ש
מ
ר
ת
 
מ
ש
כ
ן
 
ה
ע
ד
ו
ת
 
ו
י
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ע
ש
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
א
י
ש
 
ע
ל
 
ד
ג
ל
י
ו
 
ב
א
ת
ו
ת
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
י
ח
נ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
נ
ג
ד
 
ס
ב
י
ב
 
ל
א
ה
ל
 
מ
ו
ע
ד
 
י
ח
נ
ו
 
ו
ה
ח
נ
י
ם
 
ק
ד
מ
ה
 
מ
ז
ר
ח
ה
 
ד
ג
ל
 
מ
ח
נ
ה
 
י
ה
ו
ד
ה
 
ל
צ
ב
א
ת
ם
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
י
ה
ו
ד
ה
 
נ
ח
ש
ו
ן
 
ב
ן
 
ע
מ
י
נ
ד
ב
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
א
ר
ב
ע
ה
 
ו
ש
ב
ע
י
ם
 
א
ל
ף
 
ו
ש
ש
 
מ
א
ו
ת
 
ו
ה
ח
נ
י
ם
 
ע
ל
י
ו
 
מ
ט
ה
 
י
ש
ש
כ
ר
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
י
ש
ש
כ
ר
 
נ
ת
נ
א
ל
 
ב
ן
 
צ
ו
ע
ר
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
א
ר
ב
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ו
מ
ט
ה
 
ז
ב
ו
ל
ן
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
ז
ב
ו
ל
ן
 
א
ל
י
א
ב
 
ב
ן
 
ח
י
ל
ן
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ש
ב
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
כ
ל
 
ה
פ
ק
ד
י
ם
 
ל
מ
ח
נ
ה
 
י
ה
ו
ד
ה
 
מ
א
ת
 
א
ל
ף
 
ו
ש
מ
נ
י
ם
 
א
ל
ף
 
ו
ש
ש
ת
 
א
ל
פ
י
ם
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ל
צ
ב
א
ת
ם
 
ר
א
י
ש
ו
נ
ה
 
י
ס
ע
ו
 
ד
ג
ל
 
מ
ח
נ
ה
 
ר
א
ו
ב
ן
 
ת
י
מ
נ
ה
 
ל
צ
ב
א
ת
ם
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
ר
א
ו
ב
ן
 
א
ל
י
צ
ו
ר
 
ב
ן
 
ש
ד
י
א
ו
ר
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ש
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ה
ח
נ
י
ם
 
ע
ל
י
ו
 
מ
ט
ה
 
ש
מ
ע
ו
ן
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
ש
מ
ע
ו
ן
 
ש
ל
מ
י
א
ל
 
ב
ן
 
צ
ו
ר
י
ש
ד
י
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ת
ש
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ו
מ
ט
ה
 
ג
ד
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
ג
ד
 
א
ל
י
ס
ף
 
ב
ן
 
ד
ע
ו
א
ל
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ח
מ
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ש
ש
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
כ
ל
 
ה
פ
ק
ד
י
ם
 
ל
מ
ח
נ
ה
 
ר
א
ו
ב
ן
 
מ
א
ת
 
א
ל
ף
 
ו
א
ח
ד
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
ל
צ
ב
א
ת
ם
 
ו
ש
נ
י
ם
 
י
ס
ע
ו
 
ו
נ
ס
ע
 
א
ה
ל
 
מ
ו
ע
ד
 
מ
ח
נ
ה
 
ה
ל
ו
י
ם
 
ב
ת
ו
ך
 
ה
מ
ח
נ
ו
ת
 
כ
א
ש
ר
 
י
ח
נ
ו
 
כ
ן
 
י
ס
ע
ו
 
א
י
ש
 
ע
ל
 
י
ד
ו
 
ל
ד
ג
ל
י
ה
ם
 
ד
ג
ל
 
מ
ח
נ
ה
 
א
פ
ר
י
ם
 
ל
צ
ב
א
ת
ם
 
י
מ
ה
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
א
פ
ר
י
ם
 
א
ל
י
ש
מ
ע
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ע
ל
י
ו
 
מ
ט
ה
 
מ
נ
ש
ה
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
מ
נ
ש
ה
 
ג
מ
ל
י
א
ל
 
ב
ן
 
פ
ד
ה
צ
ו
ר
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ש
נ
י
ם
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
מ
א
ת
י
ם
 
ו
מ
ט
ה
 
ב
נ
י
מ
י
ם
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
ב
נ
י
מ
י
ם
 
א
ב
י
ד
ן
 
ב
ן
 
ג
ד
ע
ו
נ
י
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ח
מ
ש
ה
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
כ
ל
 
ה
פ
ק
ד
י
ם
 
ל
מ
ח
נ
ה
 
א
פ
ר
י
ם
 
מ
א
ת
 
א
ל
ף
 
ו
ש
מ
נ
ת
 
א
ל
פ
י
ם
 
ו
מ
א
ה
 
ל
צ
ב
א
ת
ם
 
ו
ש
ל
י
ש
י
ם
 
י
ס
ע
ו
 
ד
ג
ל
 
מ
ח
נ
ה
 
ד
ן
 
צ
פ
ו
נ
ה
 
ל
צ
ב
א
ת
ם
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
ד
ן
 
א
ח
י
ע
ז
ר
 
ב
ן
 
ע
מ
י
ש
ד
י
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ש
נ
י
ם
 
ו
ש
ש
י
ם
 
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
ה
ח
נ
י
ם
 
ע
ל
י
ו
 
מ
ט
ה
 
א
ש
ר
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
א
ש
ר
 
פ
ג
ע
א
ל
 
ב
ן
 
ע
כ
ר
ן
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
א
ח
ד
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
מ
ט
ה
 
נ
פ
ת
ל
י
 
ו
נ
ש
י
א
 
ל
ב
נ
י
 
נ
פ
ת
ל
י
 
א
ח
י
ר
ע
 
ב
ן
 
ע
י
נ
ן
 
ו
צ
ב
א
ו
 
ו
פ
ק
ד
י
ו
 
ש
ל
ש
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
כ
ל
 
ה
פ
ק
ד
י
ם
 
ל
מ
ח
נ
ה
 
ד
ן
 
מ
א
ת
 
א
ל
ף
 
ו
ש
ב
ע
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
ש
ש
 
מ
א
ו
ת
 
ל
א
ח
ר
נ
ה
 
י
ס
ע
ו
 
ל
ד
ג
ל
י
ה
ם
 
א
ל
ה
 
פ
ק
ד
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
כ
ל
 
פ
ק
ד
י
 
ה
מ
ח
נ
ו
ת
 
ל
צ
ב
א
ת
ם
 
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
ש
ל
ש
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
ו
ה
ל
ו
י
ם
 
ל
א
 
ה
ת
פ
ק
ד
ו
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ח
נ
ו
 
ל
ד
ג
ל
י
ה
ם
 
ו
כ
ן
 
נ
ס
ע
ו
 
א
י
ש
 
ל
מ
ש
פ
ח
ו
ת
י
ו
 
ע
ל
 
ב
י
ת
 
א
ב
ו
ת
י
ו
 
ו
א
ל
ה
 
ת
ו
ל
ד
ת
 
א
ה
ר
ן
 
ו
מ
ש
ה
 
ב
י
ו
ם
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ב
ה
ר
 
ס
י
נ
י
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
א
ה
ר
ן
 
ה
ב
כ
ו
ר
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
א
ל
ע
ז
ר
 
ו
א
י
ת
מ
ר
 
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
ה
מ
ש
ח
י
ם
 
א
ש
ר
 
מ
ל
א
 
י
ד
ם
 
ל
כ
ה
ן
 
ו
י
מ
ת
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
ב
ה
ק
ר
י
ב
ם
 
א
ש
 
ז
ר
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
ב
נ
י
ם
 
ל
א
 
ה
י
ו
 
ל
ה
ם
 
ו
י
כ
ה
ן
 
א
ל
ע
ז
ר
 
ו
א
י
ת
מ
ר
 
ע
ל
 
פ
נ
י
 
א
ה
ר
ן
 
א
ב
י
ה
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ה
ק
ר
ב
 
א
ת
 
מ
ט
ה
 
ל
ו
י
 
ו
ה
ע
מ
ד
ת
 
א
ת
ו
 
ל
פ
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
ש
ר
ת
ו
 
א
ת
ו
 
ו
ש
מ
ר
ו
 
א
ת
 
מ
ש
מ
ר
ת
ו
 
ו
א
ת
 
מ
ש
מ
ר
ת
 
כ
ל
 
ה
ע
ד
ה
 
ל
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
ה
מ
ש
כ
ן
 
ו
ש
מ
ר
ו
 
א
ת
 
כ
ל
 
כ
ל
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
מ
ש
מ
ר
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
ה
מ
ש
כ
ן
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
ל
ו
י
ם
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
נ
ת
נ
י
ם
 
נ
ת
נ
י
ם
 
ה
ם
 
ל
י
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
ב
נ
י
ו
 
ת
פ
ק
ד
 
ו
ש
מ
ר
ו
 
א
ת
 
כ
ה
נ
ת
ם
 
ו
ה
ז
ר
 
ה
ק
ר
ב
 
י
ו
מ
ת
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
א
נ
י
 
ה
נ
ה
 
ל
ק
ח
ת
י
 
א
ת
 
ה
ל
ו
י
ם
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ח
ת
 
כ
ל
 
ב
כ
ו
ר
 
פ
ט
ר
 
ר
ח
ם
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
פ
ד
ו
י
ה
ם
 
י
ה
י
ו
 
ו
ה
י
ו
 
ל
י
 
ה
ל
ו
י
ם
 
כ
י
 
ל
י
 
כ
ל
 
ב
כ
ו
ר
 
ב
י
ו
ם
 
ה
כ
י
ת
י
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ה
ק
ד
ש
ת
י
 
ל
י
 
כ
ל
 
ב
כ
ו
ר
 
ב
י
ש
ר
א
ל
 
מ
א
ד
ם
 
ע
ד
 
ב
ה
מ
ה
 
ל
י
 
י
ה
י
ו
 
א
נ
י
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ל
א
מ
ר
 
פ
ק
ד
 
א
ת
 
ב
נ
י
 
ל
ו
י
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
ת
פ
ק
ד
ם
 
ו
י
פ
ק
ד
 
א
ת
ם
 
מ
ש
ה
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
ו
 
ו
י
ה
י
ו
 
א
ל
ה
 
ב
נ
י
 
ל
ו
י
 
ב
ש
מ
ו
ת
ם
 
ג
ר
ש
ו
ן
 
ק
ה
ת
 
ו
מ
ר
ר
י
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
י
 
ג
ר
ש
ו
ן
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
נ
י
 
ו
ש
מ
ע
י
 
ו
ב
נ
י
 
ק
ה
ת
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ע
מ
ר
ם
 
ו
י
צ
ה
ר
 
ח
ב
ר
ו
ן
 
ו
ע
ז
י
א
ל
 
ו
ב
נ
י
 
מ
ר
ר
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
מ
ח
ל
י
 
ו
מ
ו
ש
י
 
א
ל
ה
 
ה
ם
 
מ
ש
פ
ח
ו
ת
 
ה
ל
ו
י
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ל
ג
ר
ש
ו
ן
 
מ
ש
פ
ח
ת
 
ה
ל
ב
נ
י
 
ו
מ
ש
פ
ח
ת
 
ה
ש
מ
ע
י
 
א
ל
ה
 
ה
ם
 
מ
ש
פ
ח
ו
ת
 
ה
ג
ר
ש
ו
נ
י
 
ו
פ
ק
ד
י
ה
ם
 
ב
מ
ס
פ
ר
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
פ
ק
ד
י
ה
ם
 
ש
ב
ע
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
מ
ש
פ
ח
ת
 
ה
ג
ר
ש
ו
נ
י
 
א
ח
ר
י
 
ה
מ
ש
כ
ן
 
י
ח
נ
ו
 
י
מ
ה
 
ו
נ
ש
י
א
 
ב
י
ת
 
א
ב
 
ל
ג
ר
ש
ו
נ
י
 
א
ל
י
ס
ף
 
ב
ן
 
ל
א
ל
 
ו
מ
ש
מ
ר
ת
 
ב
נ
י
 
ג
ר
ש
ו
ן
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ה
מ
ש
כ
ן
 
ו
ה
א
ה
ל
 
ו
מ
כ
ס
ה
ו
 
ו
מ
ס
ך
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ק
ל
ע
י
 
ה
ח
צ
ר
 
ו
א
ת
 
מ
ס
ך
 
פ
ת
ח
 
ה
ח
צ
ר
 
א
ש
ר
 
ע
ל
 
ה
מ
ש
כ
ן
 
ו
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
מ
י
ת
ר
י
ו
 
ל
כ
ל
 
ע
ב
ד
ת
ו
 
ו
ל
ק
ה
ת
 
מ
ש
פ
ח
ת
 
ה
ע
מ
ר
מ
י
 
ו
מ
ש
פ
ח
ת
 
ה
י
צ
ה
ר
י
 
ו
מ
ש
פ
ח
ת
 
ה
ח
ב
ר
ו
נ
י
 
ו
מ
ש
פ
ח
ת
 
ה
ע
ז
א
ל
י
 
א
ל
ה
 
ה
ם
 
מ
ש
פ
ח
ו
ת
 
ה
ק
ה
ת
י
 
ב
מ
ס
פ
ר
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
ש
מ
נ
ת
 
א
ל
פ
י
ם
 
ו
ש
ש
 
מ
א
ו
ת
 
ש
מ
ר
י
 
מ
ש
מ
ר
ת
 
ה
ק
ד
ש
 
מ
ש
פ
ח
ת
 
ב
נ
י
 
ק
ה
ת
 
י
ח
נ
ו
 
ע
ל
 
י
ר
ך
 
ה
מ
ש
כ
ן
 
ת
י
מ
נ
ה
 
ו
נ
ש
י
א
 
ב
י
ת
 
א
ב
 
ל
מ
ש
פ
ח
ו
ת
 
ה
ק
ה
ת
י
 
א
ל
י
צ
פ
ן
 
ב
ן
 
ע
ז
י
א
ל
 
ו
מ
ש
מ
ר
ת
ם
 
ה
א
ר
ו
ן
 
ו
ה
ש
ל
ח
ן
 
ו
ה
מ
נ
ו
ר
ה
 
ו
ה
מ
ז
ב
ח
ו
ת
 
ו
כ
ל
י
 
ה
ק
ד
ש
 
א
ש
ר
 
י
ש
ר
ת
ו
 
ב
ה
ם
 
ו
ה
מ
ס
ך
 
ו
ה
כ
י
ו
ר
 
ו
כ
נ
ו
 
ו
כ
ל
 
ע
ב
ד
ת
ם
 
ו
נ
ש
י
א
 
נ
ש
י
א
י
 
ה
ל
ו
י
ם
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
פ
ק
ד
ת
 
ש
מ
ר
י
 
מ
ש
מ
ר
ת
 
ה
ק
ד
ש
 
ל
מ
ר
ר
י
 
מ
ש
פ
ח
ת
 
ה
מ
ח
ל
י
 
ו
מ
ש
פ
ח
ת
 
ה
מ
ו
ש
י
 
א
ל
ה
 
ה
ם
 
מ
ש
פ
ח
ו
ת
 
מ
ר
ר
י
 
ו
פ
ק
ד
י
ה
ם
 
ב
מ
ס
פ
ר
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
ש
ש
ת
 
א
ל
פ
י
ם
 
ו
מ
א
ת
י
ם
 
ו
נ
ש
י
א
 
ב
י
ת
 
א
ב
 
ל
מ
ש
פ
ח
ו
ת
 
מ
ר
ר
י
 
צ
ו
ר
א
ל
 
ב
ן
 
א
ב
ח
ה
ל
 
ע
ל
 
י
ר
ך
 
ה
מ
ש
כ
ן
 
י
ח
נ
ו
 
צ
פ
ו
נ
ה
 
ו
פ
ק
ד
ת
 
מ
ש
מ
ר
ת
 
ב
נ
י
 
מ
ר
ר
י
 
ק
ר
ש
י
 
ה
מ
ש
כ
ן
 
ו
ב
ר
י
ח
י
ו
 
ו
ע
מ
ו
ד
י
ו
 
ו
א
ד
נ
י
ו
 
ו
כ
ל
 
כ
ל
י
ו
 
ו
כ
ל
 
ע
ב
ד
ת
ו
 
ו
ע
מ
ו
ד
י
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ו
א
ד
נ
י
ה
ם
 
ו
י
ת
ד
ת
ם
 
ו
מ
י
ת
ר
י
ה
ם
 
ו
ה
ח
נ
י
ם
 
א
ת
 
פ
נ
י
 
ה
מ
ש
כ
ן
 
ק
ד
מ
ה
 
ל
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
מ
ז
ר
ח
ה
 
מ
ש
ה
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
ש
מ
ר
י
 
מ
ש
מ
ר
ת
 
ה
ק
ד
ש
 
ל
מ
ש
מ
ר
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
ז
ר
 
ה
ק
ר
ב
 
י
ו
מ
ת
 
כ
ל
 
פ
ק
ד
י
 
ה
ל
ו
י
ם
 
א
ש
ר
 
פ
ק
ד
 
מ
ש
ה
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ל
מ
ש
פ
ח
ו
ת
ם
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
ש
נ
י
ם
 
ו
ע
ש
ר
י
ם
 
א
ל
ף
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
פ
ק
ד
 
כ
ל
 
ב
כ
ו
ר
 
ז
כ
ר
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
ו
ש
א
 
א
ת
 
מ
ס
פ
ר
 
ש
מ
ו
ת
ם
 
ו
ל
ק
ח
ת
 
א
ת
 
ה
ל
ו
י
ם
 
ל
י
 
א
נ
י
 
י
ה
ו
ה
 
ת
ח
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
 
ב
ה
מ
ת
 
ה
ל
ו
י
ם
 
ת
ח
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
ב
ה
מ
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
פ
ק
ד
 
מ
ש
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
א
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ה
י
ו
 
כ
ל
 
ב
כ
ו
ר
 
ז
כ
ר
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
ל
פ
ק
ד
י
ה
ם
 
ש
נ
י
ם
 
ו
ע
ש
ר
י
ם
 
א
ל
ף
 
ש
ל
ש
ה
 
ו
ש
ב
ע
י
ם
 
ו
מ
א
ת
י
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ח
 
א
ת
 
ה
ל
ו
י
ם
 
ת
ח
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
 
ב
ה
מ
ת
 
ה
ל
ו
י
ם
 
ת
ח
ת
 
ב
ה
מ
ת
ם
 
ו
ה
י
ו
 
ל
י
 
ה
ל
ו
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
ו
א
ת
 
פ
ד
ו
י
 
ה
ש
ל
ש
ה
 
ו
ה
ש
ב
ע
י
ם
 
ו
ה
מ
א
ת
י
ם
 
ה
ע
ד
פ
י
ם
 
ע
ל
 
ה
ל
ו
י
ם
 
מ
ב
כ
ו
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
ק
ח
ת
 
ח
מ
ש
ת
 
ח
מ
ש
ת
 
ש
ק
ל
י
ם
 
ל
ג
ל
ג
ל
ת
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ת
ק
ח
 
ע
ש
ר
י
ם
 
ג
ר
ה
 
ה
ש
ק
ל
 
ו
נ
ת
ת
ה
 
ה
כ
ס
ף
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
פ
ד
ו
י
 
ה
ע
ד
פ
י
ם
 
ב
ה
ם
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
כ
ס
ף
 
ה
פ
ד
ו
י
ם
 
מ
א
ת
 
ה
ע
ד
פ
י
ם
 
ע
ל
 
פ
ד
ו
י
 
ה
ל
ו
י
ם
 
מ
א
ת
 
ב
כ
ו
ר
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ק
ח
 
א
ת
 
ה
כ
ס
ף
 
ח
מ
ש
ה
 
ו
ש
ש
י
ם
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ו
א
ל
ף
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ו
י
ת
ן
 
מ
ש
ה
 
א
ת
 
כ
ס
ף
 
ה
פ
ד
ו
י
ם
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
נ
ש
א
 
א
ת
 
ר
א
ש
 
ב
נ
י
 
ק
ה
ת
 
מ
ת
ו
ך
 
ב
נ
י
 
ל
ו
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
כ
ל
 
ה
ב
א
 
ל
צ
ב
א
 
ל
ע
ש
ו
ת
 
מ
ל
א
כ
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ז
א
ת
 
ע
ב
ד
ת
 
ב
נ
י
 
ק
ה
ת
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ק
ד
ש
 
ה
ק
ד
ש
י
ם
 
ו
ב
א
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
ב
נ
ס
ע
 
ה
מ
ח
נ
ה
 
ו
ה
ו
ר
י
ד
ו
 
א
ת
 
פ
ר
כ
ת
 
ה
מ
ס
ך
 
ו
כ
ס
ו
 
ב
ה
 
א
ת
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
ו
נ
ת
נ
ו
 
ע
ל
י
ו
 
כ
ס
ו
י
 
ע
ו
ר
 
ת
ח
ש
 
ו
פ
ר
ש
ו
 
ע
ל
י
ו
 
ב
ג
ד
 
כ
ל
י
ל
 
ת
כ
ל
ת
 
מ
ל
מ
ע
ל
ה
 
ו
ש
מ
ו
 
ב
ד
י
ו
 
ו
ע
ל
 
ש
ל
ח
ן
 
ה
פ
נ
י
ם
 
י
פ
ר
ש
ו
 
ב
ג
ד
 
ת
כ
ל
ת
 
ו
נ
ת
נ
ו
 
ע
ל
י
ו
 
א
ת
 
ה
ק
ע
ר
ו
ת
 
ו
א
ת
 
ה
כ
פ
ו
ת
 
ו
א
ת
 
ה
מ
נ
ק
י
ו
ת
 
ו
א
ת
 
ק
ש
ו
ת
 
ה
נ
ס
ך
 
ו
ל
ח
ם
 
ה
ת
מ
י
ד
 
ע
ל
י
ו
 
י
ה
י
ה
 
ו
פ
ר
ש
ו
 
ע
ל
י
ה
ם
 
כ
ס
ו
י
 
ב
ג
ד
 
ת
ו
ל
ע
ת
 
ש
נ
י
 
ו
כ
ס
ו
 
א
ת
ו
 
ב
מ
כ
ס
ה
 
ע
ו
ר
 
ת
ח
ש
 
ו
ש
מ
ו
 
ב
ד
י
ו
 
ו
ל
ק
ח
ו
 
ב
ג
ד
 
ת
כ
ל
ת
 
ו
כ
ס
ו
 
א
ת
 
מ
נ
ו
ר
ת
 
ה
מ
א
ו
ר
 
ו
א
ת
 
נ
ר
ת
י
ה
 
ו
א
ת
 
מ
ל
ק
ח
י
ה
 
ו
א
ת
 
מ
ח
ת
י
ת
י
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
 
ש
מ
נ
ה
 
א
ש
ר
 
י
ש
ר
ת
ו
 
ל
ה
 
ב
ה
ם
 
ו
נ
ת
נ
ו
 
א
ת
ה
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ה
 
א
ל
 
מ
כ
ס
ה
 
ע
ו
ר
 
ת
ח
ש
 
ו
נ
ת
נ
ו
 
ע
ל
 
ה
מ
ו
ט
 
ו
ע
ל
 
מ
ז
ב
ח
 
ה
ז
ה
ב
 
י
פ
ר
ש
ו
 
ב
ג
ד
 
ת
כ
ל
ת
 
ו
כ
ס
ו
 
א
ת
ו
 
ב
מ
כ
ס
ה
 
ע
ו
ר
 
ת
ח
ש
 
ו
ש
מ
ו
 
א
ת
 
ב
ד
י
ו
 
ו
ל
ק
ח
ו
 
א
ת
 
כ
ל
 
כ
ל
י
 
ה
ש
ר
ת
 
א
ש
ר
 
י
ש
ר
ת
ו
 
ב
ה
ם
 
ב
ק
ד
ש
 
ו
נ
ת
נ
ו
 
א
ל
 
ב
ג
ד
 
ת
כ
ל
ת
 
ו
כ
ס
ו
 
א
ת
ם
 
ב
מ
כ
ס
ה
 
ע
ו
ר
 
ת
ח
ש
 
ו
נ
ת
נ
ו
 
ע
ל
 
ה
מ
ו
ט
 
ו
ד
ש
נ
ו
 
א
ת
 
ה
מ
ז
ב
ח
 
ו
פ
ר
ש
ו
 
ע
ל
י
ו
 
ב
ג
ד
 
א
ר
ג
מ
ן
 
ו
נ
ת
נ
ו
 
ע
ל
י
ו
 
א
ת
 
כ
ל
 
כ
ל
י
ו
 
א
ש
ר
 
י
ש
ר
ת
ו
 
ע
ל
י
ו
 
ב
ה
ם
 
א
ת
 
ה
מ
ח
ת
ו
ת
 
ו
א
ת
 
ה
מ
ז
ל
ג
ו
ת
 
ו
א
ת
 
ה
י
ע
י
ם
 
ו
א
ת
 
ה
מ
ז
ר
ק
ו
ת
 
כ
ל
 
כ
ל
י
 
ה
מ
ז
ב
ח
 
ו
פ
ר
ש
ו
 
ע
ל
י
ו
 
כ
ס
ו
י
 
ע
ו
ר
 
ת
ח
ש
 
ו
ש
מ
ו
 
ב
ד
י
ו
 
ו
ל
ק
ח
ו
 
ב
ג
ד
 
א
ר
ג
מ
ן
 
ו
כ
ס
ו
 
א
ת
 
ה
כ
י
ו
ר
 
ו
א
ת
 
כ
נ
ו
 
ו
נ
ת
נ
ו
 
א
ת
ם
 
א
ל
 
מ
כ
ס
ה
 
ע
ו
ר
 
ת
ח
ש
 
ו
נ
ת
נ
ו
 
ע
ל
 
ה
מ
ו
ט
 
ו
כ
ל
ה
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
ל
כ
ס
ו
ת
 
א
ת
 
ה
ק
ד
ש
 
ו
א
ת
 
כ
ל
 
כ
ל
י
 
ה
ק
ד
ש
 
ב
נ
ס
ע
 
ה
מ
ח
נ
ה
 
ו
א
ח
ר
י
 
כ
ן
 
י
ב
א
ו
 
ב
נ
י
 
ק
ה
ת
 
ל
ש
א
ת
 
ו
ל
א
 
י
ג
ע
ו
 
א
ל
 
ה
ק
ד
ש
 
ו
מ
ת
ו
 
א
ל
ה
 
מ
ש
א
י
 
ב
נ
י
 
ק
ה
ת
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
פ
ק
ד
ת
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ש
מ
ן
 
ה
מ
א
ו
ר
 
ו
ק
ט
ר
ת
 
ה
ס
מ
י
ם
 
ו
מ
נ
ח
ת
 
ה
ת
מ
י
ד
 
ו
ש
מ
ן
 
ה
מ
ש
ח
ה
 
פ
ק
ד
ת
 
כ
ל
 
ה
מ
ש
כ
ן
 
ו
כ
ל
 
א
ש
ר
 
ב
ו
 
ב
ק
ד
ש
 
ו
ב
כ
ל
י
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
א
ל
 
ת
כ
ר
י
ת
ו
 
א
ת
 
ש
ב
ט
 
מ
ש
פ
ח
ת
 
ה
ק
ה
ת
י
 
מ
ת
ו
ך
 
ה
ל
ו
י
ם
 
ז
א
ת
 
ע
ש
ו
 
ל
ה
ם
 
ו
ח
י
ו
 
ו
ל
א
 
י
מ
ו
ת
ו
 
ב
ג
ש
ת
ם
 
א
ל
 
ק
ד
ש
 
ה
ק
ד
ש
י
ם
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
י
ב
א
ו
 
ו
ש
מ
ו
 
א
ת
ם
 
א
י
ש
 
ע
ל
 
ע
ב
ד
ת
ו
 
ו
ע
ל
 
מ
ש
א
ו
 
ו
ל
א
 
י
ב
א
ו
 
ל
ר
א
ו
ת
 
כ
ב
ל
ע
 
א
ת
 
ה
ק
ד
ש
 
ו
מ
ת
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
נ
ש
א
 
א
ת
 
ר
א
ש
 
ב
נ
י
 
ג
ר
ש
ו
ן
 
ג
ם
 
ה
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
ת
פ
ק
ד
 
א
ת
ם
 
כ
ל
 
ה
ב
א
 
ל
צ
ב
א
 
צ
ב
א
 
ל
ע
ב
ד
 
ע
ב
ד
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ז
א
ת
 
ע
ב
ד
ת
 
מ
ש
פ
ח
ת
 
ה
ג
ר
ש
ו
נ
י
 
ל
ע
ב
ד
 
ו
ל
מ
ש
א
 
ו
נ
ש
א
ו
 
א
ת
 
י
ר
י
ע
ו
ת
 
ה
מ
ש
כ
ן
 
ו
א
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
מ
כ
ס
ה
ו
 
ו
מ
כ
ס
ה
 
ה
ת
ח
ש
 
א
ש
ר
 
ע
ל
י
ו
 
מ
ל
מ
ע
ל
ה
 
ו
א
ת
 
מ
ס
ך
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
 
ק
ל
ע
י
 
ה
ח
צ
ר
 
ו
א
ת
 
מ
ס
ך
 
פ
ת
ח
 
ש
ע
ר
 
ה
ח
צ
ר
 
א
ש
ר
 
ע
ל
 
ה
מ
ש
כ
ן
 
ו
ע
ל
 
ה
מ
ז
ב
ח
 
ס
ב
י
ב
 
ו
א
ת
 
מ
י
ת
ר
י
ה
ם
 
ו
א
ת
 
כ
ל
 
כ
ל
י
 
ע
ב
ד
ת
ם
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
י
ע
ש
ה
 
ל
ה
ם
 
ו
ע
ב
ד
ו
 
ע
ל
 
פ
י
 
א
ה
ר
ן
 
ו
ב
נ
י
ו
 
ת
ה
י
ה
 
כ
ל
 
ע
ב
ד
ת
 
ב
נ
י
 
ה
ג
ר
ש
ו
נ
י
 
ל
כ
ל
 
מ
ש
א
ם
 
ו
ל
כ
ל
 
ע
ב
ד
ת
ם
 
ו
פ
ק
ד
ת
ם
 
ע
ל
י
ה
ם
 
ב
מ
ש
מ
ר
ת
 
א
ת
 
כ
ל
 
מ
ש
א
ם
 
ז
א
ת
 
ע
ב
ד
ת
 
מ
ש
פ
ח
ת
 
ב
נ
י
 
ה
ג
ר
ש
ו
נ
י
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
מ
ש
מ
ר
ת
ם
 
ב
י
ד
 
א
י
ת
מ
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ב
נ
י
 
מ
ר
ר
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ת
פ
ק
ד
 
א
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
ת
פ
ק
ד
ם
 
כ
ל
 
ה
ב
א
 
ל
צ
ב
א
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ז
א
ת
 
מ
ש
מ
ר
ת
 
מ
ש
א
ם
 
ל
כ
ל
 
ע
ב
ד
ת
ם
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ק
ר
ש
י
 
ה
מ
ש
כ
ן
 
ו
ב
ר
י
ח
י
ו
 
ו
ע
מ
ו
ד
י
ו
 
ו
א
ד
נ
י
ו
 
ו
ע
מ
ו
ד
י
 
ה
ח
צ
ר
 
ס
ב
י
ב
 
ו
א
ד
נ
י
ה
ם
 
ו
י
ת
ד
ת
ם
 
ו
מ
י
ת
ר
י
ה
ם
 
ל
כ
ל
 
כ
ל
י
ה
ם
 
ו
ל
כ
ל
 
ע
ב
ד
ת
ם
 
ו
ב
ש
מ
ו
ת
 
ת
פ
ק
ד
ו
 
א
ת
 
כ
ל
 
כ
ל
י
 
מ
ש
מ
ר
ת
 
מ
ש
א
ם
 
ז
א
ת
 
ע
ב
ד
ת
 
מ
ש
פ
ח
ת
 
ב
נ
י
 
מ
ר
ר
י
 
ל
כ
ל
 
ע
ב
ד
ת
ם
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ב
י
ד
 
א
י
ת
מ
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
י
פ
ק
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
נ
ש
י
א
י
 
ה
ע
ד
ה
 
א
ת
 
ב
נ
י
 
ה
ק
ה
ת
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
כ
ל
 
ה
ב
א
 
ל
צ
ב
א
 
ל
ע
ב
ד
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ה
י
ו
 
פ
ק
ד
י
ה
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
א
ל
פ
י
ם
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
א
ל
ה
 
פ
ק
ד
י
 
מ
ש
פ
ח
ת
 
ה
ק
ה
ת
י
 
כ
ל
 
ה
ע
ב
ד
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
א
ש
ר
 
פ
ק
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ו
פ
ק
ד
י
 
ב
נ
י
 
ג
ר
ש
ו
ן
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
כ
ל
 
ה
ב
א
 
ל
צ
ב
א
 
ל
ע
ב
ד
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ה
י
ו
 
פ
ק
ד
י
ה
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
א
ל
פ
י
ם
 
ו
ש
ש
 
מ
א
ו
ת
 
ו
ש
ל
ש
י
ם
 
א
ל
ה
 
פ
ק
ד
י
 
מ
ש
פ
ח
ת
 
ב
נ
י
 
ג
ר
ש
ו
ן
 
כ
ל
 
ה
ע
ב
ד
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
א
ש
ר
 
פ
ק
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ו
פ
ק
ד
י
 
מ
ש
פ
ח
ת
 
ב
נ
י
 
מ
ר
ר
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
כ
ל
 
ה
ב
א
 
ל
צ
ב
א
 
ל
ע
ב
ד
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ה
י
ו
 
פ
ק
ד
י
ה
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ש
ל
ש
ת
 
א
ל
פ
י
ם
 
ו
מ
א
ת
י
ם
 
א
ל
ה
 
פ
ק
ד
י
 
מ
ש
פ
ח
ת
 
ב
נ
י
 
מ
ר
ר
י
 
א
ש
ר
 
פ
ק
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
כ
ל
 
ה
פ
ק
ד
י
ם
 
א
ש
ר
 
פ
ק
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
נ
ש
י
א
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
ל
ו
י
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
מ
ב
ן
 
ש
ל
ש
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ו
ע
ד
 
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
כ
ל
 
ה
ב
א
 
ל
ע
ב
ד
 
ע
ב
ד
ת
 
ע
ב
ד
ה
 
ו
ע
ב
ד
ת
 
מ
ש
א
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ה
י
ו
 
פ
ק
ד
י
ה
ם
 
ש
מ
נ
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ש
מ
נ
י
ם
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
פ
ק
ד
 
א
ת
ם
 
ב
י
ד
 
מ
ש
ה
 
א
י
ש
 
א
י
ש
 
ע
ל
 
ע
ב
ד
ת
ו
 
ו
ע
ל
 
מ
ש
א
ו
 
ו
פ
ק
ד
י
ו
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
צ
ו
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ש
ל
ח
ו
 
מ
ן
 
ה
מ
ח
נ
ה
 
כ
ל
 
צ
ר
ו
ע
 
ו
כ
ל
 
ז
ב
 
ו
כ
ל
 
ט
מ
א
 
ל
נ
פ
ש
 
מ
ז
כ
ר
 
ו
ע
ד
 
נ
ק
ב
ה
 
ת
ש
ל
ח
ו
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ת
ש
ל
ח
ו
ם
 
ו
ל
א
 
י
ט
מ
א
ו
 
א
ת
 
מ
ח
נ
י
ה
ם
 
א
ש
ר
 
א
נ
י
 
ש
כ
ן
 
ב
ת
ו
כ
ם
 
ו
י
ע
ש
ו
 
כ
ן
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ש
ל
ח
ו
 
א
ת
ם
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
כ
ן
 
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
א
י
ש
 
א
ו
 
א
ש
ה
 
כ
י
 
י
ע
ש
ו
 
מ
כ
ל
 
ח
ט
א
ת
 
ה
א
ד
ם
 
ל
מ
ע
ל
 
מ
ע
ל
 
ב
י
ה
ו
ה
 
ו
א
ש
מ
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
ו
ה
ת
ו
ד
ו
 
א
ת
 
ח
ט
א
ת
ם
 
א
ש
ר
 
ע
ש
ו
 
ו
ה
ש
י
ב
 
א
ת
 
א
ש
מ
ו
 
ב
ר
א
ש
ו
 
ו
ח
מ
י
ש
ת
ו
 
י
ס
ף
 
ע
ל
י
ו
 
ו
נ
ת
ן
 
ל
א
ש
ר
 
א
ש
ם
 
ל
ו
 
ו
א
ם
 
א
י
ן
 
ל
א
י
ש
 
ג
א
ל
 
ל
ה
ש
י
ב
 
ה
א
ש
ם
 
א
ל
י
ו
 
ה
א
ש
ם
 
ה
מ
ו
ש
ב
 
ל
י
ה
ו
ה
 
ל
כ
ה
ן
 
מ
ל
ב
ד
 
א
י
ל
 
ה
כ
פ
ו
ר
י
ם
 
א
ש
ר
 
י
כ
פ
ר
 
ב
ו
 
ע
ל
י
ו
 
ו
כ
ל
 
ת
ר
ו
מ
ה
 
ל
כ
ל
 
ק
ד
ש
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
ל
כ
ה
ן
 
ל
ו
 
י
ה
י
ה
 
ו
א
י
ש
 
א
ת
 
ק
ד
ש
י
ו
 
ל
ו
 
י
ה
י
ה
 
ו
א
י
ש
 
א
ש
ר
 
י
ת
ן
 
ל
כ
ה
ן
 
ל
ו
 
י
ה
י
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
י
ש
 
א
י
ש
 
כ
י
 
ת
ש
ט
ה
 
א
ש
ת
ו
 
ו
מ
ע
ל
ה
 
ב
ו
 
מ
ע
ל
 
ו
ש
כ
ב
 
א
י
ש
 
א
ת
ה
 
ש
כ
ב
ת
 
ז
ר
ע
 
ו
נ
ע
ל
ם
 
מ
ע
י
נ
י
 
א
י
ש
ה
 
ו
נ
ס
ת
ר
ה
 
ו
ה
י
א
 
נ
ט
מ
א
ה
 
ו
ע
ד
 
א
י
ן
 
ב
ה
 
ו
ה
י
א
 
ל
א
 
נ
ת
פ
ש
ה
 
ו
ע
ב
ר
 
ע
ל
י
ו
 
ר
ו
ח
 
ק
נ
א
ה
 
ו
ק
נ
א
 
א
ת
 
א
ש
ת
ו
 
ו
ה
י
א
 
נ
ט
מ
א
ה
 
א
ו
 
ע
ב
ר
 
ע
ל
י
ו
 
ר
ו
ח
 
ק
נ
א
ה
 
ו
ק
נ
א
 
א
ת
 
א
ש
ת
ו
 
ו
ה
י
א
 
ל
א
 
נ
ט
מ
א
ה
 
ו
ה
ב
י
א
 
ה
א
י
ש
 
א
ת
 
א
ש
ת
ו
 
א
ל
 
ה
כ
ה
ן
 
ו
ה
ב
י
א
 
א
ת
 
ק
ר
ב
נ
ה
 
ע
ל
י
ה
 
ע
ש
י
ר
ת
 
ה
א
י
פ
ה
 
ק
מ
ח
 
ש
ע
ר
י
ם
 
ל
א
 
י
צ
ק
 
ע
ל
י
ה
 
ש
מ
ן
 
ו
ל
א
 
י
ת
ן
 
ע
ל
י
ה
 
ל
ב
ו
נ
ה
 
כ
י
 
מ
נ
ח
ת
 
ק
נ
א
ת
 
ה
י
א
 
מ
נ
ח
ת
 
ז
כ
ר
ו
ן
 
מ
ז
כ
ר
ת
 
ע
ו
ן
 
ו
ה
ק
ר
י
ב
 
א
ת
ה
 
ה
כ
ה
ן
 
ו
ה
ע
מ
י
ד
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
י
ם
 
ק
ד
י
ש
י
ם
 
ב
כ
ל
י
 
ח
ר
ש
 
ו
מ
ן
 
ה
ע
פ
ר
 
א
ש
ר
 
י
ה
י
ה
 
ב
ק
ר
ק
ע
 
ה
מ
ש
כ
ן
 
י
ק
ח
 
ה
כ
ה
ן
 
ו
נ
ת
ן
 
א
ל
 
ה
מ
י
ם
 
ו
ה
ע
מ
י
ד
 
ה
כ
ה
ן
 
א
ת
 
ה
א
ש
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
פ
ר
ע
 
א
ת
 
ר
א
ש
 
ה
א
ש
ה
 
ו
נ
ת
ן
 
ע
ל
 
כ
פ
י
ה
 
א
ת
 
מ
נ
ח
ת
 
ה
ז
כ
ר
ו
ן
 
מ
נ
ח
ת
 
ק
נ
א
ת
 
ה
י
א
 
ו
ב
י
ד
 
ה
כ
ה
ן
 
י
ה
י
ו
 
מ
י
 
ה
מ
ר
י
ם
 
ה
מ
א
ר
ר
י
ם
 
ו
ה
ש
ב
י
ע
 
א
ת
ה
 
ה
כ
ה
ן
 
ו
א
מ
ר
 
א
ל
 
ה
א
ש
ה
 
א
ם
 
ל
א
 
ש
כ
ב
 
א
י
ש
 
א
ת
י
ך
 
ו
א
ם
 
ל
א
 
ש
ט
י
ת
 
ט
מ
א
ה
 
ת
ח
ת
 
א
י
ש
י
ך
 
ה
נ
ק
י
 
מ
מ
י
 
ה
מ
ר
י
ם
 
ה
מ
א
ר
ר
י
ם
 
ה
א
ל
ה
 
ו
א
ת
 
כ
י
 
ש
ט
י
ת
 
ת
ח
ת
 
א
י
ש
י
ך
 
ו
כ
י
 
נ
ט
מ
א
ת
 
ו
י
ת
ן
 
א
י
ש
 
ב
י
ך
 
א
ת
 
ש
כ
ב
ת
ו
 
מ
ב
ל
ע
ד
י
 
א
י
ש
י
ך
 
ו
ה
ש
ב
י
ע
 
ה
כ
ה
ן
 
א
ת
 
ה
א
ש
ה
 
ב
ש
ב
ו
ע
ת
 
ה
א
ל
ה
 
ו
א
מ
ר
 
ה
כ
ה
ן
 
ל
א
ש
ה
 
י
ת
ן
 
י
ה
ו
ה
 
א
ת
י
ך
 
ל
א
ל
ה
 
ו
ל
ש
ב
ו
ע
ה
 
ב
ת
ו
ך
 
ע
מ
י
ך
 
ב
ת
ת
 
י
ה
ו
ה
 
א
ת
 
י
ר
כ
י
ך
 
נ
פ
ל
ת
 
ו
א
ת
 
ב
ט
נ
י
ך
 
צ
ב
א
 
ו
ב
א
ו
 
ה
מ
י
ם
 
ה
מ
א
ר
ר
י
ם
 
ה
א
ל
ה
 
ב
מ
ע
י
ך
 
ל
צ
ב
ת
 
ב
ט
ן
 
ו
ל
נ
פ
ל
 
י
ר
ך
 
ו
א
מ
ר
ה
 
ה
א
ש
ה
 
א
מ
ן
 
א
מ
ן
 
ו
כ
ת
ב
 
א
ת
 
ה
א
ל
ו
ת
 
ה
א
ל
ה
 
ה
כ
ה
ן
 
ב
ס
פ
ר
 
ו
מ
ח
ה
 
א
ל
 
מ
י
 
ה
מ
ר
י
ם
 
ו
ה
ש
ק
ה
 
א
ת
 
ה
א
ש
ה
 
א
ת
 
מ
י
 
ה
מ
ר
י
ם
 
ה
מ
א
ר
ר
י
ם
 
ו
ב
א
ו
 
ב
ה
 
ה
מ
י
ם
 
ה
מ
א
ר
ר
י
ם
 
ל
מ
ר
י
ם
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
מ
י
ד
 
ה
א
ש
ה
 
א
ת
 
מ
נ
ח
ת
 
ה
ק
נ
א
ת
 
ו
ה
נ
י
ף
 
א
ת
 
ה
מ
נ
ח
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ה
ק
ר
י
ב
 
א
ת
ה
 
א
ל
 
ה
מ
ז
ב
ח
 
ו
ה
ר
י
ם
 
ה
כ
ה
ן
 
מ
ן
 
ה
מ
נ
ח
ה
 
א
ת
 
א
ז
כ
ר
ת
ה
 
ו
ה
ק
ט
י
ר
 
ה
מ
ז
ב
ח
ה
 
ו
א
ח
ר
 
י
ש
ק
ה
 
א
ת
 
ה
א
ש
ה
 
א
ת
 
ה
מ
י
ם
 
ו
ה
ש
ק
ה
 
א
ת
 
ה
מ
י
ם
 
ו
ה
י
ה
 
א
ם
 
נ
ט
מ
א
ה
 
ו
ת
מ
ע
ל
 
מ
ע
ל
 
ב
א
י
ש
ה
 
ו
ב
א
ו
 
ב
ה
 
ה
מ
י
ם
 
ה
מ
א
ר
ר
י
ם
 
ל
מ
ר
י
ם
 
ו
צ
ב
ת
ה
 
ב
ט
נ
ה
 
ו
נ
פ
ל
ה
 
י
ר
כ
ה
 
ו
ה
י
ת
ה
 
ה
א
ש
ה
 
ל
א
ל
ה
 
ב
ק
ר
ב
 
ע
מ
ה
 
ו
א
ם
 
ל
א
 
נ
ט
מ
א
ה
 
ה
א
ש
ה
 
ו
ט
ה
ר
ה
 
ה
י
א
 
ו
נ
ק
ת
ה
 
ו
נ
ז
ר
ע
ה
 
ז
ר
ע
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
ק
נ
א
ת
 
א
ש
ר
 
ת
ש
ט
ה
 
א
ש
ה
 
ת
ח
ת
 
א
י
ש
ה
 
ו
נ
ט
מ
א
ה
 
א
ו
 
א
י
ש
 
א
ש
ר
 
ת
ע
ב
ר
 
ע
ל
י
ו
 
ר
ו
ח
 
ק
נ
א
ה
 
ו
ק
נ
א
 
א
ת
 
א
ש
ת
ו
 
ו
ה
ע
מ
י
ד
 
א
ת
 
ה
א
ש
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ע
ש
ה
 
ל
ה
 
ה
כ
ה
ן
 
א
ת
 
כ
ל
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
נ
ק
ה
 
ה
א
י
ש
 
מ
ע
ו
ן
 
ו
ה
א
ש
ה
 
ה
ה
י
א
 
ת
ש
א
 
א
ת
 
ע
ו
נ
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
י
ש
 
א
ו
 
א
ש
ה
 
כ
י
 
י
פ
ל
א
 
ל
נ
ד
ר
 
נ
ד
ר
 
נ
ז
י
ר
 
ל
ה
ז
י
ר
 
ל
י
ה
ו
ה
 
מ
י
י
ן
 
ו
ש
כ
ר
 
י
ז
י
ר
 
ח
מ
ץ
 
י
י
ן
 
ו
ח
מ
ץ
 
ש
כ
ר
 
ל
א
 
י
ש
ת
ה
 
ו
כ
ל
 
מ
ש
א
ר
ת
 
ע
נ
ב
י
ם
 
ל
א
 
י
ש
ת
ה
 
ו
ע
נ
ב
י
ם
 
ל
ח
י
ם
 
ו
י
ב
י
ש
י
ם
 
ל
א
 
י
א
כ
ל
 
כ
ל
 
י
מ
י
 
נ
ז
ר
ו
 
מ
כ
ל
 
א
ש
ר
 
י
ע
ש
ה
 
מ
ג
פ
ן
 
ה
י
י
ן
 
מ
ח
ר
צ
נ
י
ם
 
ו
ע
ד
 
ז
ג
 
ל
א
 
י
א
כ
ל
 
כ
ל
 
י
מ
י
 
נ
ד
ר
 
נ
ז
ר
ו
 
ת
ע
ר
 
ל
א
 
י
ע
ב
ר
 
ע
ל
 
ר
א
ש
ו
 
ע
ד
 
מ
ל
א
ת
 
ה
י
מ
י
ם
 
א
ש
ר
 
י
ז
י
ר
 
ל
י
ה
ו
ה
 
ק
ד
ו
ש
 
י
ה
י
ה
 
ג
ד
ל
 
פ
ר
ע
 
ש
ע
ר
 
ר
א
ש
ו
 
כ
ל
 
י
מ
י
 
ה
ז
י
ר
ו
 
ל
י
ה
ו
ה
 
ע
ל
 
נ
פ
ש
 
מ
ת
 
ל
א
 
י
ב
ו
א
 
ל
א
ב
י
ו
 
ו
ל
א
מ
ו
 
ל
א
ח
י
ו
 
ו
ל
א
ח
ו
ת
ו
 
ל
א
 
י
ט
מ
א
 
ל
ה
ם
 
ב
מ
ו
ת
ם
 
כ
י
 
נ
ז
ר
 
א
ל
ה
י
ו
 
ע
ל
 
ר
א
ש
ו
 
כ
ל
 
י
מ
י
 
נ
ז
ר
ו
 
ק
ד
ו
ש
 
ה
ו
א
 
ל
י
ה
ו
ה
 
ו
כ
י
 
י
מ
ו
ת
 
מ
ת
 
ע
ל
י
ו
 
ב
פ
ת
ע
 
פ
ת
א
ם
 
ו
ט
מ
א
 
ר
א
ש
 
נ
ז
ר
ו
 
ו
ג
ל
ח
 
ר
א
ש
ו
 
ב
י
ו
ם
 
ט
ה
ר
ת
ו
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
י
ג
ל
ח
נ
ו
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
י
ב
י
א
 
ש
ת
י
 
ת
ר
י
ם
 
א
ו
 
ש
נ
י
 
ב
נ
י
 
י
ו
נ
ה
 
א
ל
 
ה
כ
ה
ן
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ע
ש
ה
 
ה
כ
ה
ן
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
א
ח
ד
 
ל
ע
ל
ה
 
ו
כ
פ
ר
 
ע
ל
י
ו
 
מ
א
ש
ר
 
ח
ט
א
 
ע
ל
 
ה
נ
פ
ש
 
ו
ק
ד
ש
 
א
ת
 
ר
א
ש
ו
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
ה
ז
י
ר
 
ל
י
ה
ו
ה
 
א
ת
 
י
מ
י
 
נ
ז
ר
ו
 
ו
ה
ב
י
א
 
כ
ב
ש
 
ב
ן
 
ש
נ
ת
ו
 
ל
א
ש
ם
 
ו
ה
י
מ
י
ם
 
ה
ר
א
י
ש
ו
נ
י
ם
 
י
פ
ל
ו
 
כ
י
 
ט
מ
א
 
נ
ז
ר
ו
 
ו
ז
א
ת
 
ת
ו
ר
ת
 
ה
נ
ז
י
ר
 
ב
י
ו
ם
 
מ
ל
א
ת
 
י
מ
י
 
נ
ז
ר
ו
 
י
ב
י
א
 
א
ת
ו
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
נ
ו
 
ל
י
ה
ו
ה
 
כ
ב
ש
 
ב
ן
 
ש
נ
ת
ו
 
ת
מ
י
ם
 
א
ח
ד
 
ל
ע
ל
ה
 
ו
כ
ב
ש
ה
 
א
ח
ת
 
ב
ת
 
ש
נ
ת
ה
 
ת
מ
י
מ
ה
 
ל
ח
ט
א
ת
 
ו
א
י
ל
 
א
ח
ד
 
ת
מ
י
ם
 
ל
ש
ל
מ
י
ם
 
ו
ס
ל
 
מ
צ
ו
ת
 
ס
ל
ת
 
ח
ל
ו
ת
 
ב
ל
ל
ו
ת
 
ב
ש
מ
ן
 
ו
ר
ק
י
ק
י
 
מ
צ
ו
ת
 
מ
ש
ח
י
ם
 
ב
ש
מ
ן
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ו
ה
ק
ר
י
ב
 
ה
כ
ה
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ע
ש
ה
 
א
ת
 
ח
ט
א
ת
ו
 
ו
א
ת
 
ע
ל
ת
ו
 
ו
א
ת
 
ה
א
י
ל
 
י
ע
ש
ה
 
ז
ב
ח
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
ע
ל
 
ס
ל
 
ה
מ
צ
ו
ת
 
ו
ע
ש
ה
 
ה
כ
ה
ן
 
א
ת
 
מ
נ
ח
ת
ו
 
ו
א
ת
 
נ
ס
כ
ו
 
ו
ג
ל
ח
 
ה
נ
ז
י
ר
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
א
ת
 
ר
א
ש
 
נ
ז
ר
ו
 
ו
ל
ק
ח
 
א
ת
 
ש
ע
ר
 
ר
א
ש
 
נ
ז
ר
ו
 
ו
נ
ת
ן
 
ע
ל
 
ה
א
ש
 
א
ש
ר
 
ת
ח
ת
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
א
ת
 
ה
ז
ר
ו
ע
 
ב
ש
ל
ה
 
מ
ן
 
ה
א
י
ל
 
ו
ח
ל
ת
 
מ
צ
ה
 
א
ח
ת
 
מ
ן
 
ה
ס
ל
 
ו
ר
ק
י
ק
 
מ
צ
ה
 
א
ח
ד
 
ו
נ
ת
ן
 
ע
ל
 
כ
פ
י
 
ה
נ
ז
י
ר
 
א
ח
ר
י
 
ה
ת
ג
ל
ח
 
א
ת
 
נ
ז
ר
ו
 
ו
ה
נ
י
ף
 
א
ת
ם
 
ה
כ
ה
ן
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ק
ד
ש
 
ה
ו
א
 
ל
כ
ה
ן
 
י
ה
י
ה
 
ע
ל
 
ח
ז
ה
 
ה
ת
נ
ו
פ
ה
 
ו
ע
ל
 
ש
ו
ק
 
ה
ת
ר
ו
מ
ה
 
ו
א
ח
ר
 
י
ש
ת
ה
 
ה
נ
ז
י
ר
 
י
י
ן
 
ז
א
ת
 
ת
ו
ר
ת
 
ה
נ
ז
י
ר
 
א
ש
ר
 
י
ד
ר
 
ק
ר
ב
נ
ו
 
ל
י
ה
ו
ה
 
ע
ל
 
נ
ז
ר
ו
 
מ
ל
ב
ד
 
א
ש
ר
 
ת
ש
י
ג
 
י
ד
ו
 
כ
פ
י
 
נ
ד
ר
ו
 
א
ש
ר
 
י
ד
ר
 
כ
ן
 
י
ע
ש
ה
 
ע
ל
 
ת
ו
ר
ת
 
נ
ז
ר
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
ב
נ
י
ו
 
ל
א
מ
ר
 
כ
ה
 
ת
ב
ר
כ
ו
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
מ
ר
 
ל
ה
ם
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
ו
י
ש
מ
ר
ך
 
י
א
י
ר
 
י
ה
ו
ה
 
פ
נ
י
ו
 
א
ל
י
ך
 
ו
י
ח
נ
ך
 
י
ש
א
 
י
ה
ו
ה
 
פ
נ
י
ו
 
א
ל
י
ך
 
ו
י
ש
ם
 
ל
ך
 
ש
ל
ו
ם
 
ו
ש
י
מ
ו
 
א
ת
 
ש
מ
י
 
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
נ
י
 
א
ב
ר
כ
ם
 
ו
י
ה
י
 
ב
י
ו
ם
 
כ
ל
ו
ת
 
מ
ש
ה
 
ל
ה
ק
י
ם
 
א
ת
 
ה
מ
ש
כ
ן
 
ו
י
מ
ש
ח
 
א
ת
ו
 
ו
י
ק
ד
ש
 
א
ת
ו
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
א
ת
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
כ
ל
 
כ
ל
י
ו
 
ו
י
מ
ש
ח
ם
 
ו
י
ק
ד
ש
 
א
ת
ם
 
ו
י
ק
ר
י
ב
ו
 
נ
ש
י
א
י
 
י
ש
ר
א
ל
 
ר
א
ש
י
 
ב
י
ת
 
א
ב
ו
ת
ם
 
ה
ם
 
נ
ש
י
א
י
 
ה
מ
ט
ו
ת
 
ה
ם
 
ה
ע
מ
ד
י
ם
 
ע
ל
 
ה
פ
ק
ד
י
ם
 
ו
י
ב
י
א
ו
 
א
ת
 
ק
ר
ב
נ
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ש
ש
 
ע
ג
ל
ו
ת
 
צ
ב
 
ו
ש
נ
י
ם
 
ע
ש
ר
 
ב
ק
ר
 
ע
ג
ל
ה
 
ע
ל
 
ש
נ
י
 
ה
נ
ש
י
א
י
ם
 
ו
ש
ו
ר
 
ל
א
ח
ד
 
ו
י
ק
ר
י
ב
ו
 
א
ת
ם
 
ל
פ
נ
י
 
ה
מ
ש
כ
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ח
 
מ
א
ת
ם
 
ו
ה
י
ו
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
נ
ת
ת
ה
 
א
ת
ם
 
א
ל
 
ה
ל
ו
י
ם
 
א
י
ש
 
כ
פ
י
 
ע
ב
ד
ת
ו
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ה
ע
ג
ל
ו
ת
 
ו
א
ת
 
ה
ב
ק
ר
 
ו
י
ת
ן
 
א
ת
ם
 
א
ל
 
ה
ל
ו
י
ם
 
א
ת
 
ש
ת
י
 
ה
ע
ג
ל
ו
ת
 
ו
א
ת
 
א
ר
ב
ע
ת
 
ה
ב
ק
ר
 
נ
ת
ן
 
ל
ב
נ
י
 
ג
ר
ש
ו
ן
 
כ
פ
י
 
ע
ב
ד
ת
ם
 
ו
א
ת
 
א
ר
ב
ע
ת
 
ה
ע
ג
ל
ו
ת
 
ו
א
ת
 
ש
מ
נ
ת
 
ה
ב
ק
ר
 
נ
ת
ן
 
ל
ב
נ
י
 
מ
ר
ר
י
 
כ
פ
י
 
ע
ב
ד
ת
ם
 
ב
י
ד
 
א
י
ת
מ
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
ל
ב
נ
י
 
ק
ה
ת
 
ל
א
 
נ
ת
ן
 
כ
י
 
ע
ב
ד
ת
 
ה
ק
ד
ש
 
ע
ל
י
ה
ם
 
ב
כ
ת
ף
 
י
ש
א
ו
 
ו
י
ק
ר
י
ב
ו
 
ה
נ
ש
י
א
י
ם
 
א
ת
 
ח
נ
כ
ת
 
ה
מ
ז
ב
ח
 
ב
י
ו
ם
 
ה
מ
ש
י
ח
 
א
ת
ו
 
ו
י
ק
ר
י
ב
ו
 
ה
נ
ש
י
א
י
ם
 
א
ת
 
ק
ר
ב
נ
ם
 
ל
פ
נ
י
 
ה
מ
ז
ב
ח
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
נ
ש
י
א
 
א
ח
ד
 
ל
י
ו
ם
 
נ
ש
י
א
 
א
ח
ד
 
ל
י
ו
ם
 
י
ק
ר
י
ב
ו
 
א
ת
 
ק
ר
ב
נ
ם
 
ל
ח
נ
כ
ת
 
ה
מ
ז
ב
ח
 
ו
י
ה
י
 
ה
מ
ק
ר
י
ב
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
א
ת
 
ק
ר
ב
נ
ו
 
נ
ח
ש
ו
ן
 
ב
ן
 
ע
מ
י
נ
ד
ב
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
נ
ח
ש
ו
ן
 
ב
ן
 
ע
מ
י
נ
ד
ב
 
ב
י
ו
ם
 
ה
ש
נ
י
 
ה
ק
ר
י
ב
 
נ
ת
נ
א
ל
 
ב
ן
 
צ
ו
ע
ר
 
נ
ש
י
א
 
י
ש
ש
כ
ר
 
ה
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
נ
ת
נ
א
ל
 
ב
ן
 
צ
ו
ע
ר
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
ז
ב
ו
ל
ן
 
א
ל
י
א
ב
 
ב
ן
 
ח
י
ל
ן
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ל
י
א
ב
 
ב
ן
 
ח
י
ל
ן
 
ב
י
ו
ם
 
ה
ר
ב
י
ע
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
ר
א
ו
ב
ן
 
א
ל
י
צ
ו
ר
 
ב
ן
 
ש
ד
י
א
ו
ר
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ל
י
צ
ו
ר
 
ב
ן
 
ש
ד
י
א
ו
ר
 
ב
י
ו
ם
 
ה
ח
מ
י
ש
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
ש
מ
ע
ו
ן
 
ש
ל
מ
י
א
ל
 
ב
ן
 
צ
ו
ר
י
ש
ד
י
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
ש
ל
מ
י
א
ל
 
ב
ן
 
צ
ו
ר
י
ש
ד
י
 
ב
י
ו
ם
 
ה
ש
ש
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
ג
ד
 
א
ל
י
ס
ף
 
ב
ן
 
ד
ע
ו
א
ל
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ל
י
ס
ף
 
ב
ן
 
ד
ע
ו
א
ל
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
א
פ
ר
י
ם
 
א
ל
י
ש
מ
ע
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ל
י
ש
מ
ע
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
מ
נ
ש
ה
 
ג
מ
ל
א
ל
 
ב
ן
 
פ
ד
ה
צ
ו
ר
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
ג
מ
ל
א
ל
 
ב
ן
 
פ
ד
ה
צ
ו
ר
 
ב
י
ו
ם
 
ה
ת
ש
ע
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
ב
נ
י
מ
י
ם
 
א
ב
י
ד
ן
 
ב
ן
 
ג
ד
ע
ו
נ
י
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ב
י
ד
ן
 
ב
ן
 
ג
ד
ע
ו
נ
י
 
ב
י
ו
ם
 
ה
ע
ש
י
ר
י
 
נ
ש
י
א
 
ל
ב
נ
י
 
ד
ן
 
א
ח
י
ע
ז
ר
 
ב
ן
 
ע
מ
י
ש
ד
י
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ח
י
ע
ז
ר
 
ב
ן
 
ע
מ
י
ש
ד
י
 
ב
י
ו
ם
 
ע
ש
ת
י
 
ע
ש
ר
 
י
ו
ם
 
נ
ש
י
א
 
ל
ב
נ
י
 
א
ש
ר
 
פ
ג
ע
א
ל
 
ב
ן
 
ע
כ
ר
ן
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
פ
ג
ע
א
ל
 
ב
ן
 
ע
כ
ר
ן
 
ב
י
ו
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
י
ו
ם
 
נ
ש
י
א
 
ל
ב
נ
י
 
נ
פ
ת
ל
י
 
א
ח
י
ר
ע
 
ב
ן
 
ע
י
נ
ן
 
ו
ק
ר
ב
נ
ו
 
ק
ע
ר
ת
 
כ
ס
ף
 
א
ח
ת
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
מ
ש
ק
ל
ה
 
מ
ז
ר
ק
 
א
ח
ד
 
כ
ס
ף
 
ש
ב
ע
י
ם
 
ש
ק
ל
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ש
נ
י
ה
ם
 
מ
ל
א
י
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
מ
נ
ח
ה
 
כ
ף
 
א
ח
ת
 
ע
ש
ר
ה
 
ז
ה
ב
 
מ
ל
א
ה
 
ק
ט
ר
ת
 
פ
ר
 
א
ח
ד
 
ב
ן
 
ב
ק
ר
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
 
א
ח
ד
 
ב
ן
 
ש
נ
ת
ו
 
ל
ע
ל
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
ל
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ב
ק
ר
 
ש
נ
י
ם
 
א
י
ל
י
ם
 
ח
מ
ש
ה
 
ע
ת
ו
ד
י
ם
 
ח
מ
ש
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ח
מ
ש
ה
 
ז
ה
 
ק
ר
ב
ן
 
א
ח
י
ר
ע
 
ב
ן
 
ע
י
נ
ן
 
ז
א
ת
 
ח
נ
כ
ת
 
ה
מ
ז
ב
ח
 
ב
י
ו
ם
 
ה
מ
ש
י
ח
 
א
ת
ו
 
מ
א
ת
 
נ
ש
י
א
י
 
י
ש
ר
א
ל
 
ק
ע
ר
ו
ת
 
כ
ס
ף
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
מ
ז
ר
ק
י
 
כ
ס
ף
 
ש
נ
י
ם
 
ע
ש
ר
 
כ
פ
ו
ת
 
ז
ה
ב
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ש
ל
ש
י
ם
 
ו
מ
א
ה
 
ה
ק
ע
ר
ה
 
ה
א
ח
ת
 
ה
כ
ס
ף
 
ו
ש
ב
ע
י
ם
 
ה
מ
ז
ר
ק
 
ה
א
ח
ד
 
כ
ל
 
כ
ס
ף
 
ה
כ
ל
י
ם
 
א
ל
פ
י
ם
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
כ
פ
ו
ת
 
ז
ה
ב
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
מ
ל
א
ו
ת
 
ק
ט
ר
ת
 
ע
ש
ר
ה
 
ע
ש
ר
ה
 
ה
כ
ף
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
כ
ל
 
ז
ה
ב
 
ה
כ
פ
ו
ת
 
ע
ש
ר
י
ם
 
ו
מ
א
ה
 
כ
ל
 
ה
ב
ק
ר
 
ל
ע
ל
ה
 
ש
נ
י
ם
 
ע
ש
ר
 
פ
ר
י
ם
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
נ
י
ם
 
ע
ש
ר
 
ו
מ
נ
ח
ת
ם
 
ו
ש
ע
י
ר
י
 
ע
ז
י
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
ל
ח
ט
א
ת
 
ו
כ
ל
 
ב
ק
ר
 
ז
ב
ח
 
ה
ש
ל
מ
י
ם
 
ע
ש
ר
י
ם
 
ו
א
ר
ב
ע
ה
 
פ
ר
י
ם
 
א
י
ל
י
ם
 
ש
ש
י
ם
 
ע
ת
ו
ד
י
ם
 
ש
ש
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
ש
י
ם
 
ז
א
ת
 
ח
נ
כ
ת
 
ה
מ
ז
ב
ח
 
א
ח
ר
י
 
ה
מ
ש
ח
 
א
ת
ו
 
ו
ב
ב
א
 
מ
ש
ה
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
ד
ב
ר
 
א
ת
ו
 
ו
י
ש
מ
ע
 
א
ת
 
ה
ק
ו
ל
 
מ
ד
ב
ר
 
א
ל
י
ו
 
מ
ע
ל
 
ה
כ
פ
ר
ת
 
א
ש
ר
 
ע
ל
 
א
ר
ו
ן
 
ה
ע
ד
ו
ת
 
מ
ב
י
ן
 
ש
נ
י
 
ה
כ
ר
ו
ב
י
ם
 
ו
י
ד
ב
ר
 
א
ל
י
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
א
ה
ר
ן
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
ב
ה
ע
ל
ו
ת
ך
 
א
ת
 
ה
נ
ר
ו
ת
 
א
ל
 
מ
ו
ל
 
פ
נ
י
 
ה
מ
נ
ו
ר
ה
 
י
א
י
ר
ו
 
ש
ב
ע
ת
 
ה
נ
ר
ו
ת
 
ו
י
ע
ש
 
כ
ן
 
א
ה
ר
ן
 
א
ל
 
מ
ו
ל
 
פ
נ
י
 
ה
מ
נ
ו
ר
ה
 
ה
ע
ל
ה
 
נ
ר
ת
י
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
ז
ה
 
מ
ע
ש
ה
 
ה
מ
נ
ו
ר
ה
 
מ
ק
ש
ה
 
ז
ה
ב
 
ע
ד
 
י
ר
כ
י
ה
 
ו
ע
ד
 
פ
ר
ח
י
ה
 
מ
ק
ש
ה
 
ה
י
א
 
כ
מ
ר
א
ה
 
א
ש
ר
 
ה
ר
א
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ע
ש
ה
 
א
ת
 
ה
מ
נ
ו
ר
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ח
 
א
ת
 
ה
ל
ו
י
ם
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ט
ה
ר
ת
 
א
ת
ם
 
ו
כ
ה
 
ת
ע
ש
ה
 
ל
ה
ם
 
ל
ט
ה
ר
ם
 
ה
ז
י
 
ע
ל
י
ה
ם
 
מ
י
 
ח
ט
א
ת
 
ו
ה
ע
ב
י
ר
ו
 
ת
ע
ר
 
ע
ל
 
כ
ל
 
ב
ש
ר
ם
 
ו
כ
ב
ס
ו
 
ב
ג
ד
י
ה
ם
 
ו
ה
ט
ה
ר
ו
 
ו
ל
ק
ח
ו
 
פ
ר
 
ב
ן
 
ב
ק
ר
 
ו
מ
נ
ח
ת
ו
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ו
פ
ר
 
ש
נ
י
 
ב
ן
 
ב
ק
ר
 
ת
ק
ח
 
ל
ח
ט
א
ת
 
ו
ה
ק
ר
ב
ת
 
א
ת
 
ה
ל
ו
י
ם
 
ל
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
ק
ה
ל
ת
 
א
ת
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
ק
ר
ב
ת
 
א
ת
 
ה
ל
ו
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ס
מ
כ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ה
ל
ו
י
ם
 
ו
ה
נ
י
ף
 
א
ה
ר
ן
 
א
ת
 
ה
ל
ו
י
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
י
ו
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
י
ה
ו
ה
 
ו
ה
ל
ו
י
ם
 
י
ס
מ
כ
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ר
א
ש
 
ה
פ
ר
י
ם
 
ו
ע
ש
ה
 
א
ת
 
ה
א
ח
ד
 
ח
ט
א
ת
 
ו
א
ת
 
ה
א
ח
ד
 
ע
ל
ה
 
ל
י
ה
ו
ה
 
ל
כ
פ
ר
 
ע
ל
 
ה
ל
ו
י
ם
 
ו
ה
ע
מ
ד
ת
 
א
ת
 
ה
ל
ו
י
ם
 
ל
פ
נ
י
 
א
ה
ר
ן
 
ו
ל
פ
נ
י
 
ב
נ
י
ו
 
ו
ה
נ
פ
ת
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
ל
י
ה
ו
ה
 
ו
ה
ב
ד
ל
ת
 
א
ת
 
ה
ל
ו
י
ם
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
י
ו
 
ל
י
 
ה
ל
ו
י
ם
 
ו
א
ח
ר
י
 
כ
ן
 
י
ב
א
ו
 
ה
ל
ו
י
ם
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ט
ה
ר
ת
 
א
ת
ם
 
ו
ה
נ
פ
ת
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
כ
י
 
נ
ת
נ
י
ם
 
נ
ת
נ
י
ם
 
ה
ם
 
ל
י
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ח
ת
 
כ
ל
 
ב
כ
ו
ר
 
פ
ט
ר
 
ר
ח
ם
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ק
ח
ת
י
 
א
ת
ם
 
ל
י
 
כ
י
 
ל
י
 
כ
ל
 
ב
כ
ו
ר
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
ב
י
ו
ם
 
ה
כ
י
ת
י
 
כ
ל
 
ב
כ
ו
ר
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ה
ק
ד
ש
ת
י
 
א
ת
ם
 
ל
י
 
ו
א
ק
ח
 
א
ת
 
ה
ל
ו
י
ם
 
ת
ח
ת
 
כ
ל
 
ב
כ
ו
ר
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ת
נ
ה
 
א
ת
 
ה
ל
ו
י
ם
 
נ
ת
נ
י
ם
 
ל
א
ה
ר
ן
 
ו
ל
ב
נ
י
ו
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
כ
פ
ר
 
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
א
 
י
ה
י
ה
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
נ
ג
ף
 
ב
ג
ש
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
ה
ק
ד
ש
 
ו
י
ע
ש
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ל
ו
י
ם
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ל
ל
ו
י
ם
 
כ
ן
 
ע
ש
ו
 
ל
ה
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ת
ח
ט
א
ו
 
ה
ל
ו
י
ם
 
ו
י
כ
ב
ס
ו
 
ב
ג
ד
י
ה
ם
 
ו
י
נ
ף
 
א
ה
ר
ן
 
א
ת
ם
 
ת
נ
ו
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
כ
פ
ר
 
ע
ל
י
ה
ם
 
א
ה
ר
ן
 
ל
ט
ה
ר
ם
 
ו
א
ח
ר
י
 
כ
ן
 
ב
א
ו
 
ה
ל
ו
י
ם
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
ם
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ל
פ
נ
י
 
א
ה
ר
ן
 
ו
ל
פ
נ
י
 
ב
נ
י
ו
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ע
ל
 
ה
ל
ו
י
ם
 
כ
ן
 
ע
ש
ו
 
ל
ה
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ז
א
ת
 
א
ש
ר
 
ל
ל
ו
י
ם
 
מ
ב
ן
 
ח
מ
ש
 
ו
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
י
ב
ו
א
 
ל
צ
ב
א
 
צ
ב
א
 
ב
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
מ
ב
ן
 
ח
מ
ש
י
ם
 
ש
נ
ה
 
י
ש
ו
ב
 
מ
צ
ב
א
 
ה
ע
ב
ד
ה
 
ו
ל
א
 
י
ע
ב
ד
 
ע
ו
ד
 
ו
ש
ר
ת
 
א
ת
 
א
ח
י
ו
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ל
ש
מ
ר
 
מ
ש
מ
ר
ת
 
ו
ע
ב
ד
ה
 
ל
א
 
י
ע
ב
ד
 
כ
כ
ה
 
ת
ע
ש
ו
 
ל
ל
ו
י
ם
 
ב
מ
ש
מ
ר
ת
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ב
ש
נ
ה
 
ה
ש
נ
י
ת
 
ל
צ
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ל
א
מ
ר
 
ו
י
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
פ
ס
ח
 
ב
מ
ו
ע
ד
י
ו
 
ב
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ב
ח
ד
ש
 
ה
ז
ה
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
י
ע
ש
ו
 
א
ת
ו
 
ב
מ
ו
ע
ד
י
ו
 
כ
כ
ל
 
ח
ק
ת
י
ו
 
ו
כ
כ
ל
 
מ
ש
פ
ט
י
ו
 
ת
ע
ש
ו
 
א
ת
ו
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ע
ש
ו
ת
 
ה
פ
ס
ח
 
ו
י
ע
ש
ו
 
א
ת
 
ה
פ
ס
ח
 
ב
ר
א
י
ש
ו
ן
 
ב
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ע
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ה
י
ו
 
א
נ
ש
י
ם
 
א
ש
ר
 
ה
י
ו
 
ט
מ
א
י
ם
 
ל
נ
פ
ש
 
א
ד
ם
 
ו
ל
א
 
י
כ
ל
ו
 
ל
ע
ש
ו
ת
 
ה
פ
ס
ח
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
י
ק
ר
ב
ו
 
ל
פ
נ
י
 
מ
ש
ה
 
ו
ל
פ
נ
י
 
א
ה
ר
ן
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
י
א
מ
ר
ו
 
ה
א
נ
ש
י
ם
 
ה
ה
ם
 
א
ל
י
ו
 
א
נ
ח
נ
ו
 
ט
מ
א
י
ם
 
ל
נ
פ
ש
 
א
ד
ם
 
ל
מ
ה
 
נ
ג
ר
ע
 
ל
ב
ל
ת
י
 
ה
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
ן
 
י
ה
ו
ה
 
ב
מ
ו
ע
ד
י
ו
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
ש
ה
 
ע
מ
ד
ו
 
ו
א
ש
מ
ע
ה
 
מ
ה
 
י
צ
ו
ה
 
י
ה
ו
ה
 
ל
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
א
י
ש
 
א
י
ש
 
כ
י
 
י
ה
י
ה
 
ט
מ
א
 
ל
נ
פ
ש
 
א
ו
 
ב
ד
ר
ך
 
ר
ח
ו
ק
ה
 
ל
כ
ם
 
א
ו
 
ל
ד
ר
ת
י
כ
ם
 
ו
ע
ש
ה
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
ב
ח
ד
ש
 
ה
ש
נ
י
 
ב
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
י
ע
ש
ו
 
א
ת
ו
 
ע
ל
 
מ
צ
ו
ת
 
ו
מ
ר
ר
י
ם
 
י
א
כ
ל
ה
ו
 
ל
א
 
י
ש
א
י
ר
ו
 
מ
מ
נ
ו
 
ע
ד
 
ב
ק
ר
 
ו
ע
צ
ם
 
ל
א
 
י
ש
ב
ר
ו
 
ב
ו
 
כ
כ
ל
 
ח
ק
ו
ת
 
ה
פ
ס
ח
 
י
ע
ש
ו
 
א
ת
ו
 
ו
ה
א
י
ש
 
א
ש
ר
 
ה
ו
א
 
ט
ה
ו
ר
 
ו
ב
ד
ר
ך
 
ל
א
 
ה
י
ה
 
ו
ח
ד
ל
 
ל
ע
ש
ו
ת
 
ה
פ
ס
ח
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ע
מ
י
ה
 
כ
י
 
ק
ר
ב
ן
 
י
ה
ו
ה
 
ל
א
 
ה
ק
ר
י
ב
 
ב
מ
ו
ע
ד
י
ו
 
ח
ט
א
ו
 
י
ש
א
 
ה
א
י
ש
 
ה
ה
ו
א
 
ו
כ
י
 
י
ג
ו
ר
 
א
ת
כ
ם
 
ג
ר
 
ו
ע
ש
ה
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
כ
ח
ק
ו
ת
 
ה
פ
ס
ח
 
ו
כ
מ
ש
פ
ט
י
ו
 
כ
ן
 
י
ע
ש
ה
 
ח
ק
ה
 
א
ח
ת
 
י
ה
י
ה
 
ל
כ
ם
 
ו
ל
ג
ר
 
ו
ל
א
ז
ר
ח
 
ה
א
ר
ץ
 
ו
ב
י
ו
ם
 
ה
ו
ק
ם
 
א
ת
 
ה
מ
ש
כ
ן
 
כ
ס
ה
 
ה
ע
נ
ן
 
א
ת
 
ה
מ
ש
כ
ן
 
ל
א
ה
ל
 
ה
ע
ד
ו
ת
 
ו
ב
ע
ר
ב
 
י
ה
י
ה
 
ע
ל
 
ה
מ
ש
כ
ן
 
כ
מ
ר
א
ה
 
א
ש
 
ע
ד
 
ב
ק
ר
 
כ
ן
 
י
ה
י
ה
 
ת
מ
י
ד
 
ה
ע
נ
ן
 
י
כ
ס
נ
ו
 
ו
מ
ר
א
ה
 
א
ש
 
ל
י
ל
ה
 
ו
ל
פ
י
 
ה
ע
ל
ו
ת
 
ה
ע
נ
ן
 
מ
ע
ל
 
ה
א
ה
ל
 
ו
א
ח
ר
י
 
כ
ן
 
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ש
כ
ן
 
ש
ם
 
ה
ע
נ
ן
 
ש
ם
 
י
ח
נ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ע
ל
 
פ
י
 
י
ה
ו
ה
 
י
ח
נ
ו
 
כ
ל
 
י
מ
י
 
א
ש
ר
 
י
ש
כ
ן
 
ה
ע
נ
ן
 
ע
ל
 
ה
מ
ש
כ
ן
 
י
ח
נ
ו
 
ו
ב
ה
א
ר
י
ך
 
ה
ע
נ
ן
 
ע
ל
 
ה
מ
ש
כ
ן
 
י
מ
י
ם
 
ר
ב
י
ם
 
ו
ש
מ
ר
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
מ
ש
מ
ר
ת
 
י
ה
ו
ה
 
ו
ל
א
 
י
ס
ע
ו
 
ו
י
ש
 
א
ש
ר
 
י
ה
י
ה
 
ה
ע
נ
ן
 
י
מ
י
ם
 
ב
מ
ס
פ
ר
 
ע
ל
 
ה
מ
ש
כ
ן
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
י
ח
נ
ו
 
ו
ע
ל
 
פ
י
 
י
ה
ו
ה
 
י
ס
ע
ו
 
ו
י
ש
 
א
ש
ר
 
י
ה
י
ה
 
ה
ע
נ
ן
 
מ
ע
ר
ב
 
ע
ד
 
ב
ק
ר
 
ו
נ
ע
ל
ה
 
ה
ע
נ
ן
 
ב
ב
ק
ר
 
ו
נ
ס
ע
ו
 
א
ו
 
י
ו
מ
ם
 
ו
ל
י
ל
ה
 
ו
נ
ע
ל
ה
 
ה
ע
נ
ן
 
ו
נ
ס
ע
ו
 
א
ו
 
י
ו
מ
י
ם
 
א
ו
 
ח
ד
ש
 
א
ו
 
י
מ
י
ם
 
ב
ה
א
ר
י
ך
 
ה
ע
נ
ן
 
ע
ל
 
ה
מ
ש
כ
ן
 
ל
ש
כ
ן
 
ע
ל
י
ו
 
י
ח
נ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
א
 
י
ס
ע
ו
 
ו
ב
ה
ע
ל
ו
ת
ו
 
י
ס
ע
ו
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
י
ח
נ
ו
 
ו
ע
ל
 
פ
י
 
י
ה
ו
ה
 
י
ס
ע
ו
 
א
ת
 
מ
ש
מ
ר
ת
 
י
ה
ו
ה
 
ש
מ
ר
ו
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ע
ש
ה
 
ל
ך
 
ש
ת
י
 
ח
צ
צ
ר
ו
ת
 
כ
ס
ף
 
מ
ק
ש
ה
 
ת
ע
ש
ה
 
א
ת
ם
 
ו
ה
י
ו
 
ל
ך
 
ל
מ
ק
ר
א
 
ה
ע
ד
ה
 
ו
ל
מ
ס
ע
 
א
ת
 
ה
מ
ח
נ
ו
ת
 
ו
ת
ק
ע
ו
 
ב
ה
ן
 
ו
נ
ו
ע
ד
ו
 
א
ל
י
ך
 
כ
ל
 
ה
ע
ד
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ם
 
ב
א
ח
ת
 
י
ת
ק
ע
ו
 
ו
נ
ו
ע
ד
ו
 
א
ל
י
ך
 
ה
נ
ש
י
א
י
ם
 
ר
א
ש
י
 
א
ל
פ
י
 
י
ש
ר
א
ל
 
ו
ת
ק
ע
ת
ם
 
ת
ר
ו
ע
ה
 
ו
נ
ס
ע
ו
 
ה
מ
ח
נ
ו
ת
 
ה
ח
נ
י
ם
 
ק
ד
מ
ה
 
ו
ת
ק
ע
ת
ם
 
ת
ר
ו
ע
ה
 
ש
נ
י
ת
 
ו
נ
ס
ע
ו
 
ה
מ
ח
נ
ו
ת
 
ה
ח
נ
י
ם
 
צ
פ
ו
נ
ה
 
ת
ר
ו
ע
ה
 
י
ת
ק
ע
ו
 
ל
מ
ס
ע
י
ה
ם
 
ו
ב
ה
ק
ה
ל
 
א
ת
 
ה
ק
ה
ל
 
ת
ת
ק
ע
ו
 
ו
ל
א
 
ת
ר
י
ע
ו
 
ו
ב
נ
י
 
א
ה
ר
ן
 
ה
כ
ה
נ
י
ם
 
י
ת
ק
ע
ו
 
ב
ח
צ
צ
ר
ו
ת
 
ו
ה
י
ו
 
ל
כ
ם
 
ל
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ו
כ
י
 
ת
ב
א
ו
 
מ
ל
ח
מ
ה
 
ב
א
ר
צ
כ
ם
 
ע
ל
 
ה
צ
ר
 
ה
צ
ר
ר
 
א
ת
כ
ם
 
ו
ה
ר
ע
ת
ם
 
ב
ח
צ
צ
ר
ו
ת
 
ו
נ
ז
כ
ר
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
נ
ו
ש
ע
ת
ם
 
מ
א
י
ב
י
כ
ם
 
ו
ב
י
ו
ם
 
ש
מ
ח
ת
י
כ
ם
 
ו
ב
מ
ו
ע
ד
י
כ
ם
 
ו
ב
ר
א
ש
י
 
ח
ד
ש
י
כ
ם
 
ו
ת
ק
ע
ת
ם
 
ב
ח
צ
צ
ר
ו
ת
 
ע
ל
 
ע
ל
ת
י
כ
ם
 
ו
ע
ל
 
ז
ב
ח
י
 
ש
ל
מ
י
כ
ם
 
ו
ה
י
ו
 
ל
כ
ם
 
ל
ז
כ
ר
ו
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ר
ב
 
ל
כ
ם
 
ש
ב
ת
 
ב
ה
ר
 
ה
ז
ה
 
פ
נ
ו
 
ו
ס
ע
ו
 
ל
כ
ם
 
ו
ב
א
ו
 
ה
ר
 
ה
א
מ
ר
י
 
ו
א
ל
 
כ
ל
 
ש
כ
י
נ
ו
 
ב
ע
ר
ב
ה
 
ב
ה
ר
 
ו
ב
ש
פ
ל
ה
 
ב
נ
ג
ב
 
ו
ב
ח
ו
ף
 
ה
י
ם
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ו
ה
ל
ב
נ
ו
ן
 
ע
ד
 
ה
נ
ה
ר
 
ה
ג
ד
ו
ל
 
נ
ה
ר
 
פ
ר
ת
 
ר
א
ו
 
נ
ת
ת
י
 
ל
פ
נ
י
כ
ם
 
א
ת
 
ה
א
ר
ץ
 
ב
א
ו
 
ו
ר
ש
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ת
י
כ
ם
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ל
ת
ת
 
ל
ז
ר
ע
ם
 
א
ח
ר
י
ה
ם
 
ו
י
ה
י
 
ב
ש
נ
ה
 
ה
ש
נ
י
ת
 
ב
ח
ד
ש
 
ה
ש
נ
י
 
ב
ע
ש
ר
י
ם
 
ב
ח
ד
ש
 
נ
ע
ל
ה
 
ה
ע
נ
ן
 
מ
ע
ל
 
מ
ש
כ
ן
 
ה
ע
ד
ו
ת
 
ו
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
מ
ס
ע
י
ה
ם
 
מ
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ש
כ
ן
 
ה
ע
נ
ן
 
ב
מ
ד
ב
ר
 
פ
ר
א
ן
 
ו
י
ס
ע
ו
 
ב
ר
א
י
ש
ו
נ
ה
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ו
י
ס
ע
 
ד
ג
ל
 
מ
ח
נ
ה
 
ב
נ
י
 
י
ה
ו
ד
ה
 
ב
ר
א
י
ש
ו
נ
ה
 
ל
צ
ב
א
ת
ם
 
ו
ע
ל
 
צ
ב
א
ו
 
נ
ח
ש
ו
ן
 
ב
ן
 
ע
מ
י
נ
ד
ב
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
י
ש
ש
כ
ר
 
נ
ת
נ
א
ל
 
ב
ן
 
צ
ו
ע
ר
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
ז
ב
ו
ל
ן
 
א
ל
י
א
ב
 
ב
ן
 
ח
י
ל
ן
 
ו
ה
ו
ר
ד
 
ה
מ
ש
כ
ן
 
ו
נ
ס
ע
ו
 
ב
נ
י
 
ג
ר
ש
ו
ן
 
ו
ב
נ
י
 
מ
ר
ר
י
 
נ
ש
א
י
 
ה
מ
ש
כ
ן
 
ו
נ
ס
ע
 
ד
ג
ל
 
מ
ח
נ
ה
 
ב
נ
י
 
ר
א
ו
ב
ן
 
ל
צ
ב
א
ת
ם
 
ו
ע
ל
 
צ
ב
א
ו
 
א
ל
י
צ
ו
ר
 
ב
ן
 
ש
ד
י
א
ו
ר
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
ש
מ
ע
ו
ן
 
ש
ל
מ
י
א
ל
 
ב
ן
 
צ
ו
ר
י
ש
ד
י
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
ג
ד
 
א
ל
י
ס
ף
 
ב
ן
 
ד
ע
ו
א
ל
 
ו
נ
ס
ע
ו
 
ה
ק
ה
ת
י
ם
 
נ
ש
א
י
 
ה
מ
ק
ד
ש
 
ו
ה
ק
י
מ
ו
 
א
ת
 
ה
מ
ש
כ
ן
 
ע
ד
 
ב
א
ם
 
ו
נ
ס
ע
 
ד
ג
ל
 
מ
ח
נ
ה
 
ב
נ
י
 
א
פ
ר
י
ם
 
ל
צ
ב
א
ת
ם
 
ו
ע
ל
 
צ
ב
א
ו
 
א
ל
י
ש
מ
ע
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
מ
נ
ש
ה
 
ג
מ
ל
א
ל
 
ב
ן
 
פ
ד
ה
צ
ו
ר
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
ב
נ
י
מ
י
ם
 
א
ב
י
ד
ן
 
ב
ן
 
ג
ד
ע
ו
נ
י
 
ו
נ
ס
ע
 
ד
ג
ל
 
מ
ח
נ
ה
 
ב
נ
י
 
ד
ן
 
מ
א
ס
ף
 
ל
כ
ל
 
ה
מ
ח
נ
ו
ת
 
ל
צ
ב
א
ת
ם
 
ו
ע
ל
 
צ
ב
א
ו
 
א
ח
י
ע
ז
ר
 
ב
ן
 
ע
מ
י
ש
ד
י
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
א
ש
ר
 
פ
ג
ע
א
ל
 
ב
ן
 
ע
כ
ר
ן
 
ו
ע
ל
 
צ
ב
א
 
מ
ט
ה
 
ב
נ
י
 
נ
פ
ת
ל
י
 
א
ח
י
ר
ע
 
ב
ן
 
ע
י
נ
ן
 
א
ל
ה
 
מ
ס
ע
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
צ
ב
א
ת
ם
 
ו
י
ס
ע
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
ח
ו
ב
ב
 
ב
ן
 
ר
ע
ו
א
ל
 
ה
מ
ד
י
נ
י
 
ח
ת
ן
 
מ
ש
ה
 
נ
ס
ע
י
ם
 
א
נ
ח
נ
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
א
מ
ר
 
י
ה
ו
ה
 
א
ת
ו
 
א
ת
ן
 
ל
כ
ם
 
ל
ך
 
א
ת
נ
ו
 
ו
ה
ט
י
ב
נ
ו
 
ל
ך
 
כ
י
 
י
ה
ו
ה
 
ד
ב
ר
 
ט
ו
ב
 
ע
ל
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ל
א
 
א
ל
ך
 
כ
י
 
א
ם
 
א
ל
 
א
ר
צ
י
 
ו
א
ל
 
מ
ו
ל
ד
ת
י
 
א
ל
ך
 
ו
י
א
מ
ר
 
א
ל
 
נ
א
 
ת
ע
ז
ב
 
א
ת
נ
ו
 
כ
י
 
ע
ל
 
כ
ן
 
י
ד
ע
ת
 
ח
נ
ת
י
נ
ו
 
ב
מ
ד
ב
ר
 
ו
ה
י
י
ת
 
ל
נ
ו
 
ל
ע
י
נ
י
ם
 
ו
ה
י
ה
 
כ
י
 
ת
ל
ך
 
ע
מ
נ
ו
 
ו
ה
י
ה
 
ה
ט
ו
ב
 
ה
ה
ו
א
 
א
ש
ר
 
י
י
ט
ב
 
י
ה
ו
ה
 
ע
מ
נ
ו
 
ו
ה
ט
י
ב
נ
ו
 
ל
ך
 
ו
י
ס
ע
ו
 
מ
ה
ר
 
י
ה
ו
ה
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ו
א
ר
ו
ן
 
ב
ר
י
ת
 
י
ה
ו
ה
 
נ
ס
ע
 
ל
פ
נ
י
ה
ם
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ל
ת
ו
ר
 
ל
ה
ם
 
מ
נ
ו
ח
ה
 
ו
ע
נ
ן
 
י
ה
ו
ה
 
ע
ל
י
ה
ם
 
י
ו
מ
ם
 
ב
נ
ס
ע
ם
 
מ
ן
 
ה
מ
ח
נ
ה
 
ו
י
ה
י
 
ב
נ
ס
ע
 
ה
א
ר
ו
ן
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ק
ו
מ
ה
 
י
ה
ו
ה
 
ו
י
פ
ו
צ
ו
 
א
י
ב
י
ך
 
ו
י
נ
ס
ו
 
מ
ש
נ
א
י
ך
 
מ
פ
נ
י
ך
 
ו
ב
מ
נ
ו
ח
ה
 
י
א
מ
ר
 
ש
ו
ב
ה
 
י
ה
ו
ה
 
ר
ב
ב
ו
ת
 
א
ל
פ
י
 
י
ש
ר
א
ל
 
ו
י
ה
י
 
ה
ע
ם
 
כ
מ
ת
א
נ
נ
י
ם
 
ר
ע
 
ב
א
ז
נ
י
 
י
ה
ו
ה
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
ו
י
ח
ר
 
א
פ
ו
 
ו
ת
ב
ע
ר
 
ב
ם
 
א
ש
 
י
ה
ו
ה
 
ו
ת
א
כ
ל
 
ב
ק
צ
ה
 
ה
מ
ח
נ
ה
 
ו
י
צ
ע
ק
 
ה
ע
ם
 
א
ל
 
מ
ש
ה
 
ו
י
ת
פ
ל
ל
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ו
ת
ש
ק
ע
 
ה
א
ש
 
ו
י
ק
ר
א
 
ש
ם
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
ת
ב
ע
ר
ה
 
כ
י
 
ב
ע
ר
ה
 
ב
ם
 
א
ש
 
י
ה
ו
ה
 
ו
ה
ס
פ
ס
ף
 
א
ש
ר
 
ב
ק
ר
ב
ו
 
ה
ת
א
ו
ו
 
ת
א
ו
ה
 
ו
י
ש
ב
ו
 
ו
י
ב
כ
ו
 
ג
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
ו
 
מ
י
 
י
א
כ
י
ל
נ
ו
 
ב
ש
ר
 
ז
כ
ר
נ
ו
 
א
ת
 
ה
ד
ג
ה
 
א
ש
ר
 
נ
א
כ
ל
 
ב
מ
צ
ר
י
ם
 
ח
נ
ם
 
א
ת
 
ה
ק
ש
ו
א
י
ם
 
ו
א
ת
 
ה
ב
ט
ח
י
ם
 
ו
א
ת
 
ה
ח
צ
י
ר
 
ו
א
ת
 
ה
ב
צ
ל
י
ם
 
ו
א
ת
 
ה
ש
ו
מ
י
ם
 
ו
ע
ת
ה
 
נ
פ
ש
נ
ו
 
י
ב
ש
ה
 
א
י
ן
 
כ
ל
 
ב
ל
ת
י
 
א
ל
 
ה
מ
ן
 
ע
י
נ
נ
ו
 
ו
ה
מ
ן
 
כ
ז
ר
ע
 
ג
ד
 
ה
ו
א
 
ו
ע
י
נ
ו
 
כ
ע
י
ן
 
ה
ב
ד
ל
ח
 
ש
ט
ו
 
ה
ע
ם
 
ו
ל
ק
ט
ו
 
ו
ט
ח
נ
ו
 
ב
ר
ח
י
ם
 
ו
ד
כ
ו
 
ב
מ
ד
ו
כ
ה
 
ו
ב
ש
ל
ו
 
ב
פ
ר
ו
ר
 
ו
ע
ש
ו
 
א
ת
ו
 
ע
ג
ו
ת
 
ו
ה
י
ה
 
ט
ע
מ
ו
 
כ
ט
ע
ם
 
ל
ש
ד
 
ה
ש
מ
ן
 
ו
ב
ר
ד
ת
 
ה
ט
ל
 
ע
ל
 
ה
מ
ח
נ
ה
 
ל
י
ל
ה
 
י
ר
ד
 
ה
מ
ן
 
ע
ל
י
ו
 
ו
י
ש
מ
ע
 
מ
ש
ה
 
א
ת
 
ה
ע
ם
 
ב
כ
ה
 
ל
מ
ש
פ
ח
ת
י
ו
 
א
י
ש
 
ל
פ
ת
ח
 
א
ה
ל
ו
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
מ
א
ד
 
ו
ב
ע
י
נ
י
 
מ
ש
ה
 
ר
ע
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ל
מ
ה
 
ה
ר
ע
ת
 
ל
ע
ב
ד
ך
 
ו
ל
מ
ה
 
ל
א
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ל
ש
י
ם
 
א
ת
 
מ
ש
א
 
כ
ל
 
ה
ע
ם
 
ה
ז
ה
 
ע
ל
י
 
ה
א
נ
כ
י
 
ה
ר
ת
י
 
א
ת
 
כ
ל
 
ה
ע
ם
 
ה
ז
ה
 
א
ם
 
א
נ
כ
י
 
י
ל
ד
ת
י
ו
 
כ
י
 
ת
א
מ
ר
 
א
ל
י
 
ש
א
ה
ו
 
ב
ח
י
ק
ך
 
כ
א
ש
ר
 
י
ש
א
 
ה
א
מ
ן
 
א
ת
 
ה
י
נ
ק
 
א
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
ת
 
ל
א
ב
ת
י
ו
 
מ
א
י
ן
 
ל
י
 
ב
ש
ר
 
ל
ת
ת
 
ל
כ
ל
 
ה
ע
ם
 
ה
ז
ה
 
כ
י
 
י
ב
כ
ו
 
ע
ל
י
 
ל
א
מ
ר
 
ת
נ
ה
 
ל
נ
ו
 
ב
ש
ר
 
ו
נ
א
כ
ל
 
ל
א
 
א
ו
כ
ל
 
א
נ
כ
י
 
ל
ב
ד
י
 
ל
ש
א
ת
 
א
ת
 
כ
ל
 
ה
ע
ם
 
ה
ז
ה
 
כ
י
 
כ
ב
ד
 
מ
מ
נ
י
 
ו
א
ם
 
כ
כ
ה
 
א
ת
ה
 
ע
ש
ה
 
ל
י
 
ה
ר
ג
נ
י
 
נ
א
 
ה
ר
ג
 
ו
א
ם
 
מ
צ
א
ת
י
 
ח
ן
 
ב
ע
י
נ
י
ך
 
ו
א
ל
 
א
ר
א
ה
 
ב
ר
ע
ת
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ס
פ
ה
 
ל
י
 
ש
ב
ע
י
ם
 
א
י
ש
 
מ
ז
ק
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
י
ד
ע
ת
 
כ
י
 
ה
ם
 
ז
ק
נ
י
 
ה
ע
ם
 
ו
ש
ו
ט
ר
י
ו
 
ו
ל
ק
ח
ת
 
א
ת
ם
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
ת
י
צ
ב
ו
 
ש
ם
 
ע
מ
ך
 
ו
י
ר
ד
ת
י
 
ו
ד
ב
ר
ת
י
 
ע
מ
ך
 
ש
ם
 
ו
ה
צ
ל
ת
י
 
מ
ן
 
ה
ר
ו
ח
 
א
ש
ר
 
ע
ל
י
ך
 
ו
ש
מ
ת
י
 
ע
ל
י
ה
ם
 
ו
נ
ש
א
ו
 
א
ת
ך
 
ב
מ
ש
א
 
ה
ע
ם
 
ו
ל
א
 
ת
ש
א
 
א
ת
ה
 
ל
ב
ד
ך
 
ו
א
ל
 
ה
ע
ם
 
ת
א
מ
ר
 
ה
ת
ק
ד
ש
ו
 
ל
מ
ח
ר
 
ו
א
כ
ל
ת
ם
 
ב
ש
ר
 
כ
י
 
ב
כ
י
ת
ם
 
ב
א
ז
נ
י
 
י
ה
ו
ה
 
ל
א
מ
ר
 
מ
י
 
י
א
כ
י
ל
נ
ו
 
ב
ש
ר
 
כ
י
 
ט
ו
ב
 
ל
נ
ו
 
ב
מ
צ
ר
י
ם
 
ו
נ
ת
ן
 
י
ה
ו
ה
 
ל
כ
ם
 
ב
ש
ר
 
ו
א
כ
ל
ת
ם
 
ל
א
 
י
ו
ם
 
א
ח
ד
 
ת
א
כ
ל
ו
ן
 
ו
ל
א
 
י
ו
מ
י
ם
 
ו
ל
א
 
ח
מ
ש
ה
 
י
מ
י
ם
 
ו
ל
א
 
ע
ש
ר
ה
 
י
מ
י
ם
 
ו
ל
א
 
ע
ש
ר
י
ם
 
י
ו
ם
 
ע
ד
 
ח
ד
ש
 
י
מ
י
ם
 
ע
ד
 
א
ש
ר
 
י
צ
א
 
מ
א
פ
כ
ם
 
ו
ה
י
ה
 
ל
כ
ם
 
ל
ז
ר
ה
 
י
ע
ן
 
כ
י
 
מ
א
ס
ת
ם
 
א
ת
 
י
ה
ו
ה
 
א
ש
ר
 
ב
ק
ר
ב
כ
ם
 
ו
ת
ב
כ
ו
 
ל
פ
נ
י
ו
 
ל
א
מ
ר
 
ל
מ
ה
 
ז
ה
 
י
צ
א
נ
ו
 
מ
מ
צ
ר
י
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ר
ג
ל
א
י
 
ה
ע
ם
 
א
ש
ר
 
א
נ
כ
י
 
ב
ק
ר
ב
ו
 
ו
א
ת
ה
 
א
מ
ר
ת
 
ב
ש
ר
 
א
ת
ן
 
ל
ה
ם
 
ו
א
כ
ל
ו
 
ח
ד
ש
 
י
מ
י
ם
 
ה
צ
א
ן
 
ו
ה
ב
ק
ר
 
י
ש
ח
ט
 
ל
ה
ם
 
ו
מ
צ
א
 
ל
ה
ם
 
א
ם
 
א
ת
 
כ
ל
 
ד
ג
י
 
ה
י
ם
 
י
א
ס
ף
 
ל
ה
ם
 
ו
מ
צ
א
 
ל
ה
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
י
ד
 
י
ה
ו
ה
 
ת
ק
צ
ר
 
א
ת
ה
 
ת
ר
א
ה
 
ה
י
ק
ר
ך
 
ד
ב
ר
י
 
א
ם
 
ל
א
 
ו
י
צ
א
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
א
ל
 
ה
ע
ם
 
א
ת
 
ד
ב
ר
י
 
י
ה
ו
ה
 
ו
י
א
ס
ף
 
ש
ב
ע
י
ם
 
א
י
ש
 
מ
ז
ק
נ
י
 
ה
ע
ם
 
ו
י
ע
מ
ד
 
א
ת
ם
 
ס
ב
י
ב
ת
 
ה
א
ה
ל
 
ו
י
ר
ד
 
י
ה
ו
ה
 
ב
ע
נ
ן
 
ו
י
ד
ב
ר
 
א
ל
י
ו
 
ו
י
צ
ל
 
מ
ן
 
ה
ר
ו
ח
 
א
ש
ר
 
ע
ל
י
ו
 
ו
י
ת
ן
 
ע
ל
 
ש
ב
ע
י
ם
 
א
י
ש
 
ה
ז
ק
נ
י
ם
 
ו
י
ה
י
 
כ
נ
ו
ח
 
ע
ל
י
ה
ם
 
ה
ר
ו
ח
 
ו
י
ת
נ
א
ב
ו
 
ו
ל
א
 
י
א
ס
פ
ו
 
ו
י
ש
א
ר
ו
 
ש
נ
י
 
א
נ
ש
י
ם
 
ב
מ
ח
נ
ה
 
ש
ם
 
ה
א
ח
ד
 
א
ל
ד
ד
 
ו
ש
ם
 
ה
ש
נ
י
 
מ
ו
ד
ד
 
ו
ת
נ
ח
 
ע
ל
י
ה
ם
 
ה
ר
ו
ח
 
ו
ה
ם
 
ב
כ
ת
ו
ב
י
ם
 
ו
ל
א
 
י
צ
א
ו
 
ה
א
ה
ל
ה
 
ו
י
ת
נ
א
ב
ו
 
ב
מ
ח
נ
ה
 
ו
י
ר
ץ
 
ה
נ
ע
ר
 
ו
י
ג
ד
 
ל
מ
ש
ה
 
ו
י
א
מ
ר
 
א
ל
ד
ד
 
ו
מ
ו
ד
ד
 
מ
ת
נ
א
ב
י
ם
 
ב
מ
ח
נ
ה
 
ו
י
ע
ן
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
מ
ש
ר
ת
 
מ
ש
ה
 
מ
ב
ח
י
ר
י
ו
 
ו
י
א
מ
ר
 
א
ד
נ
י
 
מ
ש
ה
 
כ
ל
א
ם
 
ו
י
א
מ
ר
 
ל
ו
 
מ
ש
ה
 
ה
מ
ק
נ
א
 
א
ת
ה
 
ל
י
 
ו
מ
י
 
י
ת
ן
 
כ
ל
 
ע
ם
 
י
ה
ו
ה
 
נ
ב
י
א
י
ם
 
כ
י
 
י
ת
ן
 
י
ה
ו
ה
 
א
ת
 
ר
ו
ח
ו
 
ע
ל
י
ה
ם
 
ו
י
א
ס
ף
 
מ
ש
ה
 
א
ל
 
ה
מ
ח
נ
ה
 
ה
ו
א
 
ו
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
ר
ו
ח
 
נ
ס
ע
 
מ
א
ת
 
י
ה
ו
ה
 
ו
י
ג
ז
 
ש
ל
ו
י
 
מ
ן
 
ה
י
ם
 
ו
י
ט
ש
 
א
ל
 
ה
מ
ח
נ
ה
 
כ
ד
ר
ך
 
י
ו
ם
 
כ
ה
 
ו
כ
ד
ר
ך
 
י
ו
ם
 
כ
ה
 
ס
ב
י
ב
ת
 
ה
מ
ח
נ
ה
 
ו
כ
א
מ
ת
י
ם
 
ע
ל
 
פ
נ
י
 
ה
א
ר
ץ
 
ו
י
ק
ם
 
ה
ע
ם
 
כ
ל
 
ה
י
ו
ם
 
ה
ה
ו
א
 
ו
כ
ל
 
ה
ל
י
ל
ה
 
ו
כ
ל
 
ה
י
ו
ם
 
ה
מ
ח
ר
ת
 
ו
י
א
ס
פ
ו
 
א
ת
 
ה
ש
ל
ו
י
 
ה
מ
מ
ע
י
ט
 
א
ס
ף
 
ע
ש
ר
ה
 
ח
מ
ר
י
ם
 
ו
י
ש
ח
ט
ו
 
ל
ה
ם
 
ש
ח
ו
ט
 
ס
ב
י
ב
ת
 
ה
מ
ח
נ
ה
 
ה
ב
ש
ר
 
ע
ו
ד
נ
ו
 
ב
י
ן
 
ש
נ
י
ה
ם
 
ט
ר
ם
 
י
כ
ר
ת
 
ו
א
ף
 
י
ה
ו
ה
 
ח
ר
ה
 
ב
ע
ם
 
ו
י
ך
 
י
ה
ו
ה
 
ב
ע
ם
 
מ
כ
ה
 
ר
ב
ה
 
מ
א
ד
 
ו
י
ק
ר
א
 
ש
ם
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
ק
ב
ר
ו
ת
 
ה
ת
א
ו
ה
 
כ
י
 
ש
ם
 
ק
ב
ר
ו
 
א
ת
 
ה
ע
ם
 
ה
מ
ת
א
ו
י
ם
 
מ
ק
ב
ר
ו
ת
 
ה
ת
א
ו
ה
 
נ
ס
ע
ו
 
ה
ע
ם
 
ה
ח
צ
ר
ו
ת
 
ו
י
ה
י
ו
 
ב
ח
צ
ר
ו
ת
 
ו
ת
ד
ב
ר
 
מ
ר
י
ם
 
ו
א
ה
ר
ן
 
ב
מ
ש
ה
 
ע
ל
 
א
ד
ו
ת
 
ה
א
ש
ה
 
ה
כ
ש
י
ת
 
א
ש
ר
 
ל
ק
ח
 
כ
י
 
א
ש
ה
 
כ
ש
י
ת
 
ל
ק
ח
 
ו
י
א
מ
ר
ו
 
ה
ר
ק
 
א
ך
 
ב
מ
ש
ה
 
ד
ב
ר
 
י
ה
ו
ה
 
ה
ל
ו
א
 
ג
ם
 
ב
נ
ו
 
ד
ב
ר
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
ו
ה
א
י
ש
 
מ
ש
ה
 
ע
נ
ו
 
מ
א
ד
 
מ
כ
ל
 
ה
א
ד
ם
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
פ
ת
א
ם
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
מ
ר
י
ם
 
צ
א
ו
 
ש
ל
ש
ת
כ
ם
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
צ
א
ו
 
ש
ל
ש
ת
ם
 
ו
י
ר
ד
 
י
ה
ו
ה
 
ב
ע
מ
ו
ד
 
ה
ע
נ
ן
 
ו
י
ע
מ
ד
 
פ
ת
ח
 
ה
א
ה
ל
 
ו
י
ק
ר
א
 
א
ה
ר
ן
 
ו
מ
ר
י
ם
 
ו
י
צ
א
ו
 
ש
נ
י
ה
ם
 
ו
י
א
מ
ר
 
ש
מ
ע
ו
 
נ
א
 
ד
ב
ר
י
 
א
ם
 
י
ה
י
ה
 
נ
ב
י
א
כ
ם
 
י
ה
ו
ה
 
ב
מ
ר
א
ה
 
א
ל
י
ו
 
ה
ת
ו
ד
ע
 
ו
ב
ח
ל
ו
ם
 
א
ד
ב
ר
 
ב
ו
 
ל
א
 
כ
ן
 
ע
ב
ד
י
 
מ
ש
ה
 
ב
כ
ל
 
ב
י
ת
י
 
נ
א
מ
ן
 
ה
ו
א
 
פ
ה
 
א
ל
 
פ
ה
 
א
ד
ב
ר
 
ב
ו
 
ב
מ
ר
א
ה
 
ו
ל
א
 
ב
ח
י
ד
ת
 
ו
ת
מ
ו
נ
ת
 
י
ה
ו
ה
 
י
ב
י
ט
 
ו
מ
ד
ו
ע
 
ל
א
 
י
ר
א
ת
ם
 
ל
ד
ב
ר
 
ב
ע
ב
ד
י
 
ב
מ
ש
ה
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ב
ם
 
ו
י
ל
ך
 
ו
ה
ע
נ
ן
 
ס
ר
 
מ
ע
ל
 
ה
א
ה
ל
 
ו
ה
נ
ה
 
מ
ר
י
ם
 
מ
צ
ר
ע
ת
 
כ
ש
ל
ג
 
ו
י
פ
ן
 
א
ה
ר
ן
 
א
ל
 
מ
ר
י
ם
 
ו
ה
נ
ה
 
מ
צ
ר
ע
ת
 
ו
י
א
מ
ר
 
א
ה
ר
ן
 
א
ל
 
מ
ש
ה
 
ב
י
 
א
ד
נ
י
 
א
ל
 
נ
א
 
ת
ש
י
ת
 
ע
ל
י
נ
ו
 
ח
ט
א
ת
 
א
ש
ר
 
נ
ו
א
ל
נ
ו
 
ו
א
ש
ר
 
ח
ט
א
נ
ו
 
א
ל
 
נ
א
 
ת
ה
י
ה
 
כ
מ
ת
 
א
ש
ר
 
ב
צ
א
ת
ו
 
מ
ר
ח
ם
 
א
מ
ו
 
ו
י
א
כ
ל
 
ח
צ
י
 
ב
ש
ר
ו
 
ו
י
צ
ע
ק
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ל
א
מ
ר
 
א
ל
 
נ
א
 
ר
פ
א
 
נ
א
 
ל
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ב
י
ה
 
י
ר
ק
 
י
ר
ק
 
ב
פ
נ
י
ה
 
ה
ל
ו
א
 
ת
כ
ל
ם
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
ס
ג
ר
 
ש
ב
ע
ת
 
י
מ
י
ם
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
א
ח
ר
 
ת
א
ס
ף
 
ו
ת
ס
ג
ר
 
מ
ר
י
ם
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ה
ע
ם
 
ל
א
 
נ
ס
ע
ו
 
ע
ד
 
ה
א
ס
פ
ה
 
מ
ר
י
ם
 
ו
א
ח
ר
 
נ
ס
ע
ו
 
ה
ע
ם
 
מ
ח
צ
ר
ו
ת
 
ו
י
ח
נ
ו
 
ב
מ
ד
ב
ר
 
פ
ר
א
ן
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ת
ם
 
ע
ד
 
ה
ר
 
ה
א
מ
ר
י
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
נ
ת
ן
 
ל
נ
ו
 
ר
א
ה
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
פ
נ
י
ך
 
א
ת
 
ה
א
ר
ץ
 
ע
ל
ה
 
ר
ש
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
ך
 
ל
ך
 
א
ל
 
ת
י
ר
א
 
ו
א
ל
 
ת
ח
ת
 
ו
י
ק
ר
ב
ו
 
א
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
ו
 
נ
ש
ל
ח
ה
 
א
נ
ש
י
ם
 
ל
פ
נ
י
נ
ו
 
ו
י
ח
פ
ד
ו
 
ל
נ
ו
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ש
י
ב
ו
 
א
ת
נ
ו
 
ד
ב
ר
 
א
ת
 
ה
ד
ר
ך
 
א
ש
ר
 
נ
ע
ל
ה
 
ב
ה
 
ו
א
ת
 
ה
ע
ר
י
ם
 
א
ש
ר
 
נ
ב
ו
א
 
ע
ל
י
ה
ן
 
ו
י
י
ט
ב
 
ה
ד
ב
ר
 
ב
ע
י
נ
י
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ש
ל
ח
 
ל
ך
 
א
נ
ש
י
ם
 
ו
י
ת
ו
ר
ו
 
א
ת
 
א
ר
ץ
 
כ
נ
ע
ן
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
א
י
ש
 
א
ח
ד
 
א
י
ש
 
א
ח
ד
 
ל
מ
ט
ה
 
א
ב
ת
י
ו
 
ת
ש
ל
ח
 
כ
ל
 
נ
ש
י
א
 
ב
ה
ם
 
ו
י
ש
ל
ח
 
א
ת
ם
 
מ
ש
ה
 
מ
מ
ד
ב
ר
 
פ
ר
א
ן
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
כ
ל
ם
 
א
נ
ש
י
ם
 
ר
א
ש
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ה
ם
 
ו
א
ל
ה
 
ש
מ
ו
ת
ם
 
ל
מ
ט
ה
 
ר
א
ו
ב
ן
 
ש
מ
ו
ע
 
ב
ן
 
ז
כ
ו
ר
 
ל
מ
ט
ה
 
ש
מ
ע
ו
ן
 
ש
פ
ט
 
ב
ן
 
ח
ו
ר
י
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ל
מ
ט
ה
 
י
ש
ש
כ
ר
 
י
ג
א
ל
 
ב
ן
 
י
ו
ס
ף
 
ל
מ
ט
ה
 
א
פ
ר
י
ם
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ל
מ
ט
ה
 
ב
נ
י
מ
י
ם
 
פ
ל
ט
י
 
ב
ן
 
ר
פ
ו
א
 
ל
מ
ט
ה
 
ז
ב
ו
ל
ן
 
ג
ד
י
א
ל
 
ב
ן
 
ס
ו
ד
י
 
ל
מ
ט
ה
 
י
ו
ס
ף
 
ל
מ
ט
ה
 
מ
נ
ש
ה
 
ג
ד
י
 
ב
ן
 
ס
ו
ס
י
 
ל
מ
ט
ה
 
ד
ן
 
ע
מ
י
א
ל
 
ב
ן
 
ג
מ
ל
י
 
ל
מ
ט
ה
 
א
ש
ר
 
ס
ת
ו
ר
 
ב
ן
 
מ
י
כ
א
ל
 
ל
מ
ט
ה
 
נ
פ
ת
ל
י
 
נ
ח
ב
י
 
ב
ן
 
ו
פ
ס
י
 
ל
מ
ט
ה
 
ג
ד
 
ג
ו
א
ל
 
ב
ן
 
מ
י
כ
י
 
א
ל
ה
 
ש
מ
ו
ת
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
ש
ל
ח
 
מ
ש
ה
 
ל
ת
ו
ר
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ק
ר
א
 
מ
ש
ה
 
ל
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
י
ה
ו
ש
ע
 
ו
י
ש
ל
ח
 
א
ת
ם
 
ל
ת
ו
ר
 
א
ת
 
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ע
ל
ו
 
ז
ה
 
ב
נ
ג
ב
 
ו
ע
ל
י
ת
ם
 
א
ת
 
ה
ה
ר
 
ו
ר
א
י
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
מ
ה
 
ה
י
א
 
ו
א
ת
 
ה
ע
ם
 
ה
י
ש
ב
 
ע
ל
י
ה
 
ה
ח
ז
ק
 
א
ו
 
ה
ר
פ
א
 
ה
מ
ע
ט
 
ה
ו
א
 
א
ם
 
ר
ב
 
ו
מ
ה
 
ה
א
ר
ץ
 
א
ש
ר
 
ה
ו
א
 
י
ש
ב
 
ב
ה
 
ה
ט
ו
ב
ה
 
ה
י
א
 
א
ם
 
ר
ע
ה
 
ו
מ
ה
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ה
ו
א
 
י
ש
ב
 
ב
ה
ן
 
ה
מ
ב
ח
נ
י
ם
 
א
ו
 
מ
ב
צ
ר
י
ם
 
ו
מ
ה
 
ה
א
ר
ץ
 
ה
ש
מ
נ
ה
 
ה
י
א
 
א
ם
 
ר
ז
ה
 
ה
י
ש
 
ב
ה
 
ע
ץ
 
א
ם
 
א
י
ן
 
ו
ה
ת
ח
ז
ק
ת
ם
 
ו
ל
ק
ח
ת
ם
 
מ
פ
ר
י
 
ה
א
ר
ץ
 
ו
ה
י
מ
י
ם
 
י
מ
י
 
ב
כ
ו
ר
ת
 
ע
נ
ב
י
ם
 
ו
י
ל
כ
ו
 
ו
י
ב
א
ו
 
ו
י
ת
ו
ר
ו
 
א
ת
 
ה
א
ר
ץ
 
מ
מ
ד
ב
ר
 
צ
ן
 
ע
ד
 
ר
ח
ב
 
ל
ב
ו
א
 
ח
מ
ת
ה
 
ו
י
ע
ל
ו
 
ב
נ
ג
ב
 
ו
י
ב
א
ו
 
ע
ד
 
ח
ב
ר
ו
ן
 
ו
ש
ם
 
א
ח
י
מ
ן
 
ש
ש
י
 
ו
ת
ל
מ
י
 
י
ל
י
ד
י
 
ע
נ
ק
 
ו
ח
ב
ר
ו
ן
 
ש
ב
ע
 
ש
נ
י
ם
 
נ
ב
נ
ת
ה
 
ל
פ
נ
י
 
צ
ע
ן
 
מ
צ
ר
י
ם
 
ו
י
ב
א
ו
 
ע
ד
 
נ
ח
ל
 
א
ש
כ
ו
ל
 
ו
י
כ
ר
ת
ו
 
מ
ש
ם
 
ז
מ
ר
ה
 
ו
א
ש
כ
ו
ל
 
ע
נ
ב
י
ם
 
א
ח
ד
 
ו
י
ש
א
ו
 
ב
מ
ו
ט
 
ב
ש
נ
י
ם
 
ו
מ
ן
 
ה
ר
מ
ו
נ
י
ם
 
ו
מ
ן
 
ה
ת
א
נ
י
ם
 
ל
מ
ק
ו
ם
 
ה
ה
ו
א
 
ק
ר
א
ו
 
נ
ח
ל
 
א
ש
כ
ו
ל
 
ע
ל
 
א
ד
ו
ת
 
ה
א
ש
כ
ו
ל
 
א
ש
ר
 
כ
ר
ת
ו
 
מ
ש
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ש
ב
ו
 
מ
ת
ו
ר
 
א
ת
 
ה
א
ר
ץ
 
מ
ק
ץ
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
י
ל
כ
ו
 
ו
י
ב
א
ו
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
מ
ד
ב
ר
 
פ
ר
א
ן
 
ק
ד
ש
ה
 
ו
י
ש
י
ב
ו
 
א
ת
ם
 
ד
ב
ר
 
ו
א
ת
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
ר
א
ו
ם
 
א
ת
 
פ
ר
י
 
ה
א
ר
ץ
 
ו
י
ס
פ
ר
ו
 
ל
ו
 
ו
י
א
מ
ר
ו
 
ב
א
נ
ו
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
ש
ל
ח
ת
נ
ו
 
ו
ג
ם
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ה
י
א
 
ו
ז
ה
 
פ
ר
י
ה
 
א
פ
ס
 
כ
י
 
ע
ז
 
ה
ע
ם
 
ה
י
ש
ב
 
ב
א
ר
ץ
 
ו
ה
ע
ר
י
ם
 
ב
צ
ר
ו
ת
 
ו
ג
ד
ל
ו
ת
 
מ
א
ד
 
ו
ג
ם
 
י
ל
י
ד
י
 
ע
נ
ק
 
ר
א
י
נ
ו
 
ש
ם
 
ע
מ
ל
ק
 
י
ש
ב
 
ב
א
ר
ץ
 
ה
נ
ג
ב
 
ו
ה
ח
ת
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
ו
ה
א
מ
ר
י
 
י
ש
ב
 
ב
ה
ר
 
ו
ה
כ
נ
ע
נ
י
 
י
ש
ב
 
ע
ל
 
ה
י
ם
 
ו
ע
ל
 
י
ד
 
ה
י
ר
ד
ן
 
ו
י
ח
ס
 
כ
ל
ב
 
א
ת
 
ה
ע
ם
 
ע
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
 
ל
ו
 
ע
ל
ה
 
נ
ע
ל
ה
 
ו
י
ר
ש
נ
ו
 
א
ת
ה
 
כ
י
 
י
כ
ל
 
נ
כ
ל
 
ל
ה
 
ו
ה
א
נ
ש
י
ם
 
א
ש
ר
 
ע
ל
ו
 
ע
מ
ו
 
א
מ
ר
ו
 
ל
א
 
נ
ו
כ
ל
 
ל
ע
ל
ו
ת
 
א
ל
 
ה
ע
ם
 
כ
י
 
ח
ז
ק
 
ה
ו
א
 
מ
מ
נ
ו
 
ו
י
ו
צ
י
א
ו
 
ד
ב
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
ת
ר
ו
 
א
ת
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ה
א
ר
ץ
 
א
ש
ר
 
ע
ב
ר
נ
ו
 
ב
ה
 
ל
ת
ו
ר
 
א
ת
ה
 
א
ר
ץ
 
א
כ
ל
ת
 
י
ש
ב
י
ה
 
ה
י
א
 
ו
כ
ל
 
ה
ע
ם
 
א
ש
ר
 
ר
א
י
נ
ו
 
ב
ת
ו
כ
ה
 
א
נ
ש
י
 
מ
ד
ו
ת
 
ו
ש
ם
 
ר
א
י
נ
ו
 
א
ת
 
ה
נ
פ
ל
י
ם
 
ב
נ
י
 
ע
נ
ק
 
מ
ן
 
ה
נ
פ
ל
י
ם
 
ו
נ
ה
י
ה
 
ב
ע
י
נ
י
נ
ו
 
כ
ח
ג
ב
י
ם
 
ו
כ
ן
 
ה
י
י
נ
ו
 
ב
ע
י
נ
י
ה
ם
 
ו
י
ר
ג
נ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ה
ל
י
ה
ם
 
ו
י
א
מ
ר
ו
 
ב
ש
נ
א
ת
 
י
ה
ו
ה
 
א
ת
נ
ו
 
ה
ו
צ
י
א
נ
ו
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ת
ת
 
א
ת
נ
ו
 
ב
י
ד
 
ה
א
מ
ר
י
 
ל
ה
ש
מ
י
ד
נ
ו
 
א
נ
ה
 
א
נ
ח
נ
ו
 
ע
ל
י
ם
 
ו
א
ח
י
נ
ו
 
ה
מ
י
ס
ו
 
א
ת
 
ל
ב
ב
נ
ו
 
ל
א
מ
ר
 
ע
ם
 
ג
ד
ו
ל
 
ו
ר
ב
 
מ
מ
נ
ו
 
ע
ר
י
ם
 
ג
ד
ל
ו
ת
 
ו
ב
צ
ר
ו
ת
 
ב
ש
מ
י
ם
 
ו
ג
ם
 
ב
נ
י
 
ע
נ
ק
י
ם
 
ר
א
י
נ
ו
 
ש
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
ת
ע
ר
צ
ו
ן
 
ו
ל
א
 
ת
י
ר
א
ו
ן
 
מ
ה
ם
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ה
ל
ך
 
ל
פ
נ
י
כ
ם
 
ה
ו
א
 
י
ל
ח
ם
 
ל
כ
ם
 
כ
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
א
ת
כ
ם
 
ב
מ
צ
ר
י
ם
 
ל
ע
י
נ
י
כ
ם
 
ו
ב
מ
ד
ב
ר
 
א
ש
ר
 
ר
א
י
ת
 
א
ש
ר
 
נ
ש
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
א
ש
ר
 
י
ש
א
 
א
י
ש
 
א
ת
 
ב
נ
ו
 
ב
כ
ל
 
ה
ד
ר
ך
 
א
ש
ר
 
ה
ל
כ
ת
ם
 
ע
ד
 
ב
א
כ
ם
 
ע
ד
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
ו
ב
ד
ב
ר
 
ה
ז
ה
 
א
י
נ
כ
ם
 
מ
א
מ
נ
י
ם
 
ב
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ה
ל
ך
 
ל
פ
נ
י
כ
ם
 
ב
ד
ר
ך
 
ל
ת
ו
ר
 
ל
כ
ם
 
מ
ק
ו
ם
 
ל
ה
ח
נ
ו
ת
כ
ם
 
ב
א
ש
 
ל
י
ל
ה
 
ל
ה
ר
א
ו
ת
כ
ם
 
ב
ד
ר
ך
 
א
ש
ר
 
ת
ל
כ
ו
 
ב
ה
 
ו
ב
ע
נ
ן
 
י
ו
מ
ם
 
ו
ת
ש
א
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
ת
נ
ו
 
א
ת
 
ק
ו
ל
ם
 
ו
י
ב
ך
 
ה
ע
ם
 
ב
ל
י
ל
ה
 
ה
ה
ו
א
 
ו
י
ל
נ
ו
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
ו
 
א
ל
י
ה
ם
 
כ
ל
 
ה
ע
ד
ה
 
ל
ו
 
מ
ת
נ
ו
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
ו
 
ב
מ
ד
ב
ר
 
ה
ז
ה
 
ל
ו
 
מ
ת
נ
ו
 
ו
ל
מ
ה
 
י
ה
ו
ה
 
מ
ב
י
א
 
א
ת
נ
ו
 
א
ל
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ל
נ
פ
ל
 
ב
ח
ר
ב
 
נ
ש
י
נ
ו
 
ו
ט
פ
נ
ו
 
י
ה
י
ו
 
ל
ב
ו
ז
 
ה
ל
ו
א
 
ט
ו
ב
 
ל
נ
ו
 
ש
ו
ב
ה
 
מ
צ
ר
י
מ
ה
 
ו
י
א
מ
ר
ו
 
א
י
ש
 
א
ל
 
א
ח
י
ו
 
נ
ת
ן
 
ר
א
ש
 
ו
נ
ש
ו
ב
 
מ
צ
ר
י
מ
ה
 
ו
י
פ
ל
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ע
ל
 
פ
נ
י
ה
ם
 
ל
פ
נ
י
 
כ
ל
 
ק
ה
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
מ
ן
 
ה
א
ת
ו
ר
י
ם
 
א
ת
 
ה
א
ר
ץ
 
ק
ר
ע
ו
 
ב
ג
ד
י
ה
ם
 
ו
י
א
מ
ר
ו
 
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ה
א
ר
ץ
 
א
ש
ר
 
ע
ב
ר
נ
ו
 
ב
ה
 
ל
ת
ו
ר
 
א
ת
ה
 
ט
ו
ב
ה
 
ה
א
ר
ץ
 
מ
א
ד
 
מ
א
ד
 
א
ם
 
ח
פ
ץ
 
ב
נ
ו
 
י
ה
ו
ה
 
ו
ה
ב
י
א
 
א
ת
נ
ו
 
א
ל
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ו
נ
ת
נ
ה
 
ל
נ
ו
 
א
ר
ץ
 
א
ש
ר
 
ה
י
א
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
א
ך
 
ב
י
ה
ו
ה
 
א
ל
 
ת
מ
ר
ד
ו
 
ו
א
ת
ם
 
א
ל
 
ת
י
ר
א
ו
 
א
ת
 
ע
ם
 
ה
א
ר
ץ
 
כ
י
 
ל
ח
מ
נ
ו
 
ה
ם
 
ס
ר
 
צ
ל
ם
 
מ
ע
ל
י
ה
ם
 
ו
י
ה
ו
ה
 
א
ת
נ
ו
 
א
ל
 
ת
י
ר
א
ו
ם
 
ו
י
א
מ
ר
ו
 
כ
ל
 
ה
ע
ד
ה
 
ל
ר
ג
ם
 
א
ת
ם
 
ב
א
ב
נ
י
ם
 
ו
כ
ב
ו
ד
 
י
ה
ו
ה
 
נ
ר
א
ה
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ע
ד
 
א
נ
ה
 
י
נ
א
צ
נ
י
 
ה
ע
ם
 
ה
ז
ה
 
ו
ע
ד
 
ה
נ
ה
 
ל
א
 
י
א
מ
נ
ו
 
ב
י
 
ב
כ
ל
 
ה
א
ת
ו
ת
 
א
ש
ר
 
ע
ש
י
ת
י
 
ב
ק
ר
ב
ו
 
א
כ
נ
ו
 
ב
ד
ב
ר
 
ו
א
ו
ר
י
ש
נ
ו
 
ו
א
ע
ש
ה
 
א
ת
ך
 
ו
א
ת
 
ב
י
ת
 
א
ב
י
ך
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
ו
ע
צ
ו
ם
 
מ
מ
נ
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ו
ש
מ
ע
ו
 
מ
צ
ר
י
ם
 
כ
י
 
ה
ע
ל
י
ת
 
ב
כ
ח
ך
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
מ
ק
ר
ב
ו
 
ו
א
מ
ר
ו
 
א
ל
 
י
ו
ש
ב
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ש
מ
ע
ו
 
כ
י
 
א
ת
ה
 
י
ה
ו
ה
 
ב
ק
ר
ב
 
ה
ע
ם
 
ה
ז
ה
 
א
ש
ר
 
ע
י
ן
 
ב
ע
י
ן
 
נ
ר
א
ה
 
א
ת
ה
 
י
ה
ו
ה
 
ו
ע
נ
נ
ך
 
ע
מ
ד
 
ע
ל
י
ה
ם
 
ו
ב
ע
מ
ו
ד
 
ע
נ
ן
 
א
ת
ה
 
ה
ל
ך
 
ל
פ
נ
י
ה
ם
 
י
ו
מ
ם
 
ו
ב
ע
מ
ו
ד
 
א
ש
 
ל
י
ל
ה
 
ו
ה
מ
ת
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
כ
א
י
ש
 
א
ח
ד
 
ו
א
מ
ר
ו
 
ה
ג
ו
י
ם
 
א
ש
ר
 
ש
מ
ע
ו
 
א
ת
 
ש
מ
ע
ך
 
ל
א
מ
ר
 
מ
ב
ל
ת
י
 
י
כ
ל
ת
 
י
ה
ו
ה
 
ל
ה
ב
י
א
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
ה
ם
 
ו
י
ש
ח
ט
ם
 
ב
מ
ד
ב
ר
 
ו
ע
ת
ה
 
י
ג
ד
ל
 
נ
א
 
כ
ח
 
א
ד
נ
י
 
כ
א
ש
ר
 
ד
ב
ר
ת
 
ל
א
מ
ר
 
י
ה
ו
ה
 
א
ר
ך
 
א
פ
י
ם
 
ו
ר
ב
 
ח
ס
ד
 
ו
א
מ
ת
 
נ
ש
א
 
ע
ו
ן
 
ו
פ
ש
ע
 
ו
ח
ט
א
ה
 
ו
נ
ק
ה
 
ל
ו
 
י
נ
ק
ה
 
פ
ק
ד
 
ע
ו
ן
 
א
ב
ו
ת
 
ע
ל
 
ב
נ
י
ם
 
ע
ל
 
ש
ל
י
ש
י
ם
 
ו
ע
ל
 
ר
ב
י
ע
י
ם
 
ס
ל
ח
 
נ
א
 
ל
ע
ו
ן
 
ה
ע
ם
 
ה
ז
ה
 
כ
ג
ד
ל
 
ח
ס
ד
ך
 
ו
כ
א
ש
ר
 
נ
ש
א
ת
 
ל
ע
ם
 
ה
ז
ה
 
מ
מ
צ
ר
י
ם
 
ו
ע
ד
 
ה
נ
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
ס
ל
ח
ת
י
 
כ
ד
ב
ר
י
ך
 
ו
א
ו
ל
ם
 
ח
י
 
א
נ
י
 
ו
י
מ
ל
א
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
א
ת
 
כ
ל
 
ה
א
ר
ץ
 
כ
י
 
כ
ל
 
ה
א
נ
ש
י
ם
 
ה
ר
א
י
ם
 
א
ת
 
כ
ב
ו
ד
י
 
ו
א
ת
 
א
ת
ו
ת
י
 
א
ש
ר
 
ע
ש
י
ת
י
 
ב
מ
צ
ר
י
ם
 
ו
ב
מ
ד
ב
ר
 
ו
י
נ
ס
ו
 
א
ת
י
 
ז
ה
 
ע
ש
ר
 
פ
ע
מ
י
ם
 
ו
ל
א
 
ש
מ
ע
ו
 
ב
ק
ו
ל
י
 
א
ם
 
י
ר
א
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ו
ת
ם
 
ל
ת
ת
 
ל
ה
ם
 
ו
כ
ל
 
מ
נ
א
צ
י
 
ל
א
 
י
ר
א
ו
ה
 
ו
ע
ב
ד
י
 
כ
ל
ב
 
ע
ק
ב
 
ה
י
ת
ה
 
ר
ו
ח
 
א
ח
ר
ת
 
ע
מ
ו
 
ו
י
מ
ל
א
 
א
ח
ר
י
 
ו
ה
ב
א
ת
י
ו
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
ב
א
 
ש
מ
ה
 
ו
ז
ר
ע
ו
 
י
י
ר
ש
נ
ה
 
ו
ה
ע
מ
ל
ק
י
 
ו
ה
כ
נ
ע
נ
י
 
י
ש
ב
 
ב
ע
מ
ק
 
מ
ח
ר
 
פ
נ
ו
 
ו
ס
ע
ו
 
ל
כ
ם
 
ה
מ
ד
ב
ר
ה
 
ד
ר
ך
 
י
ם
 
ס
ו
ף
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
ע
ד
 
מ
ת
י
 
ל
ע
ד
ה
 
ה
ר
ע
ה
 
ה
ז
א
ת
 
א
ש
ר
 
ה
ם
 
מ
ל
נ
י
ם
 
ע
ל
י
 
א
ת
 
ת
ל
נ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
ה
ם
 
מ
ל
נ
י
ם
 
ע
ל
י
 
ש
מ
ע
ת
י
 
א
מ
ר
 
א
ל
י
ה
ם
 
ח
י
 
א
נ
י
 
נ
א
ם
 
י
ה
ו
ה
 
א
ם
 
ל
א
 
כ
א
ש
ר
 
ד
ב
ר
ת
ם
 
ב
א
ז
נ
י
 
כ
ן
 
א
ע
ש
ה
 
ל
כ
ם
 
ב
מ
ד
ב
ר
 
ה
ז
ה
 
י
פ
ל
ו
 
פ
ג
ר
י
כ
ם
 
ו
כ
ל
 
פ
ק
ד
י
כ
ם
 
ל
כ
ל
 
מ
ס
פ
ר
כ
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
א
ש
ר
 
ה
ל
נ
ת
ם
 
ע
ל
י
 
א
ם
 
א
ת
ם
 
ת
ב
א
ו
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
א
ת
י
 
א
ת
 
י
ד
י
 
ל
ש
כ
ן
 
א
ת
כ
ם
 
ב
ה
 
כ
י
 
א
ם
 
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
ט
פ
כ
ם
 
א
ש
ר
 
א
מ
ר
ת
ם
 
ל
ב
ו
ז
 
י
ה
י
ה
 
ו
ה
ב
א
ת
י
 
א
ת
ם
 
ו
י
ד
ע
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
מ
א
ס
ת
ם
 
ב
ה
 
ו
פ
ג
ר
י
כ
ם
 
א
ת
ם
 
י
פ
ל
ו
 
ב
מ
ד
ב
ר
 
ה
ז
ה
 
ו
ב
נ
י
כ
ם
 
י
ה
י
ו
 
ר
ע
י
ם
 
ב
מ
ד
ב
ר
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
נ
ש
א
ו
 
א
ת
 
ז
ו
נ
ת
י
כ
ם
 
ע
ד
 
ת
ם
 
פ
ג
ר
י
כ
ם
 
ב
מ
ד
ב
ר
 
ב
מ
ס
פ
ר
 
ה
י
מ
י
ם
 
א
ש
ר
 
ת
ר
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
י
ו
ם
 
ל
ש
נ
ה
 
י
ו
ם
 
ל
ש
נ
ה
 
ת
ש
א
ו
 
א
ת
 
ע
ו
נ
ת
י
כ
ם
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
י
ד
ע
ת
ם
 
א
ת
 
ת
נ
ו
א
ת
י
 
א
נ
י
 
י
ה
ו
ה
 
ד
ב
ר
ת
י
 
א
ם
 
ל
א
 
ז
א
ת
 
א
ע
ש
ה
 
ל
כ
ל
 
ה
ע
ד
ה
 
ה
ר
ע
ה
 
ה
ז
א
ת
 
ה
נ
ו
ע
ד
י
ם
 
ע
ל
י
 
ב
מ
ד
ב
ר
 
ה
ז
ה
 
י
ת
מ
ו
 
ו
ש
ם
 
י
מ
ו
ת
ו
 
ו
ה
א
נ
ש
י
ם
 
א
ש
ר
 
ש
ל
ח
 
מ
ש
ה
 
ל
ת
ו
ר
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ש
ב
ו
 
ו
י
ל
נ
ו
 
ע
ל
י
ו
 
א
ת
 
כ
ל
 
ה
ע
ד
ה
 
ל
ה
ו
צ
י
א
 
ד
ב
ה
 
ע
ל
 
ה
א
ר
ץ
 
ו
י
מ
ת
ו
 
ה
א
נ
ש
י
ם
 
מ
ו
צ
א
י
 
ד
ב
ת
 
ה
א
ר
ץ
 
ר
ע
ה
 
ב
מ
ג
פ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ח
י
ו
 
מ
ן
 
ה
א
נ
ש
י
ם
 
ה
ה
ם
 
ה
ה
ל
כ
י
ם
 
ל
ת
ו
ר
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ת
א
ב
ל
ו
 
ה
ע
ם
 
מ
א
ד
 
ו
י
ש
כ
מ
ו
 
ב
ב
ק
ר
 
ו
י
ע
ל
ו
 
א
ל
 
ר
א
ש
 
ה
ה
ר
 
ל
א
מ
ר
 
ה
נ
נ
ו
 
ו
ע
ל
י
נ
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
א
מ
ר
 
י
ה
ו
ה
 
כ
י
 
ח
ט
א
נ
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
ל
ה
ם
 
ל
א
 
ת
ע
ל
ו
 
ו
ל
א
 
ת
ל
ח
מ
ו
 
כ
י
 
א
י
נ
נ
י
 
ב
ק
ר
ב
כ
ם
 
ו
ל
א
 
ת
נ
ג
פ
ו
 
ל
פ
נ
י
 
א
י
ב
י
כ
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
מ
ה
 
ז
ה
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
פ
י
 
י
ה
ו
ה
 
ו
ה
י
א
 
ל
א
 
ת
צ
ל
י
ח
 
א
ל
 
ת
ע
ל
ו
 
כ
י
 
א
י
ן
 
י
ה
ו
ה
 
ב
ק
ר
ב
כ
ם
 
ו
ל
א
 
ת
נ
ג
פ
ו
 
ל
פ
נ
י
 
א
י
ב
י
כ
ם
 
כ
י
 
ה
ע
מ
ל
ק
י
 
ו
ה
כ
נ
ע
נ
י
 
ש
ם
 
ל
פ
נ
י
כ
ם
 
ו
נ
פ
ל
ת
ם
 
ב
ח
ר
ב
 
כ
י
 
ע
ל
 
כ
ן
 
ש
ב
ת
ם
 
מ
א
ח
ר
י
 
י
ה
ו
ה
 
ו
ל
א
 
י
ה
י
ה
 
י
ה
ו
ה
 
ע
מ
כ
ם
 
ו
י
ע
פ
ל
ו
 
ל
ע
ל
ו
ת
 
א
ל
 
ר
א
ש
 
ה
ה
ר
 
ו
א
ר
ו
ן
 
ב
ר
י
ת
 
י
ה
ו
ה
 
ו
מ
ש
ה
 
ל
א
 
מ
ש
ו
 
מ
ק
ר
ב
 
ה
מ
ח
נ
ה
 
ו
י
ר
ד
 
ה
ע
מ
ל
ק
י
 
ו
ה
כ
נ
ע
נ
י
 
ה
י
ש
ב
 
ב
ה
ר
 
ה
ה
ו
א
 
ל
ק
ר
א
ת
ם
 
ו
י
ר
ד
פ
ו
 
א
ת
ם
 
כ
א
ש
ר
 
ת
ע
ש
י
נ
ה
 
ה
ד
ב
ר
י
ם
 
ו
י
כ
ו
ם
 
ו
י
כ
ת
ו
ם
 
ע
ד
 
ח
ר
מ
ה
 
ו
י
ש
ב
ו
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
ת
ב
א
ו
 
א
ל
 
א
ר
ץ
 
מ
ו
ש
ב
ת
י
כ
ם
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
כ
ם
 
ו
ע
ש
י
ת
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ע
ל
ה
 
א
ו
 
ז
ב
ח
 
ל
פ
ל
א
 
נ
ד
ר
 
א
ו
 
נ
ד
ב
ה
 
א
ו
 
ב
מ
ו
ע
ד
י
כ
ם
 
ל
ע
ש
ו
ת
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
מ
ן
 
ה
ב
ק
ר
 
א
ו
 
מ
ן
 
ה
צ
א
ן
 
ו
ה
ק
ר
י
ב
 
ה
מ
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
נ
ו
 
ל
י
ה
ו
ה
 
מ
נ
ח
ה
 
ס
ל
ת
 
ע
ש
ר
ו
ן
 
ב
ל
ו
ל
 
ב
ר
ב
ע
י
ת
 
ה
ה
י
ן
 
ש
מ
ן
 
ו
י
י
ן
 
ל
נ
ס
ך
 
ר
ב
ע
י
ת
 
ה
ה
י
ן
 
ת
ע
ש
ה
 
ע
ל
 
ה
ע
ל
ה
 
א
ו
 
ל
ז
ב
ח
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
א
ו
 
ל
א
י
ל
 
ת
ע
ש
ה
 
מ
נ
ח
ה
 
ס
ל
ת
 
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ב
ל
ו
ל
 
ב
ש
מ
ן
 
ש
ל
ש
י
ת
 
ה
ה
י
ן
 
ו
י
י
ן
 
ל
נ
ס
ך
 
ש
ל
ש
י
ת
 
ה
ה
י
ן
 
ת
ק
ר
י
ב
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
כ
י
 
ת
ע
ש
ה
 
ב
ן
 
ב
ק
ר
 
ע
ל
ה
 
א
ו
 
ז
ב
ח
 
ל
פ
ל
א
 
נ
ד
ר
 
א
ו
 
ש
ל
מ
י
ם
 
ל
י
ה
ו
ה
 
ו
ה
ק
ר
י
ב
 
ע
ל
 
ב
ן
 
ה
ב
ק
ר
 
מ
נ
ח
ה
 
ס
ל
ת
 
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ב
ל
ו
ל
 
ב
ש
מ
ן
 
ח
צ
י
 
ה
ה
י
ן
 
ו
י
י
ן
 
ת
ק
ר
י
ב
 
ל
נ
ס
ך
 
ח
צ
י
 
ה
ה
י
ן
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
כ
כ
ה
 
י
ע
ש
ה
 
ל
ש
ו
ר
 
ה
א
ח
ד
 
א
ו
 
ל
א
י
ל
 
ה
א
ח
ד
 
א
ו
 
ל
ש
ה
 
ב
כ
ש
ב
י
ם
 
א
ו
 
ב
ע
ז
י
ם
 
כ
מ
ס
פ
ר
ם
 
א
ש
ר
 
ת
ע
ש
ו
 
כ
כ
ה
 
ת
ע
ש
ו
 
ל
א
ח
ד
 
ב
מ
ס
פ
ר
ם
 
כ
ל
 
ה
א
ז
ר
ח
 
י
ע
ש
ה
 
כ
כ
ה
 
א
ת
 
א
ל
ה
 
ל
ה
ק
ר
י
ב
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
כ
י
 
י
ג
ו
ר
 
א
ת
כ
ם
 
ג
ר
 
א
ו
 
א
ש
ר
 
ב
ת
ו
כ
כ
ם
 
ל
ד
ר
ת
י
כ
ם
 
ו
ע
ש
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
כ
א
ש
ר
 
ת
ע
ש
ו
 
כ
ן
 
י
ע
ש
ה
 
ה
ק
ה
ל
 
ח
ק
ה
 
א
ח
ת
 
ל
כ
ם
 
ו
ל
ג
ר
 
ה
ג
ר
 
ח
ק
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
כ
כ
ם
 
כ
ג
ר
 
י
ה
י
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ת
ו
ר
ה
 
א
ח
ת
 
ו
מ
ש
פ
ט
 
א
ח
ד
 
י
ה
י
ה
 
ל
כ
ם
 
ו
ל
ג
ר
 
ה
ג
ר
 
א
ת
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ב
ב
א
כ
ם
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
נ
י
 
מ
ב
י
א
 
א
ת
כ
ם
 
ש
מ
ה
 
ו
ה
י
ה
 
ב
א
כ
ל
כ
ם
 
מ
ל
ח
ם
 
ה
א
ר
ץ
 
ת
ר
י
מ
ו
 
ת
ר
ו
מ
ה
 
ל
י
ה
ו
ה
 
ר
א
ש
י
ת
 
ע
ר
י
ס
ת
י
כ
ם
 
ח
ל
ה
 
ת
ר
י
מ
ו
 
ת
ר
ו
מ
ה
 
כ
ת
ר
ו
מ
ת
 
ג
ר
ן
 
כ
ן
 
ת
ר
י
מ
ו
 
א
ת
ה
 
מ
ר
א
ש
י
ת
 
ע
ר
י
ס
ת
י
כ
ם
 
ת
ת
נ
ו
 
ל
י
ה
ו
ה
 
ת
ר
ו
מ
ה
 
ל
ד
ר
ת
י
כ
ם
 
ו
כ
י
 
ת
ש
ג
ו
 
ו
ל
א
 
ת
ע
ש
ו
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ת
 
ה
א
ל
ה
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ת
 
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ל
י
כ
ם
 
ב
י
ד
 
מ
ש
ה
 
ל
מ
ן
 
ה
י
ו
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
ה
ל
א
ה
 
ל
ד
ר
ת
י
כ
ם
 
ו
ה
י
ה
 
א
ם
 
מ
ע
י
נ
י
 
ה
ע
ד
ה
 
נ
ע
ש
ת
ה
 
ל
ש
ג
ג
ה
 
ו
ע
ש
ו
 
כ
ל
 
ה
ע
ד
ה
 
פ
ר
 
ב
ן
 
ב
ק
ר
 
א
ח
ד
 
ל
ע
ל
ה
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
מ
נ
ח
ת
ו
 
ו
נ
ס
כ
ו
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ו
כ
פ
ר
 
ה
כ
ה
ן
 
ע
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ס
ל
ח
 
ל
ה
ם
 
כ
י
 
ש
ג
ג
ה
 
ה
י
א
 
ו
ה
ם
 
ה
ב
י
א
ו
 
א
ת
 
ק
ר
ב
נ
ם
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
ח
ט
א
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ל
 
ש
ג
ג
ת
ם
 
ו
נ
ס
ל
ח
 
ל
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
ם
 
כ
י
 
ל
כ
ל
 
ה
ע
ם
 
ב
ש
ג
ג
ה
 
ו
א
ם
 
נ
פ
ש
 
א
ח
ת
 
ת
ח
ט
א
 
ב
ש
ג
ג
ה
 
ו
ה
ק
ר
י
ב
ה
 
ע
ז
 
ב
ת
 
ש
נ
ת
ה
 
ל
ח
ט
א
ת
 
ו
כ
פ
ר
 
ה
כ
ה
ן
 
ע
ל
 
ה
נ
פ
ש
 
ה
ש
ג
ג
ת
 
ב
ח
ט
א
ה
 
ב
ש
ג
ג
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
כ
פ
ר
 
ע
ל
י
ו
 
ו
נ
ס
ל
ח
 
ל
ו
 
ה
א
ז
ר
ח
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
ם
 
ת
ו
ר
ה
 
א
ח
ת
 
י
ה
י
ה
 
ל
כ
ם
 
ל
ע
ש
ה
 
ב
ש
ג
ג
ה
 
ו
ה
נ
פ
ש
 
א
ש
ר
 
ת
ע
ש
ה
 
ב
י
ד
 
ר
מ
ה
 
מ
ן
 
ה
א
ז
ר
ח
 
ו
מ
ן
 
ה
ג
ר
 
א
ת
 
י
ה
ו
ה
 
ה
ו
א
 
מ
ג
ד
ף
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ק
ר
ב
 
ע
מ
י
ה
 
כ
י
 
א
ת
 
ד
ב
ר
 
י
ה
ו
ה
 
ב
ז
ה
 
ו
א
ת
 
מ
צ
ו
ת
י
ו
 
ה
פ
ר
 
ה
כ
ר
ת
 
ת
כ
ר
ת
 
ה
נ
פ
ש
 
ה
ה
י
א
 
ע
ו
נ
ה
 
ב
ה
 
ו
י
ה
י
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
מ
ד
ב
ר
 
ו
י
מ
צ
א
ו
 
א
י
ש
 
מ
ק
ש
ש
 
ע
צ
י
ם
 
ב
י
ו
ם
 
ה
ש
ב
ת
 
ו
י
ק
ר
י
ב
ו
 
א
ת
ו
 
ה
מ
צ
א
י
ם
 
א
ת
ו
 
מ
ק
ש
ש
 
ע
צ
י
ם
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ו
א
ל
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
נ
י
ח
ו
 
א
ת
ו
 
ב
מ
ש
מ
ר
 
כ
י
 
ל
א
 
פ
ר
ש
 
מ
ה
 
י
ע
ש
ה
 
ל
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
מ
ו
ת
 
י
ו
מ
ת
 
ה
א
י
ש
 
ר
ג
מ
ו
 
א
ת
ו
 
ב
א
ב
נ
י
ם
 
כ
ל
 
ה
ע
ד
ה
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
ו
צ
י
א
ו
 
א
ת
ו
 
כ
ל
 
ה
ע
ד
ה
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
ר
ג
מ
ו
 
א
ת
ו
 
ב
א
ב
נ
י
ם
 
ו
י
מ
ת
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ו
ע
ש
ו
 
ל
ה
ם
 
צ
י
צ
ו
ת
 
ע
ל
 
כ
נ
פ
י
 
ב
ג
ד
י
ה
ם
 
ל
ד
ר
ת
ם
 
ו
נ
ת
נ
ו
 
ע
ל
 
צ
י
צ
י
ת
 
ה
כ
נ
ף
 
פ
ת
י
ל
 
ת
כ
ל
ת
 
ו
ה
י
ו
 
ל
כ
ם
 
ל
צ
י
צ
ו
ת
 
ו
ר
א
י
ת
ם
 
א
ת
ם
 
ו
ז
כ
ר
ת
ם
 
א
ת
 
כ
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ו
ל
א
 
ת
ת
ו
ר
ו
 
א
ח
ר
י
 
ל
ב
ב
כ
ם
 
ו
א
ח
ר
י
 
ע
י
נ
י
כ
ם
 
א
ש
ר
 
א
ת
ם
 
ז
נ
י
ם
 
א
ח
ר
י
ה
ם
 
ל
מ
ע
ן
 
ת
ז
כ
ר
ו
 
ו
ע
ש
י
ת
ם
 
א
ת
 
כ
ל
 
מ
צ
ו
ת
י
 
ו
ה
י
י
ת
ם
 
ק
ד
י
ש
י
ם
 
ל
א
ל
ה
י
כ
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
ה
ו
צ
א
ת
י
 
א
ת
כ
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ה
י
ו
ת
 
ל
כ
ם
 
ל
א
ל
ה
י
ם
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
י
ק
ח
 
ק
ר
ח
 
ב
ן
 
י
צ
ה
ר
 
ב
ן
 
ק
ה
ת
 
ב
ן
 
ל
ו
י
 
ו
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
ב
נ
י
 
א
ל
י
א
ב
 
ו
א
ו
ן
 
ב
ן
 
פ
ל
ת
 
ב
ן
 
ר
א
ו
ב
ן
 
ו
י
ק
מ
ו
 
ל
פ
נ
י
 
מ
ש
ה
 
ו
א
נ
ש
י
ם
 
מ
ב
נ
י
 
י
ש
ר
א
ל
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
י
ם
 
נ
ש
י
א
י
 
ע
ד
ה
 
ק
ר
י
א
י
 
מ
ו
ע
ד
 
א
נ
ש
י
 
ש
ם
 
ו
י
ק
ה
ל
ו
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
ו
י
א
מ
ר
ו
 
א
ל
י
ה
ם
 
ר
ב
 
ל
כ
ם
 
כ
י
 
כ
ל
 
ה
ע
ד
ה
 
כ
ל
ם
 
ק
ד
י
ש
י
ם
 
ו
ב
ת
ו
כ
ם
 
י
ה
ו
ה
 
ו
מ
ד
ו
ע
 
ת
ת
נ
ש
א
ו
 
ע
ל
 
ק
ה
ל
 
י
ה
ו
ה
 
ו
י
ש
מ
ע
 
מ
ש
ה
 
ו
י
פ
ל
 
ע
ל
 
פ
נ
י
ו
 
ו
י
ד
ב
ר
 
א
ל
 
ק
ר
ח
 
ו
א
ל
 
כ
ל
 
ע
ד
ת
ו
 
ל
א
מ
ר
 
ב
ק
ר
 
ו
י
ו
ד
ע
 
י
ה
ו
ה
 
א
ת
 
א
ש
ר
 
ל
ו
 
ו
א
ת
 
ה
ק
ד
ו
ש
 
י
ק
ר
י
ב
 
א
ל
י
ו
 
ו
א
ת
 
א
ש
ר
 
י
ב
ח
ר
 
ב
ו
 
י
ק
ר
י
ב
 
א
ל
י
ו
 
ז
א
ת
 
ע
ש
ו
 
ק
ח
ו
 
ל
כ
ם
 
מ
ח
ת
ו
ת
 
ק
ר
ח
 
ו
כ
ל
 
ע
ד
ת
ו
 
ו
ת
נ
ו
 
ב
ה
ן
 
א
ש
 
ו
ש
י
מ
ו
 
ע
ל
י
ה
ן
 
ק
ט
ר
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
מ
ח
ר
 
ו
ה
י
ה
 
ה
א
י
ש
 
א
ש
ר
 
י
ב
ח
ר
 
י
ה
ו
ה
 
ה
ו
א
 
ה
ק
ד
ו
ש
 
ר
ב
 
ל
כ
ם
 
ב
נ
י
 
ל
ו
י
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ק
ר
ח
 
ש
מ
ע
ו
 
נ
א
 
ב
נ
י
 
ל
ו
י
 
ה
מ
ע
ט
 
מ
כ
ם
 
כ
י
 
ה
ב
ד
י
ל
 
א
ל
ה
י
 
י
ש
ר
א
ל
 
א
ת
כ
ם
 
מ
ע
ד
ת
 
י
ש
ר
א
ל
 
ל
ה
ק
ר
י
ב
 
א
ת
כ
ם
 
א
ל
י
ו
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
מ
ש
כ
ן
 
י
ה
ו
ה
 
ל
ע
מ
ד
 
ל
פ
נ
י
 
ה
ע
ד
ה
 
ל
ש
ר
ת
ם
 
ו
י
ק
ר
י
ב
 
א
ת
ך
 
ו
א
ת
 
כ
ל
 
א
ח
י
ך
 
ב
נ
י
 
ל
ו
י
 
א
ת
ך
 
ו
ב
ק
ש
ת
ם
 
ג
ם
 
כ
ה
נ
ה
 
ל
כ
ן
 
א
ת
ה
 
ו
כ
ל
 
ע
ד
ת
ך
 
ה
נ
ו
ע
ד
י
ם
 
ע
ל
 
י
ה
ו
ה
 
ו
א
ה
ר
ן
 
מ
ה
 
ה
ו
א
 
כ
י
 
ת
ל
נ
ו
 
ע
ל
י
ו
 
ו
י
ש
ל
ח
 
מ
ש
ה
 
ל
ק
ר
א
 
ל
ד
ת
ן
 
ו
ל
א
ב
י
ר
ם
 
ב
נ
י
 
א
ל
י
א
ב
 
ו
י
א
מ
ר
ו
 
ל
א
 
נ
ע
ל
ה
 
ה
מ
ע
ט
 
כ
י
 
ה
ע
ל
י
ת
נ
ו
 
מ
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ל
ה
מ
י
ת
נ
ו
 
ב
מ
ד
ב
ר
 
כ
י
 
ת
ש
ת
ר
ר
 
ע
ל
י
נ
ו
 
ג
ם
 
ה
ש
ת
ר
ר
 
א
ף
 
ל
א
 
א
ל
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ה
ב
א
ת
נ
ו
 
ו
ת
ת
ן
 
ל
נ
ו
 
נ
ח
ל
ת
 
ש
ד
ה
 
א
ו
 
כ
ר
ם
 
ה
ע
י
נ
י
 
ה
א
נ
ש
י
ם
 
ה
ה
ם
 
ת
נ
ק
ר
 
ל
א
 
נ
ע
ל
ה
 
ו
י
ח
ר
 
ל
מ
ש
ה
 
מ
א
ד
 
ו
י
א
מ
ר
 
א
ל
 
י
ה
ו
ה
 
א
ל
 
ת
פ
ן
 
א
ל
 
מ
נ
ח
ת
ם
 
ל
א
 
ח
מ
ו
ד
 
א
ח
ד
 
מ
ה
ם
 
נ
ש
א
ת
י
 
ו
ל
א
 
ה
ר
ע
ת
י
 
א
ת
 
א
ח
ד
 
מ
ה
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ק
ר
ח
 
א
ת
ה
 
ו
כ
ל
 
ע
ד
ת
ך
 
ה
י
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ת
ה
 
ו
ה
ם
 
ו
א
ה
ר
ן
 
מ
ח
ר
 
ו
ק
ח
ו
 
א
י
ש
 
מ
ח
ת
ת
ו
 
ו
נ
ת
ת
ם
 
ע
ל
י
ה
ן
 
ק
ט
ר
ת
 
ו
ה
ק
ר
ב
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
י
ש
 
מ
ח
ת
ת
ו
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
י
ם
 
מ
ח
ת
ו
ת
 
ו
א
ת
ה
 
ו
א
ה
ר
ן
 
א
י
ש
 
מ
ח
ת
ת
ו
 
ו
י
ק
ח
ו
 
א
י
ש
 
מ
ח
ת
ת
ו
 
ו
י
ת
נ
ו
 
ב
ה
ן
 
א
ש
 
ו
י
ש
מ
ו
 
ע
ל
י
ה
ן
 
ק
ט
ר
ת
 
ו
י
ע
מ
ד
ו
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
י
ק
ה
ל
 
ע
ל
י
ה
ם
 
ק
ר
ח
 
א
ת
 
כ
ל
 
ה
ע
ד
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ר
א
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
א
ל
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
ה
ב
ד
ל
ו
 
מ
ת
ו
ך
 
ה
ע
ד
ה
 
ה
ז
א
ת
 
ו
א
כ
ל
ה
 
א
ת
ם
 
כ
ר
ג
ע
 
ו
י
פ
ל
ו
 
ע
ל
 
פ
נ
י
ה
ם
 
ו
י
א
מ
ר
ו
 
א
ל
 
א
ל
ה
י
 
ה
ר
ו
ח
ו
ת
 
ל
כ
ל
 
ה
ב
ש
ר
 
ה
א
י
ש
 
ה
א
ח
ד
 
י
ח
ט
א
 
ו
ע
ל
 
כ
ל
 
ה
ע
ד
ה
 
ת
ק
צ
ף
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ה
ע
ד
ה
 
ל
א
מ
ר
 
ה
ע
ל
ו
 
מ
ס
ב
י
ב
 
ל
מ
ש
כ
ן
 
ק
ר
ח
 
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
ו
י
ק
ם
 
מ
ש
ה
 
ו
י
ל
ך
 
א
ל
 
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
ו
י
ל
כ
ו
 
א
ח
ר
י
ו
 
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
י
ד
ב
ר
 
א
ל
 
ה
ע
ד
ה
 
ל
א
מ
ר
 
ס
ו
ר
ו
 
נ
א
 
מ
ע
ל
 
א
ה
ל
י
 
ה
א
נ
ש
י
ם
 
ה
ר
ש
ע
י
ם
 
ה
א
ל
ה
 
ו
א
ל
 
ת
ג
ע
ו
 
ב
כ
ל
 
א
ש
ר
 
ל
ה
ם
 
פ
ן
 
ת
ס
פ
ו
 
ב
כ
ל
 
ח
ט
א
ת
ם
 
ו
י
ע
ל
ו
 
מ
ע
ל
 
מ
ש
כ
ן
 
ק
ר
ח
 
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
מ
ס
ב
י
ב
 
ו
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
י
צ
א
ו
 
נ
צ
ב
י
ם
 
פ
ת
ח
 
א
ה
ל
י
ה
ם
 
ו
נ
ש
י
ה
ם
 
ו
ב
נ
י
ה
ם
 
ו
ט
פ
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ב
ז
א
ת
 
ת
ד
ע
ו
ן
 
כ
י
 
י
ה
ו
ה
 
ש
ל
ח
נ
י
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ה
מ
ע
ש
י
ם
 
ה
א
ל
ה
 
כ
י
 
ל
א
 
מ
ל
ב
י
 
א
ם
 
כ
מ
ו
ת
 
כ
ל
 
ה
א
ד
ם
 
י
מ
ו
ת
ו
ן
 
א
ל
ה
 
ו
פ
ק
ד
ת
 
כ
ל
 
ה
א
ד
ם
 
י
פ
ק
ד
 
ע
ל
י
ה
ם
 
ל
א
 
י
ה
ו
ה
 
ש
ל
ח
נ
י
 
ו
א
ם
 
ב
ר
י
ה
 
י
ב
ר
א
 
י
ה
ו
ה
 
ו
פ
צ
ת
ה
 
ה
א
ד
מ
ה
 
א
ת
 
פ
י
ה
 
ו
ב
ל
ע
ה
 
א
ת
ם
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ל
ה
ם
 
ו
י
ר
ד
ו
 
ח
י
י
ם
 
ש
א
ל
ה
 
ו
י
ד
ע
ת
ם
 
כ
י
 
נ
א
צ
ו
 
ה
א
נ
ש
י
ם
 
ה
א
ל
ה
 
א
ת
 
י
ה
ו
ה
 
ו
י
ה
י
 
כ
כ
ל
ו
ת
ו
 
ל
ד
ב
ר
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
ת
ב
ק
ע
 
ה
א
ד
מ
ה
 
א
ש
ר
 
ת
ח
ת
י
ה
ם
 
ו
ת
פ
ת
ח
 
ה
א
ר
ץ
 
א
ת
 
פ
י
ה
 
ו
ת
ב
ל
ע
 
א
ת
ם
 
ו
א
ת
 
ב
ת
י
ה
ם
 
ו
א
ת
 
כ
ל
 
ה
א
ד
ם
 
א
ש
ר
 
ל
ק
ר
ח
 
ו
א
ת
 
כ
ל
 
ה
ר
כ
ו
ש
 
ו
י
ר
ד
ו
 
ה
ם
 
ו
כ
ל
 
א
ש
ר
 
ל
ה
ם
 
ח
י
י
ם
 
ש
א
ל
ה
 
ו
ת
כ
ס
 
ע
ל
י
ה
ם
 
ה
א
ר
ץ
 
ו
י
א
ב
ד
ו
 
מ
ת
ו
ך
 
ה
ק
ה
ל
 
ו
כ
ל
 
י
ש
ר
א
ל
 
א
ש
ר
 
ס
ב
י
ב
ת
י
ה
ם
 
נ
ס
ו
 
ל
ק
ו
ל
ם
 
כ
י
 
א
מ
ר
ו
 
פ
ן
 
ת
ב
ל
ע
נ
ו
 
ה
א
ר
ץ
 
ו
א
ש
 
י
צ
א
ה
 
מ
א
ת
 
י
ה
ו
ה
 
ו
ת
א
כ
ל
 
א
ת
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
י
ם
 
א
י
ש
 
מ
ק
ר
ב
י
 
ה
ק
ט
ר
ת
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
א
מ
ר
 
א
ל
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
י
ר
ם
 
א
ת
 
ה
מ
ח
ת
ו
ת
 
מ
ב
י
ן
 
ה
ש
ר
פ
ה
 
ו
א
ת
 
ה
א
ש
 
ז
ר
ה
 
ה
ל
א
ה
 
כ
י
 
ק
ד
ש
ו
 
א
ת
 
מ
ח
ת
ו
ת
 
ה
ח
ט
א
י
ם
 
ה
א
ל
ה
 
ב
נ
פ
ש
ו
ת
ם
 
ו
ע
ש
ו
 
א
ת
ם
 
ר
ק
ו
ע
י
 
פ
ח
י
ם
 
צ
פ
ו
א
י
 
ל
מ
ז
ב
ח
 
כ
י
 
ה
ק
ר
י
ב
ו
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ק
ד
ש
ו
 
ו
ה
י
ו
 
ל
א
ו
ת
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ח
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
א
ת
 
מ
ח
ת
ו
ת
 
ה
נ
ח
ש
ת
 
א
ש
ר
 
ה
ק
ר
י
ב
ו
 
ה
ש
ר
ו
פ
י
ם
 
ו
י
ר
ק
ע
ו
ם
 
צ
פ
ו
א
י
 
ל
מ
ז
ב
ח
 
ז
כ
ר
ו
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
מ
ע
ן
 
א
ש
ר
 
ל
א
 
י
ק
ר
ב
 
א
י
ש
 
ז
ר
 
א
ש
ר
 
ל
א
 
מ
ז
ר
ע
 
א
ה
ר
ן
 
ה
ו
א
 
ל
ה
ק
ט
י
ר
 
ק
ט
ר
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
א
 
י
ה
י
ה
 
כ
ק
ר
ח
 
ו
כ
ע
ד
ת
ו
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ל
ו
 
ו
י
ל
נ
ו
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
מ
ח
ר
ת
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
א
ת
ם
 
ה
מ
ת
ם
 
א
ת
 
ע
ם
 
י
ה
ו
ה
 
ו
י
ה
י
 
ב
ה
ק
ה
ל
 
ה
ע
ד
ה
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
ו
י
פ
נ
ו
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
נ
ה
 
כ
ס
ה
ו
 
ה
ע
נ
ן
 
ו
י
ר
א
ה
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ל
 
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ה
ר
מ
ו
 
מ
ת
ו
ך
 
ה
ע
ד
ה
 
ה
ז
א
ת
 
ו
א
כ
ל
ה
 
א
ת
ם
 
כ
ר
ג
ע
 
ו
י
פ
ל
ו
 
ע
ל
 
פ
נ
י
ה
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ה
ר
ן
 
ק
ח
 
א
ת
 
ה
מ
ח
ת
ה
 
ו
ת
ן
 
ע
ל
י
ה
 
א
ש
 
מ
ע
ל
 
ה
מ
ז
ב
ח
 
ו
ש
י
ם
 
ק
ט
ר
ת
 
ו
ה
ל
ך
 
מ
ה
ר
 
א
ל
 
ה
ע
ד
ה
 
ו
כ
פ
ר
 
ע
ל
י
ה
ם
 
כ
י
 
י
צ
א
 
ה
ק
צ
ף
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
ה
ח
ל
 
ה
נ
ג
ף
 
ו
י
ק
ח
 
א
ה
ר
ן
 
כ
א
ש
ר
 
ד
ב
ר
 
מ
ש
ה
 
ו
י
ר
ץ
 
א
ל
 
ת
ו
ך
 
ה
ק
ה
ל
 
ו
ה
נ
ה
 
ה
ח
ל
 
ה
נ
ג
ף
 
ב
ע
ם
 
ו
י
ת
ן
 
א
ת
 
ה
ק
ט
ר
ת
 
ו
י
כ
פ
ר
 
ע
ל
 
ה
ע
ם
 
ו
י
ע
מ
ד
 
ב
י
ן
 
ה
מ
י
ת
י
ם
 
ו
ב
י
ן
 
ה
ח
י
י
ם
 
ו
ת
ע
צ
ר
 
ה
מ
ג
פ
ה
 
ו
י
ה
י
ו
 
ה
מ
י
ת
י
ם
 
ב
מ
ג
פ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
מ
ל
ב
ד
 
ה
מ
י
ת
י
ם
 
ע
ל
 
ד
ב
ר
 
ק
ר
ח
 
ו
י
ש
ב
 
א
ה
ר
ן
 
א
ל
 
מ
ש
ה
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
מ
ג
פ
ה
 
נ
ע
צ
ר
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ק
ח
 
מ
א
ת
ם
 
מ
ט
ה
 
מ
ט
ה
 
ל
ב
י
ת
 
א
ב
 
מ
א
ת
 
כ
ל
 
נ
ש
י
א
י
ה
ם
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
מ
ט
ו
ת
 
א
י
ש
 
א
ת
 
ש
מ
ו
 
ת
כ
ת
ב
 
ע
ל
 
מ
ט
ה
ו
 
ו
א
ת
 
ש
ם
 
א
ה
ר
ן
 
ת
כ
ת
ב
 
ע
ל
 
מ
ט
ה
 
ל
ו
י
 
כ
י
 
מ
ט
ה
 
א
ח
ד
 
ל
ר
א
ש
 
ב
י
ת
 
א
ב
ו
ת
ם
 
ו
ה
נ
ח
ת
ם
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ל
פ
נ
י
 
ה
ע
ד
ו
ת
 
א
ש
ר
 
א
ו
ע
ד
 
ל
ך
 
ש
מ
ה
 
ו
ה
י
ה
 
ה
א
י
ש
 
א
ש
ר
 
א
ב
ח
ר
 
ב
ו
 
מ
ט
ה
ו
 
י
פ
ר
ח
 
ו
ה
ש
כ
ת
י
 
מ
ע
ל
י
 
א
ת
 
ת
ל
נ
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
ה
ם
 
מ
ל
נ
י
ם
 
ע
ל
י
כ
ם
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ת
נ
ו
 
א
ל
י
ו
 
כ
ל
 
נ
ש
י
א
י
ה
ם
 
מ
ט
ה
 
ל
נ
ש
י
א
 
א
ח
ד
 
מ
ט
ה
 
ל
נ
ש
י
א
 
א
ח
ד
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
מ
ט
ו
ת
 
ו
מ
ט
ה
 
א
ה
ר
ן
 
ב
ת
ו
ך
 
מ
ט
ו
ת
ם
 
ו
י
נ
ח
 
מ
ש
ה
 
א
ת
 
ה
מ
ט
ו
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ב
א
ה
ל
 
ה
ע
ד
ו
ת
 
ו
י
ה
י
 
מ
מ
ח
ר
ת
 
ו
י
ב
א
 
מ
ש
ה
 
א
ל
 
א
ה
ל
 
ה
ע
ד
ו
ת
 
ו
ה
נ
ה
 
פ
ר
ח
 
מ
ט
ה
 
א
ה
ר
ן
 
ל
ב
י
ת
 
ל
ו
י
 
ו
י
ו
צ
א
 
פ
ר
ח
 
ו
י
צ
ץ
 
צ
י
ץ
 
ו
י
ג
מ
ל
 
ש
ק
י
ד
י
ם
 
ו
י
ו
צ
א
 
מ
ש
ה
 
א
ת
 
כ
ל
 
ה
מ
ט
ו
ת
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
 
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ר
א
ו
 
ו
י
ק
ח
ו
 
א
י
ש
 
מ
ט
ה
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
ש
י
ב
 
א
ת
 
מ
ט
ה
 
א
ה
ר
ן
 
ל
פ
נ
י
 
ה
ע
ד
ו
ת
 
ל
מ
ש
מ
ר
ת
 
ל
א
ו
ת
 
ל
ב
נ
י
 
מ
ר
י
 
ו
ת
כ
ל
 
ת
ל
נ
ו
ת
ם
 
מ
ע
ל
י
 
ו
ל
א
 
י
מ
ו
ת
ו
 
ו
י
ע
ש
 
מ
ש
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
כ
ן
 
ע
ש
ה
 
ו
י
א
מ
ר
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ה
ן
 
ג
ו
ע
נ
ו
 
א
ב
ד
נ
ו
 
כ
ל
נ
ו
 
א
ב
ד
נ
ו
 
כ
ל
 
ה
ק
ר
ו
ב
 
ה
ק
ר
ב
 
א
ל
 
מ
ש
כ
ן
 
י
ה
ו
ה
 
י
ו
מ
ת
 
ה
א
ם
 
ת
מ
נ
ו
 
ל
ג
ו
ע
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
א
ה
ר
ן
 
א
ת
ה
 
ו
ב
נ
י
ך
 
ו
ב
י
ת
 
א
ב
י
ך
 
א
ת
ך
 
ת
ש
א
ו
 
א
ת
 
ע
ו
ן
 
ה
מ
ק
ד
ש
 
ו
א
ת
ה
 
ו
ב
נ
י
ך
 
א
ת
ך
 
ת
ש
א
ו
 
א
ת
 
ע
ו
ן
 
כ
ה
נ
ת
כ
ם
 
ו
ג
ם
 
א
ת
 
א
ח
י
ך
 
מ
ט
ה
 
ל
ו
י
 
ש
ב
ט
 
א
ב
י
ך
 
ה
ק
ר
י
ב
 
א
ת
ך
 
ו
י
ל
ו
ו
 
ע
ל
י
ך
 
ו
י
ש
ר
ת
ו
ך
 
ו
א
ת
ה
 
ו
ב
נ
י
ך
 
א
ת
ך
 
ל
פ
נ
י
 
א
ה
ל
 
ה
ע
ד
ו
ת
 
ו
ש
מ
ר
ו
 
מ
ש
מ
ר
ת
ך
 
ו
מ
ש
מ
ר
ת
 
כ
ל
 
ה
א
ה
ל
 
א
ך
 
א
ל
 
כ
ל
י
 
ה
ק
ד
ש
 
ו
א
ל
 
ה
מ
ז
ב
ח
 
ל
א
 
י
ק
ר
ב
ו
 
ו
ל
א
 
י
מ
ו
ת
ו
 
ג
ם
 
ה
ם
 
ג
ם
 
א
ת
ם
 
ו
נ
ל
ו
ו
 
ע
ל
י
ך
 
ו
ש
מ
ר
ו
 
א
ת
 
מ
ש
מ
ר
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
כ
ל
 
ע
ב
ד
ת
 
ה
א
ה
ל
 
ו
ז
ר
 
ל
א
 
י
ק
ר
ב
 
א
ל
י
כ
ם
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
מ
ש
מ
ר
ת
 
ה
ק
ד
ש
 
ו
א
ת
 
מ
ש
מ
ר
ת
 
ה
מ
ז
ב
ח
 
ו
ל
א
 
י
ה
י
ה
 
ע
ו
ד
 
ק
צ
ף
 
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
נ
י
 
ה
נ
ה
 
ל
ק
ח
ת
י
 
א
ת
 
א
ח
י
כ
ם
 
ה
ל
ו
י
ם
 
מ
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
כ
ם
 
מ
ת
נ
ה
 
נ
ת
נ
י
ם
 
ל
י
ה
ו
ה
 
ל
ע
ב
ד
 
א
ת
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
ת
ה
 
ו
ב
נ
י
ך
 
א
ת
ך
 
ת
ש
מ
ר
ו
 
א
ת
 
כ
ה
נ
ת
כ
ם
 
ל
כ
ל
 
ד
ב
ר
 
ה
מ
ז
ב
ח
 
ו
ל
מ
ב
י
ת
 
ל
פ
ר
כ
ת
 
ו
ע
ב
ד
ת
ם
 
ע
ב
ד
ת
 
מ
ת
נ
ה
 
א
ת
ן
 
א
ת
 
כ
ה
נ
ת
כ
ם
 
ו
ה
ז
ר
 
ה
ק
ר
ב
 
י
ו
מ
ת
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
א
ה
ר
ן
 
ו
א
נ
י
 
ה
נ
ה
 
נ
ת
ת
י
 
ל
ך
 
א
ת
 
מ
ש
מ
ר
ת
 
ת
ר
ו
מ
ת
י
 
ל
כ
ל
 
ק
ד
ש
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ך
 
נ
ת
ת
י
ם
 
ל
מ
ש
ח
ה
 
ו
ל
ב
נ
י
ך
 
ל
ח
ק
 
ע
ו
ל
ם
 
ז
ה
 
י
ה
י
ה
 
ל
ך
 
מ
ק
ד
ש
י
 
ה
ק
ד
ש
י
ם
 
מ
ן
 
ה
א
ש
 
כ
ל
 
ק
ר
ב
נ
ם
 
ל
כ
ל
 
מ
נ
ח
ת
ם
 
ו
ל
כ
ל
 
ח
ט
א
ת
ם
 
ו
ל
כ
ל
 
א
ש
מ
ם
 
א
ש
ר
 
י
א
ש
מ
ו
 
ל
י
 
ק
ד
ש
 
ק
ד
ש
י
ם
 
ל
ך
 
ה
ו
א
 
ו
ל
ב
נ
י
ך
 
ב
ק
ד
ש
 
ה
ק
ד
ש
י
ם
 
ת
א
כ
ל
נ
ו
 
כ
ל
 
ז
כ
ר
 
י
א
כ
ל
 
א
ת
ו
 
ק
ד
ש
 
י
ה
י
ה
 
ל
ך
 
ו
ז
ה
 
ל
ך
 
ת
ר
ו
מ
ת
 
מ
ת
נ
ם
 
ל
כ
ל
 
ת
נ
ו
פ
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ך
 
נ
ת
ת
י
ם
 
ו
ל
ב
נ
י
ך
 
ו
ל
ב
נ
ת
י
ך
 
א
ת
ך
 
ל
ח
ק
 
ע
ו
ל
ם
 
כ
ל
 
ט
ה
ו
ר
 
ב
ב
י
ת
ך
 
י
א
כ
ל
 
א
ת
ו
 
כ
ל
 
ח
ל
ב
 
י
צ
ה
ר
 
ו
כ
ל
 
ח
ל
ב
 
ת
י
ר
ש
 
ו
ד
ג
ן
 
ר
א
ש
י
ת
ם
 
א
ש
ר
 
י
ת
נ
ו
 
ל
י
ה
ו
ה
 
ל
ך
 
נ
ת
ת
י
ם
 
ב
כ
ו
ר
י
 
כ
ל
 
א
ש
ר
 
ב
א
ר
צ
ם
 
א
ש
ר
 
י
ב
י
א
ו
 
ל
י
ה
ו
ה
 
ל
ך
 
י
ה
י
ה
 
כ
ל
 
ט
ה
ו
ר
 
ב
ב
י
ת
ך
 
י
א
כ
ל
נ
ו
 
כ
ל
 
ח
ר
ם
 
ב
י
ש
ר
א
ל
 
ל
ך
 
י
ה
י
ה
 
כ
ל
 
פ
ט
ר
 
ר
ח
ם
 
ל
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
י
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
י
ה
י
ה
 
ל
ך
 
א
ך
 
פ
ד
ה
 
ת
פ
ד
ה
 
א
ת
 
ב
כ
ו
ר
 
ה
א
ד
ם
 
ו
א
ת
 
ב
כ
ו
ר
 
ה
ב
ה
מ
ה
 
ה
ט
מ
א
ה
 
ת
פ
ד
ה
 
ו
פ
ד
י
ו
 
מ
ב
ן
 
ח
ד
ש
 
ת
פ
ד
ה
 
ב
ע
ר
כ
ך
 
כ
ס
ף
 
ח
מ
ש
ת
 
ש
ק
ל
י
ם
 
ב
ש
ק
ל
 
ה
ק
ד
ש
 
ע
ש
ר
י
ם
 
ג
ר
ה
 
ה
ו
א
 
א
ך
 
ב
כ
ו
ר
 
ש
ו
ר
 
א
ו
 
ב
כ
ו
ר
 
כ
ש
ב
 
א
ו
 
ב
כ
ו
ר
 
ע
ז
 
ל
א
 
ת
פ
ד
ה
 
ק
ד
ש
 
ה
ם
 
א
ת
 
ד
מ
ם
 
ת
ז
ר
ק
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
א
ת
 
ח
ל
ב
ם
 
ת
ק
ט
י
ר
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
ב
ש
ר
ם
 
י
ה
י
ה
 
ל
ך
 
כ
ח
ז
ה
 
ה
ת
נ
ו
פ
ה
 
ו
כ
ש
ו
ק
 
ה
י
מ
י
ן
 
ל
ך
 
י
ה
י
ה
 
כ
ל
 
ת
ר
ו
מ
ת
 
ה
ק
ד
ש
י
ם
 
א
ש
ר
 
י
ר
י
מ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
י
ה
ו
ה
 
נ
ת
ת
י
 
ל
ך
 
ו
ל
ב
נ
י
ך
 
ו
ל
ב
נ
ת
י
ך
 
א
ת
ך
 
ל
ח
ק
 
ע
ו
ל
ם
 
ב
ר
י
ת
 
מ
ל
ח
 
ע
ו
ל
ם
 
ה
ו
א
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
ך
 
ו
ל
ז
ר
ע
ך
 
א
ת
ך
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
א
ה
ר
ן
 
ב
א
ר
צ
ם
 
ל
א
 
ת
נ
ח
ל
 
ו
ח
ל
ק
 
ל
א
 
י
ה
י
ה
 
ל
ך
 
ב
ת
ו
כ
ם
 
א
נ
י
 
ח
ל
ק
ך
 
ו
נ
ח
ל
ת
ך
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
ב
נ
י
 
ל
ו
י
 
ה
נ
ה
 
נ
ת
ת
י
 
כ
ל
 
מ
ע
ש
ר
 
ב
י
ש
ר
א
ל
 
ל
נ
ח
ל
ה
 
ח
ל
ף
 
ע
ב
ד
ת
ם
 
א
ש
ר
 
ה
ם
 
ע
ב
ד
י
ם
 
א
ת
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
א
 
י
ק
ר
ב
ו
 
ע
ו
ד
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
ש
א
ת
 
ח
ט
א
 
ל
מ
ו
ת
 
ו
ע
ב
ד
 
ה
ל
ו
י
 
ה
ו
א
 
א
ת
 
ע
ב
ד
ת
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
ה
ם
 
י
ש
א
ו
 
ע
ו
נ
ם
 
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ל
ד
ר
ת
י
כ
ם
 
ו
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
י
נ
ח
ל
ו
 
נ
ח
ל
ה
 
כ
י
 
א
ת
 
מ
ע
ש
ר
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
י
ר
י
מ
ו
 
ל
י
ה
ו
ה
 
ת
ר
ו
מ
ה
 
נ
ת
ת
י
ו
 
ל
ל
ו
י
ם
 
ל
נ
ח
ל
ה
 
ע
ל
 
כ
ן
 
א
מ
ר
ת
י
 
ל
ה
ם
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
י
נ
ח
ל
ו
 
נ
ח
ל
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ו
א
ל
 
ה
ל
ו
י
ם
 
ת
ד
ב
ר
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
ת
ק
ח
ו
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
מ
ע
ש
ר
 
א
ש
ר
 
נ
ת
ת
י
 
ל
כ
ם
 
מ
א
ת
ם
 
ב
נ
ח
ל
ת
י
כ
ם
 
ו
ה
ר
מ
ת
ם
 
מ
מ
נ
ו
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
מ
ע
ש
ר
 
מ
ן
 
ה
מ
ע
ש
ר
 
ו
נ
ח
ש
ב
 
ל
כ
ם
 
ת
ר
ו
מ
ת
י
כ
ם
 
כ
ד
ג
ן
 
מ
ן
 
ה
ג
ר
ן
 
ו
כ
מ
ל
א
ה
 
מ
ן
 
ה
י
ק
ב
 
כ
ן
 
ת
ר
י
מ
ו
 
ג
ם
 
א
ת
ם
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
מ
כ
ל
 
מ
ע
ש
ר
ת
י
כ
ם
 
א
ש
ר
 
ת
ק
ח
ו
 
מ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ת
ת
ם
 
מ
מ
נ
ו
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ל
א
ה
ר
ן
 
ה
כ
ה
ן
 
מ
כ
ל
 
מ
ת
נ
ת
י
כ
ם
 
ת
ר
י
מ
ו
 
א
ת
 
כ
ל
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
מ
כ
ל
 
ח
ל
ב
ו
 
א
ת
 
מ
ק
ד
ש
ו
 
מ
מ
נ
ו
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
ב
ה
ר
מ
כ
ם
 
א
ת
 
ח
ל
ב
ו
 
מ
מ
נ
ו
 
ו
נ
ח
ש
ב
 
ל
ל
ו
י
ם
 
כ
ת
ב
ו
א
ת
 
ג
ר
ן
 
ו
כ
ת
ב
ו
א
ת
 
י
ק
ב
 
ו
א
כ
ל
ת
ם
 
א
ת
ו
 
ב
כ
ל
 
מ
ק
ו
ם
 
א
ת
ם
 
ו
ב
ת
י
כ
ם
 
כ
י
 
ש
כ
ר
 
ה
ו
א
 
ל
כ
ם
 
ח
ל
ף
 
ע
ב
ד
ת
כ
ם
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
ל
א
 
ת
ש
א
ו
 
ע
ל
י
ו
 
ח
ט
א
 
ב
ה
ר
מ
כ
ם
 
א
ת
 
ח
ל
ב
ו
 
מ
מ
נ
ו
 
ו
א
ת
 
ק
ד
ש
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
ת
ח
ל
ל
ו
 
ו
ל
א
 
ת
מ
ו
ת
ו
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ל
א
מ
ר
 
ז
א
ת
 
ח
ק
ו
ת
 
ה
ת
ו
ר
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ח
ו
 
א
ל
י
ך
 
פ
ר
ה
 
א
ד
מ
ה
 
ת
מ
י
מ
ה
 
א
ש
ר
 
א
י
ן
 
ב
ה
 
מ
ו
ם
 
ו
א
ש
ר
 
ל
א
 
ע
ל
ה
 
ע
ל
י
ה
 
ע
ו
ל
 
ו
נ
ת
ת
ם
 
א
ת
ה
 
א
ל
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
ה
ו
צ
י
א
 
א
ת
ה
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
ש
ח
ט
 
א
ת
ה
 
ל
פ
נ
י
ו
 
ו
ל
ק
ח
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
מ
ד
מ
ה
 
ב
א
צ
ב
ע
ו
 
ו
ה
ז
ה
 
א
ל
 
נ
כ
ח
 
פ
נ
י
 
א
ה
ל
 
מ
ו
ע
ד
 
מ
ד
מ
ה
 
ש
ב
ע
 
פ
ע
מ
י
ם
 
ו
ש
ר
ף
 
א
ת
 
ה
פ
ר
ה
 
ל
ע
י
נ
י
ו
 
א
ת
 
ע
ו
ר
ה
 
ו
א
ת
 
ב
ש
ר
ה
 
ו
א
ת
 
ד
מ
ה
 
ע
ל
 
פ
ר
ש
ה
 
י
ש
ר
ף
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
ע
ץ
 
א
ר
ז
 
ו
א
ז
ו
ב
 
ו
ש
נ
י
 
ת
ו
ל
ע
ת
 
ו
ה
ש
ל
י
ך
 
א
ל
 
ת
ו
ך
 
ש
ר
פ
ת
 
ה
פ
ר
ה
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ה
כ
ה
ן
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
א
ח
ר
 
י
ב
ו
א
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
ט
מ
א
 
ה
כ
ה
ן
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
ש
ר
ף
 
א
ת
ה
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ב
מ
י
ם
 
ו
ר
ח
ץ
 
א
ת
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
א
ס
ף
 
א
י
ש
 
ט
ה
ו
ר
 
א
ת
 
א
פ
ר
 
ה
פ
ר
ה
 
ו
ה
נ
י
ח
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ב
מ
ק
ו
ם
 
ט
ה
ו
ר
 
ו
ה
י
ת
ה
 
ל
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
מ
ש
מ
ר
ת
 
ל
מ
י
 
נ
ד
ה
 
ח
ט
א
ת
 
ה
י
א
 
ו
כ
ב
ס
 
ה
א
ס
ף
 
א
ת
 
א
פ
ר
 
ה
פ
ר
ה
 
א
ת
 
ב
ג
ד
י
ו
 
ו
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
ה
י
ת
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
ג
ר
 
ה
ג
ר
 
ב
ת
ו
כ
ם
 
ל
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ה
נ
ג
ע
 
ב
מ
ת
 
ל
כ
ל
 
נ
פ
ש
 
א
ד
ם
 
י
ט
מ
א
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ה
ו
א
 
י
ת
ח
ט
א
 
ב
ו
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ט
ה
ר
 
ו
א
ם
 
ל
א
 
י
ת
ח
ט
א
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ל
א
 
י
ט
ה
ר
 
כ
ל
 
ה
נ
ג
ע
 
ב
מ
ת
 
ב
נ
פ
ש
 
א
ד
ם
 
א
ש
ר
 
י
מ
ו
ת
 
ו
ל
א
 
י
ת
ח
ט
א
 
א
ת
 
מ
ש
כ
ן
 
י
ה
ו
ה
 
ט
מ
א
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
י
ש
ר
א
ל
 
כ
י
 
מ
י
 
נ
ד
ה
 
ל
א
 
ז
ר
ק
 
ע
ל
י
ו
 
ט
מ
א
 
י
ה
י
ה
 
ע
ו
ד
 
ט
מ
א
ת
ו
 
ב
ו
 
ו
ז
א
ת
 
ה
ת
ו
ר
ה
 
א
ד
ם
 
כ
י
 
י
מ
ו
ת
 
ב
א
ה
ל
 
כ
ל
 
ה
ב
א
 
א
ל
 
ה
א
ה
ל
 
ו
כ
ל
 
א
ש
ר
 
ב
א
ה
ל
 
י
ט
מ
א
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
כ
ל
 
כ
ל
י
 
פ
ת
ו
ח
 
א
ש
ר
 
א
י
ן
 
צ
מ
י
ד
 
ו
פ
ת
י
ל
 
ע
ל
י
ו
 
ט
מ
א
 
ה
ו
א
 
ו
כ
ל
 
א
ש
ר
 
י
ג
ע
 
ע
ל
 
פ
נ
י
 
ה
ש
ד
ה
 
ב
ח
ל
ל
 
ח
ר
ב
 
א
ו
 
ב
מ
ת
 
א
ו
 
ב
ע
צ
ם
 
א
ד
ם
 
א
ו
 
ב
ק
ב
ר
 
י
ט
מ
א
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ל
ק
ח
ו
 
ל
ט
מ
א
 
מ
ע
פ
ר
 
ש
ר
פ
ת
 
ה
ח
ט
א
ת
 
ו
נ
ת
נ
ו
 
ע
ל
י
ו
 
מ
י
ם
 
ח
י
י
ם
 
א
ל
 
כ
ל
י
 
ו
ל
ק
ח
 
א
ז
ו
ב
 
ו
ט
ב
ל
 
ב
מ
י
ם
 
א
י
ש
 
ט
ה
ו
ר
 
ו
ה
ז
ה
 
ע
ל
 
ה
א
ה
ל
 
ו
ע
ל
 
ה
כ
ל
י
ם
 
ו
ע
ל
 
ה
נ
פ
ש
ו
ת
 
א
ש
ר
 
ה
י
ו
 
ש
ם
 
ו
ע
ל
 
ה
נ
ג
ע
 
ב
ע
צ
ם
 
א
ו
 
ב
ח
ל
ל
 
א
ו
 
ב
מ
ת
 
א
ו
 
ב
ק
ב
ר
 
ו
ה
ז
ה
 
ה
ט
ה
ו
ר
 
ע
ל
 
ה
ט
מ
א
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ח
ט
א
ו
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ר
ח
ץ
 
ב
מ
י
ם
 
ו
ט
ה
ר
 
ב
ע
ר
ב
 
ו
ה
א
י
ש
 
א
ש
ר
 
י
ט
מ
א
 
ו
ל
א
 
י
ת
ח
ט
א
 
ו
נ
כ
ר
ת
ה
 
ה
נ
פ
ש
 
ה
ה
י
א
 
מ
ת
ו
ך
 
ה
ק
ה
ל
 
כ
י
 
א
ת
 
מ
ק
ד
ש
 
י
ה
ו
ה
 
ט
מ
א
 
מ
י
 
נ
ד
ה
 
ל
א
 
ז
ר
ק
 
ע
ל
י
ו
 
ט
מ
א
 
ה
ו
א
 
ו
ה
י
ת
ה
 
ל
כ
ם
 
ל
ח
ק
ו
ת
 
ע
ו
ל
ם
 
ו
מ
ז
ה
 
מ
י
 
ה
נ
ד
ה
 
י
כ
ב
ס
 
ב
ג
ד
י
ו
 
ו
ה
נ
ג
ע
 
ב
מ
י
 
ה
נ
ד
ה
 
י
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
כ
ל
 
א
ש
ר
 
י
ג
ע
 
ב
ו
 
ה
ט
מ
א
 
י
ט
מ
א
 
ו
ה
נ
פ
ש
 
ה
נ
ג
ע
ת
 
ת
ט
מ
א
 
ע
ד
 
ה
ע
ר
ב
 
ו
י
ב
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
ל
 
ה
ע
ד
ה
 
מ
ד
ב
ר
 
צ
ן
 
ב
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ו
י
ש
ב
 
ה
ע
ם
 
ב
ק
ד
ש
 
ו
ת
מ
ת
 
ש
ם
 
מ
ר
י
ם
 
ו
ת
ק
ב
ר
 
ש
ם
 
ו
ל
א
 
ה
י
ה
 
מ
י
ם
 
ל
ע
ד
ה
 
ו
י
ק
ה
ל
ו
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
ו
י
ר
ב
 
ה
ע
ם
 
ע
ם
 
מ
ש
ה
 
ו
י
א
מ
ר
ו
 
ל
א
מ
ר
 
ו
ל
ו
י
 
ג
ו
ע
נ
ו
 
ב
ג
ו
ע
 
א
ח
י
נ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
מ
ה
 
ה
ב
א
ת
ם
 
א
ת
 
ק
ה
ל
 
י
ה
ו
ה
 
א
ל
 
ה
מ
ד
ב
ר
 
ה
ז
ה
 
ל
מ
ו
ת
 
ש
ם
 
א
נ
ח
נ
ו
 
ו
ב
ע
י
ר
נ
ו
 
ו
ל
מ
ה
 
ה
ע
ל
י
ת
נ
ו
 
מ
מ
צ
ר
י
ם
 
ל
ה
ב
י
א
 
א
ת
נ
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
ה
ר
ע
 
ה
ז
ה
 
ל
א
 
מ
ק
ו
ם
 
ז
ר
ע
 
ת
א
נ
ה
 
ג
פ
ן
 
ו
ר
מ
ו
ן
 
ו
מ
י
ם
 
א
י
ן
 
ל
ש
ת
ו
ת
 
ו
י
ב
א
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
מ
פ
נ
י
 
ה
ק
ה
ל
 
א
ל
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
פ
ל
ו
 
ע
ל
 
פ
נ
י
ה
ם
 
ו
י
ר
א
 
כ
ב
ו
ד
 
י
ה
ו
ה
 
א
ל
י
ה
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ק
ח
 
א
ת
 
ה
מ
ט
ה
 
ו
ה
ק
ה
ל
 
א
ת
 
ה
ע
ד
ה
 
א
ת
ה
 
ו
א
ה
ר
ן
 
א
ח
י
ך
 
ו
ד
ב
ר
ת
ם
 
א
ל
 
ה
ס
ל
ע
 
ל
ע
י
נ
י
ה
ם
 
ו
נ
ת
ן
 
מ
י
מ
י
ו
 
ו
ה
ו
צ
א
ת
 
ל
ה
ם
 
מ
י
ם
 
מ
ן
 
ה
ס
ל
ע
 
ו
ה
ש
ק
י
ת
 
א
ת
 
ה
ע
ד
ה
 
ו
א
ת
 
ב
ע
י
ר
ם
 
ו
י
ק
ח
 
מ
ש
ה
 
א
ת
 
ה
מ
ט
ה
 
מ
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
ו
 
ו
י
ק
ה
ל
ו
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
א
ת
 
ה
ק
ה
ל
 
א
ל
 
פ
נ
י
 
ה
ס
ל
ע
 
ו
י
א
מ
ר
 
ל
ה
ם
 
ש
מ
ע
ו
 
נ
א
 
ה
מ
ר
י
ם
 
ה
מ
ן
 
ה
ס
ל
ע
 
ה
ז
ה
 
נ
ו
צ
י
א
 
ל
כ
ם
 
מ
י
ם
 
ו
י
ר
ם
 
מ
ש
ה
 
א
ת
 
י
ד
ו
 
ו
י
ך
 
א
ת
 
ה
ס
ל
ע
 
ב
מ
ט
ה
ו
 
פ
ע
מ
י
ם
 
ו
י
צ
א
ו
 
מ
י
ם
 
ר
ב
י
ם
 
ו
ת
ש
ת
 
ה
ע
ד
ה
 
ו
ב
ע
י
ר
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
י
ע
ן
 
ל
א
 
ה
א
מ
נ
ת
ם
 
ב
י
 
ל
ה
ק
ד
י
ש
נ
י
 
ל
ע
י
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
כ
ן
 
ל
א
 
ת
ב
י
א
ו
 
א
ת
 
ה
ק
ה
ל
 
ה
ז
ה
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ת
י
 
ל
ה
ם
 
ה
ם
 
מ
י
 
מ
ר
י
ב
ה
 
א
ש
ר
 
ר
ב
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
י
ה
ו
ה
 
ו
י
ק
ד
ש
 
ב
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ד
נ
י
 
י
ה
ו
ה
 
א
ת
ה
 
ה
ח
ל
ת
 
ל
ה
ר
א
ו
ת
 
א
ת
 
ע
ב
ד
ך
 
א
ת
 
ג
ד
ל
ך
 
ו
א
ת
 
י
ד
ך
 
ה
ח
ז
ק
ה
 
א
ש
ר
 
מ
י
 
א
ל
 
ב
ש
מ
י
ם
 
ו
ב
א
ר
ץ
 
א
ש
ר
 
י
ע
ש
ה
 
כ
מ
ע
ש
י
ך
 
ו
כ
ג
ב
ו
ר
ת
י
ך
 
א
ע
ב
ר
ה
 
נ
א
 
ו
א
ר
א
ה
 
א
ת
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ה
ה
ר
 
ה
ט
ו
ב
 
ה
ז
ה
 
ו
ה
ל
ב
נ
ו
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ר
ב
 
ל
ך
 
א
ל
 
ת
ו
ס
ף
 
ד
ב
ר
 
א
ל
י
 
ע
ו
ד
 
ב
ד
ב
ר
 
ה
ז
ה
 
ע
ל
ה
 
א
ל
 
ר
א
ש
 
ה
פ
ס
ג
ה
 
ו
ש
א
 
ע
י
נ
י
ך
 
י
מ
ה
 
ו
צ
פ
ו
נ
ה
 
ו
ת
י
מ
נ
ה
 
ו
מ
ז
ר
ח
ה
 
ו
ר
א
ה
 
ב
ע
י
נ
י
ך
 
כ
י
 
ל
א
 
ת
ע
ב
ר
 
א
ת
 
ה
י
ר
ד
ן
 
ה
ז
ה
 
ו
צ
ו
י
 
א
ת
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
ח
ז
ק
ה
ו
 
ו
א
מ
צ
ה
ו
 
כ
י
 
ה
ו
א
 
י
ע
ב
ר
 
ל
פ
נ
י
 
ה
ע
ם
 
ה
ז
ה
 
ו
ה
ו
א
 
י
נ
ח
ל
 
א
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
ת
ר
א
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ר
ב
 
ל
כ
ם
 
ס
ו
ב
 
א
ת
 
ה
ה
ר
 
ה
ז
ה
 
פ
נ
ו
 
ל
כ
ם
 
צ
פ
ו
נ
ה
 
ו
א
ת
 
ה
ע
ם
 
צ
ו
י
 
ל
א
מ
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
ב
ג
ב
ו
ל
 
א
ח
י
כ
ם
 
ב
נ
י
 
ע
ש
ו
 
ה
י
ש
ב
י
ם
 
ב
ש
ע
י
ר
 
ו
י
י
ר
א
ו
 
מ
כ
ם
 
ו
נ
ש
מ
ר
ת
ם
 
מ
א
ד
 
א
ל
 
ת
ת
ג
ר
ו
 
ב
ם
 
כ
י
 
ל
א
 
א
ת
ן
 
ל
כ
ם
 
מ
א
ר
צ
ם
 
י
ר
ש
ה
 
ע
ד
 
מ
ד
ר
ך
 
כ
ף
 
ר
ג
ל
 
כ
י
 
י
ר
ש
ה
 
ל
ע
ש
ו
 
נ
ת
ת
י
 
א
ת
 
ה
ר
 
ש
ע
י
ר
 
א
כ
ל
 
ת
ש
ב
ר
ו
 
מ
א
ת
ם
 
ב
כ
ס
ף
 
ו
א
כ
ל
ת
ם
 
ו
ג
ם
 
מ
י
ם
 
ת
כ
י
ר
ו
 
מ
א
ת
ם
 
ב
כ
ס
ף
 
ו
ש
ת
י
ת
ם
 
ו
י
ש
ל
ח
 
מ
ש
ה
 
מ
ל
א
כ
י
ם
 
מ
ק
ד
ש
 
א
ל
 
מ
ל
ך
 
א
ד
ו
ם
 
כ
ה
 
א
מ
ר
 
א
ח
י
ך
 
י
ש
ר
א
ל
 
א
ת
ה
 
י
ד
ע
ת
 
א
ת
 
כ
ל
 
ה
ת
ל
א
ה
 
א
ש
ר
 
מ
צ
א
ת
נ
ו
 
ו
י
ר
ד
ו
 
א
ב
ת
י
נ
ו
 
מ
צ
ר
י
מ
ה
 
ו
נ
ש
ב
 
ב
מ
צ
ר
י
ם
 
י
מ
י
ם
 
ר
ב
י
ם
 
ו
י
ר
י
ע
ו
 
ל
נ
ו
 
ה
מ
צ
ר
י
ם
 
ו
ל
א
ב
ת
י
נ
ו
 
ו
נ
צ
ע
ק
 
א
ל
 
י
ה
ו
ה
 
ו
י
ש
מ
ע
 
ק
ו
ל
נ
ו
 
ו
י
ש
ל
ח
 
מ
ל
א
ך
 
ו
י
ו
צ
י
א
נ
ו
 
מ
מ
צ
ר
י
ם
 
ו
ה
נ
ה
 
א
נ
ח
נ
ו
 
ב
ק
ד
ש
 
ע
י
ר
 
ק
צ
ה
 
ג
ב
ו
ל
ך
 
נ
ע
ב
ר
 
נ
א
 
ב
א
ר
צ
ך
 
ל
א
 
נ
ע
ב
ר
 
ב
ש
ד
ה
 
ו
ב
כ
ר
ם
 
ו
ל
א
 
נ
ש
ת
ה
 
מ
י
 
ב
ו
ר
 
ד
ר
ך
 
ה
מ
ל
ך
 
נ
ל
ך
 
ל
א
 
נ
ס
ו
ר
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ע
ד
 
א
ש
ר
 
נ
ע
ב
ר
 
ג
ב
ו
ל
ך
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ד
ו
ם
 
ל
א
 
ת
ע
ב
ר
 
ב
י
 
פ
ן
 
ב
ח
ר
ב
 
א
צ
א
 
ל
ק
ר
א
ת
ך
 
ו
י
א
מ
ר
ו
 
א
ל
י
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
מ
ס
ל
ה
 
נ
ע
ל
ה
 
ו
א
ם
 
מ
מ
י
מ
י
ך
 
נ
ש
ת
ה
 
א
נ
י
 
ו
מ
ק
נ
י
 
ו
נ
ת
ת
י
 
מ
כ
ר
ם
 
ר
ק
 
א
י
ן
 
ד
ב
ר
 
ב
ר
ג
ל
י
 
א
ע
ב
ר
 
ו
י
א
מ
ר
 
ל
א
 
ת
ע
ב
ר
 
ו
י
צ
א
 
א
ד
ו
ם
 
ל
ק
ר
א
ת
ו
 
ב
ע
ם
 
כ
ב
ד
 
ו
ב
י
ד
 
ח
ז
ק
ה
 
ו
י
מ
א
ן
 
א
ד
ו
ם
 
נ
ת
ו
ן
 
א
ת
 
י
ש
ר
א
ל
 
ע
ב
ר
 
ב
ג
ב
ו
ל
ו
 
ו
י
ט
 
י
ש
ר
א
ל
 
מ
ע
ל
י
ו
 
ו
י
ס
ע
ו
 
מ
ק
ד
ש
 
ו
י
ב
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
ל
 
ה
ע
ד
ה
 
ה
ר
 
ה
ה
ר
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ה
ר
ן
 
ב
ה
ר
 
ה
ה
ר
 
ע
ל
 
ג
ב
ו
ל
 
א
ר
ץ
 
א
ד
ו
ם
 
ל
א
מ
ר
 
י
א
ס
ף
 
א
ה
ר
ן
 
א
ל
 
ע
מ
ו
 
כ
י
 
ל
א
 
י
ב
ו
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ת
י
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ל
 
א
ש
ר
 
מ
ר
י
ת
ם
 
א
ת
 
פ
י
י
 
ל
מ
י
 
מ
ר
י
ב
ה
 
ק
ח
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
א
ל
ע
ז
ר
 
ב
נ
ו
 
ו
ה
ע
ל
 
א
ת
ם
 
ה
ר
 
ה
ה
ר
 
ו
ה
פ
ש
ט
ת
 
א
ת
 
א
ה
ר
ן
 
א
ת
 
ב
ג
ד
י
ו
 
ו
ה
ל
ב
ש
ת
ם
 
א
ת
 
א
ל
ע
ז
ר
 
ב
נ
ו
 
ו
א
ה
ר
ן
 
י
א
ס
ף
 
ו
י
מ
ת
 
ש
ם
 
ו
י
ע
ש
 
מ
ש
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ו
י
ע
ל
ה
ו
 
א
ל
 
ה
ר
 
ה
ה
ר
 
ל
ע
י
נ
י
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
פ
ש
ט
 
מ
ש
ה
 
א
ת
 
א
ה
ר
ן
 
א
ת
 
ב
ג
ד
י
ו
 
ו
י
ל
ב
ש
 
א
ת
ם
 
א
ת
 
א
ל
ע
ז
ר
 
ב
נ
ו
 
ו
י
מ
ת
 
א
ה
ר
ן
 
ש
ם
 
ב
ר
א
ש
 
ה
ה
ר
 
ו
י
ר
ד
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
מ
ן
 
ה
ה
ר
 
ו
י
ר
א
ו
 
כ
ל
 
ה
ע
ד
ה
 
כ
י
 
ג
ו
ע
 
א
ה
ר
ן
 
ו
י
ב
כ
ו
 
א
ת
 
א
ה
ר
ן
 
ש
ל
ש
י
ם
 
י
ו
ם
 
כ
ל
 
ב
י
ת
 
י
ש
ר
א
ל
 
ו
י
ש
מ
ע
 
ה
כ
נ
ע
נ
י
 
מ
ל
ך
 
ע
ר
ד
 
י
ש
ב
 
ה
נ
ג
ב
 
כ
י
 
ב
א
 
י
ש
ר
א
ל
 
ד
ר
ך
 
ה
א
ת
ו
ר
י
ם
 
ו
י
ל
ח
ם
 
ב
י
ש
ר
א
ל
 
ו
י
ש
ב
 
מ
מ
נ
ו
 
ש
ב
י
 
ו
י
ד
ר
 
י
ש
ר
א
ל
 
נ
ד
ר
 
ל
י
ה
ו
ה
 
ו
י
א
מ
ר
 
א
ם
 
נ
ת
ו
ן
 
ת
ת
ן
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
ב
י
ד
י
 
ו
ח
ר
מ
ת
י
 
א
ת
 
ע
ר
י
ה
ם
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
ב
ק
ו
ל
 
י
ש
ר
א
ל
 
ו
י
ת
ן
 
א
ת
 
ה
כ
נ
ע
נ
י
 
ב
י
ד
ו
 
ו
י
ח
ר
ם
 
א
ת
ם
 
ו
א
ת
 
ע
ר
י
ה
ם
 
ו
י
ק
ר
א
 
ש
ם
 
ה
מ
ק
ו
ם
 
ח
ר
מ
ה
 
ו
י
ס
ע
ו
 
מ
ה
ר
 
ה
ה
ר
 
ד
ר
ך
 
י
ם
 
ס
ו
ף
 
ל
ס
ב
ב
 
א
ת
 
א
ר
ץ
 
א
ד
ו
ם
 
ו
ת
ק
צ
ר
 
נ
פ
ש
 
ה
ע
ם
 
ב
ד
ר
ך
 
ו
י
ד
ב
ר
 
ה
ע
ם
 
ב
א
ל
ה
י
ם
 
ו
ב
מ
ש
ה
 
ל
מ
ה
 
ה
ו
צ
א
ת
נ
ו
 
מ
מ
צ
ר
י
ם
 
ל
מ
ו
ת
 
ב
מ
ד
ב
ר
 
כ
י
 
א
י
ן
 
ל
ח
ם
 
ו
א
י
ן
 
מ
י
ם
 
ו
נ
פ
ש
נ
ו
 
ק
צ
ה
 
ב
ל
ח
ם
 
ה
ק
ל
ק
ל
 
ו
י
ש
ל
ח
 
י
ה
ו
ה
 
ב
ע
ם
 
א
ת
 
ה
נ
ח
ש
י
ם
 
ה
ש
ר
ו
פ
י
ם
 
ו
י
נ
ש
כ
ו
 
א
ת
 
ה
ע
ם
 
ו
י
מ
ת
 
ע
ם
 
ר
ב
 
מ
י
ש
ר
א
ל
 
ו
י
ב
א
 
ה
ע
ם
 
א
ל
 
מ
ש
ה
 
ו
י
א
מ
ר
ו
 
ח
ט
א
נ
ו
 
כ
י
 
ד
ב
ר
נ
ו
 
ב
י
ה
ו
ה
 
ו
ב
ך
 
ה
ת
פ
ל
ל
 
א
ל
 
י
ה
ו
ה
 
ו
י
ס
ר
 
מ
ע
ל
י
נ
ו
 
א
ת
 
ה
נ
ח
ש
 
ו
י
ת
פ
ל
ל
 
מ
ש
ה
 
ב
ע
ד
 
ה
ע
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ע
ש
ה
 
ל
ך
 
ש
ר
ו
ף
 
ו
ש
י
ם
 
א
ת
ו
 
ע
ל
 
ה
נ
ס
 
ו
ה
י
ה
 
כ
ל
 
ה
נ
ש
ך
 
ו
ר
א
ה
 
א
ת
ו
 
ו
ח
י
 
ו
י
ע
ש
 
מ
ש
ה
 
נ
ח
ש
 
נ
ח
ש
ת
 
ו
י
ש
מ
ה
ו
 
ע
ל
 
ה
נ
ס
 
ו
ה
י
ה
 
א
ם
 
נ
ש
ך
 
ה
נ
ח
ש
 
א
ת
 
ה
א
י
ש
 
ו
ה
ב
י
ט
 
א
ל
 
נ
ח
ש
 
ה
נ
ח
ש
ת
 
ו
ח
י
 
ו
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ח
נ
ו
 
ב
א
ב
ו
ת
 
ו
י
ס
ע
ו
 
מ
א
ב
ו
ת
 
ו
י
ח
נ
ו
 
ב
ע
י
י
 
ה
ע
ב
ר
י
ם
 
ב
מ
ד
ב
ר
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
מ
ו
א
ב
 
מ
ז
ר
ח
 
ה
ש
מ
ש
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ל
 
ת
צ
ו
ר
 
א
ת
 
מ
ו
א
ב
 
ו
א
ל
 
ת
ת
ג
ר
 
ב
ם
 
כ
י
 
ל
א
 
א
ת
ן
 
ל
ך
 
מ
א
ר
צ
ו
 
י
ר
ש
ה
 
כ
י
 
ל
ב
נ
י
 
ל
ו
ט
 
נ
ת
ת
י
 
א
ת
 
ע
ר
 
י
ר
ש
ה
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ב
נ
ח
ל
 
ז
ר
ד
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
א
ת
ה
 
ע
ב
ר
 
ה
י
ו
ם
 
א
ת
 
ג
ב
ו
ל
 
מ
ו
א
ב
 
א
ת
 
ע
ר
 
ו
ק
ר
ב
ת
 
מ
ו
ל
 
ב
נ
י
 
ע
מ
ו
ן
 
א
ל
 
ת
צ
ו
ר
ם
 
ו
א
ל
 
ת
ת
ג
ר
 
ב
ם
 
כ
י
 
ל
א
 
א
ת
ן
 
מ
א
ר
ץ
 
ב
נ
י
 
ע
מ
ו
ן
 
ל
ך
 
י
ר
ש
ה
 
כ
י
 
ל
ב
נ
י
 
ל
ו
ט
 
נ
ת
ת
י
ה
 
י
ר
ש
ה
 
ו
י
ס
ע
ו
 
מ
נ
ח
ל
 
ז
ר
ד
 
ו
י
ח
נ
ו
 
ב
ע
ב
ר
 
א
ר
נ
ן
 
א
ש
ר
 
ע
ל
 
ה
מ
ד
ב
ר
 
ה
י
ו
צ
א
 
מ
ג
ב
ו
ל
 
ה
א
מ
ר
י
 
כ
י
 
א
ר
נ
ן
 
ג
ב
ו
ל
 
מ
ו
א
ב
 
ב
י
ן
 
מ
ו
א
ב
 
ו
ב
י
ן
 
ה
א
מ
ר
י
 
ע
ל
 
כ
ן
 
י
א
מ
ר
 
ב
ס
פ
ר
 
מ
ל
ח
מ
ו
ת
 
י
ה
ו
ה
 
א
ת
 
ו
ה
ב
 
ב
ס
ו
פ
ה
 
ו
א
ת
 
ה
נ
ח
ל
י
ם
 
א
ר
נ
ן
 
א
ש
ר
 
ה
נ
ח
י
ל
ם
 
ו
א
ש
ר
 
נ
ט
ה
 
ל
ש
ב
ת
 
ע
י
ר
 
ו
נ
ש
ע
ן
 
ל
ג
ב
ו
ל
 
מ
ו
א
ב
 
ו
מ
ש
ם
 
ב
א
ר
ה
 
ה
י
א
 
ה
ב
א
ר
 
א
ש
ר
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ס
פ
ה
 
ל
י
 
א
ת
 
ה
ע
ם
 
ו
א
ת
ן
 
ל
ה
ם
 
מ
י
ם
 
א
ז
 
י
ש
י
ר
 
י
ש
ר
א
ל
 
א
ת
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ע
ל
ה
 
ב
א
ר
 
ע
נ
ו
 
ל
ה
 
ב
א
ר
 
ח
פ
ר
ו
ה
 
ש
ר
י
ם
 
כ
ר
ו
א
ה
 
נ
ד
י
ב
י
 
ה
ע
ם
 
ב
מ
ח
ק
ק
 
ו
ב
מ
ש
ע
נ
ת
ם
 
מ
מ
ד
ב
ר
 
מ
ת
נ
ה
 
ו
מ
מ
ת
נ
ה
 
נ
ח
ל
י
א
ל
 
ו
מ
נ
ח
ל
י
א
ל
 
ב
מ
ו
ת
 
ו
מ
ב
מ
ו
ת
 
ה
ג
י
א
 
א
ש
ר
 
ב
ש
ד
ה
 
מ
ו
א
ב
 
ר
א
ש
 
ה
פ
ס
ג
ה
 
ה
נ
ש
ק
ף
 
ע
ל
 
פ
נ
י
 
ה
י
ש
מ
ו
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ק
ו
מ
ו
 
ס
ע
ו
 
ו
ע
ב
ר
ו
 
א
ת
 
נ
ח
ל
 
א
ר
נ
ן
 
ר
א
ה
 
נ
ת
ת
י
 
ב
י
ד
ך
 
א
ת
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ה
א
מ
ר
י
 
ו
א
ת
 
א
ר
צ
ו
 
ה
ח
ל
 
ר
ש
 
ו
ה
ת
ג
ר
 
ב
ו
 
מ
ל
ח
מ
ה
 
ה
י
ו
ם
 
ה
ז
ה
 
ה
ח
ל
 
ת
ת
 
פ
ח
ד
ך
 
ו
י
ר
א
ת
ך
 
ע
ל
 
פ
נ
י
 
ה
ע
מ
י
ם
 
ת
ח
ת
 
כ
ל
 
ה
ש
מ
י
ם
 
א
ש
ר
 
י
ש
מ
ע
ו
 
א
ת
 
ש
מ
ע
ך
 
ו
ר
ג
ז
ו
 
ו
ח
ל
ו
 
מ
פ
נ
י
ך
 
ו
י
ש
ל
ח
 
י
ש
ר
א
ל
 
מ
ל
א
כ
י
ם
 
א
ל
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
ד
ב
ר
י
 
ש
ל
ו
ם
 
ל
א
מ
ר
 
א
ע
ב
ר
ה
 
ב
א
ר
צ
ך
 
ב
ד
ר
ך
 
ה
מ
ל
ך
 
א
ל
ך
 
ל
א
 
א
ס
ו
ר
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ל
א
 
א
ט
ה
 
ב
ש
ד
ה
 
ו
ב
כ
ר
ם
 
א
כ
ל
 
ב
כ
ס
ף
 
ת
ש
ב
י
ר
נ
י
 
ו
א
כ
ל
ת
י
 
ו
מ
י
ם
 
ב
כ
ס
ף
 
ת
ת
ן
 
ל
י
 
ו
ש
ת
י
ת
י
 
ר
ק
 
א
ע
ב
ר
ה
 
ב
ר
ג
ל
י
 
כ
א
ש
ר
 
ע
ש
ו
 
ל
י
 
ב
נ
י
 
ע
ש
ו
 
ה
י
ש
ב
י
ם
 
ב
ש
ע
י
ר
 
ו
ה
מ
ו
א
ב
י
ם
 
ה
י
ש
ב
י
ם
 
ב
ע
ר
 
ו
ל
א
 
נ
ת
ן
 
ס
י
ח
ו
ן
 
א
ת
 
י
ש
ר
א
ל
 
ע
ב
ר
 
ב
ג
ב
ו
ל
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ר
א
ה
 
ה
ח
ל
ת
י
 
ת
ת
 
ל
פ
נ
י
ך
 
א
ת
 
ס
י
ח
ו
ן
 
ו
א
ת
 
א
ר
צ
ו
 
ה
ח
ל
 
ר
ש
 
ל
ר
ש
ת
 
א
ת
 
א
ר
צ
ו
 
ו
י
א
ס
ף
 
ס
י
ח
ו
ן
 
א
ת
 
כ
ל
 
ע
מ
ו
 
ו
י
צ
א
 
ל
ק
ר
א
ת
 
י
ש
ר
א
ל
 
ה
מ
ד
ב
ר
ה
 
ו
י
ב
א
 
י
ח
צ
ה
 
ו
י
ל
ח
ם
 
ב
י
ש
ר
א
ל
 
ו
י
כ
ה
ו
 
י
ש
ר
א
ל
 
ו
א
ת
 
ב
נ
י
ו
 
ו
א
ת
 
כ
ל
 
ע
מ
ו
 
ל
פ
י
 
ח
ר
ב
 
ו
י
י
ר
ש
ו
 
א
ת
 
א
ר
צ
ו
 
מ
א
ר
נ
ן
 
ע
ד
 
י
ב
ק
 
ע
ד
 
ב
נ
י
 
ע
מ
ו
ן
 
כ
י
 
ע
ז
 
ג
ב
ו
ל
 
ב
נ
י
 
ע
מ
ו
ן
 
ו
י
ק
ח
 
י
ש
ר
א
ל
 
א
ת
 
כ
ל
 
ה
ע
ר
י
ם
 
ה
א
ל
ה
 
ו
י
ש
ב
 
י
ש
ר
א
ל
 
ב
כ
ל
 
ע
ר
י
 
ה
א
מ
ר
י
 
ב
ח
ש
ב
ו
ן
 
ו
ב
כ
ל
 
ב
נ
ת
י
ה
 
כ
י
 
ח
ש
ב
ו
ן
 
ע
י
ר
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
ה
י
א
 
ו
ה
ו
א
 
ה
נ
ל
ח
ם
 
ב
מ
ל
ך
 
מ
ו
א
ב
 
ה
ר
א
י
ש
ו
ן
 
ו
י
ק
ח
 
א
ת
 
כ
ל
 
א
ר
צ
ו
 
מ
י
ד
ו
 
ע
ד
 
א
ר
נ
ן
 
ע
ל
 
כ
ן
 
י
א
מ
ר
ו
 
ה
מ
ש
ל
י
ם
 
ב
א
י
 
ח
ש
ב
ו
ן
 
ת
ב
נ
ה
 
ו
ת
ת
כ
ו
נ
ן
 
ע
י
ר
 
ס
י
ח
ו
ן
 
כ
י
 
א
ש
 
י
צ
א
ה
 
מ
ח
ש
ב
ו
ן
 
ל
ה
ב
ה
 
מ
ק
ר
י
ת
 
ס
י
ח
ו
ן
 
א
כ
ל
ה
 
ע
ד
 
מ
ו
א
ב
 
ב
ע
ל
י
 
ב
מ
ו
ת
 
א
ר
נ
ן
 
א
ו
י
 
ל
ך
 
מ
ו
א
ב
 
א
ב
ד
ת
 
ע
ם
 
כ
מ
ו
ש
 
נ
ת
ן
 
ב
נ
י
ו
 
פ
ל
ט
י
ם
 
ו
ב
נ
ת
י
ו
 
ב
ש
ב
י
 
ל
מ
ל
ך
 
ה
א
מ
ר
י
 
ס
י
ח
ו
ן
 
ו
נ
י
ר
ם
 
א
ב
ד
ה
 
ח
ש
ב
ו
ן
 
ע
ד
 
ד
י
ב
ו
ן
 
ו
נ
ש
י
ם
 
ע
ד
 
ה
נ
פ
ח
 
א
ש
 
ע
ל
 
מ
י
ד
ב
א
 
ו
י
ש
ב
 
י
ש
ר
א
ל
 
ב
ע
ר
י
 
ה
א
מ
ר
י
 
ו
י
ש
ל
ח
 
מ
ש
ה
 
ל
ר
ג
ל
 
א
ת
 
י
ע
ז
י
ר
 
ו
י
ל
כ
ד
ו
 
ב
נ
ת
י
ה
 
ו
י
ו
ר
י
ש
ו
 
א
ת
 
ה
א
מ
ר
י
 
א
ש
ר
 
ש
ם
 
ו
י
פ
נ
ו
 
ו
י
ע
ל
ו
 
ד
ר
ך
 
ה
ב
ש
ן
 
ו
י
צ
א
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
ל
ק
ר
א
ת
ם
 
ה
ו
א
 
ו
כ
ל
 
ע
מ
ו
 
ל
מ
ל
ח
מ
ה
 
א
ד
ר
ע
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
ל
 
ת
י
ר
א
 
א
ת
ו
 
כ
י
 
ב
י
ד
ך
 
נ
ת
ת
י
 
א
ת
ו
 
ו
א
ת
 
כ
ל
 
ע
מ
ו
 
ו
א
ת
 
א
ר
צ
ו
 
ו
ע
ש
י
ת
 
ל
ו
 
כ
א
ש
ר
 
ע
ש
י
ת
 
ל
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
א
ש
ר
 
י
ש
ב
 
ב
ח
ש
ב
ו
ן
 
ו
י
כ
ו
 
א
ת
ו
 
ו
א
ת
 
כ
ל
 
ע
מ
ו
 
ע
ד
 
ב
ל
ת
י
 
ה
ש
א
י
ר
 
ל
ו
 
ש
ר
י
ד
 
ו
י
י
ר
ש
ו
 
א
ת
 
א
ר
צ
ו
 
ו
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ח
נ
ו
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
מ
ע
ב
ר
 
ל
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ו
י
ר
א
 
ב
ל
ק
 
ב
ן
 
צ
פ
ו
ר
 
א
ת
 
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
י
ש
ר
א
ל
 
ל
א
מ
ר
י
 
ו
י
ג
ר
 
מ
ו
א
ב
 
מ
פ
נ
י
 
ה
ע
ם
 
מ
א
ד
 
כ
י
 
ר
ב
 
ה
ו
א
 
ו
י
ק
ץ
 
מ
ו
א
ב
 
מ
פ
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
מ
ו
א
ב
 
א
ל
 
ז
ק
נ
י
 
מ
ד
י
ן
 
ע
ת
ה
 
י
ל
ח
ך
 
ה
ק
ה
ל
 
ה
ז
ה
 
א
ת
 
כ
ל
 
ס
ב
י
ב
ת
י
נ
ו
 
כ
ל
ח
ך
 
ה
ש
ו
ר
 
א
ת
 
י
ר
ק
 
ה
ש
ד
ה
 
ו
ב
ל
ק
 
ב
ן
 
צ
פ
ו
ר
 
מ
ל
ך
 
ל
מ
ו
א
ב
 
ב
ע
ת
 
ה
ה
י
א
 
ו
י
ש
ל
ח
 
מ
ל
א
כ
י
ם
 
א
ל
 
ב
ל
ע
ם
 
ב
ן
 
ב
ע
ו
ר
 
פ
ת
ר
ה
 
א
ש
ר
 
ע
ל
 
ה
נ
ה
ר
 
א
ר
ץ
 
ב
נ
י
 
ע
מ
ו
ן
 
ל
ק
ר
א
 
ל
ו
 
ל
א
מ
ר
 
ה
ן
 
ע
ם
 
י
צ
א
 
מ
מ
צ
ר
י
ם
 
ו
ה
נ
ה
 
כ
ס
ה
 
א
ת
 
ע
י
ן
 
ה
א
ר
ץ
 
ו
ה
ו
א
 
י
ש
ב
 
מ
מ
ו
ל
י
 
ו
ע
ת
ה
 
ל
כ
ה
 
נ
א
 
א
ר
ה
 
ל
י
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
כ
י
 
ע
צ
ו
ם
 
ה
ו
א
 
מ
מ
נ
י
 
א
ו
ל
י
 
א
ו
כ
ל
 
נ
כ
ה
 
ב
ו
 
ו
א
ג
ר
ש
נ
ו
 
מ
ן
 
ה
א
ר
ץ
 
כ
י
 
י
ד
ע
ת
י
 
א
ת
 
א
ש
ר
 
ת
ב
ר
ך
 
מ
ב
ר
ך
 
ו
א
ת
 
א
ש
ר
 
ת
א
ר
 
ו
י
א
ר
 
ו
י
ל
כ
ו
 
ז
ק
נ
י
 
מ
ו
א
ב
 
ו
ז
ק
נ
י
 
מ
ד
י
ן
 
ו
ק
ס
מ
י
ה
ם
 
ב
י
ד
ם
 
ו
י
ב
א
ו
 
א
ל
 
ב
ל
ע
ם
 
ו
י
ד
ב
ר
ו
 
א
ל
י
ו
 
ד
ב
ר
י
 
ב
ל
ק
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ל
י
נ
ו
 
פ
ה
 
ה
ל
י
ל
ה
 
ו
ה
ש
ב
ת
י
 
א
ת
כ
ם
 
ד
ב
ר
 
כ
א
ש
ר
 
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
 
ו
י
ש
ב
ו
 
ש
ר
י
 
מ
ו
א
ב
 
ע
ם
 
ב
ל
ע
ם
 
ו
י
ב
א
 
א
ל
ה
י
ם
 
א
ל
 
ב
ל
ע
ם
 
ו
י
א
מ
ר
 
מ
ה
 
ה
א
נ
ש
י
ם
 
ה
א
ל
ה
 
ע
מ
ך
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
ה
א
ל
ה
י
ם
 
ב
ל
ק
 
ב
ן
 
צ
פ
ו
ר
 
מ
ל
ך
 
מ
ו
א
ב
 
ש
ל
ח
 
א
ל
י
 
ה
ן
 
ע
ם
 
י
צ
א
 
מ
מ
צ
ר
י
ם
 
ו
י
כ
ס
 
א
ת
 
ע
י
ן
 
ה
א
ר
ץ
 
ו
ע
ת
ה
 
ל
כ
ה
 
ק
ב
ה
 
ל
י
 
א
ת
ו
 
א
ו
ל
י
 
א
ו
כ
ל
 
ל
ה
ל
ח
ם
 
ב
ו
 
ו
ג
ר
ש
ת
י
ו
 
ו
י
א
מ
ר
 
א
ל
ה
י
ם
 
א
ל
 
ב
ל
ע
ם
 
ל
א
 
ת
ל
ך
 
ע
מ
ה
ם
 
ו
ל
א
 
ת
א
ר
 
א
ת
 
ה
ע
ם
 
כ
י
 
ב
ר
ו
ך
 
ה
ו
א
 
ו
י
ק
ם
 
ב
ל
ע
ם
 
ב
ב
ק
ר
 
ו
י
א
מ
ר
 
א
ל
 
ש
ר
י
 
ב
ל
ק
 
ל
כ
ו
 
א
ל
 
א
ר
צ
כ
ם
 
כ
י
 
מ
א
ן
 
י
ה
ו
ה
 
ל
ת
ת
י
 
ל
ה
ל
ך
 
ע
מ
כ
ם
 
ו
י
ק
מ
ו
 
ש
ר
י
 
מ
ו
א
ב
 
ו
י
ב
א
ו
 
א
ל
 
ב
ל
ק
 
ו
י
א
מ
ר
ו
 
מ
א
ן
 
ב
ל
ע
ם
 
ה
ל
ך
 
ע
מ
נ
ו
 
ו
י
ס
ף
 
ע
ו
ד
 
ב
ל
ק
 
ש
ל
ח
 
ש
ר
י
ם
 
ר
ב
י
ם
 
ו
נ
כ
ב
ד
י
ם
 
מ
א
ל
ה
 
ו
י
ב
א
ו
 
א
ל
 
ב
ל
ע
ם
 
ו
י
א
מ
ר
ו
 
ל
ו
 
כ
ה
 
א
מ
ר
 
ב
ל
ק
 
ב
ן
 
צ
פ
ו
ר
 
א
ל
 
נ
א
 
ת
מ
נ
ע
 
מ
ה
ל
ך
 
א
ל
י
 
כ
י
 
כ
ב
ד
 
א
כ
ב
ד
ך
 
מ
א
ד
 
ו
כ
ל
 
א
ש
ר
 
ת
א
מ
ר
 
א
ל
י
 
א
ע
ש
ה
 
ו
ל
כ
ה
 
נ
א
 
ק
ב
ה
 
ל
י
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
ו
י
ע
ן
 
ב
ל
ע
ם
 
ו
י
א
מ
ר
 
א
ל
 
ע
ב
ד
י
 
ב
ל
ק
 
א
ם
 
י
ת
ן
 
ל
י
 
ב
ל
ק
 
מ
ל
ו
א
 
ב
י
ת
ו
 
כ
ס
ף
 
א
ו
 
ז
ה
ב
 
ל
א
 
א
ו
כ
ל
 
א
ע
ב
ר
 
א
ת
 
פ
י
 
י
ה
ו
ה
 
א
ל
ה
י
 
ל
ע
ש
ו
ת
 
ק
ט
נ
ה
 
א
ו
 
ג
ד
ל
ה
 
ו
ע
ת
ה
 
ש
ב
ו
 
נ
א
 
ב
ז
ה
 
ג
ם
 
א
ת
ם
 
ה
ל
י
ל
ה
 
ו
א
ד
ע
ה
 
מ
ה
 
י
ס
ף
 
י
ה
ו
ה
 
ד
ב
ר
 
ע
מ
י
 
ו
י
ב
א
 
מ
ל
א
ך
 
א
ל
ה
י
ם
 
א
ל
 
ב
ל
ע
ם
 
ל
י
ל
ה
 
ו
י
א
מ
ר
 
ל
ו
 
א
ם
 
ל
ק
ר
א
 
ל
ך
 
ב
א
ו
 
ה
א
נ
ש
י
ם
 
ק
ו
ם
 
ל
ך
 
א
ת
ם
 
ו
א
ך
 
א
ת
 
ה
ד
ב
ר
 
א
ש
ר
 
א
ד
ב
ר
 
א
ל
י
ך
 
א
ת
ו
 
ת
ע
ש
ה
 
ו
י
ק
ם
 
ב
ל
ע
ם
 
ב
ב
ק
ר
 
ו
י
ח
ב
ש
 
א
ת
 
א
ת
נ
ו
 
ו
י
ל
ך
 
ע
ם
 
ש
ר
י
 
מ
ו
א
ב
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
כ
י
 
ה
ל
ך
 
ה
ו
א
 
ו
י
ת
י
צ
ב
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ב
ד
ר
ך
 
ל
ש
ט
ן
 
ל
ו
 
ו
ה
ו
א
 
ר
כ
ב
 
ע
ל
 
א
ת
נ
ו
 
ו
ש
נ
י
 
נ
ע
ר
י
ו
 
ע
מ
ו
 
ו
ת
ר
א
 
ה
א
ת
ו
ן
 
א
ת
 
מ
ל
א
ך
 
י
ה
ו
ה
 
נ
צ
ב
 
ב
ד
ר
ך
 
ו
ח
ר
ב
ו
 
ש
ל
ו
פ
ה
 
ב
י
ד
ו
 
ו
ת
ט
 
ה
א
ת
ו
ן
 
מ
ן
 
ה
ד
ר
ך
 
ו
ת
ל
ך
 
ב
ש
ד
ה
 
ו
י
ך
 
ב
ל
ע
ם
 
א
ת
 
ה
א
ת
ו
ן
 
ל
ה
ט
ו
ת
ה
 
ה
ד
ר
ך
 
ו
י
ע
מ
ד
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ב
מ
ש
ע
ל
 
ה
כ
ר
מ
י
ם
 
ג
ד
ר
 
מ
ז
ה
 
ו
ג
ד
ר
 
מ
ז
ה
 
ו
ת
ר
א
 
ה
א
ת
ו
ן
 
א
ת
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ו
ת
ל
ח
ץ
 
א
ל
 
ה
ק
י
ר
 
ו
ת
ל
ח
ץ
 
א
ת
 
ר
ג
ל
 
ב
ל
ע
ם
 
א
ל
 
ה
ק
י
ר
 
ו
י
ס
ף
 
ל
ה
כ
ו
ת
ה
 
ו
י
ס
ף
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ע
ב
ר
 
ו
י
ע
מ
ד
 
ב
מ
ק
ו
ם
 
צ
ר
 
א
ש
ר
 
א
י
ן
 
ד
ר
ך
 
ל
נ
ט
ו
ת
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ו
ת
ר
א
 
ה
א
ת
ו
ן
 
א
ת
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ו
ת
ר
ב
ץ
 
ת
ח
ת
 
ב
ל
ע
ם
 
ו
י
ח
ר
 
א
ף
 
ב
ל
ע
ם
 
ו
י
ך
 
א
ת
 
ה
א
ת
ו
ן
 
ב
מ
ק
ל
 
ו
י
פ
ת
ח
 
י
ה
ו
ה
 
א
ת
 
פ
י
 
ה
א
ת
ו
ן
 
ו
ת
א
מ
ר
 
א
ל
 
ב
ל
ע
ם
 
מ
ה
 
ע
ש
י
ת
י
 
ל
ך
 
כ
י
 
ה
כ
י
ת
נ
י
 
ז
ה
 
ש
ל
ש
 
ר
ג
ל
י
ם
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
ל
א
ת
ו
ן
 
כ
י
 
ה
ת
ע
ל
ל
ת
י
 
ב
י
 
ל
ו
 
י
ש
 
ח
ר
ב
 
ב
י
ד
י
 
כ
י
 
ע
ת
ה
 
ה
ר
ג
ת
י
ך
 
ו
ת
א
מ
ר
 
ה
א
ת
ו
ן
 
א
ל
 
ב
ל
ע
ם
 
ה
ל
ו
א
 
א
נ
כ
י
 
א
ת
נ
ך
 
א
ש
ר
 
ר
כ
ב
ת
 
ע
ל
י
 
מ
ה
ו
ד
ך
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ה
ס
כ
ן
 
ה
ס
כ
נ
ת
י
 
ל
ע
ש
ו
ת
 
ל
ך
 
כ
ה
 
ו
י
א
מ
ר
 
ל
א
 
ו
י
ג
ל
 
י
ה
ו
ה
 
א
ת
 
ע
י
נ
י
 
ב
ל
ע
ם
 
ו
י
ר
א
 
א
ת
 
מ
ל
א
ך
 
י
ה
ו
ה
 
נ
צ
ב
 
ב
ד
ר
ך
 
ו
ח
ר
ב
ו
 
ש
ל
ו
פ
ה
 
ב
י
ד
ו
 
ו
י
ק
ד
 
ו
י
ש
ת
ח
ו
י
 
ל
א
פ
י
ו
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ע
ל
 
מ
ה
 
ה
כ
י
ת
 
א
ת
 
א
ת
נ
ך
 
ז
ה
 
ש
ל
ש
 
ר
ג
ל
י
ם
 
ה
נ
ה
 
א
נ
כ
י
 
י
צ
א
ת
י
 
ל
ש
ט
נ
ך
 
כ
י
 
ה
ר
ע
 
ד
ר
כ
ך
 
ל
נ
ג
ד
י
 
ו
ת
ר
א
נ
י
 
ה
א
ת
ו
ן
 
ו
ת
ט
 
מ
ל
פ
נ
י
 
ז
ה
 
ש
ל
ש
 
ר
ג
ל
י
ם
 
א
ו
ל
י
 
נ
ט
ת
ה
 
מ
פ
נ
י
 
כ
י
 
ע
ת
ה
 
ג
ם
 
א
ת
ך
 
ה
כ
י
ת
י
 
ו
א
ת
ה
 
ה
ח
י
י
ת
י
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ח
ט
א
ת
י
 
כ
י
 
ל
א
 
י
ד
ע
ת
י
 
כ
י
 
א
ת
ה
 
נ
צ
ב
 
ל
ק
ר
א
ת
י
 
ב
ד
ר
ך
 
ו
ע
ת
ה
 
א
ם
 
ר
ע
ה
 
ב
ע
י
נ
י
ך
 
א
ש
ו
ב
ה
 
ל
י
 
ו
י
א
מ
ר
 
מ
ל
א
ך
 
י
ה
ו
ה
 
א
ל
 
ב
ל
ע
ם
 
ל
ך
 
ע
ם
 
ה
א
נ
ש
י
ם
 
ו
א
פ
ס
 
א
ת
 
ה
ד
ב
ר
 
א
ש
ר
 
א
ד
ב
ר
 
א
ל
י
ך
 
א
ת
ו
 
ת
ש
מ
ר
 
ל
ד
ב
ר
 
ו
י
ל
ך
 
ב
ל
ע
ם
 
ע
ם
 
ש
ר
י
 
ב
ל
ק
 
ו
י
ש
מ
ע
 
ב
ל
ק
 
כ
י
 
ב
א
 
ב
ל
ע
ם
 
ו
י
צ
א
 
ל
ק
ר
א
ת
ו
 
א
ל
 
ע
י
ר
 
מ
ו
א
ב
 
א
ש
ר
 
ע
ל
 
ג
ב
ו
ל
 
א
ר
נ
ן
 
א
ש
ר
 
ב
ק
צ
ה
 
ה
ג
ב
ו
ל
 
ו
י
א
מ
ר
 
ב
ל
ק
 
א
ל
 
ב
ל
ע
ם
 
ה
ל
ו
א
 
ש
ל
ח
 
ש
ל
ח
ת
י
 
א
ל
י
ך
 
ל
ק
ר
א
 
ל
ך
 
ל
מ
ה
 
ל
א
 
ה
ל
כ
ת
 
א
ל
י
 
ה
א
מ
נ
ם
 
ל
א
 
א
ו
כ
ל
 
כ
ב
ד
ך
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
ב
ל
ק
 
ה
נ
ה
 
ב
א
ת
י
 
א
ל
י
ך
 
ע
ת
ה
 
ה
י
ו
כ
ל
 
א
ו
כ
ל
 
ד
ב
ר
 
מ
א
ו
מ
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
י
ש
י
ם
 
א
ל
ה
י
ם
 
ב
פ
י
י
 
א
ת
ו
 
א
ש
מ
ר
 
ל
ד
ב
ר
 
ו
י
ל
ך
 
ב
ל
ע
ם
 
ע
ם
 
ב
ל
ק
 
ו
י
ב
א
ה
ו
 
ק
ר
י
ת
 
ח
י
צ
ו
ת
 
ו
י
ז
ב
ח
 
ב
ל
ק
 
ב
ק
ר
 
ו
צ
א
ן
 
ו
י
ש
ל
ח
 
ל
ב
ל
ע
ם
 
ו
ל
ש
ר
י
ם
 
א
ש
ר
 
א
ת
ו
 
ו
י
ה
י
 
ב
ב
ק
ר
 
ו
י
ק
ח
 
ב
ל
ק
 
א
ת
 
ב
ל
ע
ם
 
ו
י
ע
ל
ה
ו
 
ב
מ
ו
ת
 
ב
ע
ל
 
ו
י
ר
א
 
מ
ש
ם
 
א
ת
 
ק
צ
ה
 
ה
ע
ם
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
ב
ל
ק
 
ע
ש
ה
 
ל
י
 
ב
ז
ה
 
ש
ב
ע
ה
 
מ
ז
ב
ח
ו
ת
 
ו
ה
כ
ן
 
ל
י
 
ב
ז
ה
 
ש
ב
ע
ה
 
פ
ר
י
ם
 
ו
ש
ב
ע
ה
 
א
י
ל
י
ם
 
ו
י
ע
ש
 
ב
ל
ק
 
כ
א
ש
ר
 
ד
ב
ר
 
ב
ל
ע
ם
 
ו
י
ע
ל
 
ב
ל
ק
 
ו
ב
ל
ע
ם
 
פ
ר
 
ו
א
י
ל
 
ב
מ
ז
ב
ח
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
ב
ל
ק
 
ה
ת
י
צ
ב
 
ע
ל
 
ע
ל
ת
י
ך
 
ו
א
ל
כ
ה
 
א
ו
ל
י
 
י
ק
ר
א
 
א
ל
ה
י
ם
 
ל
ק
ר
א
ת
י
 
ו
ד
ב
ר
 
מ
ה
 
י
ר
א
נ
י
 
ו
ה
ג
ד
ת
י
 
ל
ך
 
ו
י
ל
ך
 
ש
פ
י
 
ו
י
מ
צ
א
 
מ
ל
א
ך
 
א
ל
ה
י
ם
 
א
ת
 
ב
ל
ע
ם
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
א
ת
 
ש
ב
ע
ת
 
ה
מ
ז
ב
ח
ו
ת
 
ע
ר
כ
ת
י
 
ו
א
ע
ל
ה
 
פ
ר
 
ו
א
י
ל
 
ב
מ
ז
ב
ח
 
ו
י
ש
ם
 
מ
ל
א
ך
 
י
ה
ו
ה
 
ד
ב
ר
 
ב
פ
י
 
ב
ל
ע
ם
 
ו
י
א
מ
ר
 
ש
ו
ב
 
א
ל
 
ב
ל
ק
 
ו
כ
ה
 
ת
ד
ב
ר
 
ו
י
ש
ב
 
א
ל
י
ו
 
ו
ה
נ
ה
 
נ
צ
ב
 
ע
ל
 
ע
ל
ת
י
ו
 
ה
ו
א
 
ו
כ
ל
 
ש
ר
י
 
מ
ו
א
ב
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
מ
א
ר
ם
 
י
נ
ח
נ
י
 
ב
ל
ק
 
מ
ל
ך
 
מ
ו
א
ב
 
מ
ה
ר
ר
י
 
ק
ד
ם
 
ל
כ
ה
 
א
ר
ה
 
ל
י
 
י
ע
ק
ב
 
ו
ל
כ
ה
 
ז
ע
מ
ה
 
י
ש
ר
א
ל
 
מ
ה
 
א
ק
ב
 
ל
א
 
ק
ב
ו
 
א
ל
 
ו
מ
ה
 
א
ז
ע
ם
 
ל
א
 
ז
ע
ם
 
י
ה
ו
ה
 
כ
י
 
מ
ר
א
ש
 
צ
ו
ר
י
ם
 
א
ר
א
נ
ו
 
ו
מ
ג
ב
ע
ו
ת
 
א
ש
ו
ר
נ
ו
 
ה
ן
 
ע
ם
 
ל
ב
ד
ד
 
י
ש
כ
ן
 
ו
ב
ג
ו
י
ם
 
ל
א
 
י
ת
ח
ש
ב
 
מ
י
 
מ
נ
ה
 
ע
פ
ר
 
י
ע
ק
ב
 
ו
מ
י
 
ס
פ
ר
 
מ
ר
ב
ע
 
י
ש
ר
א
ל
 
ת
מ
ו
ת
 
נ
פ
ש
י
 
מ
ו
ת
 
י
ש
י
ר
י
ם
 
ו
ת
ה
י
 
א
ח
ר
י
ת
י
 
כ
מ
ה
ו
 
ו
י
א
מ
ר
 
ב
ל
ק
 
א
ל
 
ב
ל
ע
ם
 
מ
ה
 
ע
ש
י
ת
 
ל
י
 
ל
ק
ב
 
א
י
ב
י
 
ל
ק
ח
ת
י
ך
 
ו
ה
נ
ה
 
ב
ר
כ
ת
 
ב
ר
ו
ך
 
ו
י
ע
ן
 
ו
י
א
מ
ר
 
ה
ל
ו
א
 
א
ת
 
א
ש
ר
 
י
ש
י
ם
 
י
ה
ו
ה
 
ב
פ
י
י
 
א
ת
ו
 
א
ש
מ
ר
 
ל
ד
ב
ר
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ב
ל
ק
 
ל
ך
 
נ
א
 
א
ת
י
 
א
ל
 
מ
ק
ו
ם
 
א
ח
ר
 
ת
ר
א
נ
ו
 
מ
ש
ם
 
א
פ
ס
 
ק
צ
ה
ו
 
ת
ר
א
ה
 
ו
כ
ל
ו
 
ל
א
 
ת
ר
א
ה
 
ו
ק
ב
נ
ו
 
ל
י
 
מ
ש
ם
 
ו
י
ק
ח
ה
ו
 
ש
ד
ה
 
צ
פ
י
ם
 
א
ל
 
ר
א
ש
 
ה
פ
ס
ג
ה
 
ו
י
ב
ן
 
ש
ב
ע
ה
 
מ
ז
ב
ח
ו
ת
 
ו
י
ע
ל
 
פ
ר
 
ו
א
י
ל
 
ב
מ
ז
ב
ח
 
ו
י
א
מ
ר
 
א
ל
 
ב
ל
ק
 
ה
ת
י
צ
ב
 
ע
ל
 
ע
ל
ת
י
ך
 
ו
א
נ
כ
י
 
א
ק
ר
א
 
כ
ה
 
ו
י
ק
ר
א
 
מ
ל
א
ך
 
י
ה
ו
ה
 
א
ל
 
ב
ל
ע
ם
 
ו
י
ש
ם
 
ד
ב
ר
 
ב
פ
י
ו
 
ו
י
א
מ
ר
 
ש
ו
ב
 
א
ל
 
ב
ל
ק
 
ו
כ
ה
 
ת
ד
ב
ר
 
ו
י
ב
א
 
א
ל
י
ו
 
ו
ה
נ
ה
 
נ
צ
ב
 
ע
ל
 
ע
ל
ת
י
ו
 
ו
ש
ר
י
 
מ
ו
א
ב
 
א
ת
ו
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ב
ל
ק
 
מ
ה
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
ק
ו
ם
 
ב
ל
ק
 
ו
ש
מ
ע
ה
 
ה
א
ז
י
נ
ה
 
ע
ד
י
 
ב
נ
ו
 
צ
פ
ו
ר
 
ל
א
 
א
י
ש
 
א
ל
 
ו
י
כ
ז
ב
 
ו
ב
ן
 
א
ד
ם
 
ו
י
ת
נ
ח
ם
 
ה
ה
ו
א
 
א
מ
ר
 
ו
ל
א
 
י
ע
ש
ה
 
ד
ב
ר
 
ו
ל
א
 
י
ק
י
מ
נ
ה
 
ה
ן
 
ל
ב
ר
ך
 
ל
ק
ח
ת
י
 
א
ב
ר
ך
 
ו
ל
א
 
א
ש
י
ב
נ
ה
 
ל
א
 
א
ב
י
ט
 
א
ו
ן
 
ב
י
ע
ק
ב
 
ו
ל
א
 
ר
א
ה
 
ע
מ
ל
 
ב
י
ש
ר
א
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ו
 
ע
מ
ו
 
ו
ת
ר
ו
ע
ת
 
מ
ל
ך
 
ב
ו
 
א
ל
 
מ
ו
צ
י
א
ם
 
מ
מ
צ
ר
י
ם
 
כ
ת
ו
ע
פ
ת
 
ר
א
ם
 
ל
ו
 
כ
י
 
ל
א
 
נ
ח
ש
 
ב
י
ע
ק
ב
 
ו
ל
א
 
ק
ס
ם
 
ב
י
ש
ר
א
ל
 
כ
ע
ת
 
י
א
מ
ר
 
ל
י
ע
ק
ב
 
ו
ל
י
ש
ר
א
ל
 
מ
ה
 
פ
ע
ל
 
א
ל
 
ה
ן
 
ע
ם
 
כ
ל
ב
י
ה
 
י
ק
ו
ם
 
ו
כ
א
ר
י
ה
 
י
ת
נ
ש
א
 
ל
א
 
י
ש
כ
ב
 
ע
ד
 
י
א
כ
ל
 
ט
ר
ף
 
ו
ד
ם
 
ח
ל
ל
י
ם
 
י
ש
ת
ה
 
ו
י
א
מ
ר
 
ב
ל
ק
 
א
ל
 
ב
ל
ע
ם
 
ג
ם
 
ק
ב
 
ל
א
 
ת
ק
ב
נ
ו
 
ו
ג
ם
 
ב
ר
ו
ך
 
ל
א
 
ת
ב
ר
כ
נ
ו
 
ו
י
ע
ן
 
ב
ל
ע
ם
 
ו
י
א
מ
ר
 
א
ל
 
ב
ל
ק
 
ה
ל
ו
א
 
ד
ב
ר
ת
י
 
א
ל
י
ך
 
ל
א
מ
ר
 
כ
ל
 
ה
ד
ב
ר
 
א
ש
ר
 
י
ד
ב
ר
 
ה
א
ל
ה
י
ם
 
א
ת
ו
 
א
ע
ש
ה
 
ו
י
א
מ
ר
 
ב
ל
ק
 
א
ל
 
ב
ל
ע
ם
 
ל
ך
 
נ
א
 
א
ק
ח
ך
 
א
ל
 
מ
ק
ו
ם
 
א
ח
ר
 
א
ו
ל
י
 
י
י
ש
ר
 
ב
ע
י
נ
י
 
ה
א
ל
ה
י
ם
 
ו
ק
ב
ת
ו
 
ל
י
 
מ
ש
ם
 
ו
י
ק
ח
 
ב
ל
ק
 
א
ת
 
ב
ל
ע
ם
 
ר
א
ש
 
ה
פ
ע
ו
ר
 
ה
נ
ש
ק
ף
 
ע
ל
 
פ
נ
י
 
ה
י
ש
מ
ו
ן
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
ב
ל
ק
 
ב
נ
ה
 
ל
י
 
ב
ז
ה
 
ש
ב
ע
ה
 
מ
ז
ב
ח
ו
ת
 
ו
ה
כ
ן
 
ל
י
 
ב
ז
ה
 
ש
ב
ע
ה
 
פ
ר
י
ם
 
ו
ש
ב
ע
ה
 
א
י
ל
י
ם
 
ו
י
ע
ש
 
ב
ל
ק
 
כ
א
ש
ר
 
ד
ב
ר
 
ב
ל
ע
ם
 
ו
י
ע
ל
 
פ
ר
 
ו
א
י
ל
 
ע
ל
 
ה
מ
ז
ב
ח
 
ו
י
ר
א
 
ב
ל
ע
ם
 
כ
י
 
ט
ו
ב
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ל
ב
ר
ך
 
א
ת
 
י
ש
ר
א
ל
 
ו
ל
א
 
ה
ל
ך
 
כ
פ
ע
ם
 
ב
פ
ע
ם
 
ל
ק
ר
א
ת
 
ה
נ
ח
ש
י
ם
 
ו
י
ש
ת
 
א
ל
 
ה
מ
ד
ב
ר
 
פ
נ
י
ו
 
ו
י
ש
א
 
ב
ל
ע
ם
 
א
ת
 
ע
י
נ
י
ו
 
ו
י
ר
א
 
א
ת
 
י
ש
ר
א
ל
 
ש
כ
ן
 
ל
ש
ב
ט
י
ו
 
ו
ת
ה
י
 
ע
ל
י
ו
 
ר
ו
ח
 
א
ל
ה
י
ם
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
נ
א
ם
 
ב
ל
ע
ם
 
ב
נ
ו
 
ב
ע
ו
ר
 
ו
נ
א
ם
 
ה
ג
ב
ר
 
ש
ת
ם
 
ה
ע
י
ן
 
א
ש
ר
 
מ
ח
ז
ה
 
ש
ד
ה
 
י
ח
ז
ה
 
נ
פ
ל
 
ו
ג
ל
ו
י
 
ע
י
ן
 
מ
ה
 
ט
ב
ו
 
א
ה
ל
י
ך
 
י
ע
ק
ב
 
ו
מ
ש
כ
נ
ת
י
ך
 
י
ש
ר
א
ל
 
כ
נ
ח
ל
י
ם
 
נ
ט
ו
י
 
כ
ג
נ
ו
ת
 
ע
ל
י
 
נ
ה
ר
 
כ
א
ה
ל
י
ם
 
נ
ט
ה
 
י
ה
ו
ה
 
כ
א
ר
ז
י
ם
 
ע
ל
י
 
מ
י
ם
 
י
ז
ל
 
מ
י
ם
 
מ
ד
ל
י
ו
 
ו
ז
ר
ע
ו
 
ב
מ
י
ם
 
ר
ב
י
ם
 
ו
י
ר
ם
 
מ
ג
ו
ג
 
מ
ל
כ
ו
 
ו
ת
ת
נ
ש
א
 
מ
ל
כ
ו
ת
ו
 
א
ל
 
נ
ח
ה
ו
 
מ
מ
צ
ר
י
ם
 
כ
ת
ו
ע
פ
ת
 
ר
א
ם
 
ל
ו
 
י
א
כ
ל
 
ג
ו
י
ם
 
צ
ר
י
ו
 
ו
ע
צ
מ
ת
י
ה
ם
 
י
ג
ר
ם
 
ו
ח
צ
י
ו
 
י
מ
ח
ץ
 
כ
ר
ע
 
ש
כ
ב
 
כ
א
ר
י
ה
 
ו
כ
ל
ב
י
ה
 
מ
י
 
י
ק
י
מ
נ
ו
 
מ
ב
ר
כ
י
ך
 
ב
ר
ו
ך
 
ו
א
ר
ר
י
ך
 
א
ר
ו
ר
 
ו
י
ח
ר
 
א
ף
 
ב
ל
ק
 
א
ל
 
ב
ל
ע
ם
 
ו
י
ס
פ
ק
 
א
ת
 
כ
פ
י
ו
 
ו
י
א
מ
ר
 
ב
ל
ק
 
א
ל
 
ב
ל
ע
ם
 
ל
ק
ב
 
א
י
ב
י
 
ק
ר
א
ת
י
 
ל
ך
 
ו
ה
נ
ה
 
ב
ר
כ
ת
 
ב
ר
ו
ך
 
ז
ה
 
ש
ל
ש
 
ר
ג
ל
י
ם
 
ו
ע
ת
ה
 
ב
ר
ח
 
ל
ך
 
א
ל
 
מ
ק
ו
מ
ך
 
א
מ
ר
ת
י
 
כ
ב
ד
 
א
כ
ב
ד
ך
 
ו
ה
נ
ה
 
מ
נ
ע
ך
 
י
ה
ו
ה
 
מ
כ
ב
ו
ד
 
ו
י
א
מ
ר
 
ב
ל
ע
ם
 
א
ל
 
ב
ל
ק
 
ה
ל
ו
א
 
ג
ם
 
א
ל
 
מ
ל
א
כ
י
ך
 
א
ש
ר
 
ש
ל
ח
ת
 
א
ל
י
 
ד
ב
ר
ת
י
 
ל
א
מ
ר
 
א
ם
 
י
ת
ן
 
ל
י
 
ב
ל
ק
 
מ
ל
ו
א
 
ב
י
ת
ו
 
כ
ס
ף
 
א
ו
 
ז
ה
ב
 
ל
א
 
א
ו
כ
ל
 
ל
ע
ב
ר
 
א
ת
 
פ
י
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
ט
ו
ב
ה
 
א
ו
 
ר
ע
ה
 
מ
ל
ב
י
 
א
ש
ר
 
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
 
א
ת
ו
 
א
ד
ב
ר
ה
 
ו
ע
ת
ה
 
ה
נ
נ
י
 
ה
ל
ך
 
ל
ע
מ
י
 
ל
ך
 
ו
א
ע
י
צ
ך
 
א
ת
 
א
ש
ר
 
י
ע
ש
ה
 
ה
ע
ם
 
ה
ז
ה
 
ל
ע
מ
ך
 
ב
א
ח
ר
י
ת
 
ה
י
מ
י
ם
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
נ
א
ם
 
ב
ל
ע
ם
 
ב
נ
ו
 
ב
ע
ו
ר
 
ו
נ
א
ם
 
ה
ג
ב
ר
 
ש
ת
ם
 
ה
ע
י
ן
 
נ
א
ם
 
ש
מ
ע
 
א
מ
ר
י
 
א
ל
 
ו
י
ד
ע
 
ד
ע
ת
 
ע
ל
י
ו
ן
 
מ
ח
ז
ה
 
ש
ד
ה
 
י
ח
ז
ה
 
נ
פ
ל
 
ו
ג
ל
ו
י
 
ע
י
נ
י
ם
 
א
ר
א
נ
ו
 
ו
ל
א
 
ע
ת
ה
 
א
ש
ו
ר
נ
ו
 
ו
ל
א
 
ק
ר
ו
ב
 
ד
ר
ך
 
כ
ו
כ
ב
 
מ
י
ע
ק
ב
 
ו
ק
ם
 
ש
ב
ט
 
מ
י
ש
ר
א
ל
 
מ
ח
ץ
 
פ
ת
י
 
מ
ו
א
ב
 
ו
ק
ד
ק
ד
 
כ
ל
 
ב
נ
י
 
ש
ת
 
ו
ה
י
ה
 
א
ד
ו
ם
 
י
ר
ש
ה
 
ו
ה
י
ה
 
י
ר
ש
ה
 
ע
ש
ו
 
א
י
ב
י
ו
 
ו
י
ש
ר
א
ל
 
ע
ש
ה
 
ח
י
ל
 
ו
י
ר
ד
 
מ
י
ע
ק
ב
 
ו
ה
א
ב
י
ד
 
ש
ר
י
ד
 
מ
ע
י
ר
 
ו
י
ר
א
 
א
ת
 
ע
מ
ל
ק
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
ר
א
ש
י
ת
 
ג
ו
י
ם
 
ע
מ
ל
ק
 
ו
א
ח
ר
י
ת
ו
 
ע
ד
 
י
א
ב
ד
 
ו
י
ר
א
 
א
ת
 
ה
ק
י
נ
י
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
א
י
ת
ן
 
מ
ו
ש
ב
ך
 
ו
ש
י
ם
 
ב
ס
ל
ע
 
ק
נ
ך
 
כ
י
 
א
ם
 
י
ה
י
ה
 
ל
ב
ע
ר
 
ק
י
ן
 
ע
ד
 
מ
א
ש
ו
ר
 
ת
ו
ש
ב
ך
 
ו
י
ש
א
 
מ
ש
ל
ו
 
ו
י
א
מ
ר
 
א
ו
י
 
מ
י
 
י
ה
י
ה
 
מ
ש
מ
ו
 
א
ל
 
י
ו
צ
י
א
ם
 
מ
י
ד
 
כ
ת
י
ם
 
י
ע
נ
ו
 
א
ש
ו
ר
 
ו
י
ע
נ
ו
 
ע
ב
ר
 
ו
ג
ם
 
ה
ו
א
 
ע
ד
 
י
א
ב
ד
 
ו
י
ק
ם
 
ב
ל
ע
ם
 
ו
י
ל
ך
 
ו
י
ש
ב
 
ל
מ
ק
ו
מ
ו
 
ו
ג
ם
 
ב
ל
ק
 
ה
ל
ך
 
ל
ד
ר
כ
ו
 
ו
י
ש
ב
 
י
ש
ר
א
ל
 
ב
ש
ט
י
ם
 
ו
י
ח
ל
 
ה
ע
ם
 
ל
ז
נ
ו
ת
 
א
ל
 
ב
נ
ו
ת
 
מ
ו
א
ב
 
ו
ת
ק
ר
א
נ
ה
 
ל
ע
ם
 
ל
ז
ב
ח
י
 
א
ל
ה
י
ה
ן
 
ו
י
א
כ
ל
 
ה
ע
ם
 
ו
י
ש
ת
ח
ו
י
 
ל
א
ל
ה
י
ה
ן
 
ו
י
צ
מ
ד
 
מ
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ב
ע
ל
 
פ
ע
ו
ר
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ב
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
א
מ
ר
 
ו
י
ה
ר
ג
ו
 
א
ת
 
ה
א
נ
ש
י
ם
 
ה
נ
צ
מ
ד
י
ם
 
ל
ב
ע
ל
 
פ
ע
ו
ר
 
ו
י
ש
ו
ב
 
ח
ר
ו
ן
 
א
ף
 
י
ה
ו
ה
 
מ
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ש
פ
ט
י
 
י
ש
ר
א
ל
 
ה
ר
ג
ו
 
א
י
ש
 
א
ת
 
א
נ
ש
י
ו
 
ה
נ
צ
מ
ד
י
ם
 
ל
ב
ע
ל
 
פ
ע
ו
ר
 
ו
ה
נ
ה
 
א
י
ש
 
מ
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
 
ו
י
ק
ר
ב
 
א
ל
 
א
ח
י
ו
 
א
ת
 
ה
מ
ד
י
נ
י
ת
 
ל
ע
י
נ
י
 
מ
ש
ה
 
ו
ל
ע
י
נ
י
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
ם
 
ב
כ
י
ם
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ר
א
 
פ
י
נ
ח
ס
 
ב
ן
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ו
י
ק
ם
 
מ
ת
ו
ך
 
ה
ע
ד
ה
 
ו
י
ק
ח
 
ר
מ
ח
 
ב
י
ד
ו
 
ו
י
ב
א
 
א
ח
ר
י
 
א
י
ש
 
י
ש
ר
א
ל
 
א
ל
 
ה
ק
ב
ה
 
ו
י
ד
ק
ר
 
א
ת
 
ש
נ
י
ה
ם
 
א
ת
 
א
י
ש
 
י
ש
ר
א
ל
 
ו
א
ת
 
ה
א
ש
ה
 
ע
ל
 
ק
ב
ת
ה
 
ו
ת
ע
צ
ר
 
ה
מ
ג
פ
ה
 
מ
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ה
י
ו
 
ה
מ
י
ת
י
ם
 
ב
מ
ג
פ
ה
 
א
ר
ב
ע
ה
 
ו
ע
ש
ר
י
ם
 
א
ל
ף
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
פ
י
נ
ח
ס
 
ב
ן
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ה
ש
י
ב
 
א
ת
 
ח
מ
ת
י
 
מ
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ק
נ
א
ו
 
א
ת
 
ק
נ
א
ת
י
 
ב
ת
ו
כ
ם
 
ו
ל
א
 
כ
ל
י
ת
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ק
נ
א
ת
י
 
ל
כ
ן
 
א
מ
ר
 
ה
נ
נ
י
 
נ
ת
ן
 
ל
ו
 
א
ת
 
ב
ר
י
ת
י
 
ש
ל
ו
ם
 
ו
ה
י
ת
ה
 
ל
ו
 
ו
ל
ז
ר
ע
ו
 
א
ח
ר
י
ו
 
ב
ר
י
ת
 
כ
ה
נ
ת
 
ע
ו
ל
ם
 
ת
ח
ת
 
א
ש
ר
 
ק
נ
א
 
ל
א
ל
ה
י
ו
 
ו
י
כ
פ
ר
 
ע
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ש
ם
 
ה
א
י
ש
 
י
ש
ר
א
ל
 
ה
מ
כ
ה
 
א
ש
ר
 
ה
כ
ה
 
א
ת
 
ה
מ
ד
י
נ
י
ת
 
ז
מ
ר
י
 
ב
ן
 
ס
ל
ו
א
 
נ
ש
י
א
 
ב
י
ת
 
א
ב
 
ל
ש
מ
ע
ו
נ
י
 
ו
ש
ם
 
ה
א
ש
ה
 
ה
מ
כ
ה
 
ה
מ
ד
י
נ
י
ת
 
כ
ז
ב
י
ת
 
ב
ת
 
צ
ו
ר
 
ר
א
ש
 
א
מ
ת
 
ב
י
ת
 
א
ב
 
ב
מ
ד
י
ן
 
ה
ו
א
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
צ
ר
ר
ו
 
א
ת
 
ה
מ
ד
י
נ
י
ם
 
ו
ה
כ
י
ת
ם
 
א
ת
ם
 
כ
י
 
צ
ר
ר
י
ם
 
ה
ם
 
ל
כ
ם
 
ב
נ
כ
ל
י
ה
ם
 
א
ש
ר
 
נ
כ
ל
ו
 
ל
כ
ם
 
ע
ל
 
ד
ב
ר
 
פ
ע
ו
ר
 
ו
ע
ל
 
ד
ב
ר
 
כ
ז
ב
י
 
ב
ת
 
נ
ש
י
א
 
מ
ד
י
ן
 
א
ח
ו
ת
ם
 
ה
מ
כ
ה
 
ב
י
ו
ם
 
ה
מ
ג
פ
ה
 
ע
ל
 
ד
ב
ר
 
פ
ע
ו
ר
 
ו
י
ה
י
 
א
ח
ר
 
ה
מ
ג
פ
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ל
ע
ז
ר
 
ב
ן
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
ל
א
מ
ר
 
ש
א
ו
 
א
ת
 
ר
א
ש
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
כ
ל
 
י
צ
א
 
צ
ב
א
 
ב
י
ש
ר
א
ל
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
ת
ם
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ל
א
מ
ר
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
ה
י
ו
צ
א
י
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ר
א
ו
ב
ן
 
ב
כ
ו
ר
 
י
ש
ר
א
ל
 
ו
ב
נ
י
 
ר
א
ו
ב
ן
 
ח
נ
ו
ך
 
מ
ש
פ
ח
ת
 
ה
ח
נ
ו
כ
י
 
ל
פ
ל
ו
א
 
מ
ש
פ
ח
ת
 
ה
פ
ל
ו
א
י
 
ל
ח
צ
ר
ו
ן
 
מ
ש
פ
ח
ת
 
ה
ח
צ
ר
ו
נ
י
 
ל
כ
ר
מ
י
 
מ
ש
פ
ח
ת
 
ה
כ
ר
מ
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ה
ר
א
ו
ב
נ
י
 
ו
י
ה
י
ו
 
פ
ק
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
ש
ל
ש
י
ם
 
ב
נ
י
 
פ
ל
ו
א
 
א
ל
י
א
ב
 
ו
ב
נ
י
 
א
ל
י
א
ב
 
נ
מ
ו
א
ל
 
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
ה
ו
א
 
ד
ת
ן
 
ו
א
ב
י
ר
ם
 
ק
ר
י
א
י
 
ה
ע
ד
ה
 
א
ש
ר
 
ה
ו
ע
ד
ו
 
ע
ל
 
מ
ש
ה
 
ו
ע
ל
 
א
ה
ר
ן
 
ב
ע
ד
ת
 
ק
ר
ח
 
ב
ה
ו
ע
ד
ת
ם
 
ע
ל
 
י
ה
ו
ה
 
ו
ת
פ
ת
ח
 
ה
א
ר
ץ
 
א
ת
 
פ
י
ה
 
ו
ת
ב
ל
ע
 
א
ת
ם
 
ה
א
ר
ץ
 
ב
מ
ו
ת
 
ה
ע
ד
ה
 
ב
א
כ
ל
 
ה
א
ש
 
א
ת
 
ק
ר
ח
 
ו
א
ת
 
ח
מ
ש
י
ם
 
ו
מ
א
ת
י
ם
 
א
י
ש
 
ו
י
ה
י
ו
 
ל
נ
ו
ס
 
ו
ב
נ
י
 
ק
ר
ח
 
ל
א
 
מ
ת
ו
 
ב
נ
י
 
ש
מ
ע
ו
ן
 
ל
מ
ש
פ
ח
ו
ת
 
ה
ש
מ
ע
ו
נ
י
 
ל
נ
מ
ו
א
ל
 
מ
ש
פ
ח
ת
 
ה
נ
מ
ו
א
ל
י
 
ל
י
מ
י
ן
 
מ
ש
פ
ח
ת
 
ה
י
מ
י
נ
י
 
ל
י
כ
י
ן
 
מ
ש
פ
ח
ת
 
ה
י
כ
י
נ
י
 
ל
ז
ר
ח
 
מ
ש
פ
ח
ת
 
ה
ז
ר
ח
י
 
ל
ש
א
ו
ל
 
מ
ש
פ
ח
ת
 
ה
ש
א
ו
ל
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ה
ש
מ
ע
ו
נ
י
 
ש
נ
י
ם
 
ו
ע
ש
ר
י
ם
 
א
ל
ף
 
ו
מ
א
ת
י
ם
 
ב
נ
י
 
ג
ד
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
צ
פ
ו
ן
 
מ
ש
פ
ח
ת
 
ה
צ
פ
ו
נ
י
 
ל
ח
ג
י
 
מ
ש
פ
ח
ת
 
ה
ח
ג
י
 
ל
ש
ו
נ
י
 
מ
ש
פ
ח
ת
 
ה
ש
ו
נ
י
 
ל
א
ז
נ
י
 
מ
ש
פ
ח
ת
 
ה
א
ז
נ
י
 
ל
ע
ד
י
 
מ
ש
פ
ח
ת
 
ה
ע
ד
י
 
ל
א
ר
ו
ד
י
 
מ
ש
פ
ח
ת
 
ה
א
ר
ו
ד
י
 
ל
א
ר
ו
ל
י
 
מ
ש
פ
ח
ת
 
ה
א
ר
ו
ל
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ג
ד
 
ל
פ
ק
ד
י
ה
ם
 
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ב
נ
י
 
י
ה
ו
ד
ה
 
ע
ר
 
ו
א
ו
נ
ן
 
ו
י
מ
ת
 
ע
ר
 
ו
א
ו
נ
ן
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ה
י
ו
 
ב
נ
י
 
י
ה
ו
ד
ה
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ש
ל
ה
 
מ
ש
פ
ח
ת
 
ה
ש
ל
נ
י
 
ל
פ
ר
ץ
 
מ
ש
פ
ח
ת
 
ה
פ
ר
י
צ
י
 
ל
ז
ר
ח
 
מ
ש
פ
ח
ת
 
ה
ז
ר
ח
י
 
ו
י
ה
י
ו
 
ב
נ
י
 
פ
ר
ץ
 
ל
ח
צ
ר
ו
ן
 
מ
ש
פ
ח
ת
 
ה
ח
צ
ר
ו
נ
י
 
ל
ח
מ
ו
א
ל
 
מ
ש
פ
ח
ת
 
ה
ח
מ
ו
א
ל
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
י
ה
ו
ד
ה
 
ל
פ
ק
ד
י
ה
ם
 
ש
ש
ה
 
ו
ש
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ב
נ
י
 
י
ש
ש
כ
ר
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ת
ו
ל
ע
 
מ
ש
פ
ח
ת
 
ה
ת
ו
ל
ע
י
 
ל
פ
ו
א
ה
 
מ
ש
פ
ח
ת
 
ה
פ
ו
א
י
 
ל
י
ש
ו
ב
 
מ
ש
פ
ח
ת
 
ה
י
ש
ו
ב
י
 
ל
ש
מ
ר
ו
ן
 
מ
ש
פ
ח
ת
 
ה
ש
מ
ר
ו
נ
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
י
ש
ש
כ
ר
 
ל
פ
ק
ד
י
ה
ם
 
א
ר
ב
ע
ה
 
ו
ש
ש
י
ם
 
א
ל
ף
 
ו
ש
ל
ש
 
מ
א
ו
ת
 
ב
נ
י
 
ז
ב
ו
ל
ן
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ס
ר
ד
 
מ
ש
פ
ח
ת
 
ה
ס
ר
ד
י
 
ל
א
ל
ו
ן
 
מ
ש
פ
ח
ת
 
ה
א
ל
ו
נ
י
 
ל
י
ח
ל
א
ל
 
מ
ש
פ
ח
ת
 
ה
י
ח
ל
א
ל
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ז
ב
ו
ל
ן
 
ל
פ
ק
ד
י
ה
ם
 
ש
ש
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ב
נ
י
 
י
ו
ס
ף
 
ל
מ
ש
פ
ח
ו
ת
ם
 
מ
נ
ש
ה
 
ו
א
פ
ר
י
ם
 
ב
נ
י
 
מ
נ
ש
ה
 
ל
מ
כ
י
ר
 
מ
ש
פ
ח
ת
 
ה
מ
כ
י
ר
י
 
ו
מ
כ
י
ר
 
ה
ו
ל
י
ד
 
א
ת
 
ג
ל
ע
ד
 
מ
ש
פ
ח
ת
 
ה
ג
ל
ע
ד
י
 
א
ל
ה
 
ב
נ
י
 
ג
ל
ע
ד
 
א
י
ע
ז
ר
 
מ
ש
פ
ח
ת
 
ה
א
י
ע
ז
ר
י
 
ו
ח
ל
ק
 
מ
ש
פ
ח
ת
 
ה
ח
ל
ק
י
 
ו
א
ש
ר
ו
א
ל
 
מ
ש
פ
ח
ת
 
ה
א
ש
ר
ו
א
ל
י
 
ו
ש
כ
ם
 
מ
ש
פ
ח
ת
 
ה
ש
כ
מ
י
 
ו
ש
מ
י
ד
ע
 
מ
ש
פ
ח
ת
 
ה
ש
מ
י
ד
ע
י
 
ו
ח
פ
ר
 
מ
ש
פ
ח
ת
 
ה
ח
פ
ר
י
 
ו
צ
ל
פ
ח
ד
 
ב
ן
 
ח
פ
ר
 
ל
א
 
ה
י
ה
 
ל
ו
 
ב
נ
י
ם
 
כ
י
 
א
ם
 
ב
נ
ו
ת
 
ו
ש
ם
 
ב
נ
ו
ת
 
צ
ל
פ
ח
ד
 
מ
ח
ל
ה
 
ו
נ
ע
ה
 
ח
ג
ל
ה
 
מ
ל
כ
ה
 
ו
ת
ר
צ
ה
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
מ
נ
ש
ה
 
ל
פ
ק
ד
י
ה
ם
 
ש
נ
י
ם
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
א
ל
ה
 
ב
נ
י
 
א
פ
ר
י
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ש
ו
ת
ל
ח
 
מ
ש
פ
ח
ת
 
ה
ש
ו
ת
ל
ח
י
 
ל
ב
כ
ר
 
מ
ש
פ
ח
ת
 
ה
ב
כ
ר
י
 
ל
ת
ח
ם
 
מ
ש
פ
ח
ת
 
ה
ת
ח
מ
י
 
א
ל
ה
 
ב
נ
י
 
ש
ו
ת
ל
ח
 
ל
ע
ד
ן
 
מ
ש
פ
ח
ת
 
ה
ע
ד
נ
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
א
פ
ר
י
ם
 
ל
פ
ק
ד
י
ה
ם
 
ש
נ
י
ם
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
א
ל
ה
 
ב
נ
י
 
י
ו
ס
ף
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ב
נ
י
 
ב
נ
י
מ
י
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ב
ל
ע
 
מ
ש
פ
ח
ת
 
ה
ב
ל
ע
י
 
ל
א
ש
ב
ל
 
מ
ש
פ
ח
ת
 
ה
א
ש
ב
ל
י
 
ל
א
ח
י
ר
ם
 
מ
ש
פ
ח
ת
 
ה
א
ח
י
ר
מ
י
 
ל
ש
ו
פ
ם
 
מ
ש
פ
ח
ת
 
ה
ש
ו
פ
מ
י
 
ל
ח
ו
פ
ם
 
מ
ש
פ
ח
ת
 
ה
ח
ו
פ
מ
י
 
ל
א
ר
ד
 
מ
ש
פ
ח
ת
 
ה
א
ר
ד
י
 
ל
נ
ע
מ
ן
 
מ
ש
פ
ח
ת
 
ה
נ
ע
מ
נ
י
 
א
ל
ה
 
ב
נ
י
 
ב
נ
י
מ
י
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ו
פ
ק
ד
י
ה
ם
 
ח
מ
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
ש
ש
 
מ
א
ו
ת
 
ו
א
ל
ה
 
ב
נ
י
 
ד
ן
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ש
ו
ח
ם
 
מ
ש
פ
ח
ת
 
ה
ש
ו
ח
מ
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ד
ן
 
ל
מ
ש
פ
ח
ו
ת
ם
 
כ
ל
 
מ
ש
פ
ח
ו
ת
 
ה
ש
ו
ח
מ
י
 
ו
פ
ק
ד
י
ה
ם
 
א
ר
ב
ע
ה
 
ו
ש
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ב
נ
י
 
א
ש
ר
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
י
מ
נ
ה
 
מ
ש
פ
ח
ת
 
ה
י
מ
נ
י
 
ל
י
ש
ו
ה
 
מ
ש
פ
ח
ת
 
ה
י
ש
ו
י
 
ל
ב
ר
י
ע
ה
 
מ
ש
פ
ח
ת
 
ה
ב
ר
י
ע
י
 
ל
ח
ב
ר
 
מ
ש
פ
ח
ת
 
ה
ח
ב
ר
י
 
ל
מ
ל
כ
י
א
ל
 
מ
ש
פ
ח
ת
 
ה
מ
ל
כ
י
א
ל
י
 
ו
ש
ם
 
ב
ת
 
א
ש
ר
 
ש
ר
ח
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
א
ש
ר
 
ל
פ
ק
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
ח
מ
ש
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
ב
נ
י
 
נ
פ
ת
ל
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
י
ח
צ
א
ל
 
מ
ש
פ
ח
ת
 
ה
י
ח
צ
א
ל
י
 
ל
ג
ו
נ
י
 
מ
ש
פ
ח
ת
 
ה
ג
ו
נ
י
 
ל
י
צ
ר
 
מ
ש
פ
ח
ת
 
ה
י
צ
ר
י
 
ל
ש
ל
ו
ם
 
מ
ש
פ
ח
ת
 
ה
ש
ל
ו
מ
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
נ
פ
ת
ל
י
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ו
פ
ק
ד
י
ה
ם
 
ח
מ
ש
ה
 
ו
א
ר
ב
ע
י
ם
 
א
ל
ף
 
ו
א
ר
ב
ע
 
מ
א
ו
ת
 
א
ל
ה
 
פ
ק
ד
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
ש
ל
ש
י
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ל
א
ל
ה
 
ת
ח
ל
ק
 
ה
א
ר
ץ
 
ב
נ
ח
ל
ה
 
ב
מ
ס
פ
ר
 
ש
מ
ו
ת
 
ל
ר
ב
 
ת
ר
ב
ה
 
נ
ח
ל
ת
ו
 
ו
ל
מ
ע
ט
 
ת
מ
ע
י
ט
 
נ
ח
ל
ת
ו
 
א
י
ש
 
ל
פ
י
 
פ
ק
ד
י
ו
 
י
ת
ן
 
נ
ח
ל
ת
ו
 
א
ך
 
ב
ג
ו
ר
ל
 
י
ח
ל
ק
 
א
ת
 
ה
א
ר
ץ
 
ל
ש
מ
ו
ת
 
מ
ט
ו
ת
 
א
ב
ת
י
כ
ם
 
י
ת
נ
ח
ל
ו
 
ע
ל
 
פ
י
 
ה
ג
ו
ר
ל
 
י
ח
ל
ק
 
נ
ח
ל
ת
ו
 
ב
י
ן
 
ר
ב
 
ל
מ
ע
ט
 
ו
א
ל
ה
 
פ
ק
ד
י
 
ה
ל
ו
י
ם
 
ל
מ
ש
פ
ח
ו
ת
ם
 
ל
ג
ר
ש
ו
ן
 
מ
ש
פ
ח
ת
 
ה
ג
ר
ש
ו
נ
י
 
ל
ק
ה
ת
 
מ
ש
פ
ח
ת
 
ה
ק
ה
ת
י
 
ל
מ
ר
ר
י
 
מ
ש
פ
ח
ת
 
ה
מ
ר
ר
י
 
א
ל
ה
 
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
ל
ו
י
 
מ
ש
פ
ח
ת
 
ה
ל
ב
נ
י
 
ו
מ
ש
פ
ח
ת
 
ה
ח
ב
ר
ו
נ
י
 
ו
מ
ש
פ
ח
ת
 
ה
מ
ח
ל
י
 
ו
מ
ש
פ
ח
ת
 
ה
ק
ר
ח
י
 
ו
מ
ש
פ
ח
ת
 
ה
מ
ו
ש
י
 
ו
ק
ה
ת
 
ה
ו
ל
י
ד
 
א
ת
 
ע
מ
ר
ם
 
ו
ש
ם
 
א
ש
ת
 
ע
מ
ר
ם
 
י
ו
כ
ב
ד
 
ב
ת
 
ל
ו
י
 
א
ש
ר
 
י
ל
ד
ה
 
א
ת
ה
 
ל
ל
ו
י
 
ב
מ
צ
ר
י
ם
 
ו
ת
ל
ד
 
ל
ע
מ
ר
ם
 
א
ת
 
א
ה
ר
ן
 
ו
א
ת
 
מ
ש
ה
 
ו
א
ת
 
מ
ר
י
ם
 
א
ח
ת
ם
 
ו
י
ו
ל
ד
 
ל
א
ה
ר
ן
 
א
ת
 
נ
ד
ב
 
ו
א
ת
 
א
ב
י
ה
ו
א
 
א
ת
 
א
ל
ע
ז
ר
 
ו
א
ת
 
א
י
ת
מ
ר
 
ו
י
מ
ת
 
נ
ד
ב
 
ו
א
ב
י
ה
ו
א
 
ב
ה
ק
ר
י
ב
ם
 
א
ש
 
ז
ר
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ה
י
ו
 
פ
ק
ד
י
ה
ם
 
ש
ל
ש
ה
 
ו
ע
ש
ר
י
ם
 
א
ל
ף
 
כ
ל
 
ז
כ
ר
 
מ
ב
ן
 
ח
ד
ש
 
ו
מ
ע
ל
ה
 
כ
י
 
ל
א
 
ה
ת
פ
ק
ד
ו
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
י
 
ל
א
 
נ
ת
ן
 
ל
ה
ם
 
נ
ח
ל
ה
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
ה
 
פ
ק
ד
י
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
ש
ר
 
פ
ק
ד
ו
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ו
ב
א
ל
ה
 
ל
א
 
ה
י
ה
 
א
י
ש
 
מ
פ
ק
ד
י
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ה
כ
ה
ן
 
א
ש
ר
 
פ
ק
ד
ו
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
כ
י
 
א
מ
ר
 
י
ה
ו
ה
 
ל
ה
ם
 
מ
ו
ת
 
י
מ
ו
ת
ו
 
ב
מ
ד
ב
ר
 
ו
ל
א
 
נ
ו
ת
ר
 
מ
ה
ם
 
א
י
ש
 
כ
י
 
א
ם
 
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
ת
ק
ר
ב
נ
ה
 
ב
נ
ו
ת
 
צ
ל
פ
ח
ד
 
ב
ן
 
ח
פ
ר
 
ב
ן
 
ג
ל
ע
ד
 
ב
ן
 
מ
כ
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
ל
מ
ש
פ
ח
ו
ת
 
מ
נ
ש
ה
 
ב
ן
 
י
ו
ס
ף
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ב
נ
ת
י
ו
 
מ
ח
ל
ה
 
ו
נ
ע
ה
 
ח
ג
ל
ה
 
מ
ל
כ
ה
 
ו
ת
ר
צ
ה
 
ו
ת
ע
מ
ד
נ
ה
 
ל
פ
נ
י
 
מ
ש
ה
 
ו
ל
פ
נ
י
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
ל
פ
נ
י
 
ה
נ
ש
י
א
י
ם
 
ו
כ
ל
 
ה
ע
ד
ה
 
פ
ת
ח
 
א
ה
ל
 
מ
ו
ע
ד
 
ל
א
מ
ר
 
א
ב
י
נ
ו
 
מ
ת
 
ב
מ
ד
ב
ר
 
ו
ה
ו
א
 
ל
א
 
ה
י
ה
 
ב
ת
ו
ך
 
ה
ע
ד
ה
 
ה
נ
ו
ע
ד
י
ם
 
ע
ל
 
י
ה
ו
ה
 
ב
ע
ד
ת
 
ק
ר
ח
 
כ
י
 
ב
ח
ט
א
ו
 
מ
ת
 
א
ב
י
נ
ו
 
ו
ב
נ
י
ם
 
ל
א
 
ה
י
ה
 
ל
ו
 
ל
מ
ה
 
י
ג
ר
ע
 
ש
ם
 
א
ב
י
נ
ו
 
מ
ת
ו
ך
 
מ
ש
פ
ח
ת
ו
 
כ
י
 
א
י
ן
 
ל
ו
 
ב
ן
 
ת
נ
ו
 
ל
נ
ו
 
א
ח
ז
ת
 
נ
ח
ל
ה
 
ב
ת
ו
ך
 
א
ח
י
 
א
ב
י
נ
ו
 
ו
י
ק
ר
ב
 
מ
ש
ה
 
א
ת
 
מ
ש
פ
ט
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
כ
ן
 
ב
נ
ו
ת
 
צ
ל
פ
ח
ד
 
ד
ב
ר
ו
ת
 
נ
ת
ן
 
ת
ת
ן
 
ל
ה
ן
 
א
ח
ז
ת
 
נ
ח
ל
ה
 
ב
ת
ו
ך
 
א
ח
י
 
א
ב
י
ה
ן
 
ו
ה
ע
ב
ר
ת
 
א
ת
 
נ
ח
ל
ת
 
א
ב
י
ה
ן
 
ל
ה
ן
 
ו
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ד
ב
ר
 
ל
א
מ
ר
 
א
י
ש
 
כ
י
 
י
מ
ו
ת
 
ו
ב
ן
 
א
י
ן
 
ל
ו
 
ו
נ
ת
ת
ם
 
א
ת
 
נ
ח
ל
ת
ו
 
ל
ב
ת
ו
 
ו
א
ם
 
א
י
ן
 
ל
ו
 
ב
ת
 
ו
נ
ת
ת
ם
 
א
ת
 
נ
ח
ל
ת
ו
 
ל
א
ח
י
ו
 
ו
א
ם
 
א
י
ן
 
ל
ו
 
א
ח
י
ם
 
ו
נ
ת
ת
ם
 
א
ת
 
נ
ח
ל
ת
ו
 
ל
א
ח
י
 
א
ב
י
ו
 
ו
א
ם
 
א
י
ן
 
א
ח
י
ם
 
ל
א
ב
י
ו
 
ו
נ
ת
ת
ם
 
א
ת
 
נ
ח
ל
ת
ו
 
ל
ש
א
ר
ו
 
ה
ק
ר
ו
ב
 
א
ל
י
ו
 
מ
מ
ש
פ
ח
ת
ו
 
ו
י
י
ר
ש
 
א
ת
ו
 
ו
ה
י
ת
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ח
ק
ת
 
מ
ש
פ
ט
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ע
ל
ה
 
א
ל
 
ה
ר
 
ה
ע
ב
ר
י
ם
 
ה
ז
ה
 
ו
ר
א
ה
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ת
י
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ר
א
י
ת
 
א
ת
ה
 
ו
נ
א
ס
פ
ת
 
א
ל
 
ע
מ
ך
 
ג
ם
 
א
ת
ה
 
כ
א
ש
ר
 
נ
א
ס
ף
 
א
ה
ר
ן
 
א
ח
י
ך
 
א
ש
ר
 
מ
ר
י
ת
ם
 
א
ת
 
פ
י
י
 
ב
מ
ד
ב
ר
 
צ
ן
 
ב
מ
ר
י
ב
ת
 
ה
ע
ד
ה
 
ל
ה
ק
ד
י
ש
נ
י
 
ב
מ
י
ם
 
ל
ע
י
נ
י
ה
ם
 
ה
ם
 
מ
י
 
מ
ר
י
ב
ת
 
ק
ד
ש
 
מ
ד
ב
ר
 
צ
ן
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
י
ה
ו
ה
 
ל
א
מ
ר
 
י
פ
ק
ד
 
י
ה
ו
ה
 
א
ל
ה
י
 
ה
ר
ו
ח
ו
ת
 
ל
כ
ל
 
ה
ב
ש
ר
 
א
י
ש
 
ע
ל
 
ה
ע
ד
ה
 
א
ש
ר
 
י
צ
א
 
ל
פ
נ
י
ה
ם
 
ו
א
ש
ר
 
י
ב
ו
א
 
ל
פ
נ
י
ה
ם
 
ו
א
ש
ר
 
י
ו
צ
י
א
ם
 
ו
א
ש
ר
 
י
ב
י
א
ם
 
ו
ל
א
 
ת
ה
י
ה
 
ע
ד
ת
 
י
ה
ו
ה
 
כ
צ
א
ן
 
א
ש
ר
 
א
י
ן
 
ל
ה
ם
 
ר
ע
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ק
ח
 
ל
ך
 
א
ת
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ה
א
י
ש
 
א
ש
ר
 
ר
ו
ח
ו
 
ב
ו
 
ו
ס
מ
כ
ת
 
א
ת
 
י
ד
ך
 
ע
ל
י
ו
 
ו
ה
ע
מ
ד
ת
 
א
ת
ו
 
ל
פ
נ
י
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
ל
פ
נ
י
 
כ
ל
 
ה
ע
ד
ה
 
ו
צ
ו
י
ת
 
א
ת
ו
 
ל
ע
י
נ
י
ה
ם
 
ו
נ
ת
ת
ה
 
מ
ה
ו
ד
ך
 
ע
ל
י
ו
 
ו
ל
מ
ע
ן
 
י
ש
מ
ע
ו
ן
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
פ
נ
י
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
י
ע
מ
ד
 
ו
ש
א
ל
 
ל
ו
 
ב
מ
ש
פ
ט
 
ה
א
ר
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ל
 
פ
י
ה
ו
 
י
צ
א
 
ו
ע
ל
 
פ
י
ה
ו
 
י
ב
ו
א
 
ה
ו
א
 
ו
כ
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
ו
 
ו
כ
ל
 
ה
ע
ד
ה
 
ו
י
ע
ש
 
מ
ש
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
ו
י
ק
ח
 
א
ת
 
י
ה
ו
ש
ע
 
ו
י
ע
מ
ד
ה
ו
 
ל
פ
נ
י
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
ל
פ
נ
י
 
כ
ל
 
ה
ע
ד
ה
 
ו
י
ס
מ
ך
 
א
ת
 
י
ד
ו
 
ע
ל
י
ו
 
ו
י
צ
ו
ה
ו
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ע
י
נ
י
ך
 
ה
ר
א
ו
ת
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ל
ש
נ
י
 
ה
מ
ל
כ
י
ם
 
ה
א
ל
ה
 
כ
ן
 
י
ע
ש
ה
 
י
ה
ו
ה
 
ל
כ
ל
 
ה
מ
מ
ל
כ
ו
ת
 
א
ש
ר
 
א
ת
ה
 
ע
ב
ר
 
ש
מ
ה
 
ל
א
 
ת
י
ר
א
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ו
א
 
ה
נ
ל
ח
ם
 
ל
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
צ
ו
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
א
ת
 
ק
ר
ב
נ
י
 
ל
ח
מ
י
 
ל
א
ש
י
 
ר
י
ח
 
נ
י
ח
ח
י
 
ת
ש
מ
ר
ו
 
ל
ה
ק
ר
י
ב
 
ל
י
 
ב
מ
ו
ע
ד
י
ו
 
ו
א
מ
ר
ת
 
ל
ה
ם
 
ז
ה
 
ה
א
ש
 
א
ש
ר
 
ת
ק
ר
י
ב
ו
 
ל
י
ה
ו
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ת
מ
י
מ
ם
 
ש
נ
י
ם
 
ל
י
ו
ם
 
ע
ל
ת
 
ת
מ
י
ד
 
א
ת
 
ה
כ
ב
ש
 
ה
א
ח
ד
 
ת
ע
ש
ה
 
ב
ב
ק
ר
 
ו
א
ת
 
ה
כ
ב
ש
 
ה
ש
נ
י
 
ת
ע
ש
ה
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ו
ע
ש
י
ר
ת
 
ה
א
י
פ
ה
 
ס
ל
ת
 
ל
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ר
ב
ע
י
ת
 
ה
ה
י
ן
 
ע
ל
ת
 
ת
מ
י
ד
 
ה
ע
ש
ו
י
ה
 
ב
ה
ר
 
ס
י
נ
י
 
ל
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
נ
ס
כ
ו
 
ר
ב
ע
י
ת
 
ה
ה
י
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ב
ק
ד
ש
 
ה
ס
ך
 
נ
ס
ך
 
ש
כ
ר
 
ל
י
ה
ו
ה
 
ו
א
ת
 
ה
כ
ב
ש
 
ה
ש
נ
י
 
ת
ע
ש
ה
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
כ
מ
נ
ח
ת
 
ה
ב
ק
ר
 
ו
כ
נ
ס
כ
ו
 
ת
ע
ש
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ו
ב
י
ו
ם
 
ה
ש
ב
ת
 
ש
נ
י
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ת
מ
י
מ
ם
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ס
ל
ת
 
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ו
נ
ס
כ
ו
 
ע
ל
ת
 
ש
ב
ת
 
ב
ש
ב
ת
 
ע
ל
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
נ
ס
כ
י
ה
ם
 
ו
ב
ר
א
ש
י
 
ח
ד
ש
י
כ
ם
 
ת
ק
ר
י
ב
ו
 
ע
ל
ה
 
ל
י
ה
ו
ה
 
פ
ר
י
ם
 
ב
נ
י
 
ב
ק
ר
 
ש
נ
י
ם
 
ו
א
י
ל
 
א
ח
ד
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
ב
ע
ה
 
ת
מ
י
מ
ם
 
ו
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ס
ל
ת
 
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
פ
ר
 
ה
א
ח
ד
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ס
ל
ת
 
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
א
י
ל
 
ה
א
ח
ד
 
ו
ע
ש
ר
ו
ן
 
ע
ש
ר
ו
ן
 
ס
ל
ת
 
מ
נ
ח
ה
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ע
ל
ה
 
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
נ
ס
כ
י
ה
ם
 
ח
צ
י
 
ה
ה
י
ן
 
י
י
ן
 
ל
פ
ר
 
ה
א
ח
ד
 
ו
ש
ל
ש
י
ת
 
ה
ה
י
ן
 
ל
א
י
ל
 
ו
ר
ב
י
ע
י
ת
 
ה
ה
י
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
י
י
ן
 
ז
א
ת
 
ע
ל
ת
 
ה
ח
ד
ש
 
ב
ח
ד
ש
ו
 
ל
ח
ד
ש
י
 
ה
ש
נ
ה
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ל
י
ה
ו
ה
 
ע
ל
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
י
ע
ש
ו
 
ו
נ
ס
כ
י
ה
ם
 
ב
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ב
א
ר
ב
ע
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
ו
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ז
ה
 
ח
ג
 
ש
ב
ע
ת
 
י
מ
י
ם
 
מ
צ
ו
ת
 
ת
א
כ
ל
ו
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
מ
ק
ר
א
 
ק
ד
ש
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ה
ק
ר
ב
ת
ם
 
א
ש
ה
 
ע
ל
ה
 
ל
י
ה
ו
ה
 
פ
ר
י
ם
 
ב
נ
י
 
ב
ק
ר
 
ש
נ
י
ם
 
ו
א
י
ל
 
א
ח
ד
 
ו
ש
ב
ע
ה
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ת
מ
י
מ
ם
 
י
ה
י
ו
 
ל
כ
ם
 
ו
מ
נ
ח
ת
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ל
פ
ר
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ל
א
י
ל
 
ת
ע
ש
ו
 
ו
ע
ש
ר
ו
ן
 
ע
ש
ר
ו
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ל
ש
ב
ע
ת
 
ה
כ
ב
ש
י
ם
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ל
כ
פ
ר
 
ע
ל
י
כ
ם
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ב
ק
ר
 
א
ש
ר
 
ל
ע
ל
ת
 
ה
ת
מ
י
ד
 
ת
ע
ש
ו
 
א
ת
 
א
ל
ה
 
כ
א
ל
ה
 
ל
י
ו
ם
 
ת
ע
ש
ו
 
ש
ב
ע
ת
 
ה
י
מ
י
ם
 
ל
ח
ם
 
א
ש
ה
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
ע
ל
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
י
ע
ש
ו
 
ו
נ
ס
כ
י
ה
ם
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ב
י
ו
ם
 
ה
ב
כ
ר
י
ם
 
ב
ה
ק
ר
י
ב
כ
ם
 
מ
נ
ח
ה
 
ח
ד
ש
ה
 
ל
י
ה
ו
ה
 
ב
ש
ב
ע
ת
י
כ
ם
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ה
ק
ר
ב
ת
ם
 
ע
ל
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
פ
ר
י
ם
 
ב
נ
י
 
ב
ק
ר
 
ש
נ
י
ם
 
ו
א
י
ל
 
א
ח
ד
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
ב
ע
ה
 
ת
מ
י
מ
ם
 
י
ה
י
ו
 
ל
כ
ם
 
ו
מ
נ
ח
ת
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ל
פ
ר
 
ה
א
ח
ד
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ל
א
י
ל
 
ה
א
ח
ד
 
ו
ע
ש
ר
ו
ן
 
ע
ש
ר
ו
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ל
ש
ב
ע
ת
 
ה
כ
ב
ש
י
ם
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ל
כ
פ
ר
 
ע
ל
י
כ
ם
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ת
ע
ש
ו
 
ת
מ
י
מ
ם
 
י
ה
י
ו
 
ל
כ
ם
 
ו
נ
ס
כ
י
ה
ם
 
ו
ב
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
י
ו
ם
 
ת
ר
ו
ע
ה
 
י
ה
י
ה
 
ל
כ
ם
 
ו
ע
ש
י
ת
ם
 
ע
ל
ה
 
ל
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
פ
ר
 
ב
ן
 
ב
ק
ר
 
א
ח
ד
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
ב
ע
ה
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ל
פ
ר
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ל
א
י
ל
 
ו
ע
ש
ר
ו
ן
 
ע
ש
ר
ו
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ל
ש
ב
ע
ת
 
ה
כ
ב
ש
י
ם
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
ל
כ
פ
ר
 
ע
ל
י
כ
ם
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ח
ד
ש
 
ו
מ
נ
ח
ת
ה
 
ו
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
כ
מ
ש
פ
ט
ם
 
ל
ר
י
ח
 
נ
י
ח
ח
 
א
ש
ה
 
ל
י
ה
ו
ה
 
ו
ב
ע
ש
ו
ר
 
ל
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ה
ז
ה
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
ו
ע
נ
י
ת
ם
 
א
ת
 
נ
פ
ש
ת
י
כ
ם
 
ו
כ
ל
 
מ
ל
א
כ
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ה
ק
ר
ב
ת
ם
 
ע
ל
ה
 
ל
י
ה
ו
ה
 
ר
י
ח
 
נ
י
ח
ח
 
פ
ר
 
ב
ן
 
ב
ק
ר
 
א
ח
ד
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
ב
ע
ה
 
ת
מ
י
מ
ם
 
י
ה
י
ו
 
ל
כ
ם
 
ו
מ
נ
ח
ת
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ל
פ
ר
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ל
א
י
ל
 
ה
א
ח
ד
 
ו
ע
ש
ר
ו
ן
 
ע
ש
ר
ו
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ל
ש
ב
ע
ת
 
ה
כ
ב
ש
י
ם
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ח
ט
א
ת
 
ה
כ
פ
ו
ר
י
ם
 
ו
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ש
ב
י
ע
י
 
ה
ז
ה
 
מ
ק
ר
א
 
ק
ד
ש
 
י
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ח
ג
ת
ם
 
ח
ג
 
ל
י
ה
ו
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ה
ק
ר
ב
ת
ם
 
ע
ל
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
פ
ר
י
ם
 
ב
נ
י
 
ב
ק
ר
 
ש
ל
ש
ה
 
ע
ש
ר
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
י
ה
י
ו
 
ל
כ
ם
 
ו
מ
נ
ח
ת
ם
 
ס
ל
ת
 
ב
ל
ו
ל
ה
 
ב
ש
מ
ן
 
ש
ל
ש
ה
 
ע
ש
ר
נ
י
ם
 
ל
פ
ר
 
ה
א
ח
ד
 
ל
ש
ל
ש
ה
 
ע
ש
ר
 
ה
פ
ר
י
ם
 
ו
ש
נ
י
 
ע
ש
ר
נ
י
ם
 
ל
א
י
ל
 
ה
א
ח
ד
 
ל
ש
נ
י
 
ה
א
י
ל
י
ם
 
ו
ע
ש
ר
ו
ן
 
ע
ש
ר
ו
ן
 
ל
כ
ב
ש
 
ה
א
ח
ד
 
ל
א
ר
ב
ע
ה
 
ע
ש
ר
 
ה
כ
ב
ש
י
ם
 
ו
נ
ס
כ
י
ה
ם
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ש
נ
י
 
פ
ר
י
ם
 
ב
נ
י
 
ב
ק
ר
 
ש
נ
י
ם
 
ע
ש
ר
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
י
ם
 
ל
א
י
ל
י
ם
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
פ
ר
י
ם
 
ע
ש
ת
ה
 
ע
ש
ר
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
י
ם
 
ל
א
י
ל
י
ם
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ר
ב
י
ע
י
 
פ
ר
י
ם
 
ע
ש
ר
ה
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
י
ם
 
ל
א
י
ל
י
ם
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ח
מ
י
ש
י
 
פ
ר
י
ם
 
ת
ש
ע
ה
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
י
ם
 
ל
א
י
ל
י
ם
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ש
ש
י
 
פ
ר
י
ם
 
ש
מ
נ
ה
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
י
ם
 
ל
א
י
ל
י
ם
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
פ
ר
י
ם
 
ש
ב
ע
ה
 
א
י
ל
י
ם
 
ש
נ
י
ם
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
א
ר
ב
ע
ה
 
ע
ש
ר
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
י
ם
 
ל
א
י
ל
י
ם
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
ו
ב
י
ו
ם
 
ה
ש
מ
י
נ
י
 
ע
צ
ר
ת
 
ת
ה
י
ה
 
ל
כ
ם
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ל
א
 
ת
ע
ש
ו
 
ו
ה
ק
ר
ב
ת
ם
 
ע
ל
ה
 
א
ש
ה
 
ר
י
ח
 
נ
י
ח
ח
 
ל
י
ה
ו
ה
 
פ
ר
 
א
ח
ד
 
א
י
ל
 
א
ח
ד
 
כ
ב
ש
י
ם
 
ב
נ
י
 
ש
נ
ה
 
ש
ב
ע
ה
 
ת
מ
י
מ
ם
 
ו
מ
נ
ח
ת
ם
 
ו
נ
ס
כ
י
ה
ם
 
ל
פ
ר
 
ל
א
י
ל
 
ו
ל
כ
ב
ש
י
ם
 
ב
מ
ס
פ
ר
ם
 
כ
מ
ש
פ
ט
 
ו
ש
ע
י
ר
 
ע
ז
י
ם
 
א
ח
ד
 
ל
ח
ט
א
ת
 
מ
ל
ב
ד
 
ע
ל
ת
 
ה
ת
מ
י
ד
 
ו
מ
נ
ח
ת
ה
 
ו
נ
ס
כ
י
ה
 
א
ל
ה
 
ת
ע
ש
ו
 
ל
י
ה
ו
ה
 
ב
מ
ו
ע
ד
י
כ
ם
 
ל
ב
ד
 
מ
נ
ד
ר
י
כ
ם
 
ו
נ
ד
ב
ת
י
כ
ם
 
ל
ע
ל
ת
י
כ
ם
 
ו
ל
מ
נ
ח
ת
י
כ
ם
 
ו
ל
נ
ס
כ
י
כ
ם
 
ו
ל
ש
ל
מ
י
כ
ם
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ר
א
ש
י
 
ה
מ
ט
ו
ת
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
י
ש
 
כ
י
 
י
ד
ר
 
נ
ד
ר
 
ל
י
ה
ו
ה
 
א
ו
 
ה
ש
ב
ע
 
ש
ב
ו
ע
ה
 
ל
א
ס
ר
 
א
ס
ר
 
ע
ל
 
נ
פ
ש
ו
 
ל
א
 
י
ח
ל
 
ד
ב
ר
י
ו
 
כ
כ
ל
 
ה
י
ו
צ
א
 
מ
פ
י
ו
 
י
ע
ש
ה
 
ו
א
ש
ה
 
כ
י
 
ת
ד
ר
 
נ
ד
ר
 
ל
י
ה
ו
ה
 
ו
א
ס
ר
ה
 
א
ס
ר
 
ב
ב
י
ת
 
א
ב
י
ה
 
ב
נ
ע
ר
י
ה
 
ו
ש
מ
ע
 
א
ב
י
ה
 
א
ת
 
נ
ד
ר
י
ה
 
ו
א
ס
ר
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
ו
ה
ח
ר
י
ש
 
ל
ה
 
א
ב
י
ה
 
ו
ק
מ
ו
 
כ
ל
 
נ
ד
ר
י
ה
 
ו
א
ס
ר
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
י
ק
ו
מ
ו
 
ו
א
ם
 
ה
נ
א
 
י
נ
י
א
 
א
ב
י
ה
 
א
ת
ה
 
ב
י
ו
ם
 
ש
מ
ע
ו
 
כ
ל
 
נ
ד
ר
י
ה
 
ו
א
ס
ר
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
ל
א
 
י
ק
ו
מ
ו
 
ו
י
ה
ו
ה
 
י
ס
ל
ח
 
ל
ה
 
כ
י
 
ה
נ
י
א
 
א
ב
י
ה
 
א
ת
ה
 
ו
א
ם
 
ה
י
ו
 
ת
ה
י
ה
 
ל
א
י
ש
 
ו
נ
ד
ר
י
ה
 
ע
ל
י
ה
 
א
ו
 
מ
ב
ט
א
 
ש
פ
ת
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
ו
ש
מ
ע
 
א
י
ש
ה
 
ב
י
ו
ם
 
ש
מ
ע
ו
 
ו
ח
ר
י
ש
 
ל
ה
 
ו
ק
מ
ו
 
כ
ל
 
נ
ד
ר
י
ה
 
ו
א
ס
ר
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
י
ק
ו
מ
ו
 
ו
א
ם
 
ב
י
ו
ם
 
ש
מ
ע
 
א
י
ש
ה
 
י
נ
י
א
 
א
ת
ה
 
ו
ה
פ
ר
 
א
ת
 
נ
ד
ר
י
ה
 
א
ש
ר
 
ע
ל
י
ה
 
א
ו
 
מ
ב
ט
א
 
ש
פ
ת
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
ו
י
ה
ו
ה
 
י
ס
ל
ח
 
ל
ה
 
ו
נ
ד
ר
 
א
ל
מ
נ
ה
 
ו
ג
ר
ו
ש
ה
 
כ
ל
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
י
ק
ו
ם
 
ע
ל
י
ה
 
ו
א
ם
 
ב
י
ת
 
א
י
ש
ה
 
נ
ד
ר
ה
 
א
ו
 
א
ס
ר
ה
 
א
ס
ר
 
ע
ל
 
נ
פ
ש
ה
 
ב
ש
ב
ו
ע
ה
 
ו
ש
מ
ע
 
א
י
ש
ה
 
ו
ח
ר
י
ש
 
ל
ה
 
ל
א
 
ה
נ
י
א
 
א
ת
ה
 
ו
ק
מ
ו
 
כ
ל
 
נ
ד
ר
י
ה
 
ו
כ
ל
 
א
ס
ר
י
ה
 
א
ש
ר
 
א
ס
ר
ה
 
ע
ל
 
נ
פ
ש
ה
 
י
ק
ו
מ
ו
 
ו
א
ם
 
ה
פ
ר
 
י
פ
י
ר
 
א
ת
ם
 
א
י
ש
ה
 
ב
י
ו
ם
 
ש
מ
ע
ו
 
כ
ל
 
מ
ו
צ
א
 
ש
פ
ת
י
ה
 
ל
נ
ד
ר
י
ה
 
ו
ל
א
ס
ר
 
נ
פ
ש
ה
 
ל
א
 
י
ק
ו
מ
ו
 
א
י
ש
ה
 
ה
פ
י
ר
ם
 
ו
י
ה
ו
ה
 
י
ס
ל
ח
 
ל
ה
 
כ
ל
 
נ
ד
ר
 
ו
כ
ל
 
ש
ב
ו
ע
ת
 
א
ס
ר
 
ל
ע
נ
ו
ת
 
נ
פ
ש
 
א
י
ש
ה
 
י
ק
י
מ
נ
ו
 
ו
א
י
ש
ה
 
י
פ
י
ר
נ
ו
 
ו
א
ם
 
ה
ח
ר
י
ש
 
י
ח
ר
י
ש
 
ל
ה
 
א
י
ש
ה
 
מ
י
ו
ם
 
א
ל
 
י
ו
ם
 
ו
ה
ק
ם
 
א
ת
 
כ
ל
 
נ
ד
ר
י
ה
 
א
ו
 
א
ת
 
כ
ל
 
א
ס
ר
י
ה
 
א
ש
ר
 
ע
ל
י
ה
 
ה
ק
י
ם
 
א
ת
ם
 
כ
י
 
ח
ר
י
ש
 
ל
ה
 
ב
י
ו
ם
 
ש
מ
ע
ו
 
ו
א
ם
 
ה
פ
ר
 
י
פ
י
ר
 
א
ת
ם
 
א
ח
ר
י
 
ש
מ
ע
ו
 
ו
נ
ש
א
 
א
ת
 
ע
ו
נ
ו
 
א
ל
ה
 
ה
ח
ק
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ב
י
ן
 
א
י
ש
 
ל
א
ש
ת
ו
 
ו
ב
י
ן
 
א
ב
 
ל
ב
ת
ו
 
ב
נ
ע
ר
י
ה
 
ב
ב
י
ת
 
א
ב
י
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
נ
ק
ם
 
נ
ק
מ
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ת
 
ה
מ
ד
י
נ
י
ם
 
ו
א
ח
ר
 
ת
א
ס
ף
 
א
ל
 
ע
מ
ך
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ה
ע
ם
 
ל
א
מ
ר
 
ה
ח
ל
י
צ
ו
 
מ
א
ת
כ
ם
 
א
נ
ש
י
ם
 
ל
צ
ב
א
 
ו
י
ה
י
ו
 
ע
ל
 
מ
ד
י
ן
 
ל
ת
ת
 
נ
ק
מ
ת
 
י
ה
ו
ה
 
ב
מ
ד
י
ן
 
א
ל
ף
 
ל
מ
ט
ה
 
א
ל
ף
 
ל
מ
ט
ה
 
ל
כ
ל
 
מ
ט
ו
ת
 
י
ש
ר
א
ל
 
ת
ש
ל
ח
ו
 
ל
צ
ב
א
 
ו
י
מ
ס
ר
ו
 
מ
א
ל
פ
י
 
י
ש
ר
א
ל
 
א
ל
ף
 
ל
מ
ט
ה
 
ש
נ
י
ם
 
ע
ש
ר
 
א
ל
ף
 
ח
ל
ו
צ
י
 
צ
ב
א
 
ו
י
ש
ל
ח
 
א
ת
ם
 
מ
ש
ה
 
א
ל
ף
 
ל
מ
ט
ה
 
ל
צ
ב
א
 
א
ת
ם
 
ו
א
ת
 
פ
י
נ
ח
ס
 
ב
ן
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ל
צ
ב
א
 
ו
כ
ל
י
 
ה
ק
ד
ש
 
ו
ח
צ
צ
ר
ו
ת
 
ה
ת
ר
ו
ע
ה
 
ב
י
ד
ו
 
ו
י
צ
ב
א
ו
 
ע
ל
 
מ
ד
י
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ה
ר
ג
ו
 
כ
ל
 
ז
כ
ר
 
ו
א
ת
 
מ
ל
כ
י
 
מ
ד
י
ן
 
ה
ר
ג
ו
 
ע
ל
 
ח
ל
ל
י
ה
ם
 
א
ת
 
א
ו
י
 
ו
א
ת
 
ר
ק
ם
 
ו
א
ת
 
צ
ו
ר
 
ו
א
ת
 
ח
ו
ר
 
ו
א
ת
 
ר
ב
ע
 
ח
מ
ש
ת
 
מ
ל
כ
י
 
מ
ד
י
ן
 
ו
א
ת
 
ב
ל
ע
ם
 
ב
ן
 
ב
ע
ו
ר
 
ה
ר
ג
ו
 
ב
ח
ר
ב
 
ו
י
ש
ב
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
נ
ש
י
 
מ
ד
י
ן
 
ו
א
ת
 
ט
פ
ם
 
ו
א
ת
 
כ
ל
 
ב
ה
מ
ת
ם
 
ו
א
ת
 
כ
ל
 
מ
ק
נ
י
ה
ם
 
ו
א
ת
 
כ
ל
 
ח
י
ל
ם
 
ב
ז
ז
ו
 
ו
א
ת
 
כ
ל
 
ע
ר
י
ה
ם
 
ב
מ
ו
ש
ב
ת
ם
 
ו
א
ת
 
כ
ל
 
ט
י
ר
ת
ם
 
ש
ר
פ
ו
 
ב
א
ש
 
ו
י
ק
ח
ו
 
א
ת
 
כ
ל
 
ה
ש
ל
ל
 
ו
א
ת
 
כ
ל
 
ה
מ
ל
ק
ח
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
ו
י
ב
י
א
ו
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
א
ל
 
כ
ל
 
ע
ד
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
ש
ב
י
 
ו
א
ת
 
ה
מ
ל
ק
ח
 
ו
א
ת
 
ה
ש
ל
ל
 
א
ל
 
ה
מ
ח
נ
ה
 
א
ל
 
ע
ר
ב
ת
 
מ
ו
א
ב
 
א
ש
ר
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ו
י
צ
א
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
כ
ל
 
נ
ש
י
א
י
 
ה
ע
ד
ה
 
ל
ק
ר
א
ת
ם
 
א
ל
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
ק
צ
ף
 
מ
ש
ה
 
ע
ל
 
פ
ק
ד
י
 
ה
ח
י
ל
 
ש
ר
י
 
ה
א
ל
פ
י
ם
 
ו
ש
ר
י
 
ה
מ
א
ו
ת
 
ה
ב
א
י
ם
 
מ
צ
ב
א
 
ה
מ
ל
ח
מ
ה
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
ש
ה
 
ל
מ
ה
 
ה
ח
י
ת
ם
 
כ
ל
 
נ
ק
ב
ה
 
ה
נ
ה
 
ה
נ
ה
 
ה
י
ו
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ד
ב
ר
 
ב
ל
ע
ם
 
ל
מ
ס
ר
 
מ
ע
ל
 
ב
י
ה
ו
ה
 
ע
ל
 
ד
ב
ר
 
פ
ע
ו
ר
 
ו
ת
ה
י
 
ה
מ
ג
פ
ה
 
ב
ע
ד
ת
 
י
ה
ו
ה
 
ו
ע
ת
ה
 
ה
ר
ג
ו
 
כ
ל
 
ז
כ
ר
 
ב
ט
ף
 
ו
כ
ל
 
א
ש
ה
 
י
ד
ע
ת
 
א
י
ש
 
ל
מ
ש
כ
ב
 
ז
כ
ר
 
ה
ר
ג
ו
 
ו
כ
ל
 
ה
ט
ף
 
ב
נ
ש
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
 
מ
ש
כ
ב
 
ז
כ
ר
 
ח
י
ו
 
ל
כ
ם
 
ו
א
ת
ם
 
ח
נ
ו
 
ל
כ
ם
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ש
ב
ע
ת
 
י
מ
י
ם
 
כ
ל
 
ה
ר
ג
 
נ
פ
ש
 
ו
כ
ל
 
ה
נ
ג
ע
 
ב
ח
ל
ל
 
ת
ת
ח
ט
א
ו
 
ב
י
ו
ם
 
ה
ש
ל
י
ש
י
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
א
ת
ם
 
ו
ש
ב
י
ת
כ
ם
 
ו
כ
ל
 
ב
ג
ד
 
ו
כ
ל
 
כ
ל
י
 
ע
ו
ר
 
ו
כ
ל
 
מ
ע
ש
ה
 
ע
ז
י
ם
 
ו
כ
ל
 
כ
ל
י
 
ע
ץ
 
ת
ת
ח
ט
א
ו
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
מ
ר
 
א
ל
 
א
נ
ש
י
 
ה
צ
ב
א
 
ה
ב
א
י
ם
 
ל
מ
ל
ח
מ
ה
 
ז
א
ת
 
ח
ק
ת
 
ה
ת
ו
ר
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ך
 
א
ת
 
ה
ז
ה
ב
 
ו
א
ת
 
ה
כ
ס
ף
 
ו
א
ת
 
ה
נ
ח
ש
ת
 
ו
א
ת
 
ה
ב
ר
ז
ל
 
ו
א
ת
 
ה
ב
ד
י
ל
 
ו
א
ת
 
ה
ע
ו
פ
ר
ת
 
כ
ל
 
ד
ב
ר
 
א
ש
ר
 
י
ב
ו
א
 
ב
א
ש
 
ת
ע
ב
י
ר
ו
 
ב
א
ש
 
ו
ט
ה
ר
 
א
ך
 
ב
מ
י
 
נ
ד
ה
 
י
ת
ח
ט
א
 
ו
כ
ל
 
א
ש
ר
 
ל
א
 
י
ב
ו
א
 
ב
א
ש
 
ת
ע
ב
י
ר
ו
 
ב
מ
י
ם
 
ו
כ
ב
ס
ת
ם
 
ב
ג
ד
י
כ
ם
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ט
ה
ר
ת
ם
 
ו
א
ח
ר
 
ת
ב
א
ו
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
י
א
מ
ר
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
ל
 
א
נ
ש
י
 
ה
צ
ב
א
 
ה
ב
א
י
ם
 
ל
מ
ל
ח
מ
ה
 
ז
א
ת
 
ח
ק
ת
 
ה
ת
ו
ר
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
א
ך
 
א
ת
 
ה
ז
ה
ב
 
ו
א
ת
 
ה
כ
ס
ף
 
ו
א
ת
 
ה
נ
ח
ש
ת
 
ו
א
ת
 
ה
ב
ר
ז
ל
 
ו
א
ת
 
ה
ב
ד
י
ל
 
ו
א
ת
 
ה
ע
ו
פ
ר
ת
 
כ
ל
 
ד
ב
ר
 
א
ש
ר
 
י
ב
ו
א
 
ב
א
ש
 
ת
ע
ב
י
ר
ו
 
ב
א
ש
 
ו
ט
ה
ר
 
א
ך
 
ב
מ
י
 
נ
ד
ה
 
י
ת
ח
ט
א
 
ו
כ
ל
 
א
ש
ר
 
ל
א
 
י
ב
ו
א
 
ב
א
ש
 
ת
ע
ב
י
ר
ו
 
ב
מ
י
ם
 
ו
כ
ב
ס
ת
ם
 
ב
ג
ד
י
כ
ם
 
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ו
ט
ה
ר
ת
ם
 
ו
א
ח
ר
 
ת
ב
א
ו
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ש
א
 
א
ת
 
ר
א
ש
 
ה
מ
ל
ק
ח
 
ה
ש
ב
י
 
ב
א
ד
ם
 
ו
ב
ב
ה
מ
ה
 
א
ת
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
ר
א
ש
י
 
א
ב
ו
ת
 
ה
ע
ד
ה
 
ו
ח
צ
י
ת
 
א
ת
 
ה
מ
ל
ק
ח
 
ב
י
ן
 
ת
פ
ש
י
 
ה
מ
ל
ח
מ
ה
 
ה
י
ו
צ
א
י
ם
 
ל
צ
ב
א
 
ו
ב
י
ן
 
כ
ל
 
ה
ע
ד
ה
 
ו
ה
ר
מ
ת
 
מ
כ
ס
 
ל
י
ה
ו
ה
 
מ
א
ת
 
א
נ
ש
י
 
ה
מ
ל
ח
מ
ה
 
ה
י
ו
צ
א
י
ם
 
ל
צ
ב
א
 
א
ח
ת
 
נ
פ
ש
 
מ
ח
מ
ש
 
מ
א
ו
ת
 
מ
ן
 
ה
א
ד
ם
 
ו
מ
ן
 
ה
ב
ק
ר
 
ו
מ
ן
 
ה
ח
מ
ר
י
ם
 
ו
מ
ן
 
ה
צ
א
ן
 
מ
כ
ל
 
ה
ב
ה
מ
ה
 
מ
מ
ח
צ
י
ת
ם
 
ת
ק
ח
 
ו
נ
ת
ת
ה
 
ל
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
ת
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ו
מ
מ
ח
צ
י
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ת
ק
ח
 
א
ח
ד
 
א
ח
ז
 
מ
ן
 
ה
ח
מ
ש
י
ם
 
מ
ן
 
ה
א
ד
ם
 
ו
מ
ן
 
ה
ב
ק
ר
 
ו
מ
ן
 
ה
ח
מ
ר
י
ם
 
ו
מ
ן
 
ה
צ
א
ן
 
מ
כ
ל
 
ה
ב
ה
מ
ה
 
ו
נ
ת
ת
ה
 
א
ת
ם
 
ל
ל
ו
י
ם
 
ש
מ
ר
י
 
מ
ש
מ
ר
ת
 
מ
ש
כ
ן
 
י
ה
ו
ה
 
ו
י
ע
ש
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ה
י
 
ה
מ
ל
ק
ח
 
י
ת
ר
 
ה
ב
ז
 
א
ש
ר
 
ב
ז
ז
ו
 
ע
ם
 
ה
צ
ב
א
 
צ
א
ן
 
ש
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
ש
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
ת
 
א
ל
פ
י
ם
 
ו
ב
ק
ר
 
ש
נ
י
ם
 
ו
ש
ב
ע
י
ם
 
א
ל
ף
 
ו
ח
מ
ר
י
ם
 
א
ח
ד
 
ו
ש
ש
י
ם
 
א
ל
ף
 
ו
נ
פ
ש
 
א
ד
ם
 
מ
ן
 
ה
נ
ש
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
 
מ
ש
כ
ב
 
ז
כ
ר
 
כ
ל
 
נ
פ
ש
 
ש
נ
י
ם
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ת
ה
י
 
ה
מ
ח
צ
ה
 
ח
ל
ק
 
ה
י
ו
צ
א
י
ם
 
ב
צ
ב
א
 
מ
ס
פ
ר
 
צ
א
ן
 
ש
ל
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ש
ב
ע
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
י
ה
י
 
ה
מ
כ
ס
 
ל
י
ה
ו
ה
 
מ
ן
 
ה
צ
א
ן
 
ש
ש
 
מ
א
ו
ת
 
ח
מ
ש
ה
 
ו
ש
ב
ע
י
ם
 
ו
ב
ק
ר
 
ש
ש
ה
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
מ
כ
ס
ם
 
ל
י
ה
ו
ה
 
ש
נ
י
ם
 
ו
ש
ב
ע
י
ם
 
ו
ח
מ
ר
י
ם
 
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
מ
כ
ס
ם
 
ל
י
ה
ו
ה
 
א
ח
ד
 
ו
ש
ש
י
ם
 
ו
נ
פ
ש
 
א
ד
ם
 
ש
ש
ה
 
ע
ש
ר
 
א
ל
ף
 
ו
מ
כ
ס
ם
 
ל
י
ה
ו
ה
 
ש
נ
י
ם
 
ו
ש
ל
ש
י
ם
 
נ
פ
ש
 
ו
י
ת
ן
 
מ
ש
ה
 
א
ת
 
מ
כ
ס
 
ת
ר
ו
מ
ת
 
י
ה
ו
ה
 
ל
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
מ
מ
ח
צ
י
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
ח
צ
ה
 
מ
ש
ה
 
מ
ן
 
ה
א
נ
ש
י
ם
 
ה
צ
ב
א
י
ם
 
ו
ת
ה
י
 
מ
ח
צ
י
ת
 
ה
ע
ד
ה
 
מ
ן
 
ה
צ
א
ן
 
ש
ל
ש
 
מ
א
ו
ת
 
א
ל
ף
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ש
ב
ע
ת
 
א
ל
פ
י
ם
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
ב
ק
ר
 
ש
ש
ה
 
ו
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ח
מ
ר
י
ם
 
ש
ל
ש
י
ם
 
א
ל
ף
 
ו
ח
מ
ש
 
מ
א
ו
ת
 
ו
נ
פ
ש
 
א
ד
ם
 
ש
ש
ה
 
ע
ש
ר
 
א
ל
ף
 
ו
י
ק
ח
 
מ
ש
ה
 
מ
מ
ח
צ
י
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
א
ח
ז
 
א
ח
ד
 
מ
ן
 
ה
ח
מ
ש
י
ם
 
מ
ן
 
ה
א
ד
ם
 
ו
מ
ן
 
ה
ב
ה
מ
ה
 
ו
י
ת
ן
 
א
ת
ם
 
א
ל
 
ה
ל
ו
י
ם
 
ש
מ
ר
י
 
מ
ש
מ
ר
ת
 
מ
ש
כ
ן
 
י
ה
ו
ה
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
י
ק
ר
ב
ו
 
א
ל
 
מ
ש
ה
 
ה
פ
ק
ד
י
ם
 
א
ש
ר
 
ל
א
ל
פ
י
 
ה
צ
ב
א
 
ש
ר
י
 
ה
א
ל
פ
י
ם
 
ו
ש
ר
י
 
ה
מ
א
ו
ת
 
ו
י
א
מ
ר
ו
 
א
ל
 
מ
ש
ה
 
ע
ב
ד
י
ך
 
נ
ש
א
ו
 
א
ת
 
ר
א
ש
 
א
נ
ש
י
 
ה
מ
ל
ח
מ
ה
 
א
ש
ר
 
ב
י
ד
נ
ו
 
ו
ל
א
 
נ
פ
ק
ד
 
מ
מ
נ
ו
 
א
י
ש
 
ו
נ
ק
ר
י
ב
 
א
ת
 
ק
ר
ב
ן
 
י
ה
ו
ה
 
א
י
ש
 
א
ש
ר
 
מ
צ
א
 
כ
ל
י
 
ז
ה
ב
 
א
צ
ע
ד
ה
 
ו
צ
מ
י
ד
 
ט
ב
ע
ת
 
ע
ג
י
ל
 
ו
כ
ו
מ
ז
 
ל
כ
פ
ר
 
ע
ל
 
נ
פ
ש
ת
י
נ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
י
ק
ח
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
ז
ה
ב
 
מ
א
ת
ם
 
כ
ל
 
כ
ל
י
 
מ
ע
ש
ה
 
ו
י
ה
י
 
ז
ה
ב
 
ה
ת
ר
ו
מ
ה
 
א
ש
ר
 
ה
ר
י
מ
ו
 
ל
י
ה
ו
ה
 
ש
ש
ה
 
ע
ש
ר
 
א
ל
ף
 
ו
ש
ב
ע
 
מ
א
ו
ת
 
ו
ח
מ
ש
י
ם
 
ש
ק
ל
 
מ
א
ת
 
ש
ר
י
 
ה
א
ל
פ
י
ם
 
ו
מ
א
ת
 
ש
ר
י
 
ה
מ
א
ו
ת
 
א
נ
ש
י
 
ה
צ
ב
א
 
ב
ז
ז
ו
 
א
י
ש
 
ל
ו
 
ו
י
ק
ח
 
מ
ש
ה
 
ו
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
א
ת
 
ה
ז
ה
ב
 
מ
א
ת
 
ש
ר
י
 
ה
א
ל
פ
י
ם
 
ו
ה
מ
א
ו
ת
 
ו
י
ב
י
א
ו
 
א
ת
ו
 
א
ל
 
א
ה
ל
 
מ
ו
ע
ד
 
ז
כ
ר
ו
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
מ
ק
נ
ה
 
ר
ב
 
ה
י
ה
 
ל
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ל
ב
נ
י
 
ג
ד
 
ו
ל
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
ע
צ
ו
ם
 
מ
א
ד
 
ו
י
ר
א
ו
 
א
ת
 
א
ר
ץ
 
י
ע
ז
י
ר
 
ו
א
ת
 
א
ר
ץ
 
ג
ל
ע
ד
 
ו
ה
נ
ה
 
ה
מ
ק
ו
ם
 
מ
ק
ו
ם
 
מ
ק
נ
ה
 
ו
י
ב
א
ו
 
ב
נ
י
 
ג
ד
 
ו
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
ו
י
א
מ
ר
ו
 
א
ל
 
מ
ש
ה
 
ו
א
ל
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
א
ל
 
נ
ש
י
א
י
 
ה
ע
ד
ה
 
ל
א
מ
ר
 
ע
ט
ר
ו
ת
 
ו
ד
י
ב
ו
ן
 
ו
י
ע
ז
י
ר
 
ו
נ
מ
ר
ה
 
ו
ח
ש
ב
ו
ן
 
ו
א
ל
ע
ל
ה
 
ו
ש
ב
ם
 
ו
נ
ב
ו
 
ו
ב
ע
ו
ן
 
ה
א
ר
ץ
 
א
ש
ר
 
ה
כ
ה
 
י
ה
ו
ה
 
ל
פ
נ
י
 
ע
ד
ת
 
י
ש
ר
א
ל
 
א
ר
ץ
 
מ
ק
נ
ה
 
ה
י
א
 
ו
ל
ע
ב
ד
י
ך
 
מ
ק
נ
ה
 
ו
י
א
מ
ר
ו
 
א
ם
 
מ
צ
א
נ
ו
 
ח
ן
 
ב
ע
י
נ
י
ך
 
י
ת
ן
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ל
ע
ב
ד
י
ך
 
ל
א
ח
ז
ה
 
ו
א
ל
 
ת
ע
ב
י
ר
נ
ו
 
א
ת
 
ה
י
ר
ד
ן
 
ו
י
א
מ
ר
 
מ
ש
ה
 
ל
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ל
ב
נ
י
 
ג
ד
 
ו
ל
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
ה
א
ח
י
כ
ם
 
י
ב
א
ו
 
ל
מ
ל
ח
מ
ה
 
ו
א
ת
ם
 
ת
ש
ב
ו
 
פ
ה
 
ו
ל
מ
ה
 
ת
נ
י
א
ו
 
א
ת
 
ל
ב
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ע
ב
ר
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ן
 
ל
ה
ם
 
י
ה
ו
ה
 
כ
ה
 
ע
ש
ו
 
א
ב
ת
י
כ
ם
 
ב
ש
ל
ח
י
 
א
ת
ם
 
מ
ק
ד
ש
 
ב
ר
נ
ע
 
ל
ר
א
ו
ת
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ע
ל
ו
 
ע
ד
 
נ
ח
ל
 
א
ש
כ
ו
ל
 
ו
י
ר
א
ו
 
א
ת
 
ה
א
ר
ץ
 
ו
י
נ
י
א
ו
 
א
ת
 
ל
ב
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
ב
ל
ת
י
 
ב
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ן
 
ל
ה
ם
 
י
ה
ו
ה
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
י
ש
ב
ע
 
ל
א
מ
ר
 
א
ם
 
י
ר
א
ו
 
ה
א
נ
ש
י
ם
 
ה
ע
ל
י
ם
 
מ
מ
צ
ר
י
ם
 
מ
ב
ן
 
ע
ש
ר
י
ם
 
ש
נ
ה
 
ו
מ
ע
ל
ה
 
א
ת
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
כ
י
 
ל
א
 
מ
ל
א
ו
 
א
ח
ר
י
 
ב
ל
ת
י
 
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ה
ק
נ
ז
י
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
כ
י
 
מ
ל
א
ו
 
א
ח
ר
י
 
י
ה
ו
ה
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ב
י
ש
ר
א
ל
 
ו
י
נ
ע
ם
 
ב
מ
ד
ב
ר
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ע
ד
 
ת
ם
 
כ
ל
 
ה
ד
ו
ר
 
ה
ע
ש
ה
 
ה
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ו
ה
נ
ה
 
ק
מ
ת
ם
 
ת
ח
ת
 
א
ב
ת
י
כ
ם
 
ת
ר
ב
ו
ת
 
א
נ
ש
י
ם
 
ח
ט
א
י
ם
 
ל
ס
פ
ו
ת
 
ע
ו
ד
 
ע
ל
 
ח
ר
ו
ן
 
א
ף
 
י
ה
ו
ה
 
ע
ל
 
י
ש
ר
א
ל
 
כ
י
 
ת
ש
ו
ב
ו
ן
 
מ
א
ח
ר
י
ו
 
ו
י
ס
ף
 
ע
ו
ד
 
ל
ה
נ
י
ח
ו
 
ב
מ
ד
ב
ר
 
ו
ש
ח
ת
ם
 
ל
כ
ל
 
ה
ע
ם
 
ה
ז
ה
 
ו
י
ג
ש
ו
 
א
ל
י
ו
 
ו
י
א
מ
ר
ו
 
ג
ד
ר
ו
ת
 
צ
א
ן
 
נ
ב
נ
ה
 
ל
מ
ק
נ
י
נ
ו
 
פ
ה
 
ו
ע
ר
י
ם
 
ל
ט
פ
נ
ו
 
ו
א
נ
ח
נ
ו
 
נ
ח
ל
ץ
 
ח
ש
י
ם
 
ל
פ
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ד
 
א
ש
ר
 
א
ם
 
ה
ב
א
נ
ו
ם
 
א
ל
 
מ
ק
ו
מ
ם
 
ו
י
ש
ב
 
ט
פ
נ
ו
 
ב
ע
ר
י
 
ה
מ
ב
צ
ר
 
מ
פ
נ
י
 
י
ש
ב
י
 
ה
א
ר
ץ
 
ל
א
 
נ
ש
ו
ב
 
א
ל
 
ב
ת
י
נ
ו
 
ע
ד
 
ה
ת
נ
ח
ל
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
י
ש
 
א
ת
 
נ
ח
ל
ת
ו
 
כ
י
 
ל
א
 
נ
נ
ח
ל
 
א
ת
ם
 
מ
ע
ב
ר
 
ל
י
ר
ד
ן
 
ו
ה
ל
א
ה
 
כ
י
 
ב
א
ה
 
נ
ח
ל
ת
נ
ו
 
א
ל
י
נ
ו
 
מ
ע
ב
ר
 
ל
י
ר
ד
ן
 
מ
ז
ר
ח
ה
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
מ
ש
ה
 
א
ם
 
ת
ע
ש
ו
ן
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ו
א
ם
 
ת
ח
ל
צ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
מ
ל
ח
מ
ה
 
ו
ע
ב
ר
 
ל
כ
ם
 
כ
ל
 
ח
ל
ו
ץ
 
א
ת
 
ה
י
ר
ד
ן
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ע
ד
 
א
ו
ר
י
ש
ו
 
א
ת
 
א
י
ב
י
ו
 
מ
פ
נ
י
ו
 
ו
נ
כ
ב
ש
ה
 
ה
א
ר
ץ
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
א
ח
ר
 
ת
ש
ו
ב
ו
ן
 
ו
ה
י
י
ת
ם
 
נ
ק
ו
א
י
ם
 
מ
י
ה
ו
ה
 
ו
מ
י
ש
ר
א
ל
 
ו
ה
י
ת
ה
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ל
כ
ם
 
ל
א
ח
ז
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
א
ם
 
ל
א
 
ת
ע
ש
ו
ן
 
כ
ן
 
ה
נ
ה
 
ח
ט
א
ת
ם
 
ל
י
ה
ו
ה
 
ו
ד
ע
ו
 
ח
ט
א
ת
י
כ
ם
 
א
ש
ר
 
ת
מ
צ
א
 
א
ת
כ
ם
 
ב
נ
ו
 
ל
כ
ם
 
ע
ר
י
ם
 
ל
ט
פ
כ
ם
 
ו
ג
ד
ר
ו
ת
 
ל
צ
א
נ
כ
ם
 
ו
ה
י
ו
צ
א
 
מ
פ
י
כ
ם
 
ת
ע
ש
ו
ן
 
ו
י
א
מ
ר
ו
 
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ב
נ
י
 
ג
ד
 
ו
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ע
ב
ד
י
ך
 
י
ע
ש
ו
 
כ
א
ש
ר
 
א
ד
נ
י
 
מ
צ
ו
ה
 
ט
פ
נ
ו
 
ו
נ
ש
י
נ
ו
 
ו
מ
ק
נ
י
נ
ו
 
ו
כ
ל
 
ב
ה
מ
ת
נ
ו
 
י
ה
י
ו
 
ש
ם
 
ב
ע
ר
י
 
ה
ג
ל
ע
ד
 
ו
ע
ב
ד
י
ך
 
י
ע
ב
ר
ו
 
כ
ל
 
ח
ל
ו
ץ
 
צ
ב
א
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
מ
ל
ח
מ
ה
 
כ
א
ש
ר
 
א
ד
נ
י
 
ד
ב
ר
 
ו
י
צ
ו
 
ל
ה
ם
 
מ
ש
ה
 
א
ת
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
א
ת
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
א
ת
 
ר
א
ש
י
 
א
ב
ו
ת
 
ה
מ
ט
ו
ת
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
מ
ש
ה
 
א
ל
י
ה
ם
 
א
ם
 
י
ע
ב
ר
ו
 
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ב
נ
י
 
ג
ד
 
ו
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
א
ת
כ
ם
 
א
ת
 
ה
י
ר
ד
ן
 
כ
ל
 
ח
ל
ו
ץ
 
ל
מ
ל
ח
מ
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
נ
כ
ב
ש
ה
 
ה
א
ר
ץ
 
ל
פ
נ
י
כ
ם
 
ו
נ
ת
ת
ם
 
ל
ה
ם
 
א
ת
 
א
ר
ץ
 
ה
ג
ל
ע
ד
 
ל
א
ח
ז
ה
 
ו
א
ם
 
ל
א
 
י
ע
ב
ר
ו
 
ח
ל
ו
צ
י
ם
 
א
ת
כ
ם
 
ו
נ
א
ח
ז
ו
 
ב
ת
ו
כ
כ
ם
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ע
נ
ו
 
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ב
נ
י
 
ג
ד
 
ו
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
ל
א
מ
ר
 
א
ת
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
ע
ב
ד
י
ך
 
כ
ן
 
נ
ע
ש
ה
 
א
נ
ח
נ
ו
 
נ
ע
ב
ר
 
ח
ל
ו
צ
י
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ר
ץ
 
כ
נ
ע
ן
 
ו
א
ת
נ
ו
 
א
ח
ז
ת
 
נ
ח
ל
ת
נ
ו
 
מ
ע
ב
ר
 
ל
י
ר
ד
ן
 
ו
י
ת
ן
 
ל
ה
ם
 
מ
ש
ה
 
ל
ב
נ
י
 
ר
א
ו
ב
ן
 
ו
ל
ב
נ
י
 
ג
ד
 
ו
ל
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
ב
ן
 
י
ו
ס
ף
 
א
ת
 
מ
מ
ל
כ
ת
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
ו
א
ת
 
מ
מ
ל
כ
ת
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
א
ר
ץ
 
ל
ע
ר
י
ה
 
ב
ג
ב
ו
ל
ו
ת
 
ע
ר
י
 
ה
א
ר
ץ
 
ס
ב
י
ב
 
ו
י
ב
נ
ו
 
ב
נ
י
 
ג
ד
 
א
ת
 
ד
י
ב
ו
ן
 
ו
א
ת
 
ע
ט
ר
ו
ת
 
ו
א
ת
 
ע
ר
ע
ר
 
ו
א
ת
 
ע
ט
ר
ו
ת
 
ש
פ
י
ם
 
ו
א
ת
 
י
ע
ז
י
ר
 
ו
י
ג
ב
ה
ה
 
ו
א
ת
 
ב
י
ת
 
נ
מ
ר
ה
 
ו
א
ת
 
ב
י
ת
 
ה
ר
ן
 
ע
ר
י
 
מ
ב
צ
ר
 
ו
ג
ד
ר
ו
ת
 
צ
א
ן
 
ו
ב
נ
י
 
ר
א
ו
ב
ן
 
ב
נ
ו
 
א
ת
 
ח
ש
ב
ו
ן
 
ו
א
ת
 
א
ל
ע
ל
ה
 
ו
א
ת
 
ק
ר
י
ת
י
ם
 
ו
א
ת
 
נ
ב
ו
 
ו
א
ת
 
ב
ע
ל
 
מ
ע
ו
ן
 
מ
ו
ס
ב
ו
ת
 
ש
ם
 
ו
א
ת
 
ש
ב
מ
ה
 
ו
י
ק
ר
א
ו
 
ב
ש
מ
ו
ת
 
א
ת
 
ש
מ
ו
ת
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ב
נ
ו
 
ו
י
ל
כ
ו
 
ב
נ
י
 
מ
כ
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
ג
ל
ע
ד
ה
 
ו
י
ל
כ
ד
ו
ה
 
ו
י
ו
ר
י
ש
ו
 
א
ת
 
ה
א
מ
ר
י
 
א
ש
ר
 
ב
ה
 
ו
י
ת
ן
 
מ
ש
ה
 
א
ת
 
ה
ג
ל
ע
ד
 
ל
מ
כ
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
ו
י
ש
ב
 
ב
ה
 
ו
י
א
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
ה
ל
ך
 
ו
י
ל
כ
ד
 
א
ת
 
ח
ו
ת
י
ם
 
ו
י
ק
ר
א
 
א
ת
ה
ן
 
ח
ו
ת
 
י
א
י
ר
 
ו
נ
ב
ח
 
ה
ל
ך
 
ו
י
ל
כ
ד
 
א
ת
 
ק
נ
ת
 
ו
א
ת
 
ב
נ
ת
י
ה
 
ו
י
ק
ר
א
 
ל
ה
 
נ
ב
ח
 
ב
ש
מ
ו
 
א
ל
ה
 
מ
ס
ע
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ש
ר
 
י
צ
א
ו
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
צ
ב
א
ת
ם
 
ב
י
ד
 
מ
ש
ה
 
ו
א
ה
ר
ן
 
ו
י
כ
ת
ב
 
מ
ש
ה
 
א
ת
 
מ
ו
צ
א
י
ה
ם
 
ל
מ
ס
ע
י
ה
ם
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ו
א
ל
ה
 
מ
ס
ע
י
ה
ם
 
ל
מ
ו
צ
א
י
ה
ם
 
ו
י
ס
ע
ו
 
מ
ר
ע
מ
ס
ס
 
ב
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
ב
ח
מ
ש
ה
 
ע
ש
ר
 
י
ו
ם
 
ל
ח
ד
ש
 
ה
ר
א
י
ש
ו
ן
 
מ
מ
ח
ר
ת
 
ה
פ
ס
ח
 
י
צ
א
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
י
ד
 
ר
מ
ה
 
ל
ע
י
נ
י
 
כ
ל
 
מ
צ
ר
י
ם
 
ו
מ
צ
ר
י
ם
 
מ
ק
ב
ר
י
ם
 
א
ת
 
א
ש
ר
 
ה
כ
ה
 
י
ה
ו
ה
 
ב
ה
ם
 
כ
ל
 
ב
כ
ו
ר
 
ו
ב
א
ל
ה
י
ה
ם
 
ע
ש
ה
 
י
ה
ו
ה
 
ש
פ
ט
י
ם
 
ו
י
ס
ע
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
ר
ע
מ
ס
ס
 
ו
י
ח
נ
ו
 
ב
ס
כ
ו
ת
 
ו
י
ס
ע
ו
 
מ
ס
כ
ו
ת
 
ו
י
ח
נ
ו
 
ב
א
ת
ם
 
א
ש
ר
 
ב
ק
צ
ה
 
ה
מ
ד
ב
ר
 
ו
י
ס
ע
ו
 
מ
א
ת
ם
 
ו
י
ש
ב
ו
 
ע
ל
 
פ
י
 
ה
ח
י
ר
ת
 
א
ש
ר
 
ל
פ
נ
י
 
ב
ע
ל
 
צ
פ
ו
ן
 
ו
י
ח
נ
ו
 
ל
פ
נ
י
 
מ
ג
ד
ו
ל
 
ו
י
ס
ע
ו
 
מ
פ
י
 
ה
ח
י
ר
ת
 
ו
י
ע
ב
ר
ו
 
ב
ת
ו
ך
 
ה
י
ם
 
ה
מ
ד
ב
ר
ה
 
ו
י
ל
כ
ו
 
ד
ר
ך
 
ש
ל
ש
ת
 
י
מ
י
ם
 
ב
מ
ד
ב
ר
 
א
ת
ם
 
ו
י
ח
נ
ו
 
ב
מ
ר
ה
 
ו
י
ס
ע
ו
 
מ
מ
ר
ה
 
ו
י
ב
א
ו
 
א
י
ל
י
ם
 
ו
ב
א
י
ל
י
ם
 
ש
ת
י
ם
 
ע
ש
ר
ה
 
ע
י
נ
ו
ת
 
מ
י
ם
 
ו
ש
ב
ע
י
ם
 
ת
מ
ר
י
ם
 
ו
י
ח
נ
ו
 
ש
ם
 
ו
י
ס
ע
ו
 
מ
א
י
ל
י
ם
 
ו
י
ח
נ
ו
 
ע
ל
 
י
ם
 
ס
ו
ף
 
ו
י
ס
ע
ו
 
מ
י
ם
 
ס
ו
ף
 
ו
י
ח
נ
ו
 
ב
מ
ד
ב
ר
 
ס
י
ן
 
ו
י
ס
ע
ו
 
מ
מ
ד
ב
ר
 
ס
י
ן
 
ו
י
ח
נ
ו
 
ב
ד
פ
ק
ה
 
ו
י
ס
ע
ו
 
מ
ד
פ
ק
ה
 
ו
י
ח
נ
ו
 
ב
א
ל
י
ש
 
ו
י
ס
ע
ו
 
מ
א
ל
י
ש
 
ו
י
ח
נ
ו
 
ב
ר
פ
י
ד
י
ם
 
ו
ל
א
 
ה
י
ה
 
ש
ם
 
מ
י
ם
 
ל
ע
ם
 
ל
ש
ת
ו
ת
 
ו
י
ס
ע
ו
 
מ
ר
פ
י
ד
י
ם
 
ו
י
ח
נ
ו
 
ב
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ס
ע
ו
 
מ
מ
ד
ב
ר
 
ס
י
נ
י
 
ו
י
ח
נ
ו
 
ב
ק
ב
ר
ו
ת
 
ה
ת
א
ו
ה
 
ו
י
ס
ע
ו
 
מ
ק
ב
ר
ו
ת
 
ה
ת
א
ו
ה
 
ו
י
ח
נ
ו
 
ב
ח
צ
ר
ו
ת
 
ו
י
ס
ע
ו
 
מ
ח
צ
ר
ו
ת
 
ו
י
ח
נ
ו
 
ב
ר
ת
מ
ה
 
ו
י
ס
ע
ו
 
מ
ר
ת
מ
ה
 
ו
י
ח
נ
ו
 
ב
ר
מ
ו
נ
 
פ
ר
ץ
 
ו
י
ס
ע
ו
 
מ
ר
מ
ו
נ
 
פ
ר
ץ
 
ו
י
ח
נ
ו
 
ב
ל
ב
ו
נ
ה
 
ו
י
ס
ע
ו
 
מ
ל
ב
ו
נ
ה
 
ו
י
ח
נ
ו
 
ב
ר
ס
ה
 
ו
י
ס
ע
ו
 
מ
ר
ס
ה
 
ו
י
ח
נ
ו
 
ב
ק
ה
ל
ת
ה
 
ו
י
ס
ע
ו
 
מ
ק
ה
ל
ת
ה
 
ו
י
ח
נ
ו
 
ב
ה
ר
 
ש
פ
ר
 
ו
י
ס
ע
ו
 
מ
ה
ר
 
ש
פ
ר
 
ו
י
ח
נ
ו
 
ב
ח
ר
ד
ה
 
ו
י
ס
ע
ו
 
מ
ח
ר
ד
ה
 
ו
י
ח
נ
ו
 
ב
מ
ק
ה
ל
ת
 
ו
י
ס
ע
ו
 
מ
מ
ק
ה
ל
ת
 
ו
י
ח
נ
ו
 
ב
ת
ח
ת
 
ו
י
ס
ע
ו
 
מ
ת
ח
ת
 
ו
י
ח
נ
ו
 
ב
ת
ר
ח
 
ו
י
ס
ע
ו
 
מ
ת
ר
ח
 
ו
י
ח
נ
ו
 
ב
מ
ת
ק
ה
 
ו
י
ס
ע
ו
 
מ
מ
ת
ק
ה
 
ו
י
ח
נ
ו
 
ב
ח
ש
מ
ו
נ
ה
 
ו
י
ס
ע
ו
 
מ
ח
ש
מ
ו
נ
ה
 
ו
י
ח
נ
ו
 
ב
מ
ס
ר
ו
ת
 
ו
י
ס
ע
ו
 
מ
מ
ס
ר
ו
ת
 
ו
י
ח
נ
ו
 
ב
ב
נ
י
 
י
ע
ק
ן
 
ו
י
ס
ע
ו
 
מ
ב
נ
י
 
י
ע
ק
ן
 
ו
י
ח
נ
ו
 
ב
ה
ר
 
ה
ג
ד
ג
ד
ה
 
ו
י
ס
ע
ו
 
מ
ה
ר
 
ה
ג
ד
ג
ד
ה
 
ו
י
ח
נ
ו
 
ב
י
ט
ב
ת
ה
 
ו
י
ס
ע
ו
 
מ
י
ט
ב
ת
ה
 
ו
י
ח
נ
ו
 
ב
ע
ב
ר
נ
ה
 
ו
י
ס
ע
ו
 
מ
ע
ב
ר
נ
ה
 
ו
י
ח
נ
ו
 
ב
ע
צ
י
ו
נ
 
ג
ב
ר
 
ו
י
ס
ע
ו
 
מ
ע
צ
י
ו
נ
 
ג
ב
ר
 
ו
י
ח
נ
ו
 
ב
מ
ד
ב
ר
 
צ
ן
 
ה
י
א
 
ק
ד
ש
 
ו
י
ס
ע
ו
 
מ
ק
ד
ש
 
ו
י
ח
נ
ו
 
ב
ה
ר
 
ה
ה
ר
 
ב
ק
צ
ה
 
א
ר
ץ
 
א
ד
ו
ם
 
ו
י
ע
ל
 
א
ה
ר
ן
 
ה
כ
ה
ן
 
א
ל
 
ה
ר
 
ה
ה
ר
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ו
י
מ
ת
 
ש
ם
 
ב
ש
נ
ת
 
ה
א
ר
ב
ע
י
ם
 
ל
צ
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ב
ח
ד
ש
 
ה
ח
מ
י
ש
י
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ו
א
ה
ר
ן
 
ב
ן
 
ש
ל
ש
 
ו
ע
ש
ר
י
ם
 
ו
מ
א
ת
 
ש
נ
ה
 
ב
מ
ו
ת
ו
 
ב
ה
ר
 
ה
ה
ר
 
ו
י
ש
מ
ע
 
ה
כ
נ
ע
נ
י
 
מ
ל
ך
 
ע
ר
ד
 
ו
ה
ו
א
 
י
ש
ב
 
ב
נ
ג
ב
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ב
ב
ו
א
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ס
ע
ו
 
מ
ה
ר
 
ה
ה
ר
 
ו
י
ח
נ
ו
 
ב
צ
ל
מ
ו
נ
ה
 
ו
י
ס
ע
ו
 
מ
צ
ל
מ
ו
נ
ה
 
ו
י
ח
נ
ו
 
ב
פ
י
נ
ן
 
ו
י
ס
ע
ו
 
מ
פ
י
נ
ן
 
ו
י
ח
נ
ו
 
ב
א
ב
ו
ת
 
ו
י
ס
ע
ו
 
מ
א
ב
ו
ת
 
ו
י
ח
נ
ו
 
ב
ע
י
י
 
ה
ע
ב
ר
י
ם
 
ב
ג
ב
ו
ל
 
מ
ו
א
ב
 
ו
י
ס
ע
ו
 
מ
ע
י
י
ם
 
ו
י
ח
נ
ו
 
ב
ד
י
ב
ו
ן
 
ג
ד
 
ו
י
ס
ע
ו
 
מ
ד
י
ב
ו
ן
 
ג
ד
 
ו
י
ח
נ
ו
 
ב
ע
ל
מ
ו
נ
 
ד
ב
ל
ת
י
מ
ה
 
ו
י
ס
ע
ו
 
מ
ע
ל
מ
ו
נ
 
ד
ב
ל
ת
י
מ
ה
 
ו
י
ח
נ
ו
 
ב
ה
ר
י
 
ה
ע
ב
ר
י
ם
 
ל
פ
נ
י
 
נ
ב
ו
 
ו
י
ס
ע
ו
 
מ
ה
ר
י
 
ה
ע
ב
ר
י
ם
 
ו
י
ח
נ
ו
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ו
י
ח
נ
ו
 
ע
ל
 
ה
י
ר
ד
ן
 
מ
ב
י
ת
 
ה
י
ש
מ
ו
ת
 
ע
ד
 
א
ב
ל
 
ש
ט
י
ם
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
א
ל
 
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ה
ו
ר
ש
ת
ם
 
א
ת
 
כ
ל
 
י
ש
ב
י
 
ה
א
ר
ץ
 
מ
פ
נ
י
כ
ם
 
ו
א
ב
ד
ת
ם
 
א
ת
 
כ
ל
 
מ
ש
כ
י
ו
ת
ם
 
ו
א
ת
 
כ
ל
 
צ
ל
מ
י
 
מ
ס
כ
ו
ת
ם
 
ת
א
ב
י
ד
ו
 
ו
א
ת
 
כ
ל
 
ב
מ
ת
ם
 
ת
ש
מ
י
ד
ו
 
ו
ה
ו
ר
ש
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ש
ב
ת
ם
 
ב
ה
 
כ
י
 
ל
כ
ם
 
נ
ת
ת
י
 
א
ת
 
ה
א
ר
ץ
 
ל
ר
ש
ת
 
א
ת
ה
 
ו
ה
ת
נ
ח
ל
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
ב
ג
ו
ר
ל
 
ל
מ
ש
פ
ח
ו
ת
י
כ
ם
 
ל
ר
ב
 
ת
ר
ב
ה
 
א
ת
 
נ
ח
ל
ת
ו
 
ו
ל
מ
ע
ט
 
ת
מ
ע
י
ט
 
א
ת
 
נ
ח
ל
ת
ו
 
ע
ל
 
א
ש
ר
 
י
צ
א
 
ל
ו
 
ש
ם
 
ה
ג
ו
ר
ל
 
ל
ו
 
י
ה
י
ה
 
ל
מ
ט
ו
ת
 
א
ב
ת
י
כ
ם
 
ת
ת
נ
ח
ל
ו
 
ו
א
ם
 
ל
א
 
ת
ו
ר
י
ש
ו
 
א
ת
 
י
ש
ב
י
 
ה
א
ר
ץ
 
מ
פ
נ
י
כ
ם
 
ו
ה
י
ה
 
א
ש
ר
 
ת
ו
ת
י
ר
ו
 
מ
ה
ם
 
ל
ש
כ
י
ם
 
ב
ע
י
נ
י
כ
ם
 
ו
ל
צ
נ
י
ם
 
ב
צ
ד
י
כ
ם
 
ו
צ
ר
ר
ו
 
א
ת
כ
ם
 
ע
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
י
ש
ב
י
ם
 
ב
ה
 
ו
ה
י
ה
 
כ
א
ש
ר
 
ד
מ
י
ת
י
 
ל
ע
ש
ו
ת
 
ל
ה
ם
 
כ
ן
 
א
ע
ש
ה
 
ל
כ
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
צ
ו
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
א
ת
ם
 
ב
א
י
ם
 
א
ל
 
א
ר
ץ
 
כ
נ
ע
ן
 
ז
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
ת
פ
ל
 
ל
כ
ם
 
ב
נ
ח
ל
ה
 
א
ר
ץ
 
כ
נ
ע
ן
 
ל
ג
ב
ו
ל
ת
י
ה
 
ו
ה
י
ה
 
ל
כ
ם
 
פ
א
ת
 
נ
ג
ב
ה
 
מ
מ
ד
ב
ר
 
צ
ן
 
ע
ל
 
י
ד
י
 
א
ד
ו
ם
 
ו
ה
י
ה
 
ל
כ
ם
 
ג
ב
ו
ל
 
נ
ג
ב
ה
 
מ
ק
צ
ה
 
י
ם
 
ה
מ
ל
ח
 
ק
ד
מ
ה
 
ו
נ
ס
ב
 
ל
כ
ם
 
ה
ג
ב
ו
ל
 
מ
נ
ג
ב
 
ל
מ
ע
ל
ה
 
ע
ק
ר
ב
י
ם
 
ו
ע
ב
ר
 
צ
נ
ה
 
ו
ה
י
ה
 
ת
ו
צ
א
י
ת
ו
 
מ
נ
ג
ב
 
ל
ק
ד
ש
 
ב
ר
נ
ע
 
ו
י
צ
א
 
ח
צ
ר
 
א
ד
ר
 
ו
ע
ב
ר
 
ע
צ
מ
ו
נ
ה
 
ו
נ
ס
ב
 
ה
ג
ב
ו
ל
 
מ
ע
צ
מ
ו
נ
ה
 
נ
ח
ל
 
מ
צ
ר
י
ם
 
ו
ה
י
ה
 
ת
ו
צ
א
י
ת
ו
 
ה
י
ם
 
ו
ג
ב
ו
ל
 
י
מ
ה
 
י
ה
י
ה
 
ל
כ
ם
 
ה
י
ם
 
ה
ג
ד
ו
ל
 
י
ג
ב
ל
 
ז
ה
 
י
ה
י
ה
 
ל
כ
ם
 
ג
ב
ו
ל
 
י
מ
ה
 
ו
ז
ה
 
י
ה
י
ה
 
ל
כ
ם
 
ג
ב
ו
ל
 
צ
פ
ו
נ
ה
 
מ
ן
 
ה
י
ם
 
ה
ג
ד
ו
ל
 
ת
ת
א
ו
 
ל
כ
ם
 
ה
ר
 
ה
ה
ר
 
ו
מ
ה
ר
 
ה
ה
ר
 
ת
ת
א
ו
 
ל
ב
ו
א
 
ח
מ
ת
ה
 
ו
ה
י
ה
 
ת
ו
צ
א
י
ת
ו
 
ה
ג
ב
ו
ל
 
צ
ר
ד
ה
 
ו
י
צ
א
 
ה
ג
ב
ו
ל
 
ז
פ
ר
נ
ה
 
ו
ה
י
ה
 
ת
ו
צ
א
י
ת
ו
 
ח
צ
ר
 
ע
י
נ
ן
 
ז
ה
 
י
ה
י
ה
 
ל
כ
ם
 
ג
ב
ו
ל
 
צ
פ
ו
נ
ה
 
ו
ה
ת
א
ו
י
ת
ם
 
ל
כ
ם
 
ל
ג
ב
ו
ל
 
ק
ד
מ
ה
 
מ
ח
צ
ר
 
ע
י
נ
ן
 
ש
פ
מ
ה
 
ו
י
ר
ד
 
ה
ג
ב
ו
ל
 
מ
ש
פ
מ
ה
 
ה
א
ר
ב
ל
ה
 
מ
ק
ד
ם
 
ל
ע
י
ן
 
ו
י
ר
ד
 
ה
ג
ב
ו
ל
 
ו
מ
ח
ה
 
א
ל
 
כ
ת
ף
 
י
ם
 
כ
נ
ר
ת
 
ק
ד
מ
ה
 
ו
י
ר
ד
 
ה
ג
ב
ו
ל
 
ה
י
ר
ד
נ
ה
 
ו
ה
י
ה
 
ת
ו
צ
א
י
ת
ו
 
י
ם
 
ה
מ
ל
ח
 
ז
א
ת
 
ת
ה
י
ה
 
ל
כ
ם
 
ה
א
ר
ץ
 
ל
ג
ב
ו
ל
ת
י
ה
 
ס
ב
י
ב
 
ו
י
צ
ו
 
מ
ש
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ז
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
ת
ת
נ
ח
ל
ו
 
א
ת
ה
 
ב
ג
ו
ר
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ת
ת
 
ל
ת
ש
ע
ת
 
ה
מ
ט
ו
ת
 
ו
ח
צ
י
 
ה
מ
ט
ה
 
כ
י
 
ל
ק
ח
ו
 
מ
ט
ה
 
ב
נ
י
 
ה
ר
א
ו
ב
נ
י
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ו
מ
ט
ה
 
ב
נ
י
 
ה
ג
ד
י
 
ל
ב
י
ת
 
א
ב
ו
ת
ם
 
ו
ח
צ
י
 
מ
ט
ה
 
מ
נ
ש
ה
 
ל
ק
ח
ו
 
נ
ח
ל
ת
ם
 
ש
נ
י
 
ה
מ
ט
ו
ת
 
ו
ח
צ
י
 
ה
מ
ט
ה
 
ל
ק
ח
ו
 
נ
ח
ל
ת
ם
 
מ
ע
ב
ר
 
ל
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ק
ד
מ
ה
 
מ
ז
ר
ח
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
א
ל
ה
 
ש
מ
ו
ת
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
י
נ
ח
ל
ו
 
ל
כ
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ל
ע
ז
ר
 
ה
כ
ה
ן
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
נ
ש
י
א
 
א
ח
ד
 
נ
ש
י
א
 
א
ח
ד
 
מ
מ
ט
ה
 
ת
ק
ח
ו
 
ל
נ
ח
ל
 
א
ת
 
ה
א
ר
ץ
 
ו
א
ל
ה
 
ש
מ
ו
ת
 
ה
א
נ
ש
י
ם
 
ל
מ
ט
ה
 
י
ה
ו
ד
ה
 
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ל
מ
ט
ה
 
ב
נ
י
 
ש
מ
ע
ו
ן
 
ש
מ
ו
א
ל
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
ל
מ
ט
ה
 
ב
נ
י
מ
י
ם
 
א
ל
ד
ד
 
ב
ן
 
כ
ס
ל
ן
 
ל
מ
ט
ה
 
ב
נ
י
 
ד
ן
 
נ
ש
י
א
 
ב
ק
י
 
ב
ן
 
י
ג
ל
י
 
ל
ב
נ
י
 
י
ו
ס
ף
 
ל
מ
ט
ה
 
ב
נ
י
 
מ
נ
ש
ה
 
נ
ש
י
א
 
ח
נ
א
ל
 
ב
ן
 
א
פ
ו
ד
 
ו
ל
מ
ט
ה
 
ב
נ
י
 
א
פ
ר
י
ם
 
נ
ש
י
א
 
ק
מ
ו
א
ל
 
ב
ן
 
ש
פ
ט
ן
 
ו
ל
מ
ט
ה
 
ב
נ
י
 
ז
ב
ו
ל
ן
 
נ
ש
י
א
 
א
ל
י
צ
פ
ן
 
ב
ן
 
פ
ר
נ
ך
 
ו
ל
מ
ט
ה
 
ב
נ
י
 
י
ש
ש
כ
ר
 
נ
ש
י
א
 
פ
ל
ט
א
ל
 
ב
ן
 
ע
ז
ן
 
ו
ל
מ
ט
ה
 
ב
נ
י
 
א
ש
ר
 
נ
ש
י
א
 
א
ח
י
ו
ד
 
ב
ן
 
ש
ל
מ
י
 
ו
ל
מ
ט
ה
 
ב
נ
י
 
נ
פ
ת
ל
י
 
נ
ש
י
א
 
פ
ד
ה
א
ל
 
ב
ן
 
ע
מ
י
ה
ו
ד
 
א
ל
ה
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
נ
ח
ל
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
ל
א
מ
ר
 
צ
ו
י
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ת
נ
ו
 
ל
ל
ו
י
ם
 
מ
נ
ח
ל
ת
 
א
ח
ז
ת
ם
 
ע
ר
י
ם
 
ל
ש
ב
ת
 
ו
מ
ג
ר
ש
 
ל
ע
ר
י
ם
 
ס
ב
י
ב
ת
י
ה
ם
 
ת
ת
נ
ו
 
ל
ל
ו
י
ם
 
ו
ה
י
ו
 
ה
ע
ר
י
ם
 
ל
ה
ם
 
ל
ש
ב
ת
 
ו
מ
ג
ר
ש
י
ה
ן
 
י
ה
י
ו
 
ל
ב
ה
מ
ת
ם
 
ו
ל
ר
כ
ו
ש
ם
 
ו
ל
כ
ל
 
ח
י
ת
ם
 
ו
מ
ג
ר
ש
י
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ת
ת
נ
ו
 
ל
ל
ו
י
ם
 
מ
ק
י
ר
 
ה
ע
י
ר
 
ה
ח
ו
צ
ה
 
א
ל
ף
 
א
מ
ה
 
ס
ב
י
ב
 
ו
מ
ד
ת
ם
 
מ
ח
ו
ץ
 
ל
ע
י
ר
 
א
ת
 
פ
א
ת
 
ק
ד
מ
ה
 
א
ל
פ
י
ם
 
ב
א
מ
ה
 
ו
א
ת
 
פ
א
ת
 
נ
ג
ב
ה
 
א
ל
פ
י
ם
 
ב
א
מ
ה
 
ו
א
ת
 
פ
א
ת
 
י
מ
ה
 
א
ל
פ
י
ם
 
ב
א
מ
ה
 
ו
א
ת
 
פ
א
ת
 
צ
פ
ו
נ
ה
 
א
ל
פ
י
ם
 
ב
א
מ
ה
 
ו
ה
ע
י
ר
 
ב
ת
ו
ך
 
ז
ה
 
י
ה
י
ה
 
ל
כ
ם
 
מ
ג
ר
ש
י
 
ה
ע
ר
י
ם
 
ו
א
ת
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ת
ת
נ
ו
 
ל
ל
ו
י
ם
 
א
ת
 
ש
ש
 
ע
ר
י
 
ה
מ
ק
ל
ט
 
א
ש
ר
 
ת
ת
נ
ו
 
ל
נ
ו
ס
 
ש
ם
 
ה
ר
צ
ח
 
ו
ע
ל
י
ה
ן
 
ת
ת
נ
ו
 
א
ר
ב
ע
י
ם
 
ו
ש
ת
י
ם
 
ע
י
ר
 
כ
ל
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ת
ת
נ
ו
 
ל
ל
ו
י
ם
 
א
ר
ב
ע
י
ם
 
ו
ש
מ
נ
ה
 
ע
י
ר
 
א
ת
ה
ן
 
ו
א
ת
 
מ
ג
ר
ש
י
ה
ן
 
ו
ה
ע
ר
י
ם
 
א
ש
ר
 
ת
ת
נ
ו
 
מ
א
ח
ז
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
מ
א
ת
 
ה
ר
ב
 
ת
ר
ב
ו
 
ו
מ
א
ת
 
ה
מ
ע
ט
 
ת
מ
ע
י
ט
ו
 
א
י
ש
 
כ
פ
י
 
נ
ח
ל
ת
ו
 
א
ש
ר
 
י
נ
ח
ל
 
י
ת
ן
 
מ
ע
ר
י
ו
 
ל
ל
ו
י
ם
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ל
א
מ
ר
 
ד
ב
ר
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
מ
ר
ת
 
א
ל
י
ה
ם
 
כ
י
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
א
ל
 
א
ר
ץ
 
כ
נ
ע
ן
 
ו
ה
ק
ר
י
ת
ם
 
ל
כ
ם
 
ע
ר
י
ם
 
ע
ר
י
 
מ
ק
ל
ט
 
ת
ה
י
י
נ
ה
 
ל
כ
ם
 
ו
נ
ס
 
ש
מ
ה
 
ה
ר
צ
ח
 
מ
כ
ה
 
נ
פ
ש
 
ב
ש
ג
ג
ה
 
ו
ה
י
ו
 
ל
כ
ם
 
ה
ע
ר
י
ם
 
ל
מ
ק
ל
ט
 
מ
ג
א
ל
 
ו
ל
א
 
י
ו
מ
ת
 
ה
ר
צ
ח
 
ע
ד
 
ע
מ
ד
ו
 
ל
פ
נ
י
 
ה
ע
ד
ה
 
ל
מ
ש
פ
ט
 
ו
ה
ע
ר
י
ם
 
א
ש
ר
 
ת
ת
נ
ו
 
ש
ש
 
ע
ר
י
 
מ
ק
ל
ט
 
ת
ה
י
נ
ה
 
ל
כ
ם
 
א
ת
 
ש
ל
ש
 
ה
ע
ר
י
ם
 
ת
ת
נ
ו
 
מ
ע
ב
ר
 
ל
י
ר
ד
ן
 
ו
א
ת
 
ש
ל
ש
 
ה
ע
ר
י
ם
 
ת
ת
נ
ו
 
ב
א
ר
ץ
 
כ
נ
ע
ן
 
ע
ר
י
 
מ
ק
ל
ט
 
ת
ה
י
נ
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ל
ג
ר
 
ו
ל
ת
ו
ש
ב
 
ב
ת
ו
כ
ם
 
ת
ה
י
י
נ
ה
 
ש
ש
 
ה
ע
ר
י
ם
 
ה
א
ל
ה
 
ל
מ
ק
ל
ט
 
ל
נ
ו
ס
 
ש
מ
ה
 
כ
ל
 
מ
כ
ה
 
נ
פ
ש
 
ב
ש
ג
ג
ה
 
ו
א
ם
 
ב
כ
ל
י
 
ב
ר
ז
ל
 
ה
כ
ה
ו
 
ו
י
מ
ת
 
ר
צ
ח
 
ה
ו
א
 
מ
ו
ת
 
י
ו
מ
ת
 
ה
ר
צ
ח
 
ו
א
ם
 
ב
א
ב
ן
 
י
ד
 
א
ש
ר
 
י
מ
ו
ת
 
ב
ה
 
ה
כ
ה
ו
 
ו
י
מ
ת
 
ר
צ
ח
 
ה
ו
א
 
מ
ו
ת
 
י
ו
מ
ת
 
ה
ר
צ
ח
 
ו
א
ם
 
ב
כ
ל
י
 
ע
ץ
 
י
ד
 
א
ש
ר
 
י
מ
ו
ת
 
ב
ו
 
ה
כ
ה
ו
 
ו
י
מ
ת
 
ר
צ
ח
 
ה
ו
א
 
מ
ו
ת
 
י
ו
מ
ת
 
ה
ר
צ
ח
 
ג
א
ל
 
ה
ד
ם
 
ה
ו
א
 
י
מ
י
ת
 
א
ת
 
ה
ר
צ
ח
 
ב
פ
ג
ע
ו
 
ב
ו
 
ה
ו
א
 
י
מ
י
ת
נ
ו
 
ו
א
ם
 
ב
ש
נ
א
ה
 
י
ח
ד
י
פ
נ
ו
 
א
ו
 
ה
ש
ל
י
ך
 
ע
ל
י
ו
 
ב
צ
ד
י
ה
 
ו
י
מ
ת
 
א
ו
 
ב
א
י
ב
ה
 
ה
כ
ה
ו
 
ב
י
ד
ו
 
ו
י
מ
ת
 
מ
ו
ת
 
י
ו
מ
ת
 
ה
מ
כ
ה
 
ר
צ
ח
 
ה
ו
א
 
ג
א
ל
 
ה
ד
ם
 
י
מ
י
ת
 
א
ת
 
ה
ר
צ
ח
 
ב
פ
ג
ע
ו
 
ב
ו
 
ו
א
ם
 
ב
פ
ת
ע
 
ב
ל
א
 
א
י
ב
ה
 
ה
ד
י
פ
ו
 
א
ו
 
ה
ש
ל
י
ך
 
ע
ל
י
ו
 
כ
ל
 
כ
ל
י
 
ב
ל
א
 
צ
ד
י
ה
 
א
ו
 
ב
כ
ל
 
א
ב
ן
 
א
ש
ר
 
י
מ
ו
ת
 
ב
ה
 
ב
ל
א
 
ר
א
ו
ת
 
ו
י
פ
ל
 
ע
ל
י
ו
 
ו
י
מ
ת
 
ו
ה
ו
א
 
ל
א
 
א
ו
י
ב
 
ל
ו
 
ו
ל
א
 
מ
ב
ק
ש
 
ר
ע
ת
ו
 
ו
ש
פ
ט
ו
 
ה
ע
ד
ה
 
ב
י
ן
 
ה
מ
כ
ה
 
ו
ב
י
ן
 
ג
א
ל
 
ה
ד
ם
 
ע
ל
 
ה
מ
ש
פ
ט
י
ם
 
ה
א
ל
ה
 
ו
ה
צ
י
ל
ו
 
ה
ע
ד
ה
 
א
ת
 
ה
מ
כ
ה
 
מ
י
ד
 
ג
א
ל
 
ה
ד
ם
 
ו
ה
ש
י
ב
ו
 
א
ת
ו
 
ה
ע
ד
ה
 
א
ל
 
ע
י
ר
 
מ
ק
ל
ט
ו
 
א
ש
ר
 
נ
ס
 
ש
מ
ה
 
ו
י
ש
ב
 
ב
ה
 
ע
ד
 
מ
ו
ת
 
ה
כ
ה
ן
 
ה
ג
ד
ו
ל
 
א
ש
ר
 
מ
ש
ח
 
א
ת
ו
 
ב
ש
מ
ן
 
ה
ק
ד
ש
 
ו
א
ם
 
י
צ
א
 
י
צ
א
 
ה
ר
צ
ח
 
א
ת
 
ג
ב
ו
ל
 
ע
י
ר
 
מ
ק
ל
ט
ו
 
א
ש
ר
 
י
נ
ו
ס
 
ש
מ
ה
 
ו
מ
צ
א
 
א
ת
ו
 
ג
א
ל
 
ה
ד
ם
 
מ
ח
ו
ץ
 
ל
ג
ב
ו
ל
 
ע
י
ר
 
מ
ק
ל
ט
ו
 
ו
ר
צ
ח
 
ג
א
ל
 
ה
ד
ם
 
א
ת
 
ה
ר
צ
ח
 
א
י
ן
 
ל
ו
 
ד
ם
 
כ
י
 
ב
ע
י
ר
 
מ
ק
ל
ט
ו
 
י
ש
ב
 
ע
ד
 
מ
ו
ת
 
ה
כ
ה
ן
 
ה
ג
ד
ו
ל
 
ו
א
ח
ר
י
 
מ
ו
ת
 
ה
כ
ה
ן
 
ה
ג
ד
ו
ל
 
י
ש
ו
ב
 
ה
ר
צ
ח
 
א
ל
 
א
ר
ץ
 
א
ח
ז
ת
ו
 
ו
ה
י
ו
 
א
ל
ה
 
ל
כ
ם
 
ל
ח
ק
ת
 
מ
ש
פ
ט
 
ל
ד
ר
ת
י
כ
ם
 
ב
כ
ל
 
מ
ו
ש
ב
ת
י
כ
ם
 
כ
ל
 
מ
כ
ה
 
נ
פ
ש
 
ל
פ
י
 
ע
ד
י
ם
 
י
ר
צ
ח
 
א
ת
 
ה
ר
צ
ח
 
ו
ע
ד
 
א
ח
ד
 
ל
א
 
י
ע
נ
ה
 
ב
נ
פ
ש
 
ל
מ
ו
ת
 
ו
ל
א
 
ת
ק
ח
ו
 
כ
פ
ר
 
ל
נ
פ
ש
 
ר
צ
ח
 
א
ש
ר
 
ה
ו
א
 
ר
ש
ע
 
ל
מ
ו
ת
 
כ
י
 
מ
ו
ת
 
י
ו
מ
ת
 
ו
ל
א
 
ת
ק
ח
ו
 
כ
פ
ר
 
ל
נ
ו
ס
 
א
ל
 
ע
י
ר
 
מ
ק
ל
ט
ו
 
ל
ש
ו
ב
 
ל
ש
ב
ת
 
ב
א
ר
ץ
 
ע
ד
 
מ
ו
ת
 
ה
כ
ה
ן
 
ה
ג
ד
ו
ל
 
ו
ל
א
 
ת
ח
נ
י
פ
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
י
ש
ב
י
ם
 
ב
ה
 
כ
י
 
ה
ד
ם
 
ה
ו
א
 
י
ח
נ
י
ף
 
א
ת
 
ה
א
ר
ץ
 
ו
ל
א
ר
ץ
 
ל
א
 
י
כ
פ
ר
 
ל
ד
ם
 
א
ש
ר
 
ש
פ
ך
 
ב
ה
 
כ
י
 
א
ם
 
ב
ד
ם
 
ש
פ
כ
ו
 
ו
ל
א
 
ת
ט
מ
א
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
י
ש
ב
י
ם
 
ב
ה
 
א
ש
ר
 
א
נ
י
 
ש
כ
ן
 
ב
ת
ו
כ
ה
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
ש
כ
ן
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ק
ר
ב
ו
 
ר
א
ש
י
 
ה
א
ב
ו
ת
 
ל
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
ג
ל
ע
ד
 
ב
ן
 
מ
כ
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
מ
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
י
ו
ס
ף
 
ו
י
ד
ב
ר
ו
 
ל
פ
נ
י
 
מ
ש
ה
 
ו
ל
פ
נ
י
 
ה
נ
ש
י
א
י
ם
 
ר
א
ש
י
 
ה
א
ב
ו
ת
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
ו
 
א
ת
 
א
ד
נ
י
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ת
ת
 
א
ת
 
ה
א
ר
ץ
 
ב
נ
ח
ל
ה
 
ב
ג
ו
ר
ל
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
א
ד
נ
י
 
צ
ו
ה
 
ב
י
ה
ו
ה
 
ל
ת
ת
 
א
ת
 
נ
ח
ל
ת
 
צ
ל
פ
ח
ד
 
א
ח
י
נ
ו
 
ל
ב
נ
ת
י
ו
 
ו
ה
י
ו
 
ל
א
ח
ד
 
מ
ב
נ
י
 
ש
ב
ט
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
נ
ש
י
ם
 
ו
נ
ג
ר
ע
ה
 
נ
ח
ל
ת
ן
 
מ
נ
ח
ל
ת
 
א
ב
ת
י
נ
ו
 
ו
נ
ו
ס
פ
ה
 
ע
ל
 
נ
ח
ל
ת
 
ה
מ
ט
ה
 
א
ש
ר
 
ת
ה
י
י
נ
ה
 
ל
ה
ם
 
ו
מ
ג
ו
ר
ל
 
נ
ח
ל
ת
נ
ו
 
י
ג
ר
ע
 
ו
א
ם
 
י
ה
י
ה
 
ה
י
ו
ב
ל
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
נ
ו
ס
פ
ה
 
נ
ח
ל
ת
ן
 
ע
ל
 
נ
ח
ל
ת
 
ה
מ
ט
ה
 
א
ש
ר
 
ת
ה
י
י
נ
ה
 
ל
ה
ם
 
ו
מ
נ
ח
ל
ת
 
מ
ט
ה
 
א
ב
ת
י
נ
ו
 
י
ג
ר
ע
 
נ
ח
ל
ת
ן
 
ו
י
צ
ו
 
מ
ש
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ל
א
מ
ר
 
כ
ן
 
מ
ט
ה
 
ב
נ
י
 
י
ו
ס
ף
 
ד
ב
ר
י
ם
 
ז
ה
 
ה
ד
ב
ר
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ל
ב
נ
ו
ת
 
צ
ל
פ
ח
ד
 
ל
א
מ
ר
 
ל
ט
ו
ב
 
ב
ע
י
נ
י
ה
ם
 
ת
ה
י
נ
ה
 
ל
נ
ש
י
ם
 
א
ך
 
ל
מ
ש
פ
ח
ת
 
מ
ט
ה
 
א
ב
י
ה
ן
 
ת
ה
י
נ
ה
 
ל
נ
ש
י
ם
 
ו
ל
א
 
ת
ס
ו
ב
 
נ
ח
ל
ה
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
מ
מ
ט
ה
 
א
ל
 
מ
ט
ה
 
כ
י
 
א
י
ש
 
ב
נ
ח
ל
ת
 
מ
ט
ה
 
א
ב
ת
י
ו
 
י
ד
ב
ק
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
כ
ל
 
ב
ת
 
י
ר
ש
ת
 
נ
ח
ל
ה
 
מ
מ
ט
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
ח
ד
 
מ
מ
ש
פ
ח
ת
 
מ
ט
ה
 
א
ב
י
ה
 
ת
ה
י
ה
 
ל
א
ש
ה
 
ל
מ
ע
ן
 
י
י
ר
ש
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
י
ש
 
א
ת
 
נ
ח
ל
ת
 
א
ב
ת
י
ו
 
ו
ל
א
 
ת
ס
ב
 
נ
ח
ל
ה
 
מ
מ
ט
ה
 
א
ל
 
מ
ט
ה
 
א
ח
ר
 
כ
י
 
א
י
ש
 
ב
נ
ח
ל
ת
ו
 
י
ד
ב
ק
ו
 
מ
ט
ו
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
כ
ן
 
ע
ש
ו
 
ב
נ
ו
ת
 
צ
ל
פ
ח
ד
 
ו
ת
ה
י
י
נ
ה
 
מ
ח
ל
ה
 
ו
נ
ע
ה
 
ח
ג
ל
ה
 
מ
ל
כ
ה
 
ו
ת
ר
צ
ה
 
ב
נ
ו
ת
 
צ
ל
פ
ח
ד
 
ל
ב
נ
י
 
ד
ד
י
ה
ן
 
ל
נ
ש
י
ם
 
מ
מ
ש
פ
ח
ו
ת
 
ב
נ
י
 
מ
נ
ש
ה
 
ב
ן
 
י
ו
ס
ף
 
ה
י
ו
 
ל
נ
ש
י
ם
 
ו
ת
ה
י
 
נ
ח
ל
ת
ן
 
ע
ל
 
מ
ט
ה
 
מ
ש
פ
ח
ת
 
א
ב
י
ה
ן
 
א
ל
ה
 
ה
מ
צ
ו
ת
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
ב
י
ד
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ע
ל
 
י
ר
ד
ן
 
י
ר
י
ח
ו
 
א
ל
ה
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
כ
ל
 
י
ש
ר
א
ל
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ב
מ
ד
ב
ר
 
ב
ע
ר
ב
ה
 
מ
ו
ל
 
ס
ו
ף
 
ב
י
ן
 
פ
ר
א
ן
 
ו
ב
י
ן
 
ת
פ
ל
 
ו
ל
ב
ן
 
ו
ח
צ
ר
ו
ת
 
ו
ד
י
 
ז
ה
ב
 
א
ח
ד
 
ע
ש
ר
 
י
ו
ם
 
מ
ח
ו
ר
ב
 
ד
ר
ך
 
ה
ר
 
ש
ע
י
ר
 
ע
ד
 
ק
ד
ש
 
ב
ר
נ
ע
 
ו
י
ה
י
 
ב
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ב
ע
ש
ת
י
 
ע
ש
ר
 
ח
ד
ש
 
ב
א
ח
ד
 
ל
ח
ד
ש
 
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ו
 
א
ל
י
ה
ם
 
א
ח
ר
י
 
ה
כ
ו
ת
ו
 
א
ת
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
א
ש
ר
 
י
ש
ב
 
ב
ח
ש
ב
ו
ן
 
ו
א
ת
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
א
ש
ר
 
י
ש
ב
 
ב
ע
ש
ת
ר
ו
ת
 
ב
א
ד
ר
ע
י
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ב
א
ר
ץ
 
מ
ו
א
ב
 
ה
ו
א
ל
 
מ
ש
ה
 
ב
א
ר
 
א
ת
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ל
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ד
ב
ר
 
א
ל
י
נ
ו
 
ב
ח
ו
ר
ב
 
ל
א
מ
ר
 
ר
ב
 
ל
כ
ם
 
ש
ב
ת
 
ב
ה
ר
 
ה
ז
ה
 
פ
נ
ו
 
ו
ס
ע
ו
 
ל
כ
ם
 
ו
ב
א
ו
 
ה
ר
 
ה
א
מ
ר
י
 
ו
א
ל
 
כ
ל
 
ש
כ
י
נ
ו
 
ב
ע
ר
ב
ה
 
ב
ה
ר
 
ו
ב
ש
פ
ל
ה
 
ב
נ
ג
ב
 
ו
ב
ח
ו
ף
 
ה
י
ם
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ו
ה
ל
ב
נ
ו
ן
 
ע
ד
 
ה
נ
ה
ר
 
ה
ג
ד
ו
ל
 
נ
ה
ר
 
פ
ר
ת
 
ר
א
ו
 
נ
ת
ת
י
 
ל
פ
נ
י
כ
ם
 
א
ת
 
ה
א
ר
ץ
 
ב
א
ו
 
ו
ר
ש
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ת
י
כ
ם
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ל
ת
ת
 
ל
ז
ר
ע
ם
 
א
ח
ר
י
ה
ם
 
ו
א
מ
ר
 
א
ל
י
כ
ם
 
ב
ע
ת
 
ה
ה
י
א
 
ל
א
מ
ר
 
ל
א
 
א
ו
כ
ל
 
ל
ב
ד
י
 
ש
א
ת
 
א
ת
כ
ם
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ר
ב
ה
 
א
ת
כ
ם
 
ו
ה
נ
כ
ם
 
ה
י
ו
ם
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ל
ר
ב
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
י
ס
ף
 
ע
ל
י
כ
ם
 
כ
כ
ם
 
א
ל
ף
 
פ
ע
מ
י
ם
 
ו
י
ב
ר
ך
 
א
ת
כ
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
כ
ם
 
א
י
כ
ה
 
א
ש
א
 
ל
ב
ד
י
 
ט
ר
ח
כ
ם
 
מ
ש
א
כ
ם
 
ו
ר
י
ב
כ
ם
 
ה
ב
ו
 
ל
כ
ם
 
א
נ
ש
י
ם
 
ח
כ
מ
י
ם
 
ו
נ
ב
ו
נ
י
ם
 
ו
י
ד
ע
י
ם
 
ל
ש
ב
ט
י
כ
ם
 
ו
א
ש
י
מ
ם
 
ב
ר
א
ש
י
כ
ם
 
ו
ת
ע
נ
ו
 
א
ת
י
 
ו
ת
א
מ
ר
ו
 
ט
ו
ב
 
ה
ד
ב
ר
 
א
ש
ר
 
ד
ב
ר
ת
 
ל
ע
ש
ו
ת
 
ו
א
ק
ח
 
א
ת
 
ר
א
ש
י
 
ש
ב
ט
י
כ
ם
 
א
נ
ש
י
ם
 
ח
כ
מ
י
ם
 
ו
י
ד
ע
י
ם
 
ו
א
ת
ן
 
א
ת
ם
 
ר
א
ש
י
ם
 
ע
ל
י
כ
ם
 
ש
ר
י
 
א
ל
פ
י
ם
 
ו
ש
ר
י
 
מ
א
ו
ת
 
ש
ר
י
 
ח
מ
ש
י
ם
 
ו
ש
ר
י
 
ע
ש
ר
ו
ת
 
ו
ש
ט
ר
י
ם
 
ל
ש
ב
ט
י
כ
ם
 
ו
א
צ
ו
ה
 
א
ת
 
ש
פ
ט
י
כ
ם
 
ב
ע
ת
 
ה
ה
י
א
 
ל
א
מ
ר
 
ש
מ
ע
ו
 
ב
י
ן
 
א
ח
י
כ
ם
 
ו
ש
פ
ט
ת
ם
 
צ
ד
ק
 
ב
י
ן
 
א
י
ש
 
ו
ב
י
ן
 
א
ח
י
ו
 
ו
ב
י
ן
 
ג
ר
ו
 
ל
א
 
ת
כ
י
ר
ו
 
פ
נ
י
ם
 
ב
מ
ש
פ
ט
 
כ
ק
ט
ן
 
כ
ג
ד
ו
ל
 
ת
ש
מ
ע
ו
ן
 
ל
א
 
ת
ג
ו
ר
ו
 
מ
פ
נ
י
 
א
י
ש
 
כ
י
 
ה
מ
ש
פ
ט
 
ל
א
ל
ה
י
ם
 
ה
ו
א
 
ו
ה
ד
ב
ר
 
א
ש
ר
 
י
ק
ש
ה
 
מ
כ
ם
 
ת
ק
ר
י
ב
ו
ן
 
א
ל
י
 
ו
ש
מ
ע
ת
י
ו
 
ו
א
צ
ו
ה
 
א
ת
כ
ם
 
ב
ע
ת
 
ה
ה
י
א
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ת
ע
ש
ו
ן
 
ו
נ
ס
ע
ה
 
מ
ח
ו
ר
ב
 
ו
נ
ל
כ
ה
 
א
ת
 
כ
ל
 
ה
מ
ד
ב
ר
 
ה
ג
ד
ו
ל
 
ו
ה
נ
ו
ר
א
 
ה
ה
ו
א
 
א
ש
ר
 
ר
א
י
ת
ם
 
ד
ר
ך
 
ה
ר
 
ה
א
מ
ר
י
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
ת
נ
ו
 
ו
נ
ב
ו
א
 
ע
ד
 
ק
ד
ש
 
ב
ר
נ
ע
 
ו
א
מ
ר
 
א
ל
י
כ
ם
 
ב
א
ת
ם
 
ע
ד
 
ה
ר
 
ה
א
מ
ר
י
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
נ
ת
ן
 
ל
נ
ו
 
ר
א
ה
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
פ
נ
י
ך
 
א
ת
 
ה
א
ר
ץ
 
ע
ל
ה
 
ר
ש
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
ך
 
ל
ך
 
א
ל
 
ת
י
ר
א
 
ו
א
ל
 
ת
ח
ת
 
ו
ת
ק
ר
ב
ו
ן
 
א
ל
י
 
כ
ל
כ
ם
 
ו
ת
א
מ
ר
ו
 
נ
ש
ל
ח
ה
 
א
נ
ש
י
ם
 
ל
פ
נ
י
נ
ו
 
ו
י
ח
פ
ד
ו
 
ל
נ
ו
 
א
ת
 
ה
א
ר
ץ
 
ו
י
ש
י
ב
ו
 
א
ת
נ
ו
 
ד
ב
ר
 
א
ת
 
ה
ד
ר
ך
 
א
ש
ר
 
נ
ע
ל
ה
 
ב
ה
 
ו
א
ת
 
ה
ע
ר
י
ם
 
א
ש
ר
 
נ
ב
ו
א
 
ע
ל
י
ה
ן
 
ו
י
י
ט
ב
 
ב
ע
י
נ
י
 
ה
ד
ב
ר
 
ו
א
ק
ח
 
מ
כ
ם
 
ש
נ
י
ם
 
ע
ש
ר
 
א
נ
ש
י
ם
 
א
י
ש
 
א
ח
ד
 
ל
ש
ב
ט
 
ו
י
פ
נ
ו
 
ו
י
ע
ל
ו
 
ה
ה
ר
ה
 
ו
י
ב
א
ו
 
ע
ד
 
נ
ח
ל
 
א
ש
כ
ו
ל
 
ו
י
ר
ג
ל
ו
 
א
ת
ה
 
ו
י
ק
ח
ו
 
ב
י
ד
ם
 
מ
פ
ר
י
 
ה
א
ר
ץ
 
ו
י
ו
ר
י
ד
ו
 
א
ל
י
נ
ו
 
ו
י
ש
י
ב
ו
 
א
ת
נ
ו
 
ד
ב
ר
 
ו
י
א
מ
ר
ו
 
ט
ו
ב
ה
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
נ
ת
ן
 
ל
נ
ו
 
ו
ל
א
 
א
ב
י
ת
ם
 
ל
ע
ל
ו
ת
 
ו
ת
מ
ר
ו
 
א
ת
 
פ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ת
ר
ג
נ
ו
 
ב
א
ה
ל
י
כ
ם
 
ו
ת
א
מ
ר
ו
 
ב
ש
נ
א
ת
 
י
ה
ו
ה
 
א
ת
נ
ו
 
ה
ו
צ
י
א
נ
ו
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
ת
ת
 
א
ת
נ
ו
 
ב
י
ד
 
ה
א
מ
ר
י
 
ל
ה
ש
מ
י
ד
נ
ו
 
א
נ
ה
 
א
נ
ח
נ
ו
 
ע
ל
י
ם
 
ו
א
ח
י
נ
ו
 
ה
מ
י
ס
ו
 
א
ת
 
ל
ב
ב
נ
ו
 
ל
א
מ
ר
 
ע
ם
 
ג
ד
ו
ל
 
ו
ר
ב
 
מ
מ
נ
ו
 
ע
ר
י
ם
 
ג
ד
ל
ו
ת
 
ו
ב
צ
ר
ו
ת
 
ב
ש
מ
י
ם
 
ו
ג
ם
 
ב
נ
י
 
ע
נ
ק
י
ם
 
ר
א
י
נ
ו
 
ש
ם
 
ו
א
מ
ר
 
א
ל
י
כ
ם
 
ל
א
 
ת
ע
ר
צ
ו
ן
 
ו
ל
א
 
ת
י
ר
א
ו
ן
 
מ
ה
ם
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ה
ל
ך
 
ל
פ
נ
י
כ
ם
 
ה
ו
א
 
י
ל
ח
ם
 
ל
כ
ם
 
כ
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
א
ת
כ
ם
 
ב
מ
צ
ר
י
ם
 
ל
ע
י
נ
י
כ
ם
 
ו
ב
מ
ד
ב
ר
 
א
ש
ר
 
ר
א
י
ת
 
א
ש
ר
 
נ
ש
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
א
ש
ר
 
י
ש
א
 
א
י
ש
 
א
ת
 
ב
נ
ו
 
ב
כ
ל
 
ה
ד
ר
ך
 
א
ש
ר
 
ה
ל
כ
ת
ם
 
ע
ד
 
ב
א
כ
ם
 
ע
ד
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
ו
ב
ד
ב
ר
 
ה
ז
ה
 
א
י
נ
כ
ם
 
מ
א
מ
נ
י
ם
 
ב
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ה
ל
ך
 
ל
פ
נ
י
כ
ם
 
ב
ד
ר
ך
 
ל
ת
ו
ר
 
ל
כ
ם
 
מ
ק
ו
ם
 
ל
ה
ח
נ
ו
ת
כ
ם
 
ב
א
ש
 
ל
י
ל
ה
 
ל
ה
ר
א
ו
ת
כ
ם
 
ב
ד
ר
ך
 
א
ש
ר
 
ת
ל
כ
ו
 
ב
ה
 
ו
ב
ע
נ
ן
 
י
ו
מ
ם
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
א
ת
 
ק
ו
ל
 
ד
ב
ר
י
כ
ם
 
ו
י
ק
צ
ף
 
ו
י
ש
ב
ע
 
ל
א
מ
ר
 
א
ם
 
י
ר
א
ה
 
א
י
ש
 
ב
א
נ
ש
י
ם
 
ה
א
ל
ה
 
ה
ד
ו
ר
 
ה
ר
ע
 
ה
ז
ה
 
א
ת
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ת
י
כ
ם
 
ז
ו
ל
ת
י
 
כ
ל
ב
 
ב
ן
 
י
פ
נ
ה
 
ה
ו
א
 
י
ר
א
נ
ה
 
ו
ל
ו
 
א
ת
ן
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
ד
ר
ך
 
ב
ה
 
ו
ל
ב
נ
י
ו
 
י
ע
ן
 
כ
י
 
מ
ל
א
 
א
ח
ר
י
 
י
ה
ו
ה
 
ג
ם
 
ב
י
 
ה
ת
א
נ
ף
 
י
ה
ו
ה
 
ב
ג
ל
ל
כ
ם
 
ל
א
מ
ר
 
ג
ם
 
א
ת
ה
 
ל
א
 
ת
ב
ו
א
 
ש
מ
ה
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ה
ע
מ
ד
 
ל
פ
נ
י
ך
 
ה
ו
א
 
י
ב
ו
א
 
ש
מ
ה
 
א
ת
ו
 
א
ח
ז
י
ק
 
כ
י
 
ה
ו
א
 
י
נ
ח
ל
נ
ה
 
א
ת
 
י
ש
ר
א
ל
 
ו
ט
פ
כ
ם
 
א
ש
ר
 
א
מ
ר
ת
ם
 
ל
ב
ו
ז
 
י
ה
י
ה
 
ו
ב
נ
י
כ
ם
 
ה
ם
 
י
ב
א
ו
 
ש
ם
 
ו
ל
ה
ם
 
א
ת
נ
נ
ה
 
ו
ה
ם
 
י
י
ר
ש
ו
ה
 
ו
א
ת
ם
 
פ
נ
ו
 
ו
ס
ע
ו
 
ל
כ
ם
 
ה
מ
ד
ב
ר
ה
 
ד
ר
ך
 
י
ם
 
ס
ו
ף
 
ו
ת
ע
נ
ו
 
ו
ת
א
מ
ר
ו
 
א
ל
י
 
ח
ט
א
נ
ו
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
נ
ח
נ
ו
 
נ
ע
ל
ה
 
ו
נ
ל
ח
מ
נ
ו
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
ת
ח
ג
ר
ו
 
א
י
ש
 
א
ת
 
כ
ל
י
 
מ
ל
ח
מ
ת
ו
 
ו
ת
ה
י
י
נ
ו
 
ל
ע
ל
ו
ת
 
ה
ה
ר
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
א
מ
ר
 
ל
ה
ם
 
ל
א
 
ת
ע
ל
ו
 
ו
ל
א
 
ת
ל
ח
מ
ו
 
כ
י
 
א
י
נ
נ
י
 
ב
ק
ר
ב
כ
ם
 
ו
ל
א
 
ת
נ
ג
פ
ו
 
ל
פ
נ
י
 
א
י
ב
י
כ
ם
 
ו
א
ד
ב
ר
ה
 
א
ל
י
כ
ם
 
ו
ל
א
 
ש
מ
ע
ת
ם
 
ו
ת
מ
ר
ו
 
א
ת
 
פ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ת
ז
י
ד
ו
 
ו
ת
ע
ל
ו
 
ה
ה
ר
ה
 
ו
י
צ
א
 
ה
ע
מ
ל
ק
י
 
ו
ה
כ
נ
ע
נ
י
 
ה
י
ש
ב
 
ב
ה
ר
 
ה
ה
ו
א
 
ל
ק
ר
א
ת
כ
ם
 
ו
י
ר
ד
פ
ו
 
א
ת
כ
ם
 
כ
א
ש
ר
 
ת
ע
ש
י
נ
ה
 
ה
ד
ב
ר
י
ם
 
ו
י
כ
ת
ו
 
א
ת
כ
ם
 
ב
ש
ע
י
ר
 
ע
ד
 
ח
ר
מ
ה
 
ו
ת
ש
ב
ו
 
ו
ת
ב
כ
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
א
 
ש
מ
ע
 
י
ה
ו
ה
 
ב
ק
ו
ל
כ
ם
 
ו
ל
א
 
ה
א
ז
י
ן
 
א
ל
י
כ
ם
 
ו
ת
ש
ב
ו
 
ב
ק
ד
ש
 
י
מ
י
ם
 
ר
ב
י
ם
 
כ
י
מ
י
ם
 
א
ש
ר
 
י
ש
ב
ת
ם
 
ו
נ
פ
נ
ה
 
ו
נ
ס
ע
ה
 
ה
מ
ד
ב
ר
ה
 
ד
ר
ך
 
י
ם
 
ס
ו
ף
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
 
ו
נ
ס
ב
 
א
ת
 
ה
ר
 
ש
ע
י
ר
 
י
מ
י
ם
 
ר
ב
י
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ל
א
מ
ר
 
ר
ב
 
ל
כ
ם
 
ס
ו
ב
 
א
ת
 
ה
ה
ר
 
ה
ז
ה
 
פ
נ
ו
 
ל
כ
ם
 
צ
פ
ו
נ
ה
 
ו
א
ת
 
ה
ע
ם
 
צ
ו
י
 
ל
א
מ
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
ב
ג
ב
ו
ל
 
א
ח
י
כ
ם
 
ב
נ
י
 
ע
ש
ו
 
ה
י
ש
ב
י
ם
 
ב
ש
ע
י
ר
 
ו
י
י
ר
א
ו
 
מ
כ
ם
 
ו
נ
ש
מ
ר
ת
ם
 
מ
א
ד
 
א
ל
 
ת
ת
ג
ר
ו
 
ב
ם
 
כ
י
 
ל
א
 
א
ת
ן
 
ל
כ
ם
 
מ
א
ר
צ
ם
 
י
ר
ש
ה
 
ע
ד
 
מ
ד
ר
ך
 
כ
ף
 
ר
ג
ל
 
כ
י
 
י
ר
ש
ה
 
ל
ע
ש
ו
 
נ
ת
ת
י
 
א
ת
 
ה
ר
 
ש
ע
י
ר
 
א
כ
ל
 
ת
ש
ב
ר
ו
 
מ
א
ת
ם
 
ב
כ
ס
ף
 
ו
א
כ
ל
ת
ם
 
ו
ג
ם
 
מ
י
ם
 
ת
כ
י
ר
ו
 
מ
א
ת
ם
 
ב
כ
ס
ף
 
ו
ש
ת
י
ת
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ר
כ
ך
 
ב
כ
ל
 
מ
ע
ש
ה
 
י
ד
י
ך
 
י
ד
ע
 
ל
כ
ת
ך
 
א
ת
 
ה
מ
ד
ב
ר
 
ה
ג
ד
ו
ל
 
ה
ז
ה
 
ז
ה
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ע
מ
ך
 
ל
א
 
ח
ס
ר
ת
 
ד
ב
ר
 
ו
א
ש
ל
ח
ה
 
מ
ל
א
כ
י
ם
 
א
ל
 
מ
ל
ך
 
א
ד
ו
ם
 
ל
א
מ
ר
 
א
ע
ב
ר
ה
 
ב
א
ר
צ
ך
 
ל
א
 
א
ט
ה
 
ב
ש
ד
ה
 
ו
ב
כ
ר
ם
 
ו
ל
א
 
נ
ש
ת
ה
 
מ
י
 
ב
ו
ר
 
ד
ר
ך
 
ה
מ
ל
ך
 
נ
ל
ך
 
ל
א
 
נ
ס
ו
ר
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ע
ד
 
א
ש
ר
 
נ
ע
ב
ר
 
ג
ב
ו
ל
ך
 
ו
י
א
מ
ר
 
ל
א
 
ת
ע
ב
ר
 
ב
י
 
פ
ן
 
ב
ח
ר
ב
 
א
צ
א
 
ל
ק
ר
א
ת
ך
 
ו
נ
ע
ב
ר
ה
 
מ
א
ת
 
א
ח
י
נ
ו
 
ב
נ
י
 
ע
ש
ו
 
ה
י
ש
ב
י
ם
 
ב
ש
ע
י
ר
 
מ
ד
ר
ך
 
ה
ע
ר
ב
ה
 
מ
א
י
ל
ת
 
ו
מ
ע
צ
י
ו
נ
 
ג
ב
ר
 
ו
נ
פ
נ
ה
 
ו
נ
ע
ב
ר
ה
 
ד
ר
ך
 
מ
ד
ב
ר
 
מ
ו
א
ב
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
א
ל
 
ת
צ
ו
ר
 
א
ת
 
מ
ו
א
ב
 
ו
א
ל
 
ת
ת
ג
ר
 
ב
ו
 
כ
י
 
ל
א
 
א
ת
ן
 
ל
ך
 
מ
א
ר
צ
ו
 
י
ר
ש
ה
 
כ
י
 
ל
ב
נ
י
 
ל
ו
ט
 
נ
ת
ת
י
 
א
ת
 
ע
ר
 
י
ר
ש
ה
 
ה
א
י
מ
י
ם
 
ל
פ
נ
י
ם
 
י
ש
ב
ו
 
ב
ה
 
ע
ם
 
ג
ד
ו
ל
 
ו
ר
ב
 
ו
ר
ם
 
כ
ע
נ
ק
י
ם
 
ו
ה
מ
ו
א
ב
י
ם
 
י
ק
ר
א
ו
 
ל
ה
ם
 
א
י
מ
י
ם
 
ו
ב
ש
ע
י
ר
 
י
ש
ב
ו
 
ה
ח
ר
י
 
ל
פ
נ
י
ם
 
ו
ב
נ
י
 
ע
ש
ו
 
י
י
ר
ש
ו
ם
 
ו
י
ש
מ
ד
ם
 
י
ה
ו
ה
 
מ
פ
נ
י
ה
ם
 
ו
י
י
ר
ש
ו
ם
 
ו
י
ש
ב
ו
 
ת
ח
ת
י
ה
ם
 
כ
א
ש
ר
 
ע
ש
ה
 
י
ש
ר
א
ל
 
ל
א
ר
ץ
 
י
ר
ש
ת
ו
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ל
ה
ם
 
ו
ע
ת
ה
 
ק
ו
מ
ו
 
ס
ע
ו
 
ו
ע
ב
ר
ו
 
ל
כ
ם
 
א
ת
 
נ
ח
ל
 
ז
ר
ד
 
ו
נ
ע
ב
ר
ה
 
א
ת
 
נ
ח
ל
 
ז
ר
ד
 
ו
ה
י
מ
י
ם
 
א
ש
ר
 
ה
ל
כ
נ
ו
 
מ
ק
ד
ש
 
ב
ר
נ
ע
 
ע
ד
 
א
ש
ר
 
ע
ב
ר
נ
ו
 
א
ת
 
נ
ח
ל
 
ז
ר
ד
 
ש
ל
ש
י
ם
 
ו
ש
מ
נ
ה
 
ש
נ
ה
 
ע
ד
 
ת
ם
 
כ
ל
 
ה
ד
ו
ר
 
א
נ
ש
י
 
ה
מ
ל
ח
מ
ה
 
מ
ק
ר
ב
 
ה
מ
ח
נ
ה
 
כ
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
ה
ם
 
ו
ג
ם
 
י
ד
 
י
ה
ו
ה
 
ה
י
ת
ה
 
ב
ם
 
ל
ה
מ
ם
 
מ
ק
ר
ב
 
ה
מ
ח
נ
ה
 
ע
ד
 
ת
מ
ם
 
ו
י
ה
י
 
כ
א
ש
ר
 
ת
מ
ו
 
כ
ל
 
א
נ
ש
י
 
ה
מ
ל
ח
מ
ה
 
ל
מ
ו
ת
 
מ
ק
ר
ב
 
ה
ע
ם
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ל
א
מ
ר
 
א
ת
ה
 
ע
ב
ר
 
ה
י
ו
ם
 
א
ת
 
ג
ב
ו
ל
 
מ
ו
א
ב
 
א
ת
 
ע
ר
 
ו
ק
ר
ב
ת
 
מ
ו
ל
 
ב
נ
י
 
ע
מ
ו
ן
 
א
ל
 
ת
צ
ו
ר
ם
 
ו
א
ל
 
ת
ת
ג
ר
 
ב
ם
 
כ
י
 
ל
א
 
א
ת
ן
 
מ
א
ר
ץ
 
ב
נ
י
 
ע
מ
ו
ן
 
ל
ך
 
י
ר
ש
ה
 
כ
י
 
ל
ב
נ
י
 
ל
ו
ט
 
נ
ת
ת
י
ה
 
י
ר
ש
ה
 
א
ר
ץ
 
ר
פ
א
י
ם
 
ת
ח
ש
ב
 
א
ף
 
ה
י
א
 
ר
פ
א
י
ם
 
י
ש
ב
ו
 
ב
ה
 
ל
פ
נ
י
ם
 
ו
ה
ע
מ
ו
נ
י
ם
 
י
ק
ר
א
ו
 
ל
ה
ם
 
ז
מ
ז
מ
י
ם
 
ע
ם
 
ג
ד
ו
ל
 
ו
ר
ב
 
ו
ר
ם
 
כ
ע
נ
ק
י
ם
 
ו
י
ש
מ
ד
ם
 
י
ה
ו
ה
 
מ
פ
נ
י
ה
ם
 
ו
י
י
ר
ש
ו
ם
 
ו
י
ש
ב
ו
 
ת
ח
ת
י
ה
ם
 
כ
א
ש
ר
 
ע
ש
ה
 
ל
ב
נ
י
 
ע
ש
ו
 
ה
י
ש
ב
י
ם
 
ב
ש
ע
י
ר
 
א
ש
ר
 
ה
ש
מ
י
ד
 
א
ת
 
ה
ח
ר
י
 
מ
פ
נ
י
ה
ם
 
ו
י
י
ר
ש
ו
ם
 
ו
י
ש
ב
ו
 
ת
ח
ת
י
ה
ם
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
ה
ע
ו
י
ם
 
ה
י
ש
ב
י
ם
 
ב
ח
צ
ר
י
ם
 
ע
ד
 
ע
ז
ה
 
כ
פ
ת
ר
י
ם
 
ה
י
ו
צ
א
י
ם
 
מ
כ
פ
ת
ר
 
ה
ש
מ
י
ד
ם
 
ו
י
ש
ב
ו
 
ת
ח
ת
ם
 
ק
ו
מ
ו
 
ס
ע
ו
 
ו
ע
ב
ר
ו
 
א
ת
 
נ
ח
ל
 
א
ר
נ
ן
 
ר
א
ה
 
נ
ת
ת
י
 
ב
י
ד
ך
 
א
ת
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ה
א
מ
ר
י
 
ו
א
ת
 
א
ר
צ
ו
 
ה
ח
ל
 
ר
ש
 
ו
ה
ת
ג
ר
 
ב
ו
 
מ
ל
ח
מ
ה
 
ה
י
ו
ם
 
ה
ז
ה
 
ה
ח
ל
 
ת
ת
 
פ
ח
ד
ך
 
ו
י
ר
א
ת
ך
 
ע
ל
 
פ
נ
י
 
ה
ע
מ
י
ם
 
ת
ח
ת
 
כ
ל
 
ה
ש
מ
י
ם
 
א
ש
ר
 
י
ש
מ
ע
ו
 
א
ת
 
ש
מ
ע
ך
 
ו
ר
ג
ז
ו
 
ו
ח
ל
ו
 
מ
פ
נ
י
ך
 
ו
א
ש
ל
ח
ה
 
מ
ל
א
כ
י
ם
 
מ
מ
ד
ב
ר
 
ק
ד
מ
ו
ת
 
א
ל
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ד
ב
ר
י
 
ש
ל
ו
ם
 
ל
א
מ
ר
 
א
ע
ב
ר
ה
 
ב
א
ר
צ
ך
 
ב
ד
ר
ך
 
ב
ד
ר
ך
 
א
ל
ך
 
ל
א
 
א
ס
ו
ר
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
א
כ
ל
 
ב
כ
ס
ף
 
ת
ש
ב
י
ר
נ
י
 
ו
א
כ
ל
ת
י
 
ו
מ
י
ם
 
ב
כ
ס
ף
 
ת
ת
ן
 
ל
י
 
ו
ש
ת
י
ת
י
 
ר
ק
 
א
ע
ב
ר
ה
 
ב
ר
ג
ל
י
 
כ
א
ש
ר
 
ע
ש
ו
 
ל
י
 
ב
נ
י
 
ע
ש
ו
 
ה
י
ש
ב
י
ם
 
ב
ש
ע
י
ר
 
ו
ה
מ
ו
א
ב
י
ם
 
ה
י
ש
ב
י
ם
 
ב
ע
ר
 
ע
ד
 
א
ש
ר
 
א
ע
ב
ר
ה
 
א
ת
 
ה
י
ר
ד
ן
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
נ
ת
ן
 
ל
נ
ו
 
ו
ל
א
 
א
ב
ה
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ה
ע
ב
י
ר
נ
ו
 
ב
ו
 
כ
י
 
ה
ק
ש
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ר
ו
ח
ו
 
ו
א
מ
ץ
 
א
ת
 
ל
ב
ב
ו
 
ל
מ
ע
ן
 
ת
ת
ו
 
ב
י
ד
ך
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ר
א
ה
 
ה
ח
ל
ת
י
 
ת
ת
 
ל
פ
נ
י
ך
 
א
ת
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ה
א
מ
ר
י
 
ו
א
ת
 
א
ר
צ
ו
 
ה
ח
ל
 
ר
ש
 
ל
ר
ש
ת
 
א
ת
 
א
ר
צ
ו
 
ו
י
צ
א
 
ס
י
ח
ו
ן
 
ל
ק
ר
א
ת
נ
ו
 
ה
ו
א
 
ו
כ
ל
 
ע
מ
ו
 
ל
מ
ל
ח
מ
ה
 
י
ח
צ
ה
 
ו
י
ת
נ
ה
ו
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ל
פ
נ
י
נ
ו
 
ו
נ
כ
ה
 
א
ת
ו
 
ו
א
ת
 
ב
נ
י
ו
 
ו
א
ת
 
כ
ל
 
ע
מ
ו
 
ו
נ
ל
כ
ד
ה
 
א
ת
 
כ
ל
 
ע
ר
י
ו
 
ב
ע
ת
 
ה
ה
י
א
 
ו
נ
ח
ר
י
מ
ה
 
א
ת
 
כ
ל
 
ע
ר
י
ו
 
מ
ת
ם
 
ה
נ
ש
י
ם
 
ו
ה
ט
ף
 
ל
א
 
ה
ש
א
י
ר
נ
ו
 
ש
ר
י
ד
 
ר
ק
 
ה
ב
ה
מ
ה
 
ב
ז
ז
נ
ו
 
ל
נ
ו
 
ו
ש
ל
ל
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ל
כ
ד
נ
ו
 
מ
ע
ר
ע
ר
 
א
ש
ר
 
ע
ל
 
ש
פ
ת
 
נ
ח
ל
 
א
ר
נ
ן
 
ו
ה
ע
י
ר
 
א
ש
ר
 
ב
נ
ח
ל
 
ו
ע
ד
 
ה
ג
ל
ע
ד
 
ל
א
 
ה
י
ת
ה
 
ק
ר
י
ה
 
א
ש
ר
 
ש
ג
ב
ה
 
מ
מ
נ
ו
 
א
ת
 
ה
כ
ל
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ב
י
ד
נ
ו
 
ר
ק
 
א
ל
 
א
ר
ץ
 
ב
נ
י
 
ע
מ
ו
ן
 
ל
א
 
ק
ר
ב
ת
 
כ
ל
 
י
ד
 
נ
ח
ל
 
ה
י
ב
ק
 
ו
ע
ר
י
 
ה
ה
ר
 
ו
כ
ל
 
א
ש
ר
 
צ
ו
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
נ
פ
נ
ה
 
ו
נ
ע
ל
ה
 
ד
ר
ך
 
ה
ב
ש
ן
 
ו
י
צ
א
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
ל
ק
ר
א
ת
נ
ו
 
ה
ו
א
 
ו
כ
ל
 
ע
מ
ו
 
ל
מ
ל
ח
מ
ה
 
א
ד
ר
ע
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
א
ל
 
ת
י
ר
א
 
א
ת
ו
 
כ
י
 
ב
י
ד
ך
 
נ
ת
ת
י
 
א
ת
ו
 
ו
א
ת
 
כ
ל
 
ע
מ
ו
 
ו
א
ת
 
א
ר
צ
ו
 
ו
ע
ש
י
ת
 
ל
ו
 
כ
א
ש
ר
 
ע
ש
י
ת
 
ל
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
א
ש
ר
 
י
ש
ב
 
ב
ח
ש
ב
ו
ן
 
ו
י
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ב
י
ד
נ
ו
 
ג
ם
 
א
ת
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
ו
א
ת
 
כ
ל
 
ע
מ
ו
 
ו
נ
כ
נ
ו
 
ע
ד
 
ב
ל
ת
י
 
ה
ש
א
י
ר
 
ל
ו
 
ש
ר
י
ד
 
ו
נ
ל
כ
ד
ה
 
א
ת
 
כ
ל
 
ע
ר
י
ו
 
ב
ע
ת
 
ה
ה
י
א
 
ל
א
 
ה
י
ת
ה
 
ק
ר
י
ה
 
א
ש
ר
 
ל
א
 
ל
ק
ח
נ
ו
 
מ
א
ת
ם
 
ש
ש
י
ם
 
ע
י
ר
 
כ
ל
 
ח
ב
ל
 
ה
א
ר
ג
ב
 
מ
מ
ל
כ
ו
ת
 
ע
ו
ג
 
ב
ב
ש
ן
 
כ
ל
 
א
ל
ה
 
ע
ר
י
ם
 
ב
צ
ר
ו
ת
 
ח
ו
מ
ה
 
ג
ב
ח
ה
 
ד
ל
ת
י
ם
 
ו
ב
ר
י
ח
 
ל
ב
ד
 
מ
ע
ר
י
 
ה
פ
ר
ז
י
 
ה
ר
ב
ה
 
מ
א
ד
 
ו
נ
ח
ר
י
מ
ה
 
א
ת
ם
 
כ
א
ש
ר
 
ע
ש
י
נ
ו
 
ל
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ה
ח
ר
י
ם
 
כ
ל
 
ע
י
ר
 
מ
ת
ם
 
ה
נ
ש
י
ם
 
ו
ה
ט
ף
 
ו
כ
ל
 
ה
ב
ה
מ
ה
 
ו
ש
ל
ל
 
ה
ע
ר
י
ם
 
ב
ז
ז
נ
ו
 
ל
נ
ו
 
ו
נ
ק
ח
 
ב
ע
ת
 
ה
ה
י
א
 
א
ת
 
ה
א
ר
ץ
 
מ
י
ד
 
ש
נ
י
 
מ
ל
כ
י
 
ה
א
מ
ר
י
 
א
ש
ר
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
מ
נ
ח
ל
 
א
ר
נ
ן
 
ו
ע
ד
 
ה
ר
 
ח
ר
מ
ו
ן
 
צ
י
ד
נ
י
ם
 
י
ק
ר
א
ו
 
ל
ח
ר
מ
ו
ן
 
ש
ר
י
ן
 
ו
ה
א
מ
ר
י
 
י
ק
ר
א
ו
 
ל
ו
 
ש
נ
י
ר
 
כ
ל
 
ע
ר
י
 
ה
מ
י
ש
ו
ר
 
ו
כ
ל
 
ה
ג
ל
ע
ד
 
ו
כ
ל
 
ה
ב
ש
ן
 
ע
ד
 
ס
ל
כ
ה
 
ו
א
ד
ר
ע
י
 
ע
ר
י
 
מ
מ
ל
כ
ת
 
ע
ו
ג
 
ב
ב
ש
ן
 
כ
י
 
ר
ק
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
נ
ש
א
ר
 
מ
י
ת
ר
 
ה
ר
פ
א
י
ם
 
ה
נ
ה
 
ע
ר
ש
ו
 
ע
ר
ש
 
ב
ר
ז
ל
 
ה
ל
ו
א
 
ה
י
א
 
ב
ר
ב
ת
 
ב
נ
י
 
ע
מ
ו
ן
 
ת
ש
ע
 
א
מ
ו
ת
 
א
ר
כ
ה
 
ו
א
ר
ב
ע
 
א
מ
ו
ת
 
ר
ח
ב
ה
 
ב
א
מ
ת
 
א
י
ש
 
ו
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
י
ר
ש
נ
ו
 
ב
ע
ת
 
ה
ה
י
א
 
מ
ע
ר
ע
ר
 
א
ש
ר
 
ע
ל
 
ש
פ
ת
 
נ
ח
ל
 
א
ר
נ
ן
 
ו
ח
צ
י
 
ה
ר
 
ה
ג
ל
ע
ד
 
ו
ע
ר
י
ו
 
נ
ת
ת
י
 
ל
ר
א
ו
ב
נ
י
 
ו
ל
ג
ד
י
 
ו
י
ת
ר
 
ה
ג
ל
ע
ד
 
ו
כ
ל
 
ה
ב
ש
ן
 
מ
מ
ל
כ
ת
 
ע
ו
ג
 
נ
ת
ת
י
 
ל
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
כ
ל
 
ח
ב
ל
 
ה
א
ר
ג
ב
 
ל
כ
ל
 
ה
ב
ש
ן
 
ה
ה
ו
א
 
י
ק
ר
א
 
א
ר
ץ
 
ר
פ
א
י
ם
 
ו
י
א
י
ר
 
ב
ן
 
מ
נ
ש
ה
 
ל
ק
ח
 
א
ת
 
כ
ל
 
ח
ב
ל
 
ה
א
ר
ג
ב
 
ע
ד
 
ג
ב
ו
ל
 
ה
ג
י
ש
ו
ר
י
 
ו
ה
מ
כ
ע
ת
י
 
ו
י
ק
ר
א
 
א
ת
ם
 
ע
ל
 
ש
מ
ו
 
א
ת
 
ה
ב
ש
ן
 
ח
ו
ת
 
י
א
י
ר
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
ל
מ
כ
י
ר
 
נ
ת
ת
י
 
א
ת
 
ה
ג
ל
ע
ד
 
ו
ל
ר
א
ו
ב
נ
י
 
ו
ל
ג
ד
י
 
נ
ת
ת
י
 
מ
ן
 
ה
ג
ל
ע
ד
 
ו
ע
ד
 
נ
ח
ל
 
א
ר
נ
ן
 
ת
ו
ך
 
ה
נ
ח
ל
 
ו
ג
ב
ו
ל
 
ע
ד
 
י
ב
ק
 
ה
נ
ח
ל
 
ג
ב
ו
ל
 
ב
נ
י
 
ע
מ
ו
ן
 
ו
ה
ע
ר
ב
ה
 
ו
ה
י
ר
ד
נ
ה
 
ו
ג
ב
ו
ל
 
מ
כ
נ
ר
ת
 
ו
ע
ד
 
י
ם
 
ה
ע
ר
ב
ה
 
י
ם
 
ה
מ
ל
ח
 
ת
ח
ת
 
א
ש
ד
ו
ת
 
ה
פ
ס
ג
ה
 
מ
ז
ר
ח
ה
 
ו
א
צ
ו
ה
 
א
ת
כ
ם
 
ב
ע
ת
 
ה
ה
י
א
 
ל
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
נ
ת
ן
 
ל
כ
ם
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ל
ר
ש
ת
ה
 
ח
ל
ו
צ
י
ם
 
ת
ע
ב
ר
ו
 
ל
פ
נ
י
 
א
ח
י
כ
ם
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
ל
 
ב
נ
י
 
ח
י
ל
 
ר
ק
 
ט
פ
כ
ם
 
ו
נ
ש
י
כ
ם
 
ו
מ
ק
נ
י
כ
ם
 
י
ד
ע
ת
י
 
כ
י
 
מ
ק
נ
ה
 
ר
ב
 
ל
כ
ם
 
י
ש
ב
ו
 
ב
ע
ר
י
כ
ם
 
א
ש
ר
 
נ
ת
ת
י
 
ל
כ
ם
 
ע
ד
 
א
ש
ר
 
י
נ
י
ח
 
י
ה
ו
ה
 
ל
א
ח
י
כ
ם
 
כ
כ
ם
 
ו
י
י
ר
ש
ו
 
ג
ם
 
ה
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
נ
ת
ן
 
ל
ה
ם
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ו
ש
ב
ת
ם
 
א
י
ש
 
ל
י
ר
ש
ת
ו
 
א
ש
ר
 
נ
ת
ת
י
 
ל
כ
ם
 
ו
א
ת
 
י
ה
ו
ש
ע
 
צ
ו
י
ת
י
 
ב
ע
ת
 
ה
ה
י
א
 
ל
א
מ
ר
 
ע
י
נ
י
ך
 
ה
ר
א
ו
ת
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ל
ש
נ
י
 
ה
מ
ל
כ
י
ם
 
ה
א
ל
ה
 
כ
ן
 
י
ע
ש
ה
 
י
ה
ו
ה
 
ל
כ
ל
 
ה
מ
מ
ל
כ
ו
ת
 
א
ש
ר
 
א
ת
ה
 
ע
ב
ר
 
ש
מ
ה
 
ל
א
 
ת
י
ר
א
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ו
א
 
ה
נ
ל
ח
ם
 
ל
כ
ם
 
ו
א
ת
ח
נ
נ
ה
 
א
ל
 
י
ה
ו
ה
 
ב
ע
ת
 
ה
ה
י
א
 
ל
א
מ
ר
 
א
ד
נ
י
 
י
ה
ו
ה
 
א
ת
ה
 
ה
ח
ל
ת
 
ל
ה
ר
א
ו
ת
 
א
ת
 
ע
ב
ד
ך
 
א
ת
 
ג
ד
ל
ך
 
ו
א
ת
 
י
ד
ך
 
ה
ח
ז
ק
ה
 
א
ש
ר
 
מ
י
 
א
ל
 
ב
ש
מ
י
ם
 
ו
ב
א
ר
ץ
 
א
ש
ר
 
י
ע
ש
ה
 
כ
מ
ע
ש
י
ך
 
ו
כ
ג
ב
ו
ר
ת
י
ך
 
א
ע
ב
ר
 
נ
א
 
ו
א
ר
א
ה
 
א
ת
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ה
ה
ר
 
ה
ט
ו
ב
 
ה
ז
ה
 
ו
ה
ל
ב
נ
ו
ן
 
ו
י
ת
ע
ב
ר
 
י
ה
ו
ה
 
ב
י
 
ל
מ
ע
נ
כ
ם
 
ו
ל
א
 
ש
מ
ע
 
א
ל
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ר
ב
 
ל
ך
 
א
ל
 
ת
ו
ס
ף
 
ד
ב
ר
 
א
ל
י
 
ע
ו
ד
 
ב
ד
ב
ר
 
ה
ז
ה
 
ע
ל
ה
 
א
ל
 
ר
א
ש
 
ה
פ
ס
ג
ה
 
ו
ש
א
 
ע
י
נ
י
ך
 
י
מ
ה
 
ו
צ
פ
ו
נ
ה
 
ו
ת
י
מ
נ
ה
 
ו
מ
ז
ר
ח
ה
 
ו
ר
א
ה
 
ב
ע
י
נ
י
ך
 
כ
י
 
ל
א
 
ת
ע
ב
ר
 
א
ת
 
ה
י
ר
ד
ן
 
ה
ז
ה
 
ו
צ
ו
י
 
א
ת
 
י
ה
ו
ש
ע
 
ו
ח
ז
ק
ה
ו
 
ו
א
מ
צ
ה
ו
 
כ
י
 
ה
ו
א
 
י
ע
ב
ר
 
ל
פ
נ
י
 
ה
ע
ם
 
ה
ז
ה
 
ו
ה
ו
א
 
י
נ
ח
ל
 
א
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
ת
ר
א
ה
 
ו
נ
ש
ב
 
ב
ג
י
א
 
מ
ו
ל
 
ב
י
ת
 
פ
ע
ו
ר
 
ו
ע
ת
ה
 
י
ש
ר
א
ל
 
ש
מ
ע
 
א
ל
 
ה
ח
ק
י
ם
 
ו
א
ל
 
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
א
נ
כ
י
 
מ
ל
מ
ד
 
א
ת
כ
ם
 
ל
ע
ש
ו
ת
 
ל
מ
ע
ן
 
ת
ח
י
ו
ן
 
ו
ב
א
ת
ם
 
ו
י
ר
ש
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
כ
ם
 
נ
ת
ן
 
ל
כ
ם
 
ל
א
 
ת
ו
ס
י
פ
ו
 
ע
ל
 
ה
ד
ב
ר
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ו
ל
א
 
ת
ג
ר
ע
ו
 
מ
מ
נ
ו
 
ל
ש
מ
ר
 
א
ת
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ע
י
נ
י
כ
ם
 
ה
ר
א
ו
ת
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ב
ב
ע
ל
 
פ
ע
ו
ר
 
כ
י
 
כ
ל
 
ה
א
י
ש
 
א
ש
ר
 
ה
ל
ך
 
א
ח
ר
י
 
ב
ע
ל
 
פ
ע
ו
ר
 
ה
ש
מ
י
ד
ו
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ק
ר
ב
ך
 
ו
א
ת
ם
 
ה
ד
ב
י
ק
י
ם
 
ב
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ח
י
י
ם
 
כ
ל
כ
ם
 
ה
י
ו
ם
 
ר
א
ו
 
ל
מ
ד
ת
י
 
א
ת
כ
ם
 
ח
ק
י
ם
 
ו
מ
ש
פ
ט
י
ם
 
כ
א
ש
ר
 
צ
ו
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
 
ל
ע
ש
ו
ת
 
כ
ן
 
ב
ק
ר
ב
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ב
א
י
ם
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
ש
מ
ר
ת
ם
 
ו
ע
ש
י
ת
ם
 
כ
י
 
ה
י
א
 
ח
כ
מ
ת
כ
ם
 
ו
ב
י
נ
ת
כ
ם
 
ל
ע
י
נ
י
 
ה
ע
מ
י
ם
 
א
ש
ר
 
י
ש
מ
ע
ו
 
א
ת
 
כ
ל
 
ה
ח
ק
י
ם
 
ה
א
ל
ה
 
ו
א
מ
ר
ו
 
ר
ק
 
ע
ם
 
ח
כ
ו
ם
 
ו
נ
ב
ו
ן
 
ה
ג
ו
י
 
ה
ג
ד
ו
ל
 
ה
ז
ה
 
כ
י
 
מ
י
 
ג
ו
י
 
ג
ד
ו
ל
 
א
ש
ר
 
ל
ו
 
א
ל
ה
י
ם
 
ק
ר
ו
ב
י
ם
 
א
ל
י
ו
 
כ
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ב
כ
ל
 
ק
ר
א
נ
ו
 
א
ל
י
ו
 
ו
מ
י
 
ג
ו
י
 
ג
ד
ו
ל
 
א
ש
ר
 
ל
ו
 
ח
ק
י
ם
 
ו
מ
ש
פ
ט
י
ם
 
צ
ד
ק
י
ם
 
כ
כ
ל
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
א
ש
ר
 
א
נ
כ
י
 
נ
ת
ן
 
ל
פ
נ
י
כ
ם
 
ה
י
ו
ם
 
ר
ק
 
ה
ש
מ
ר
 
ל
ך
 
ו
ש
מ
ו
ר
 
נ
פ
ש
ך
 
מ
א
ד
 
פ
ן
 
ת
ש
כ
ח
 
א
ת
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ר
א
ו
 
ע
י
נ
י
ך
 
ו
פ
ן
 
י
ס
ו
ר
ו
 
מ
ל
ב
ב
ך
 
כ
ל
 
י
מ
י
 
ח
י
י
ך
 
ו
ה
ו
ד
ע
ת
ם
 
ל
ב
נ
י
ך
 
ו
ל
ב
נ
י
 
ב
נ
י
ך
 
י
ו
ם
 
א
ש
ר
 
ע
מ
ד
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ח
ו
ר
ב
 
ב
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ה
ק
ה
ל
 
ל
י
 
א
ת
 
ה
ע
ם
 
ו
א
ש
מ
י
ע
ם
 
א
ת
 
ד
ב
ר
י
 
א
ש
ר
 
י
ל
מ
ד
ו
ן
 
ל
י
ר
א
ה
 
א
ת
י
 
כ
ל
 
ה
י
מ
י
ם
 
א
ש
ר
 
ה
ם
 
ח
י
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
ו
א
ת
 
ב
נ
י
ה
ם
 
י
ל
מ
ד
ו
ן
 
ו
ת
ק
ר
ב
ו
ן
 
ו
ת
ע
מ
ד
ו
ן
 
ת
ח
ת
 
ה
ה
ר
 
ו
ה
ה
ר
 
ב
ע
ר
 
ב
א
ש
 
ע
ד
 
ל
ב
ב
 
ה
ש
מ
י
ם
 
ח
ש
ך
 
ע
נ
ן
 
ו
ע
ר
פ
ל
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
כ
ם
 
מ
ת
ו
ך
 
ה
א
ש
 
ק
ו
ל
 
ד
ב
ר
י
ם
 
א
ת
ם
 
ש
מ
ע
י
ם
 
ו
ת
מ
ו
נ
ה
 
א
י
נ
כ
ם
 
ר
א
י
ם
 
ז
ו
ל
ת
י
 
ק
ו
ל
 
ו
י
ג
ד
 
ל
כ
ם
 
א
ת
 
ב
ר
י
ת
ו
 
א
ש
ר
 
צ
ו
ה
 
א
ת
כ
ם
 
ל
ע
ש
ו
ת
 
ע
ש
ר
ת
 
ה
ד
ב
ר
י
ם
 
ו
י
כ
ת
ב
ם
 
ע
ל
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
ו
א
ת
י
 
צ
ו
ה
 
י
ה
ו
ה
 
ב
ע
ת
 
ה
ה
י
א
 
ל
ל
מ
ד
 
א
ת
כ
ם
 
ח
ק
י
ם
 
ו
מ
ש
פ
ט
י
ם
 
ל
ע
ש
ו
ת
כ
ם
 
א
ת
ם
 
ב
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
נ
ש
מ
ר
ת
ם
 
מ
א
ד
 
ל
נ
פ
ש
ת
י
כ
ם
 
כ
י
 
ל
א
 
ר
א
י
ת
ם
 
כ
ל
 
ת
מ
ו
נ
ה
 
ב
י
ו
ם
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
כ
ם
 
ב
ח
ו
ר
ב
 
מ
ת
ו
ך
 
ה
א
ש
 
פ
ן
 
ת
ש
ח
ת
ו
ן
 
ו
ע
ש
י
ת
ם
 
ל
כ
ם
 
פ
ס
ל
 
ת
מ
ו
נ
ת
 
כ
ל
 
ס
מ
ל
 
ת
ב
נ
י
ת
 
ז
כ
ר
 
א
ו
 
נ
ק
ב
ה
 
ת
ב
נ
י
ת
 
כ
ל
 
ב
ה
מ
ה
 
א
ש
ר
 
ב
א
ר
ץ
 
ת
ב
נ
י
ת
 
כ
ל
 
צ
פ
ו
ר
 
כ
נ
ף
 
א
ש
ר
 
ת
ע
ף
 
ב
ש
מ
י
ם
 
ת
ב
נ
י
ת
 
כ
ל
 
ר
מ
ש
 
ב
א
ד
מ
ה
 
ת
ב
נ
י
ת
 
כ
ל
 
ד
ג
י
 
א
ש
ר
 
ב
מ
י
ם
 
מ
ת
ח
ת
 
ל
א
ר
ץ
 
ו
פ
ן
 
ת
ש
א
 
ע
י
נ
י
ך
 
ה
ש
מ
י
ם
 
ו
ר
א
י
ת
 
א
ת
 
ה
ש
מ
ש
 
ו
א
ת
 
ה
י
ר
ח
 
ו
א
ת
 
ה
כ
ו
כ
ב
י
ם
 
כ
ל
 
צ
ב
א
 
ה
ש
מ
י
ם
 
ו
נ
ד
ח
ת
 
ו
ה
ש
ת
ח
ו
י
ת
 
ל
ה
ם
 
ו
ע
ב
ד
ת
ם
 
א
ש
ר
 
ח
ל
ק
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
ם
 
ל
כ
ל
 
ה
ע
מ
י
ם
 
ת
ח
ת
 
כ
ל
 
ה
ש
מ
י
ם
 
ו
א
ת
כ
ם
 
ל
ק
ח
 
י
ה
ו
ה
 
ו
י
ו
צ
א
 
א
ת
כ
ם
 
מ
כ
ו
ר
 
ה
ב
ר
ז
ל
 
מ
מ
צ
ר
י
ם
 
ל
ה
י
ו
ת
 
ל
ו
 
ל
ע
ם
 
נ
ח
ל
ה
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
י
ה
ו
ה
 
ה
ת
א
נ
ף
 
ב
י
 
ע
ל
 
ד
ב
ר
י
כ
ם
 
ל
ב
ל
ת
י
 
ע
ב
ר
י
 
א
ת
 
ה
י
ר
ד
ן
 
ו
ל
ב
ל
ת
י
 
ב
א
 
א
ל
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
כ
י
 
א
נ
כ
י
 
מ
ת
 
ב
א
ר
ץ
 
ה
ז
א
ת
 
א
י
נ
נ
י
 
ע
ב
ר
 
א
ת
 
ה
י
ר
ד
ן
 
ו
א
ת
ם
 
ע
ב
ר
י
ם
 
ו
י
ר
ש
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
ה
ז
א
ת
 
ה
ש
מ
ר
ו
 
ל
כ
ם
 
פ
ן
 
ת
ש
כ
ח
ו
 
א
ת
 
ב
ר
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
כ
ר
ת
 
ע
מ
כ
ם
 
ו
ע
ש
י
ת
ם
 
ל
כ
ם
 
פ
ס
ל
 
ת
מ
ו
נ
ת
 
כ
ל
 
א
ש
ר
 
צ
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
 
א
כ
ל
ה
 
ה
ו
א
 
א
ל
 
ק
נ
א
 
כ
י
 
ת
ו
ל
י
ד
ו
 
ב
נ
י
ם
 
ו
ב
נ
י
 
ב
נ
י
ם
 
ו
נ
ו
ש
נ
ת
ם
 
ב
א
ר
ץ
 
ו
ה
ש
ח
ת
ם
 
ו
ע
ש
י
ת
ם
 
פ
ס
ל
 
ת
מ
ו
נ
ת
 
כ
ל
 
ו
ע
ש
י
ת
ם
 
ה
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
ה
כ
ע
י
ס
ו
 
ה
ע
ד
ת
י
 
ב
כ
ם
 
ה
י
ו
ם
 
א
ת
 
ה
ש
מ
י
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
כ
י
 
א
ב
ד
 
ת
א
ב
ד
ו
ן
 
מ
ה
ר
 
מ
ע
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ל
א
 
ת
א
ר
י
כ
ו
ן
 
י
מ
י
ם
 
ע
ל
י
ה
 
כ
י
 
ה
ש
מ
ד
 
ת
ש
מ
ד
ו
ן
 
ו
ה
פ
י
ץ
 
י
ה
ו
ה
 
א
ת
כ
ם
 
ב
ע
מ
י
ם
 
ו
נ
ש
א
ר
ת
ם
 
מ
ת
י
 
מ
ס
פ
ר
 
ב
ג
ו
י
ם
 
א
ש
ר
 
י
נ
ה
ג
 
י
ה
ו
ה
 
א
ת
כ
ם
 
ש
מ
ה
 
ו
ע
ב
ד
ת
ם
 
ש
ם
 
א
ל
ה
י
ם
 
מ
ע
ש
ה
 
י
ד
י
 
א
ד
ם
 
ע
ץ
 
ו
א
ב
ן
 
א
ש
ר
 
ל
א
 
י
ר
א
ו
ן
 
ו
ל
א
 
י
ש
מ
ע
ו
ן
 
ו
ל
א
 
י
א
כ
ל
ו
ן
 
ו
ל
א
 
י
ר
י
ח
ו
ן
 
ו
ב
ק
ש
ת
 
מ
ש
ם
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
מ
צ
א
ת
ו
 
כ
י
 
ת
ד
ר
ש
נ
ו
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
ב
צ
ר
 
ל
ך
 
ו
מ
צ
א
ו
ך
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ב
א
ח
ר
י
ת
 
ה
י
מ
י
ם
 
ו
ש
ב
ת
 
ע
ד
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ע
ת
 
ב
ק
ו
ל
ו
 
כ
י
 
א
ל
 
ר
ח
ו
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
י
ר
פ
ך
 
ו
ל
א
 
י
ש
ח
י
ת
ך
 
ו
ל
א
 
י
ש
כ
ח
 
א
ת
 
ב
ר
י
ת
 
א
ב
ת
י
ך
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
ה
ם
 
כ
י
 
ש
א
ל
 
נ
א
 
ל
י
מ
י
ם
 
ה
ר
א
י
ש
ו
נ
י
ם
 
א
ש
ר
 
ה
י
ו
 
ל
פ
נ
י
ך
 
ל
מ
ן
 
ה
י
ו
ם
 
א
ש
ר
 
ב
ר
א
 
א
ל
ה
י
ם
 
א
ד
ם
 
ע
ל
 
ה
א
ר
ץ
 
ו
ל
מ
ק
צ
ה
 
ה
ש
מ
י
ם
 
ו
ע
ד
 
ק
צ
ה
 
ה
ש
מ
י
ם
 
ה
ן
 
ה
י
ה
 
כ
ד
ב
ר
 
ה
ג
ד
ו
ל
 
ה
ז
ה
 
א
ו
 
ה
נ
ש
מ
ע
 
כ
מ
ה
ו
 
ה
ש
מ
ע
 
ע
ם
 
ק
ו
ל
 
א
ל
ה
י
ם
 
ח
י
י
ם
 
מ
ד
ב
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
כ
א
ש
ר
 
ש
מ
ע
ת
 
א
ת
ה
 
ו
י
ח
י
 
א
ו
 
ה
נ
ס
ה
 
א
ל
ה
י
ם
 
ל
ב
ו
א
 
ל
ק
ח
ת
 
ל
ו
 
ג
ו
י
 
מ
ק
ר
ב
 
ג
ו
י
 
ב
מ
ס
ו
ת
 
ב
א
ת
ו
ת
 
ו
ב
מ
ו
פ
ת
י
ם
 
ו
ב
מ
ל
ח
מ
ה
 
ו
ב
י
ד
 
ח
ז
ק
ה
 
ו
ב
ז
ר
ו
ע
 
נ
ט
ו
י
ה
 
ו
ב
מ
ר
א
י
ם
 
ג
ד
ל
י
ם
 
כ
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
ל
כ
ם
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ב
מ
צ
ר
י
ם
 
ל
ע
י
נ
י
כ
ם
 
א
ת
ה
 
ה
ר
א
ת
 
ל
ד
ע
ת
 
כ
י
 
י
ה
ו
ה
 
ה
ו
א
 
ה
א
ל
ה
י
ם
 
א
י
ן
 
ע
ו
ד
 
מ
ל
ב
ד
ו
 
מ
ן
 
ה
ש
מ
י
ם
 
ה
ש
מ
י
ע
ך
 
א
ת
 
ק
ו
ל
ו
 
ל
י
ס
ר
ך
 
ו
ע
ל
 
ה
א
ר
ץ
 
ה
ר
א
ך
 
א
ת
 
א
ש
ו
 
ה
ג
ד
ל
ה
 
ו
ד
ב
ר
י
ו
 
ש
מ
ע
ת
 
מ
ת
ו
ך
 
ה
א
ש
 
ו
ת
ח
ת
 
כ
י
 
א
ה
ב
 
א
ת
 
א
ב
ת
י
ך
 
ו
י
ב
ח
ר
 
ב
ז
ר
ע
ם
 
א
ח
ר
י
ה
ם
 
ו
י
ו
צ
י
א
ך
 
ב
פ
נ
י
ו
 
ו
ב
כ
ח
ו
 
ה
ג
ד
ו
ל
 
מ
מ
צ
ר
י
ם
 
ל
ה
ו
ר
י
ש
 
ג
ו
י
ם
 
ג
ד
ל
י
ם
 
ו
ע
צ
מ
י
ם
 
מ
מ
ך
 
מ
פ
נ
י
ך
 
ל
ה
ב
י
א
ך
 
ל
ת
ת
 
ל
ך
 
א
ת
 
א
ר
צ
ם
 
נ
ח
ל
ה
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
י
ד
ע
ת
 
ה
י
ו
ם
 
ו
ה
ש
ב
ו
ת
 
א
ל
 
ל
ב
ב
ך
 
כ
י
 
י
ה
ו
ה
 
ה
ו
א
 
ה
א
ל
ה
י
ם
 
ב
ש
מ
י
ם
 
מ
מ
ע
ל
 
ו
ע
ל
 
ה
א
ר
ץ
 
מ
ת
ח
ת
 
א
י
ן
 
ע
ו
ד
 
ו
ש
מ
ר
ת
 
א
ת
 
ח
ק
י
ו
 
ו
א
ת
 
מ
צ
ו
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
א
ש
ר
 
י
י
ט
ב
 
ל
ך
 
ו
ל
ב
נ
י
ך
 
א
ח
ר
י
ך
 
ו
ל
מ
ע
ן
 
ת
א
ר
י
ך
 
י
מ
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
כ
ל
 
ה
י
מ
י
ם
 
א
ז
 
י
ב
ד
י
ל
 
מ
ש
ה
 
ש
ל
ש
 
ע
ר
י
ם
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
מ
ז
ר
ח
 
ה
ש
מ
ש
 
ל
נ
ו
ס
 
ש
מ
ה
 
ה
ר
צ
ח
 
א
ש
ר
 
י
ר
צ
ח
 
א
ת
 
ר
ע
ה
ו
 
ב
ב
ל
י
 
ד
ע
ת
 
ו
ה
ו
א
 
ל
א
 
ש
נ
א
 
ל
ו
 
מ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ו
נ
ס
 
א
ל
 
א
ח
ת
 
מ
ן
 
ה
ע
ר
י
ם
 
ה
א
ל
ה
 
ו
ח
י
 
א
ת
 
ב
ו
צ
ר
 
ב
מ
ד
ב
ר
 
ב
א
ר
ץ
 
ה
מ
י
ש
ו
ר
 
ל
ר
א
ו
ב
נ
י
 
ו
א
ת
 
ר
מ
ו
ת
 
ב
ג
ל
ע
ד
 
ל
ג
ד
י
 
ו
א
ת
 
ג
ו
ל
ן
 
ב
ב
ש
ן
 
ל
מ
נ
ש
ה
 
ו
ז
א
ת
 
ה
ת
ו
ר
ה
 
א
ש
ר
 
ש
ם
 
מ
ש
ה
 
ל
פ
נ
י
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
ה
 
ה
ע
ד
ו
ת
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
ד
ב
ר
 
מ
ש
ה
 
א
ל
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
צ
א
ת
ם
 
מ
מ
צ
ר
י
ם
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
ב
ג
י
א
 
מ
ו
ל
 
ב
י
ת
 
פ
ע
ו
ר
 
ב
א
ר
ץ
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ה
א
מ
ר
י
 
א
ש
ר
 
י
ש
ב
 
ב
ח
ש
ב
ו
ן
 
א
ש
ר
 
ה
כ
ה
 
מ
ש
ה
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
ב
צ
א
ת
ם
 
מ
מ
צ
ר
י
ם
 
ו
י
י
ר
ש
ו
 
א
ת
 
א
ר
צ
ו
 
ו
א
ת
 
א
ר
ץ
 
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
ש
נ
י
 
מ
ל
כ
י
 
ה
א
מ
ר
י
 
א
ש
ר
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
מ
ז
ר
ח
 
ה
ש
מ
ש
 
מ
ע
ר
ע
ר
 
א
ש
ר
 
ע
ל
 
ש
פ
ת
 
נ
ח
ל
 
א
ר
נ
ן
 
ו
ע
ד
 
ה
ר
 
ש
י
א
ו
ן
 
ה
ו
א
 
ח
ר
מ
ו
ן
 
ו
כ
ל
 
ה
ע
ר
ב
ה
 
ע
ב
ר
 
ה
י
ר
ד
ן
 
מ
ז
ר
ח
ה
 
ו
ע
ד
 
י
ם
 
ה
ע
ר
ב
ה
 
י
ם
 
ה
מ
ל
ח
 
ת
ח
ת
 
א
ש
ד
ו
ת
 
ה
פ
ס
ג
ה
 
ו
י
ק
ר
א
 
מ
ש
ה
 
א
ל
 
כ
ל
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ש
מ
ע
 
י
ש
ר
א
ל
 
א
ת
 
ה
ח
ק
י
ם
 
ו
א
ת
 
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
א
נ
כ
י
 
ד
ב
ר
 
ב
א
ז
נ
י
כ
ם
 
ה
י
ו
ם
 
ו
ל
מ
ד
ת
ם
 
א
ת
ם
 
ו
ש
מ
ר
ת
ם
 
ל
ע
ש
ו
ת
ם
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
כ
ר
ת
 
ע
מ
נ
ו
 
ב
ר
י
ת
 
ב
ח
ו
ר
ב
 
ל
א
 
א
ת
 
א
ב
ת
י
נ
ו
 
כ
ר
ת
 
י
ה
ו
ה
 
א
ת
 
ה
ב
ר
י
ת
 
ה
ז
א
ת
 
כ
י
 
א
ת
נ
ו
 
א
נ
ח
נ
ו
 
א
ל
ה
 
פ
ה
 
ה
י
ו
ם
 
כ
ל
נ
ו
 
ח
י
י
ם
 
פ
נ
י
ם
 
ב
פ
נ
י
ם
 
ד
ב
ר
 
י
ה
ו
ה
 
ע
מ
כ
ם
 
ב
ה
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
ו
א
נ
כ
י
 
ע
מ
ד
 
ב
י
ן
 
י
ה
ו
ה
 
ו
ב
י
נ
כ
ם
 
ב
ע
ת
 
ה
ה
י
א
 
ל
ה
ג
י
ד
 
ל
כ
ם
 
א
ת
 
ד
ב
ר
י
 
י
ה
ו
ה
 
כ
י
 
י
ר
א
ת
ם
 
מ
פ
נ
י
 
ה
א
ש
 
ו
ל
א
 
ע
ל
י
ת
ם
 
ב
ה
ר
 
ל
א
מ
ר
 
א
נ
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
ה
ו
צ
א
ת
י
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
ל
א
 
י
ה
י
ה
 
ל
ך
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ע
ל
 
פ
נ
י
 
ל
א
 
ת
ע
ש
ה
 
ל
ך
 
פ
ס
ל
 
ו
כ
ל
 
ת
מ
ו
נ
ה
 
א
ש
ר
 
ב
ש
מ
י
ם
 
מ
מ
ע
ל
 
ו
א
ש
ר
 
ב
א
ר
ץ
 
מ
ת
ח
ת
 
ו
א
ש
ר
 
ב
מ
י
ם
 
מ
ת
ח
ת
 
ל
א
ר
ץ
 
ל
א
 
ת
ש
ת
ח
ו
ה
 
ל
ה
ם
 
ו
ל
א
 
ת
ע
ב
ד
ם
 
כ
י
 
א
נ
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
ק
נ
א
 
פ
ק
ד
 
ע
ו
ן
 
א
ב
ו
ת
 
ע
ל
 
ב
נ
י
ם
 
ע
ל
 
ש
ל
י
ש
י
ם
 
ו
ע
ל
 
ר
ב
י
ע
י
ם
 
ל
ש
נ
א
י
 
ו
ע
ש
ה
 
ח
ס
ד
 
ל
א
ל
פ
י
ם
 
ל
א
ה
ב
י
 
ו
ל
ש
מ
ר
י
 
מ
צ
ו
ת
י
 
ל
א
 
ת
ש
א
 
א
ת
 
ש
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
ו
א
 
כ
י
 
ל
א
 
י
נ
ק
ה
 
י
ה
ו
ה
 
א
ת
 
א
ש
ר
 
י
ש
א
 
א
ת
 
ש
מ
ו
 
ל
ש
ו
א
 
ש
מ
ו
ר
 
א
ת
 
י
ו
ם
 
ה
ש
ב
ת
 
ל
ק
ד
ש
ה
ו
 
כ
א
ש
ר
 
צ
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ש
ש
ת
 
י
מ
י
ם
 
ת
ע
ב
ד
 
ו
ע
ש
י
ת
 
כ
ל
 
מ
ל
א
כ
ת
ך
 
ו
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ש
ב
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ע
ש
ה
 
ב
ו
 
כ
ל
 
מ
ל
א
כ
ה
 
א
ת
ה
 
ו
ב
נ
ך
 
ו
ב
ת
ך
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
ש
ו
ר
ך
 
ו
ח
מ
ו
ר
ך
 
ו
כ
ל
 
ב
ה
מ
ת
ך
 
ו
ג
ר
ך
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ל
מ
ע
ן
 
י
נ
ו
ח
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
כ
מ
ו
ך
 
ו
ז
כ
ר
ת
 
כ
י
 
ע
ב
ד
 
ה
י
י
ת
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ו
צ
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ש
ם
 
ב
י
ד
 
ח
ז
ק
ה
 
ו
ב
ז
ר
ו
ע
 
נ
ט
ו
י
ה
 
ע
ל
 
כ
ן
 
צ
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ע
ש
ו
ת
 
א
ת
 
י
ו
ם
 
ה
ש
ב
ת
 
כ
ב
ד
 
א
ת
 
א
ב
י
ך
 
ו
א
ת
 
א
מ
ך
 
כ
א
ש
ר
 
צ
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
מ
ע
ן
 
י
א
ר
כ
ו
ן
 
י
מ
י
ך
 
ו
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ך
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
א
 
ת
ר
צ
ח
 
ל
א
 
ת
נ
א
ף
 
ל
א
 
ת
ג
נ
ב
 
ל
א
 
ת
ע
נ
ה
 
ב
ר
ע
ך
 
ע
ד
 
ש
ו
א
 
ל
א
 
ת
ח
מ
ד
 
ב
י
ת
 
ר
ע
ך
 
ו
ל
א
 
ת
ח
מ
ד
 
א
ש
ת
 
ר
ע
ך
 
ש
ד
ה
ו
 
ע
ב
ד
ו
 
ו
א
מ
ת
ו
 
ש
ו
ר
ו
 
ו
ח
מ
ר
ו
 
ו
כ
ל
 
א
ש
ר
 
ל
ר
ע
ך
 
ו
ה
י
ה
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
ה
ק
מ
ת
 
ל
ך
 
א
ב
נ
י
ם
 
ג
ד
ל
ו
ת
 
ו
ש
ד
ת
 
א
ת
ם
 
ב
ש
י
ד
 
ו
כ
ת
ב
ת
 
ע
ל
 
ה
א
ב
נ
י
ם
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
ה
י
ה
 
ב
ע
ב
ר
כ
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ת
ק
י
מ
ו
 
א
ת
 
ה
א
ב
נ
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ב
ה
ר
ג
ר
י
ז
י
ם
 
ו
ב
נ
י
ת
 
ש
ם
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ז
ב
ח
 
א
ב
נ
י
ם
 
ל
א
 
ת
נ
י
ף
 
ע
ל
י
ה
ם
 
ב
ר
ז
ל
 
א
ב
נ
י
ם
 
ש
ל
מ
ו
ת
 
ת
ב
נ
ה
 
א
ת
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ע
ל
י
ת
 
ע
ל
י
ו
 
ע
ל
ו
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ז
ב
ח
ת
 
ש
ל
מ
י
ם
 
ו
א
כ
ל
ת
 
ש
ם
 
ו
ש
מ
ח
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ה
ר
 
ה
ה
ו
א
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
א
ח
ר
י
 
ד
ר
ך
 
מ
ב
ו
א
 
ה
ש
מ
ש
 
ב
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ה
י
ש
ב
 
ב
ע
ר
ב
ה
 
מ
ו
ל
 
ה
ג
ל
ג
ל
 
א
צ
ל
 
א
ל
ו
ן
 
מ
ו
ר
א
 
מ
ו
ל
 
ש
כ
ם
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
כ
ל
 
ק
ה
ל
כ
ם
 
ב
ה
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
ח
ש
ך
 
ע
נ
ן
 
ו
ע
ר
פ
ל
 
ק
ו
ל
 
ג
ד
ו
ל
 
ו
ל
א
 
י
ס
ף
 
ו
י
כ
ת
ב
ם
 
ע
ל
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
ו
י
ת
נ
ם
 
א
ל
י
 
ו
י
ה
י
 
כ
ש
מ
ע
כ
ם
 
א
ת
 
ה
ק
ו
ל
 
מ
ת
ו
ך
 
ה
ח
ש
ך
 
ו
ה
ה
ר
 
ב
ע
ר
 
ב
א
ש
 
ו
ת
ק
ר
ב
ו
ן
 
א
ל
י
 
כ
ל
 
ר
א
ש
י
 
ש
ב
ט
י
כ
ם
 
ו
ז
ק
נ
י
כ
ם
 
ו
ת
א
מ
ר
ו
 
ה
ן
 
ה
ר
א
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
ת
 
כ
ב
ו
ד
ו
 
א
ת
 
ג
ד
ל
ו
 
ו
א
ת
 
ק
ו
ל
ו
 
ש
מ
ע
נ
ו
 
מ
ת
ו
ך
 
ה
א
ש
 
ה
י
ו
ם
 
ה
ז
ה
 
ר
א
י
נ
ו
 
כ
י
 
י
ד
ב
ר
 
א
ל
ה
י
ם
 
א
ת
 
ה
א
ד
ם
 
ו
ח
י
 
ו
ע
ת
ה
 
ל
מ
ה
 
נ
מ
ו
ת
 
כ
י
 
ת
א
כ
ל
נ
ו
 
ה
א
ש
 
ה
ג
ד
ל
ה
 
ה
ז
א
ת
 
א
ם
 
י
ס
פ
י
ם
 
א
נ
ח
נ
ו
 
ל
ש
מ
ע
 
א
ת
 
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ע
ו
ד
 
ו
מ
ת
נ
ו
 
כ
י
 
מ
י
 
כ
ל
 
ב
ש
ר
 
א
ש
ר
 
ש
מ
ע
 
ק
ו
ל
 
א
ל
ה
י
ם
 
ח
י
י
ם
 
מ
ד
ב
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
כ
מ
ו
נ
ו
 
ו
י
ח
י
 
ק
ר
ב
 
א
ת
ה
 
ו
ש
מ
ע
 
א
ת
 
כ
ל
 
א
ש
ר
 
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
א
ת
ה
 
ת
ד
ב
ר
 
א
ל
י
נ
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
ל
י
ך
 
ו
ש
מ
ע
נ
ו
 
ו
ע
ש
י
נ
ו
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
א
ת
 
ק
ו
ל
 
ד
ב
ר
י
כ
ם
 
ב
ד
ב
ר
כ
ם
 
א
ל
י
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ש
מ
ע
ת
י
 
א
ת
 
ק
ו
ל
 
ד
ב
ר
י
 
ה
ע
ם
 
ה
ז
ה
 
א
ש
ר
 
ד
ב
ר
ו
 
א
ל
י
ך
 
ה
ט
י
ב
ו
 
כ
ל
 
א
ש
ר
 
ד
ב
ר
ו
 
מ
י
 
י
ת
ן
 
ו
ה
י
ה
 
ל
ב
ב
ם
 
ז
ה
 
ל
ה
ם
 
ל
י
ר
א
ה
 
א
ת
י
 
ו
ל
ש
מ
ר
 
א
ת
 
מ
צ
ו
ת
י
 
כ
ל
 
ה
י
מ
י
ם
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ה
ם
 
ו
ל
ב
נ
י
ה
ם
 
ל
ע
ו
ל
ם
 
ל
ך
 
א
מ
ר
 
ל
ה
ם
 
ש
ו
ב
ו
 
ל
כ
ם
 
ל
א
ה
ל
י
כ
ם
 
ו
א
ת
ה
 
פ
ה
 
ע
מ
ד
 
ע
מ
ד
י
 
ו
א
ד
ב
ר
ה
 
א
ל
י
ך
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
ת
ל
מ
ד
ם
 
ו
ע
ש
ו
 
ב
א
ר
ץ
 
א
ש
ר
 
א
נ
כ
י
 
נ
ת
ן
 
ל
ה
ם
 
ל
ר
ש
ת
ה
 
ו
ש
מ
ר
ת
ם
 
ל
ע
ש
ו
ת
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ת
כ
ם
 
ל
א
 
ת
ס
ו
ר
ו
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ב
כ
ל
 
ה
ד
ר
ך
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ת
כ
ם
 
ת
ל
כ
ו
ן
 
ל
מ
ע
ן
 
ת
ח
י
ו
ן
 
ו
ט
ו
ב
 
ל
כ
ם
 
ו
ה
א
ר
כ
ת
ם
 
י
מ
י
ם
 
ב
א
ר
ץ
 
א
ש
ר
 
ת
י
ר
ש
ו
ן
 
ו
ז
א
ת
 
ה
מ
צ
ו
ה
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
ל
מ
ד
 
א
ת
כ
ם
 
ל
ע
ש
ו
ת
 
ב
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ל
מ
ע
ן
 
ת
י
ר
א
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
א
ת
 
כ
ל
 
ח
ק
י
ו
 
ו
מ
צ
ו
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
א
ת
ה
 
ו
ב
נ
ך
 
ו
ב
ן
 
ב
נ
ך
 
כ
ל
 
י
מ
י
 
ח
י
י
ך
 
ו
ל
מ
ע
ן
 
י
א
ר
י
כ
ו
ן
 
י
מ
י
ך
 
ו
ש
מ
ע
ת
 
י
ש
ר
א
ל
 
ו
ש
מ
ר
ת
 
ל
ע
ש
ו
ת
 
א
ש
ר
 
י
י
ט
ב
 
ל
ך
 
ו
א
ש
ר
 
ת
ר
ב
ה
 
מ
א
ד
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
ך
 
ל
ך
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ש
מ
ע
 
י
ש
ר
א
ל
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
י
ה
ו
ה
 
א
ח
ד
 
ו
א
ה
ב
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
ו
ב
כ
ל
 
מ
א
ד
ך
 
ו
ה
י
ו
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ע
ל
 
ל
ב
ב
ך
 
ו
ש
נ
נ
ת
ם
 
ל
ב
נ
י
ך
 
ו
ד
ב
ר
ת
 
ב
ם
 
ב
ש
ב
ת
ך
 
ב
ב
י
ת
 
ב
ל
כ
ת
ך
 
ב
ד
ר
ך
 
ב
ש
כ
ב
ך
 
ו
ב
ק
ו
מ
ך
 
ו
ק
ש
ר
ת
ם
 
ל
א
ו
ת
 
ע
ל
 
י
ד
י
ך
 
ו
ה
י
ו
 
ל
ט
ט
פ
ו
ת
 
ב
י
ן
 
ע
י
נ
י
ך
 
ו
כ
ת
ב
ת
ם
 
ע
ל
 
מ
ז
ז
ו
ת
 
ב
ת
י
ך
 
ו
ב
ש
ע
ר
י
ך
 
ו
ה
י
ה
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ל
ת
ת
 
ל
ך
 
ע
ר
י
ם
 
ג
ד
ל
ו
ת
 
ו
ט
ו
ב
ו
ת
 
א
ש
ר
 
ל
א
 
ב
נ
י
ת
 
ב
ת
י
ם
 
מ
ל
א
י
ם
 
כ
ל
 
ט
ו
ב
 
א
ש
ר
 
ל
א
 
מ
ל
א
ת
 
ב
ו
ר
ו
ת
 
ח
צ
ו
ב
י
ם
 
א
ש
ר
 
ל
א
 
ח
צ
ב
ת
 
כ
ר
מ
י
ם
 
ו
ז
י
ת
י
ם
 
א
ש
ר
 
ל
א
 
נ
ט
ע
ת
 
ו
א
כ
ל
ת
 
ו
ש
ב
ע
ת
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
ש
כ
ח
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
ה
ו
צ
י
א
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ת
י
ר
א
 
ו
א
ת
ו
 
ת
ע
ב
ד
 
ו
ב
ש
מ
ו
 
ת
ש
ב
ע
 
ל
א
 
ת
ל
כ
ו
 
א
ח
ר
י
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
מ
א
ל
ה
י
 
ה
ע
מ
י
ם
 
א
ש
ר
 
ס
ב
י
ב
ת
י
כ
ם
 
כ
י
 
א
ל
 
ק
נ
א
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ק
ר
ב
ך
 
פ
ן
 
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ך
 
ו
ה
ש
מ
י
ד
ך
 
מ
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ל
א
 
ת
נ
ס
ו
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
כ
א
ש
ר
 
נ
ס
י
ת
ם
 
ב
מ
ס
ה
 
ש
מ
ר
 
ת
ש
מ
ר
ו
ן
 
א
ת
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ע
ד
ת
י
ו
 
ו
ח
ק
י
ו
 
א
ש
ר
 
צ
ו
ך
 
ו
ע
ש
י
ת
 
ה
י
ש
ר
 
ו
ה
ט
ו
ב
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ך
 
ו
ב
א
ת
 
ו
י
ר
ש
ת
 
א
ת
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
ך
 
ל
ה
ד
י
ף
 
א
ת
 
כ
ל
 
א
י
ב
י
ך
 
מ
פ
נ
י
ך
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
ה
י
ה
 
כ
י
 
י
ש
א
ל
ך
 
ב
נ
ך
 
מ
ח
ר
 
ל
א
מ
ר
 
מ
ה
 
ה
ע
ד
ו
ת
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
א
ת
כ
ם
 
ו
א
מ
ר
ת
 
ל
ב
נ
ך
 
ע
ב
ד
י
ם
 
ה
י
י
נ
ו
 
ל
פ
ר
ע
ה
 
ב
מ
צ
ר
י
ם
 
ו
י
ו
צ
י
א
נ
ו
 
י
ה
ו
ה
 
מ
מ
צ
ר
י
ם
 
ב
י
ד
 
ח
ז
ק
ה
 
ו
י
ת
ן
 
י
ה
ו
ה
 
א
ת
ו
ת
 
ו
מ
ו
פ
ת
י
ם
 
ג
ד
ל
י
ם
 
ו
ר
ע
י
ם
 
ב
מ
צ
ר
י
ם
 
ב
פ
ר
ע
ה
 
ו
ב
כ
ל
 
ב
י
ת
ו
 
ל
ע
י
נ
י
נ
ו
 
ו
א
ת
נ
ו
 
ה
ו
צ
י
א
 
מ
ש
ם
 
ל
מ
ע
ן
 
ה
ב
י
א
 
א
ת
נ
ו
 
ל
ת
ת
 
ל
נ
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
נ
ו
 
ו
י
צ
ו
נ
ו
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ה
ח
ק
י
ם
 
ה
א
ל
ה
 
ל
י
ר
א
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ל
ט
ו
ב
 
ל
נ
ו
 
כ
ל
 
ה
י
מ
י
ם
 
ו
ל
ה
ח
י
ו
ת
נ
ו
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
צ
ד
ק
ה
 
ת
ה
י
ה
 
ל
נ
ו
 
כ
י
 
נ
ש
מ
ר
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
ה
ז
א
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
כ
א
ש
ר
 
צ
ו
נ
ו
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
נ
ש
ל
 
ג
ו
י
ם
 
ר
ב
י
ם
 
מ
פ
נ
י
ך
 
ה
ח
ת
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
א
מ
ר
י
 
ו
ה
כ
נ
ע
נ
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
ש
ב
ע
ה
 
ג
ו
י
ם
 
ר
ב
י
ם
 
ו
ע
צ
מ
י
ם
 
מ
מ
ך
 
ו
נ
ת
נ
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
פ
נ
י
ך
 
ו
ה
כ
י
ת
ם
 
ה
ח
ר
י
ם
 
ת
ח
ר
י
ם
 
א
ת
ם
 
ל
א
 
ת
כ
ר
ת
 
ל
ה
ם
 
ב
ר
י
ת
 
ו
ל
א
 
ת
ח
נ
ם
 
ו
ל
א
 
ת
ת
ח
ת
ן
 
ב
ם
 
ב
ת
ך
 
ל
א
 
ת
ת
ן
 
ל
ב
נ
ו
 
ו
ב
ת
ו
 
ל
א
 
ת
ק
ח
 
ל
ב
נ
ך
 
כ
י
 
י
ס
י
ר
 
א
ת
 
ב
נ
ך
 
מ
א
ח
ר
י
 
ו
ע
ב
ד
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
ח
ר
ה
 
א
ף
 
י
ה
ו
ה
 
ב
כ
ם
 
ו
ה
ש
מ
י
ד
ך
 
מ
ה
ר
 
כ
י
 
א
ם
 
כ
ה
 
ת
ע
ש
ה
 
ל
ה
ם
 
מ
ז
ב
ח
ת
י
ה
ם
 
ת
ת
צ
ו
ן
 
ו
מ
צ
ב
ת
י
ה
ם
 
ת
ש
ב
ר
ו
ן
 
ו
א
ש
ר
י
ה
ם
 
ת
ג
ד
ע
ו
ן
 
ו
פ
ס
י
ל
י
ה
ם
 
ת
ש
ר
פ
ו
ן
 
ב
א
ש
 
כ
י
 
ע
ם
 
ק
ד
ש
 
א
ת
ה
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ב
ך
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ה
י
ו
ת
 
ל
ו
 
ל
ע
ם
 
ס
ג
ל
ה
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ל
א
 
מ
ר
ב
כ
ם
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
ח
ש
ק
 
י
ה
ו
ה
 
ב
כ
ם
 
ו
י
ב
ח
ר
 
ב
כ
ם
 
כ
י
 
א
ת
ם
 
ה
מ
ע
ט
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
כ
י
 
מ
א
ה
ב
ת
 
י
ה
ו
ה
 
א
ת
כ
ם
 
ו
מ
ש
מ
ר
ו
 
א
ת
 
ה
ש
ב
ו
ע
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
כ
ם
 
ה
ו
צ
י
א
 
י
ה
ו
ה
 
א
ת
כ
ם
 
ב
י
ד
 
ח
ז
ק
ה
 
ו
י
פ
ד
ך
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
מ
י
ד
 
פ
ר
ע
ה
 
מ
ל
ך
 
מ
צ
ר
י
ם
 
ו
י
ד
ע
ת
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ו
א
 
ה
א
ל
ה
י
ם
 
ה
א
ל
 
ה
נ
א
מ
ן
 
ש
מ
ר
 
ה
ב
ר
י
ת
 
ו
ה
ח
ס
ד
 
ל
א
ה
ב
י
ו
 
ו
ל
ש
מ
ר
י
 
מ
צ
ו
ת
י
ו
 
ל
א
ל
ף
 
ד
ו
ר
 
ו
מ
ש
ל
ם
 
ל
ש
נ
א
י
ו
 
ע
ל
 
פ
נ
י
ו
 
ל
ה
א
ב
י
ד
ו
 
ל
א
 
י
א
ח
ר
 
ל
ש
נ
א
י
ו
 
ע
ל
 
פ
נ
י
ו
 
י
ש
ל
ם
 
ל
ו
 
ו
ש
מ
ר
ת
 
א
ת
 
ה
מ
צ
ו
ה
 
א
ת
 
ה
ח
ק
י
ם
 
ו
א
ת
 
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
ע
ש
ו
ת
ם
 
ו
ה
י
ה
 
ע
ק
ב
 
ת
ש
מ
ע
ו
ן
 
א
ת
 
ה
מ
ש
פ
ט
י
ם
 
ה
א
ל
ה
 
ו
ש
מ
ר
ת
ם
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ו
ש
מ
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ך
 
א
ת
 
ה
ב
ר
י
ת
 
ו
א
ת
 
ה
ח
ס
ד
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
ו
א
ה
ב
ך
 
ו
ב
ר
כ
ך
 
ו
ה
ר
ב
ך
 
ו
ב
ר
ך
 
פ
ר
י
 
ב
ט
נ
ך
 
ו
פ
ר
י
 
א
ד
מ
ת
ך
 
ד
ג
נ
ך
 
ת
י
ר
ש
ך
 
ו
י
צ
ה
ר
ך
 
ש
ג
ר
 
א
ל
פ
י
ך
 
ו
ע
ש
ת
ר
ו
ת
 
צ
א
נ
ך
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
ך
 
ל
ת
ת
 
ל
ך
 
ב
ר
ו
ך
 
ת
ה
י
ה
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
ל
א
 
י
ה
י
ה
 
ב
ך
 
ע
ק
ר
 
ו
ע
ק
ר
ה
 
ו
ב
ב
ה
מ
ת
ך
 
ו
ה
ס
י
ר
 
י
ה
ו
ה
 
מ
מ
ך
 
כ
ל
 
ח
ל
י
 
ו
כ
ל
 
מ
ד
ו
י
 
מ
צ
ר
י
ם
 
ה
ר
ע
י
ם
 
א
ש
ר
 
י
ד
ע
ת
 
ל
א
 
י
ש
י
מ
ם
 
ב
ך
 
ו
נ
ת
נ
ם
 
ב
כ
ל
 
ש
נ
א
י
ך
 
ו
א
כ
ל
ת
 
א
ת
 
כ
ל
 
ה
ע
מ
י
ם
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
א
 
ת
ח
ו
ס
 
ע
י
נ
ך
 
ע
ל
י
ה
ם
 
ו
ל
א
 
ת
ע
ב
ד
 
א
ת
 
א
ל
ה
י
ה
ם
 
כ
י
 
מ
ו
ק
ש
 
ה
ו
א
 
ל
ך
 
כ
י
 
ת
א
מ
ר
 
ב
ל
ב
ב
ך
 
ר
ב
י
ם
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
מ
מ
נ
י
 
א
י
ך
 
א
ו
כ
ל
 
ל
ה
ו
ר
י
ש
ם
 
ל
א
 
ת
י
ר
א
 
מ
ה
ם
 
ז
כ
ר
 
ת
ז
כ
ר
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
פ
ר
ע
ה
 
ו
ל
כ
ל
 
מ
צ
ר
י
ם
 
ה
מ
ס
ו
ת
 
ה
ג
ד
ל
ו
ת
 
א
ש
ר
 
ר
א
ו
 
ע
י
נ
י
ך
 
ה
א
ת
ו
ת
 
ו
ה
מ
ו
פ
ת
י
ם
 
ו
ה
י
ד
 
ה
ח
ז
ק
ה
 
ו
ה
ז
ר
ו
ע
 
ה
נ
ט
ו
י
ה
 
א
ש
ר
 
ה
ו
צ
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
ן
 
י
ע
ש
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
כ
ל
 
ה
ע
מ
י
ם
 
א
ש
ר
 
א
ת
ה
 
י
ר
א
 
מ
פ
נ
י
ה
ם
 
ו
ג
ם
 
א
ת
 
ה
צ
ר
ע
ה
 
י
ש
ל
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ם
 
ע
ד
 
א
ב
ד
 
ה
נ
ש
א
ר
י
ם
 
ו
ה
נ
ס
ת
ר
י
ם
 
מ
פ
נ
י
ך
 
ל
א
 
ת
ע
ר
ץ
 
מ
פ
נ
י
ה
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ק
ר
ב
ך
 
א
ל
 
ג
ד
ו
ל
 
ו
נ
ו
ר
א
 
ו
נ
ש
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
מ
ל
פ
נ
י
ך
 
מ
ע
ט
 
מ
ע
ט
 
ל
א
 
ת
ו
כ
ל
 
כ
ל
ו
ת
ם
 
מ
ה
ר
 
פ
ן
 
ת
ר
ב
ה
 
ע
ל
י
ך
 
ח
י
ת
 
ה
ש
ד
ה
 
ו
נ
ת
נ
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
פ
נ
י
ך
 
ו
ה
מ
ם
 
מ
ה
מ
ה
 
ג
ד
ל
ה
 
ע
ד
 
ה
ש
מ
י
ד
ם
 
ו
נ
ת
ן
 
מ
ל
כ
י
ה
ם
 
ב
י
ד
ך
 
ו
א
ב
ד
ת
 
א
ת
 
ש
מ
ם
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
ל
א
 
י
ת
י
צ
ב
 
א
י
ש
 
ל
פ
נ
י
ך
 
ע
ד
 
ה
ש
מ
י
ד
ך
 
א
ת
ם
 
פ
ס
י
ל
י
 
א
ל
ה
י
ה
ם
 
ת
ש
ר
פ
ו
ן
 
ב
א
ש
 
ל
א
 
ת
ח
מ
ד
 
כ
ס
ף
 
ו
ז
ה
ב
 
ע
ל
י
ה
ם
 
ו
ל
ק
ח
ת
 
ל
ך
 
פ
ן
 
ת
ו
ק
ש
 
ב
ו
 
כ
י
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ו
א
 
ו
ל
א
 
ת
ב
י
א
 
ת
ו
ע
ב
ה
 
א
ל
 
ב
י
ת
ך
 
ו
ה
י
י
ת
 
ח
ר
ם
 
כ
מ
ה
ו
 
ש
ק
ץ
 
ת
ש
ק
צ
נ
ו
 
ו
ת
ע
ב
 
ת
ת
ע
ב
נ
ו
 
כ
י
 
ח
ר
ם
 
ה
ו
א
 
כ
ל
 
ה
מ
צ
ו
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ת
ש
מ
ר
ו
ן
 
ל
ע
ש
ו
ת
 
ל
מ
ע
ן
 
ת
ח
י
ו
ן
 
ו
ר
ב
י
ת
ם
 
ו
ב
א
ת
ם
 
ו
י
ר
ש
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
כ
ם
 
ו
ז
כ
ר
ת
 
א
ת
 
כ
ל
 
ה
ד
ר
ך
 
א
ש
ר
 
ה
ו
ל
י
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ז
ה
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ב
מ
ד
ב
ר
 
ל
מ
ע
ן
 
ע
נ
ו
ת
ך
 
ל
נ
ס
ו
ת
ך
 
ל
ד
ע
ת
 
א
ש
ר
 
ב
ל
ב
ב
ך
 
ה
ת
ש
מ
ר
 
מ
צ
ו
ת
י
ו
 
א
ם
 
ל
א
 
ו
י
ע
נ
ך
 
ו
י
ר
ע
ב
ך
 
ו
י
א
כ
י
ל
ך
 
א
ת
 
ה
מ
ן
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
 
ו
ל
א
 
י
ד
ע
ו
 
א
ב
ת
י
ך
 
ל
מ
ע
ן
 
ה
ו
ד
י
ע
ך
 
כ
י
 
ל
א
 
ע
ל
 
ה
ל
ח
ם
 
ל
ב
ד
ו
 
י
ח
י
ה
 
ה
א
ד
ם
 
כ
י
 
ע
ל
 
כ
ל
 
מ
ו
צ
א
 
פ
י
 
י
ה
ו
ה
 
י
ח
י
ה
 
ה
א
ד
ם
 
ש
מ
ל
ת
ך
 
ל
א
 
ב
ל
ת
ה
 
מ
ע
ל
י
ך
 
ו
ר
ג
ל
י
ך
 
ל
א
 
ב
צ
ק
ה
 
ז
ה
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ו
י
ד
ע
ת
 
ע
ם
 
ל
ב
ב
ך
 
כ
י
 
כ
א
ש
ר
 
י
י
ס
ר
 
א
י
ש
 
א
ת
 
ב
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
י
ס
ר
ך
 
ו
ש
מ
ר
ת
 
א
ת
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ל
כ
ת
 
ב
ד
ר
כ
י
ו
 
ו
ל
י
ר
א
ה
 
א
ת
ו
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ב
י
א
ך
 
א
ל
 
א
ר
ץ
 
ט
ו
ב
ה
 
ו
ר
ח
ב
ה
 
א
ר
ץ
 
נ
ח
ל
י
 
מ
י
ם
 
ע
י
נ
ו
ת
 
ת
ה
ו
מ
ו
ת
 
י
צ
א
י
ם
 
ב
ב
ק
ע
ה
 
ו
ב
ה
ר
 
א
ר
ץ
 
ח
ט
ה
 
ו
ש
ע
ר
ה
 
ג
פ
ן
 
ת
א
נ
ה
 
ו
ר
מ
ו
ן
 
א
ר
ץ
 
ז
י
ת
 
ש
מ
ן
 
ו
ד
ב
ש
 
א
ר
ץ
 
א
ש
ר
 
ל
א
 
ב
מ
ס
כ
נ
ת
 
ת
א
כ
ל
 
ב
ה
 
ל
ח
ם
 
ל
א
 
ת
ח
ס
ר
 
כ
ל
 
ב
ה
 
א
ר
ץ
 
א
ש
ר
 
א
ב
נ
י
ה
 
ב
ר
ז
ל
 
ו
מ
ה
ר
ר
י
ה
 
ת
ח
צ
ב
 
נ
ח
ש
ת
 
ו
א
כ
ל
ת
 
ו
ש
ב
ע
ת
 
ו
ב
ר
כ
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ע
ל
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
נ
ת
ן
 
ל
ך
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
ש
כ
ח
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ב
ל
ת
י
 
ש
מ
ר
 
מ
צ
ו
ת
י
ו
 
ו
מ
ש
פ
ט
י
ו
 
ו
ח
ק
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
פ
ן
 
ת
א
כ
ל
 
ו
ש
ב
ע
ת
 
ו
ב
ת
י
ם
 
ט
ו
ב
י
ם
 
ת
ב
נ
ה
 
ו
י
ש
ב
ת
 
ו
ב
ק
ר
ך
 
ו
צ
א
נ
ך
 
י
ר
ב
ו
ן
 
ו
כ
ס
ף
 
ו
ז
ה
ב
 
י
ר
ב
ה
 
ל
ך
 
ו
כ
ל
 
א
ש
ר
 
ל
ך
 
י
ר
ב
ה
 
ו
ר
ם
 
ל
ב
ב
ך
 
ו
ש
כ
ח
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
מ
ו
צ
י
א
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
ה
מ
ו
ל
י
כ
ך
 
ב
מ
ד
ב
ר
 
ה
ג
ד
ו
ל
 
ו
ה
נ
ו
ר
א
 
נ
ח
ש
 
ש
ר
ו
ף
 
ע
ק
ר
ב
 
ו
צ
מ
א
ו
ן
 
א
ש
ר
 
א
י
ן
 
מ
י
ם
 
ה
מ
ו
צ
א
 
ל
ך
 
מ
י
ם
 
מ
צ
ו
ר
 
ה
ח
ל
מ
י
ש
 
ה
מ
א
כ
י
ל
ך
 
מ
ן
 
ב
מ
ד
ב
ר
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
 
א
ב
ת
י
ך
 
ל
מ
ע
ן
 
ע
נ
ו
ת
ך
 
ו
ל
מ
ע
ן
 
נ
ס
ו
ת
ך
 
ל
ה
ט
י
ב
ך
 
ב
א
ח
ר
י
ת
ך
 
ו
א
מ
ר
ת
 
ב
ל
ב
ב
ך
 
כ
ח
י
 
ו
ע
צ
ם
 
י
ד
י
 
ע
ש
ה
 
ל
י
 
א
ת
 
ה
ח
י
ל
 
ה
ז
ה
 
ו
ז
כ
ר
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
ה
ו
א
 
ה
נ
ת
ן
 
ל
ך
 
כ
ח
 
ל
ע
ש
ו
ת
 
ח
י
ל
 
ו
ל
מ
ע
ן
 
ה
ק
י
ם
 
א
ת
 
ב
ר
י
ת
ו
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
ה
י
ה
 
א
ם
 
ש
כ
ח
 
ת
ש
כ
ח
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ל
כ
ת
 
א
ח
ר
י
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
ע
ב
ד
ת
ם
 
ו
ה
ש
ת
ח
ו
י
ת
 
ל
ה
ם
 
ה
ע
ד
ת
י
 
ב
כ
ם
 
ה
י
ו
ם
 
כ
י
 
א
ב
ד
 
ת
א
ב
ד
ו
ן
 
כ
ג
ו
י
ם
 
א
ש
ר
 
י
ה
ו
ה
 
מ
א
ב
ד
 
מ
פ
נ
י
כ
ם
 
כ
ן
 
ת
א
ב
ד
ו
ן
 
ע
ק
ב
 
ל
א
 
ת
ש
מ
ע
ו
ן
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ש
מ
ע
 
י
ש
ר
א
ל
 
א
ת
ה
 
ע
ב
ר
 
ה
י
ו
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ל
ב
ו
א
 
ל
ר
ש
ת
 
ג
ו
י
ם
 
ג
ד
ל
י
ם
 
ו
ע
צ
מ
י
ם
 
מ
מ
ך
 
ע
ר
י
ם
 
ג
ד
ל
ו
ת
 
ו
ב
צ
ר
ו
ת
 
ב
ש
מ
י
ם
 
ע
ם
 
ג
ד
ו
ל
 
ו
ר
ם
 
ב
נ
י
 
ע
נ
ק
י
ם
 
א
ש
ר
 
א
ת
ה
 
י
ד
ע
ת
 
ו
א
ת
ה
 
ש
מ
ע
ת
 
מ
י
 
י
ת
י
צ
ב
 
ל
פ
נ
י
 
ב
נ
י
 
ע
נ
ק
 
ו
י
ד
ע
ת
 
ה
י
ו
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ו
א
 
ה
ע
ב
ר
 
ל
פ
נ
י
ך
 
א
ש
 
א
כ
ל
ה
 
ה
ו
א
 
י
ש
מ
י
ד
ם
 
ו
ה
ו
א
 
י
כ
נ
ע
ם
 
ל
פ
נ
י
ך
 
ו
ה
ו
ר
ש
ת
ם
 
ו
א
ב
ד
ת
ם
 
מ
ה
ר
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ל
ך
 
א
ל
 
ת
א
מ
ר
 
ב
ל
ב
ב
ך
 
ב
ה
ד
י
ף
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
ם
 
מ
פ
נ
י
ך
 
ל
א
מ
ר
 
ב
צ
ד
ק
ת
י
 
ה
ב
י
א
נ
י
 
י
ה
ו
ה
 
ל
ר
ש
ת
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
ו
ב
ר
ש
ע
ת
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
י
ה
ו
ה
 
מ
ו
ר
י
ש
ם
 
מ
פ
נ
י
ך
 
ל
א
 
ב
צ
ד
ק
ת
ך
 
ו
ב
י
ש
ר
 
ל
ב
ב
ך
 
א
ת
ה
 
ב
א
 
ל
ר
ש
ת
 
א
ת
 
א
ר
צ
ם
 
כ
י
 
ב
ר
ש
ע
ת
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
י
ה
ו
ה
 
מ
ו
ר
י
ש
ם
 
מ
פ
נ
י
ך
 
ו
ל
מ
ע
ן
 
ה
ק
י
ם
 
א
ת
 
ה
ד
ב
ר
 
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ו
י
ד
ע
ת
 
כ
י
 
ל
א
 
ב
צ
ד
ק
ת
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
א
ת
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
ה
ז
א
ת
 
ל
ר
ש
ת
ה
 
כ
י
 
ע
ם
 
ק
ש
ה
 
ע
ר
ף
 
א
ת
ה
 
ז
כ
ו
ר
 
ו
א
ל
 
ת
ש
כ
ח
 
א
ת
 
א
ש
ר
 
ה
ק
צ
פ
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
מ
ד
ב
ר
 
ל
מ
ן
 
ה
י
ו
ם
 
א
ש
ר
 
י
צ
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ד
 
ב
א
כ
ם
 
ע
ד
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
מ
מ
ר
י
ם
 
ה
י
י
ת
ם
 
ע
ם
 
י
ה
ו
ה
 
ו
ב
ח
ו
ר
ב
 
ה
ק
צ
פ
ת
ם
 
א
ת
 
י
ה
ו
ה
 
ו
י
ת
א
נ
ף
 
י
ה
ו
ה
 
ב
כ
ם
 
ל
ה
ש
מ
י
ד
 
א
ת
כ
ם
 
ב
ע
ל
ו
ת
י
 
ה
ה
ר
ה
 
ל
ק
ח
ת
 
ל
ו
ח
ו
ת
 
ה
א
ב
נ
י
ם
 
ל
ו
ח
ת
 
ה
ב
ר
י
ת
 
א
ש
ר
 
כ
ר
ת
 
י
ה
ו
ה
 
ע
מ
כ
ם
 
ו
א
ש
ב
 
ב
ה
ר
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ל
ח
ם
 
ל
א
 
א
כ
ל
ת
י
 
ו
מ
י
ם
 
ל
א
 
ש
ת
י
ת
י
 
ו
י
ת
ן
 
י
ה
ו
ה
 
א
ל
י
 
א
ת
 
ש
נ
י
 
ל
ו
ח
ת
 
ה
א
ב
נ
י
ם
 
כ
ת
ו
ב
י
ם
 
ב
א
צ
ב
ע
 
א
ל
ה
י
ם
 
ו
ע
ל
י
ה
ם
 
כ
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
י
כ
ם
 
ב
ה
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
ב
י
ו
ם
 
ה
ק
ה
ל
 
ו
י
ה
י
 
מ
ק
ץ
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
י
 
א
ת
 
ש
נ
י
 
ל
ו
ח
ת
 
ה
ב
ר
י
ת
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ק
ו
ם
 
ר
ד
 
מ
ה
ר
 
מ
ז
ה
 
כ
י
 
ש
ח
ת
 
ע
מ
ך
 
א
ש
ר
 
ה
ו
צ
א
ת
 
מ
מ
צ
ר
י
ם
 
ס
ר
ו
 
מ
ה
ר
 
מ
ן
 
ה
ד
ר
ך
 
א
ש
ר
 
צ
ו
י
ת
ם
 
ע
ש
ו
 
ל
ה
ם
 
ע
ג
ל
 
מ
ס
כ
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ל
א
מ
ר
 
ר
א
י
ת
י
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
ו
ה
נ
ה
 
ע
ם
 
ק
ש
ה
 
ע
ר
ף
 
ה
ו
א
 
ה
ר
ף
 
מ
מ
נ
י
 
ו
א
ש
מ
י
ד
ם
 
ו
א
מ
ח
ה
 
א
ת
 
ש
מ
ם
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
ו
א
ע
ש
ה
 
א
ת
ך
 
ל
ג
ו
י
 
ע
צ
ו
ם
 
ו
ר
ב
 
מ
מ
נ
ו
 
ו
א
פ
נ
ה
 
ו
א
ר
ד
ה
 
מ
ן
 
ה
ה
ר
 
ו
ה
ה
ר
 
ב
ע
ר
 
ב
א
ש
 
ו
ש
נ
י
 
ל
ו
ח
ת
 
ה
ב
ר
י
ת
 
ע
ל
 
ש
ת
י
 
י
ד
י
 
ו
א
ר
א
ה
 
ו
ה
נ
ה
 
ח
ט
א
ת
ם
 
ל
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ע
ש
י
ת
ם
 
ל
כ
ם
 
ע
ג
ל
 
מ
ס
כ
ה
 
ס
ר
ת
ם
 
מ
ה
ר
 
מ
ן
 
ה
ד
ר
ך
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
כ
ם
 
ו
א
ת
פ
ש
ה
 
ב
ש
נ
י
 
ה
ל
ו
ח
ו
ת
 
ו
א
ש
ל
י
כ
ם
 
מ
ע
ל
 
ש
ת
י
 
י
ד
י
 
ו
א
ש
ב
ר
ם
 
ל
ע
י
נ
י
כ
ם
 
ו
א
ת
נ
פ
ל
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
כ
ר
א
י
ש
ו
נ
ה
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ל
ח
ם
 
ל
א
 
א
כ
ל
ת
י
 
ו
מ
י
ם
 
ל
א
 
ש
ת
י
ת
י
 
ע
ל
 
כ
ל
 
ח
ט
א
ת
י
כ
ם
 
א
ש
ר
 
ח
ט
א
ת
ם
 
ל
ע
ש
ו
ת
 
ה
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ל
ה
כ
ע
י
ס
ו
 
כ
י
 
י
ג
ר
ת
י
 
מ
פ
נ
י
 
ה
א
ף
 
ו
ה
ח
מ
ה
 
א
ש
ר
 
ק
צ
ף
 
י
ה
ו
ה
 
ע
ל
י
כ
ם
 
ל
ה
ש
מ
י
ד
 
א
ת
כ
ם
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
א
ל
י
 
ג
ם
 
ב
פ
ע
ם
 
ה
ה
ו
א
 
ו
ב
א
ה
ר
ן
 
ה
ת
א
נ
ף
 
י
ה
ו
ה
 
מ
א
ד
 
ל
ה
ש
מ
י
ד
ו
 
ו
א
ת
פ
ל
ל
ה
 
ג
ם
 
ב
ע
ד
 
א
ה
ר
ן
 
ב
ע
ת
 
ה
ה
י
א
 
ו
א
ת
 
ח
ט
א
ת
י
כ
ם
 
א
ש
ר
 
ע
ש
י
ת
ם
 
א
ת
 
ה
ע
ג
ל
 
ל
ק
ח
ת
י
 
ו
א
ש
ר
פ
ה
 
א
ת
ו
 
ב
א
ש
 
ו
א
כ
ת
ה
 
א
ת
ו
 
ט
ח
ו
ן
 
ה
י
י
ט
ב
 
ע
ד
 
א
ש
ר
 
ד
ק
 
ל
ע
פ
ר
 
ו
א
ש
ל
י
כ
ה
 
א
ת
 
ע
פ
ר
ו
 
א
ל
 
ה
נ
ח
ל
 
ה
י
ו
ר
ד
 
מ
ן
 
ה
ה
ר
 
ו
ב
ת
ב
ע
ר
ה
 
ו
ב
מ
ס
ה
 
ו
ב
ק
ב
ר
ו
ת
 
ה
ת
א
ו
ה
 
מ
ק
צ
פ
י
ם
 
ה
י
י
ת
ם
 
א
ת
 
י
ה
ו
ה
 
ו
ב
ש
ל
ח
 
י
ה
ו
ה
 
א
ת
כ
ם
 
מ
ק
ד
ש
 
ב
ר
נ
ע
 
ל
א
מ
ר
 
ע
ל
ו
 
ו
ר
ש
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ת
ת
י
 
ל
כ
ם
 
ו
ת
מ
ר
ו
 
א
ת
 
פ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ל
א
 
ה
א
מ
נ
ת
ם
 
ל
ו
 
ו
ל
א
 
ש
מ
ע
ת
ם
 
ב
ק
ו
ל
ו
 
מ
מ
ר
י
ם
 
ה
י
י
ת
ם
 
ע
ם
 
י
ה
ו
ה
 
מ
י
ו
ם
 
ד
ע
ת
ו
 
א
ת
כ
ם
 
ו
א
ת
נ
פ
ל
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ת
 
א
ר
ב
ע
י
ם
 
ה
י
ו
ם
 
ו
א
ת
 
א
ר
ב
ע
י
ם
 
ה
ל
י
ל
ה
 
א
ש
ר
 
ה
ת
נ
פ
ל
ת
י
 
כ
י
 
א
מ
ר
 
י
ה
ו
ה
 
ל
ה
ש
מ
י
ד
 
א
ת
כ
ם
 
ו
א
ת
פ
ל
ל
ה
 
א
ל
 
י
ה
ו
ה
 
ו
א
מ
ר
ה
 
א
ד
נ
י
 
י
ה
ו
ה
 
א
ל
 
ת
ש
ח
י
ת
 
ע
מ
ך
 
ו
נ
ח
ל
ת
ך
 
א
ש
ר
 
פ
ד
י
ת
 
ב
ג
ד
ל
ך
 
א
ש
ר
 
ה
ו
צ
א
ת
 
מ
מ
צ
ר
י
ם
 
ב
י
ד
ך
 
ה
ח
ז
ק
ה
 
ז
כ
ו
ר
 
ל
ע
ב
ד
י
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
א
ל
 
ת
פ
ן
 
א
ל
 
ק
ש
ה
 
ה
ע
ם
 
ה
ז
ה
 
ו
א
ל
 
ר
ש
ע
ו
 
ו
א
ל
 
ח
ט
א
ת
ו
 
פ
ן
 
י
א
מ
ר
ו
 
ע
ם
 
ה
א
ר
ץ
 
א
ש
ר
 
ה
ו
צ
א
ת
נ
ו
 
מ
ש
ם
 
מ
ב
ל
ת
י
 
י
כ
ל
ת
 
י
ה
ו
ה
 
ל
ה
ב
י
א
 
א
ת
ם
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
ד
ב
ר
 
ל
ה
ם
 
ו
מ
ש
נ
א
ת
ו
 
א
ת
ם
 
ה
ו
צ
י
א
ם
 
ל
ה
מ
י
ת
ם
 
ב
מ
ד
ב
ר
 
ו
ה
ם
 
ע
מ
ך
 
ו
נ
ח
ל
ת
ך
 
א
ש
ר
 
ה
ו
צ
א
ת
 
מ
מ
צ
ר
י
ם
 
ב
כ
ח
ך
 
ה
ג
ד
ו
ל
 
ו
ב
ז
ר
ו
ע
ך
 
ה
נ
ט
ו
י
ה
 
ב
ע
ת
 
ה
ה
י
א
 
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
פ
ס
ל
 
ל
ך
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
כ
ר
א
י
ש
ו
נ
י
ם
 
ו
ע
ל
ה
 
א
ל
י
 
ה
ה
ר
ה
 
ו
ע
ש
י
ת
 
ל
ך
 
א
ר
ו
ן
 
ע
ץ
 
ו
א
כ
ת
ב
ה
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
א
ת
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ה
י
ו
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
ה
ר
א
י
ש
ו
נ
י
ם
 
א
ש
ר
 
ש
ב
ר
ת
 
ו
ש
מ
ת
ם
 
ב
א
ר
ו
ן
 
ו
א
ע
ש
ה
 
א
ר
ו
ן
 
ע
צ
י
 
ש
ט
י
ם
 
ו
א
פ
ס
ל
ה
 
ש
נ
י
 
ל
ו
ח
ת
 
א
ב
נ
י
ם
 
כ
ר
א
י
ש
ו
נ
י
ם
 
ו
א
ע
ל
ה
 
ה
ה
ר
ה
 
ו
ש
נ
י
 
ה
ל
ו
ח
ו
ת
 
ב
י
ד
י
 
ו
י
כ
ת
ב
 
ע
ל
 
ה
ל
ו
ח
ו
ת
 
כ
מ
כ
ת
ב
 
ה
ר
א
י
ש
ו
ן
 
א
ת
 
ע
ש
ר
ת
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ע
ל
י
כ
ם
 
ב
ה
ר
 
מ
ת
ו
ך
 
ה
א
ש
 
ב
י
ו
ם
 
ה
ק
ה
ל
 
ו
י
ת
נ
ם
 
י
ה
ו
ה
 
א
ל
י
 
ו
א
פ
נ
ה
 
ו
א
ר
ד
ה
 
מ
ן
 
ה
ה
ר
 
ו
א
ש
י
מ
ה
 
א
ת
 
ה
ל
ו
ח
ו
ת
 
ב
א
ר
ו
ן
 
א
ש
ר
 
ע
ש
י
ת
י
 
ו
י
ה
י
ו
 
ש
ם
 
כ
א
ש
ר
 
צ
ו
נ
י
 
י
ה
ו
ה
 
ו
ב
נ
י
 
י
ש
ר
א
ל
 
נ
ס
ע
ו
 
מ
מ
ס
ר
ו
ת
 
ו
י
ח
נ
ו
 
ב
ב
נ
י
 
י
ע
ק
ן
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ה
ג
ד
ג
ד
ה
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ב
י
ט
ב
ת
ה
 
א
ר
ץ
 
נ
ח
ל
י
 
מ
י
ם
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ב
ע
ב
ר
נ
ה
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ב
ע
צ
י
ו
נ
 
ג
ב
ר
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ב
מ
ד
ב
ר
 
צ
ן
 
ה
י
א
 
ק
ד
ש
 
מ
ש
ם
 
נ
ס
ע
ו
 
ו
י
ח
נ
ו
 
ב
ה
ר
 
ה
ה
ר
 
ו
י
מ
ת
 
ש
ם
 
א
ה
ר
ן
 
ו
י
ק
ב
ר
 
ש
ם
 
ו
י
כ
ה
ן
 
א
ל
ע
ז
ר
 
ב
נ
ו
 
ת
ח
ת
י
ו
 
ב
ע
ת
 
ה
ה
י
א
 
ה
ב
ד
י
ל
 
י
ה
ו
ה
 
א
ת
 
ש
ב
ט
 
ה
ל
ו
י
 
ל
ש
א
ת
 
א
ת
 
א
ר
ו
ן
 
ב
ר
י
ת
 
י
ה
ו
ה
 
ל
ע
מ
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
ש
ר
ת
ו
 
ו
ל
ב
ר
ך
 
ב
ש
מ
ו
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ע
ל
 
כ
ן
 
ל
א
 
ה
י
ה
 
ל
ל
ו
י
 
ח
ל
ק
 
ו
נ
ח
ל
ה
 
ע
ם
 
א
ח
י
ו
 
י
ה
ו
ה
 
ה
ו
א
 
נ
ח
ל
ת
ו
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ו
 
ו
א
נ
כ
י
 
ע
מ
ד
ת
י
 
ב
ה
ר
 
כ
י
מ
י
ם
 
ה
ר
א
י
ש
ו
נ
י
ם
 
א
ר
ב
ע
י
ם
 
י
ו
ם
 
ו
א
ר
ב
ע
י
ם
 
ל
י
ל
ה
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
א
ל
י
 
ג
ם
 
ב
פ
ע
ם
 
ה
ה
ו
א
 
ו
ל
א
 
א
ב
ה
 
י
ה
ו
ה
 
ה
ש
ח
י
ת
ך
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ק
ו
ם
 
ל
ך
 
ל
מ
ס
ע
 
ל
פ
נ
י
 
ה
ע
ם
 
ה
ז
ה
 
ו
י
ב
א
ו
 
ו
י
י
ר
ש
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ו
ת
ם
 
ל
ת
ת
 
ל
ה
ם
 
ו
ע
ת
ה
 
י
ש
ר
א
ל
 
מ
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ש
א
ל
 
מ
ע
מ
ך
 
כ
י
 
א
ם
 
ל
י
ר
א
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ל
כ
ת
 
ב
כ
ל
 
ד
ר
כ
י
ו
 
ו
ל
א
ה
ב
ה
 
א
ת
ו
 
ו
ל
ע
ב
ד
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
ו
ל
ש
מ
ר
 
א
ת
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
א
ת
 
ח
ק
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
ט
ו
ב
 
ל
ך
 
ה
ן
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ש
מ
י
ם
 
ו
ש
מ
י
 
ה
ש
מ
י
ם
 
ה
א
ר
ץ
 
ו
כ
ל
 
א
ש
ר
 
ב
ה
 
ר
ק
 
ב
א
ב
ת
י
ך
 
ח
ש
ק
 
י
ה
ו
ה
 
ל
א
ה
ב
ה
 
א
ת
ם
 
ו
י
ב
ח
ר
 
ב
ז
ר
ע
ם
 
א
ח
ר
י
ה
ם
 
ב
כ
ם
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
כ
י
ו
ם
 
ה
ז
ה
 
ו
מ
ל
ת
ם
 
א
ת
 
ע
ר
ל
ת
 
ל
ב
ב
כ
ם
 
ו
ע
ר
פ
כ
ם
 
ל
א
 
ת
ק
ש
ו
 
ע
ו
ד
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ו
א
 
א
ל
ה
י
 
ה
א
ל
ה
י
ם
 
ו
א
ד
ו
ן
 
ה
א
ד
ו
נ
י
ם
 
ה
א
ל
 
ה
ג
ד
ו
ל
 
ו
ה
ג
י
ב
ו
ר
 
ו
ה
נ
ו
ר
א
 
א
ש
ר
 
ל
א
 
י
ש
א
 
פ
נ
י
ם
 
ו
ל
א
 
י
ק
ח
 
ש
ח
ד
 
ע
ש
ה
 
מ
ש
פ
ט
 
י
ת
ו
ם
 
ו
א
ל
מ
נ
ה
 
ו
א
ה
ב
 
ג
ר
 
ל
ת
ת
 
ל
ו
 
ל
ח
ם
 
ו
ש
מ
ל
ה
 
ו
א
ה
ב
ת
ם
 
א
ת
 
ה
ג
ר
 
כ
י
 
ג
ר
י
ם
 
ה
י
י
ת
ם
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ת
י
ר
א
 
ו
א
ת
ו
 
ת
ע
ב
ד
 
ו
ב
ו
 
ת
ד
ב
ק
 
ו
ב
ש
מ
ו
 
ת
ש
ב
ע
 
ה
ו
א
 
ת
ה
ל
ת
ך
 
ו
ה
ו
א
 
א
ל
ה
י
ך
 
א
ש
ר
 
ע
ש
ה
 
א
ת
ך
 
א
ת
 
ה
ג
ד
ל
ו
ת
 
ו
א
ת
 
ה
נ
ו
ר
א
ו
ת
 
ה
א
ל
ה
 
א
ש
ר
 
ר
א
ו
 
ע
י
נ
י
ך
 
ב
ש
ב
ע
י
ם
 
נ
פ
ש
 
י
ר
ד
ו
 
א
ב
ת
י
ך
 
מ
צ
ר
י
מ
ה
 
ו
ע
ת
ה
 
ש
מ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ל
ר
ב
 
ו
א
ה
ב
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ר
ת
 
מ
ש
מ
ר
ת
ו
 
ח
ק
ת
י
ו
 
ו
מ
צ
ו
ת
י
ו
 
ו
מ
ש
פ
ט
י
ו
 
כ
ל
 
ה
י
מ
י
ם
 
ו
י
ד
ע
ת
ם
 
ה
י
ו
ם
 
כ
י
 
ל
א
 
א
ת
 
ב
נ
י
כ
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
 
ו
א
ש
ר
 
ל
א
 
ר
א
ו
 
א
ת
 
מ
ו
ס
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ת
 
ג
ד
ל
ו
 
ו
א
ת
 
י
ד
ו
 
ה
ח
ז
ק
ה
 
ו
א
ת
 
ז
ר
ו
ע
ו
 
ה
נ
ט
ו
י
ה
 
א
ת
 
א
ת
ו
ת
י
ו
 
ו
א
ת
 
מ
ע
ש
י
ו
 
א
ש
ר
 
ע
ש
ה
 
ב
ת
ו
ך
 
מ
צ
ר
י
ם
 
ל
פ
ר
ע
ה
 
ו
ל
כ
ל
 
א
ר
צ
ו
 
ו
א
ש
ר
 
ע
ש
ה
 
ל
ח
י
ל
 
מ
צ
ר
י
ם
 
ל
ס
ו
ס
י
ו
 
ו
ל
ר
כ
ב
ו
 
א
ש
ר
 
ה
צ
י
ף
 
א
ת
 
מ
י
 
י
ם
 
ס
ו
ף
 
ע
ל
 
פ
נ
י
ה
ם
 
ב
ר
ד
פ
ם
 
א
ח
ר
י
כ
ם
 
ו
י
א
ב
ד
ם
 
י
ה
ו
ה
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
א
ש
ר
 
ע
ש
ה
 
ל
כ
ם
 
ב
מ
ד
ב
ר
 
ע
ד
 
ב
א
כ
ם
 
ע
ד
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
ו
א
ש
ר
 
ע
ש
ה
 
ל
ד
ת
ן
 
ו
ל
א
ב
י
ר
ם
 
ב
נ
י
 
א
ל
י
א
ב
 
ב
ן
 
ר
א
ו
ב
ן
 
א
ש
ר
 
פ
צ
ת
ה
 
ה
א
ר
ץ
 
א
ת
 
פ
י
ה
 
ו
ת
ב
ל
ע
ם
 
ו
א
ת
 
כ
ל
 
ה
א
ד
ם
 
א
ש
ר
 
ל
ק
ר
ח
 
ו
א
ת
 
ב
ת
י
ה
ם
 
ו
א
ת
 
א
ה
ל
י
ה
ם
 
ו
א
ת
 
כ
ל
 
ה
י
ק
ו
ם
 
א
ש
ר
 
ב
ר
ג
ל
י
ה
ם
 
ב
ק
ר
ב
 
כ
ל
 
י
ש
ר
א
ל
 
כ
י
 
ע
י
נ
י
כ
ם
 
ה
ר
א
ו
ת
 
א
ת
 
כ
ל
 
מ
ע
ש
ה
 
י
ה
ו
ה
 
ה
ג
ד
ו
ל
 
א
ש
ר
 
ע
ש
ה
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ל
מ
ע
ן
 
ת
ח
ז
ק
ו
 
ו
ב
א
ת
ם
 
ו
י
ר
ש
ת
ם
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ב
א
י
ם
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
ל
מ
ע
ן
 
ת
א
ר
י
כ
ו
ן
 
י
מ
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
כ
ם
 
ל
ת
ת
 
ל
ז
ר
ע
ם
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
כ
י
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ב
א
י
ם
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ל
א
 
כ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ה
י
א
 
א
ש
ר
 
י
צ
א
ת
ם
 
מ
ש
ם
 
א
ש
ר
 
ת
ז
ר
ע
 
א
ת
 
ז
ר
ע
ך
 
ו
ה
ש
ק
י
ת
 
ב
ר
ג
ל
י
ך
 
כ
ג
ן
 
ה
י
ר
ק
 
ו
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
א
ר
ץ
 
ה
ר
י
ם
 
ו
ב
ק
ע
ו
ת
 
ל
מ
ט
ר
 
ה
ש
מ
י
ם
 
ת
ש
ת
ה
 
מ
י
ם
 
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ד
ר
ש
 
א
ת
ה
 
ת
מ
י
ד
 
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ה
 
מ
ר
א
ש
י
ת
 
ה
ש
נ
ה
 
ו
ע
ד
 
א
ח
ר
י
ת
 
ה
ש
נ
ה
 
ו
ה
י
ה
 
א
ם
 
ש
מ
ע
 
ת
ש
מ
ע
ו
 
א
ל
 
מ
צ
ו
ת
י
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ל
א
ה
ב
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
ע
ב
ד
ו
 
ב
כ
ל
 
ל
ב
ב
כ
ם
 
ו
ב
כ
ל
 
נ
פ
ש
כ
ם
 
ו
נ
ת
ן
 
מ
ט
ר
 
א
ר
צ
ך
 
ב
ע
ת
ו
 
י
ו
ר
א
 
ו
מ
ל
ק
ו
ש
 
ו
א
ס
פ
ת
 
ד
ג
נ
ך
 
ת
י
ר
ש
ך
 
ו
י
צ
ה
ר
ך
 
ו
נ
ת
ן
 
ע
ש
ב
 
ב
ש
ד
ך
 
ל
ב
ה
מ
ת
ך
 
ו
א
כ
ל
ת
 
ו
ש
ב
ע
ת
 
ה
ש
מ
ר
ו
 
ל
כ
ם
 
פ
ן
 
י
פ
ת
ה
 
ל
ב
ב
כ
ם
 
ו
ס
ר
ת
ם
 
ו
ע
ב
ד
ת
ם
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
ה
ש
ת
ח
ו
י
ת
ם
 
ל
ה
ם
 
ו
ח
ר
ה
 
א
ף
 
י
ה
ו
ה
 
ב
כ
ם
 
ו
ע
צ
ר
 
א
ת
 
ה
ש
מ
י
ם
 
ו
ל
א
 
י
ה
י
ה
 
מ
ט
ר
 
ו
ה
א
ד
מ
ה
 
ל
א
 
ת
ת
ן
 
א
ת
 
י
ב
ו
ל
ה
 
ו
א
ב
ד
ת
ם
 
מ
ה
ר
 
מ
ע
ל
 
ה
א
ר
ץ
 
ה
ט
ו
ב
ה
 
א
ש
ר
 
י
ה
ו
ה
 
נ
ת
ן
 
ל
כ
ם
 
ו
ש
מ
ת
ם
 
א
ת
 
ד
ב
ר
י
 
א
ל
ה
 
ע
ל
 
ל
ב
ב
כ
ם
 
ו
ע
ל
 
נ
פ
ש
כ
ם
 
ו
ק
ש
ר
ת
ם
 
א
ת
ם
 
ל
א
ו
ת
 
ע
ל
 
י
ד
י
כ
ם
 
ו
ה
י
ו
 
ל
ט
ט
פ
ו
ת
 
ב
י
ן
 
ע
י
נ
י
כ
ם
 
ו
ל
מ
ד
ת
ם
 
א
ת
ם
 
א
ת
 
ב
נ
י
כ
ם
 
ל
ד
ב
ר
 
ב
ם
 
ב
ש
ב
ת
ך
 
ב
ב
י
ת
 
ב
ל
כ
ת
ך
 
ב
ד
ר
ך
 
ב
ש
כ
ב
ך
 
ו
ב
ק
ו
מ
ך
 
ו
כ
ת
ב
ת
ם
 
ע
ל
 
מ
ז
ז
ו
ת
 
ב
ת
י
ך
 
ו
ב
ש
ע
ר
י
ך
 
ל
מ
ע
ן
 
י
ר
ב
ו
ן
 
י
מ
י
כ
ם
 
ו
י
מ
י
 
ב
נ
י
כ
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
כ
ם
 
ל
ת
ת
 
ל
ה
ם
 
כ
י
מ
י
 
ה
ש
מ
י
ם
 
ע
ל
 
ה
א
ר
ץ
 
כ
י
 
א
ם
 
ש
מ
ר
 
ת
ש
מ
ר
ו
ן
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
ה
ז
א
ת
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ל
ע
ש
ו
ת
ה
 
ל
א
ה
ב
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
ל
כ
ת
 
ב
כ
ל
 
ד
ר
כ
י
ו
 
ו
ל
ה
ד
ב
ק
ה
 
ב
ו
 
ו
ה
ו
ר
י
ש
 
י
ה
ו
ה
 
א
ת
 
כ
ל
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
מ
ל
פ
נ
י
ך
 
ו
י
ר
ש
ת
ם
 
ג
ו
י
ם
 
ג
ד
ל
י
ם
 
ו
ע
צ
מ
י
ם
 
מ
מ
ך
 
כ
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ת
ד
ר
ך
 
כ
ף
 
ר
ג
ל
כ
ם
 
ב
ו
 
ל
כ
ם
 
י
ה
י
ה
 
מ
ן
 
ה
מ
ד
ב
ר
 
ו
ה
ל
ב
נ
ו
ן
 
ו
מ
ן
 
ה
נ
ה
ר
 
נ
ה
ר
 
פ
ר
ת
 
ו
ע
ד
 
ה
י
ם
 
ה
א
ח
ר
ו
ן
 
י
ה
י
ה
 
ג
ב
ו
ל
כ
ם
 
ל
א
 
י
ת
י
צ
ב
 
א
י
ש
 
ל
פ
נ
י
כ
ם
 
פ
ח
ד
כ
ם
 
ו
מ
ר
א
כ
ם
 
י
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ע
ל
 
פ
נ
י
 
כ
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
ת
ד
ר
כ
ו
 
ב
ה
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
כ
ם
 
ר
א
ה
 
א
נ
כ
י
 
נ
ת
ן
 
ל
פ
נ
י
כ
ם
 
ה
י
ו
ם
 
ב
ר
כ
ה
 
ו
ק
ל
ל
ה
 
א
ת
 
ה
ב
ר
כ
ה
 
א
ש
ר
 
ת
ש
מ
ע
ו
ן
 
א
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ו
ה
ק
ל
ל
ה
 
א
ם
 
ל
א
 
ת
ש
מ
ע
ו
ן
 
א
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ס
ר
ת
ם
 
מ
ן
 
ה
ד
ר
ך
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ל
ל
כ
ת
 
א
ח
ר
י
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
ם
 
ו
ה
י
ה
 
כ
י
 
י
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
נ
ת
ת
ה
 
א
ת
 
ה
ב
ר
כ
ה
 
ע
ל
 
ה
ר
ג
ר
י
ז
י
ם
 
ו
א
ת
 
ה
ק
ל
ל
ה
 
ע
ל
 
ה
ר
 
ע
י
ב
ל
 
ה
ל
ו
א
 
ה
ם
 
ב
ע
ב
ר
 
ה
י
ר
ד
ן
 
א
ח
ר
י
 
ד
ר
ך
 
מ
ב
ו
א
 
ה
ש
מ
ש
 
ב
א
ר
ץ
 
ה
כ
נ
ע
נ
י
 
ה
י
ש
ב
 
ב
ע
ר
ב
ה
 
מ
ו
ל
 
ה
ג
ל
ג
ל
 
א
צ
ל
 
א
ל
ו
ן
 
מ
ו
ר
א
 
מ
ו
ל
 
ש
כ
ם
 
כ
י
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ל
ב
ו
א
 
ל
ר
ש
ת
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
נ
ת
ן
 
ל
כ
ם
 
ו
י
ר
ש
ת
ם
 
א
ת
ה
 
ו
י
ש
ב
ת
ם
 
ב
ה
 
ו
ש
מ
ר
ת
ם
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ה
ח
ק
י
ם
 
ו
א
ת
 
כ
ל
 
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
א
נ
כ
י
 
נ
ת
ן
 
ל
פ
נ
י
כ
ם
 
ה
י
ו
ם
 
א
ל
ה
 
ה
ח
ק
י
ם
 
ו
ה
מ
ש
פ
ט
י
ם
 
א
ש
ר
 
ת
ש
מ
ר
ו
 
ל
ע
ש
ו
ת
 
ב
א
ר
ץ
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
ך
 
ל
ך
 
ל
ר
ש
ת
ה
 
כ
ל
 
ה
י
מ
י
ם
 
א
ש
ר
 
א
ת
ם
 
ח
י
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ב
ד
 
ת
א
ב
ד
ו
ן
 
א
ת
 
כ
ל
 
ה
מ
ק
ו
מ
ו
ת
 
א
ש
ר
 
ע
ב
ד
ו
 
ש
ם
 
ה
ג
ו
י
ם
 
א
ש
ר
 
א
ת
ם
 
י
ר
ש
י
ם
 
א
ת
ם
 
א
ת
 
א
ל
ה
י
ה
ם
 
ע
ל
 
ה
ה
ר
י
ם
 
ה
ר
מ
י
ם
 
ו
ע
ל
 
ה
ג
ב
ע
ו
ת
 
ו
ת
ח
ת
 
כ
ל
 
ע
ץ
 
ר
ע
נ
ן
 
ו
נ
ת
צ
ת
ם
 
א
ת
 
מ
ז
ב
ח
ת
י
ה
ם
 
ו
ש
ב
ר
ת
ם
 
א
ת
 
מ
צ
ב
ת
י
ה
ם
 
ו
א
ש
ר
י
ה
ם
 
ת
ש
ר
פ
ו
ן
 
ב
א
ש
 
ו
פ
ס
י
ל
י
 
א
ל
ה
י
ה
ם
 
ת
ג
ד
ע
ו
ן
 
ו
א
ב
ד
ת
ם
 
א
ת
 
ש
מ
ם
 
מ
ן
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
ל
א
 
ת
ע
ש
ו
 
כ
ן
 
ל
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
כ
י
 
א
ם
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
מ
כ
ל
 
ש
ב
ט
י
כ
ם
 
ל
ש
י
ם
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ל
ש
כ
י
נ
ו
 
ת
ד
ר
ש
ו
 
ו
ב
א
ת
ם
 
ש
ם
 
ו
ה
ב
א
ת
ם
 
ש
מ
ה
 
ע
ל
ת
י
כ
ם
 
ו
ז
ב
ח
י
כ
ם
 
ו
א
ת
 
מ
ע
ש
ר
ת
י
כ
ם
 
ו
א
ת
 
ת
ר
ו
מ
ת
י
כ
ם
 
ו
נ
ד
ר
י
כ
ם
 
ו
נ
ד
ב
ת
י
כ
ם
 
ו
ב
כ
ו
ר
ת
 
ב
ק
ר
כ
ם
 
ו
צ
א
נ
כ
ם
 
ו
א
כ
ל
ת
ם
 
ש
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ש
מ
ח
ת
ם
 
ב
כ
ל
 
מ
ש
ל
ח
 
י
ד
י
כ
ם
 
א
ת
ם
 
ו
ב
ת
י
כ
ם
 
א
ש
ר
 
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ע
ש
ו
 
כ
כ
ל
 
א
ש
ר
 
א
נ
ח
נ
ו
 
ע
ש
י
ם
 
פ
ה
 
ה
י
ו
ם
 
א
י
ש
 
כ
ל
 
ה
י
ש
ר
 
ב
ע
י
נ
י
ו
 
כ
י
 
ל
א
 
ב
א
ת
ם
 
ע
ד
 
ע
ת
ה
 
א
ל
 
ה
מ
נ
ו
ח
ה
 
ו
א
ל
 
ה
נ
ח
ל
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
נ
ת
ן
 
ל
כ
ם
 
ו
ע
ב
ר
ת
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ו
י
ש
ב
ת
ם
 
ב
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
מ
נ
ח
י
ל
 
א
ת
כ
ם
 
ו
ה
נ
י
ח
 
ל
כ
ם
 
מ
כ
ל
 
א
י
ב
י
כ
ם
 
מ
ס
ב
י
ב
 
ו
י
ש
ב
ת
ם
 
ב
ט
ח
 
ו
ה
י
ה
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ב
ו
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ש
מ
ה
 
ת
ב
י
א
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ע
ל
ת
י
כ
ם
 
ו
ז
ב
ח
י
כ
ם
 
ו
מ
ע
ש
ר
ת
י
כ
ם
 
ו
ת
ר
ו
מ
ת
י
כ
ם
 
ו
נ
ד
ב
ת
י
כ
ם
 
ו
כ
ל
 
מ
ב
ח
ר
 
נ
ד
ר
י
כ
ם
 
א
ש
ר
 
ת
ד
ר
ו
 
ל
י
ה
ו
ה
 
ו
ש
מ
ח
ת
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ת
ם
 
ו
ב
נ
י
כ
ם
 
ו
ב
נ
ת
י
כ
ם
 
ע
ב
ד
י
כ
ם
 
ו
א
מ
ת
י
כ
ם
 
ו
ה
ל
ו
י
 
א
ש
ר
 
ב
ש
ע
ר
י
כ
ם
 
כ
י
 
א
י
ן
 
ל
ו
 
ח
ל
ק
 
ו
נ
ח
ל
ה
 
א
ת
כ
ם
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
ע
ל
ה
 
ע
ל
ת
י
ך
 
ב
כ
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ת
ר
א
ה
 
כ
י
 
א
ם
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
ב
א
ח
ד
 
ש
ב
ט
י
ך
 
ש
ם
 
ת
ע
ל
ה
 
ע
ל
ת
י
ך
 
ו
ש
ם
 
ת
ע
ש
ה
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ר
ק
 
ב
כ
ל
 
א
ו
ת
 
נ
פ
ש
ך
 
ת
ז
ב
ח
 
ו
א
כ
ל
ת
 
ב
ש
ר
 
כ
ב
ר
כ
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
נ
ת
ן
 
ל
ך
 
ב
כ
ל
 
ש
ע
ר
י
ך
 
ה
ט
מ
א
 
ו
ה
ט
ה
ו
ר
 
י
א
כ
ל
נ
ו
 
כ
צ
ב
י
 
ו
כ
א
י
ל
 
ר
ק
 
ה
ד
ם
 
ל
א
 
ת
א
כ
ל
 
ע
ל
 
ה
א
ר
ץ
 
ת
ש
פ
כ
נ
ו
 
כ
מ
י
ם
 
ל
א
 
ת
ו
כ
ל
 
ל
א
כ
ל
 
ב
ש
ע
ר
י
ך
 
מ
ע
ש
ר
 
ד
ג
נ
ך
 
ת
י
ר
ש
ך
 
ו
י
צ
ה
ר
ך
 
ו
ב
כ
ו
ר
ת
 
ב
ק
ר
ך
 
ו
צ
א
נ
ך
 
ו
כ
ל
 
נ
ד
ר
י
ך
 
א
ש
ר
 
ת
ד
ר
 
ו
נ
ד
ב
ת
י
ך
 
ו
ת
ר
ו
מ
ו
ת
 
י
ד
י
ך
 
כ
י
 
א
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ת
א
כ
ל
נ
ו
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ו
 
א
ת
ה
 
ו
ב
נ
ך
 
ו
ב
ת
ך
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
ו
ה
ל
ו
י
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ו
ש
מ
ח
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
מ
ש
ל
ח
 
י
ד
י
ך
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
ע
ז
ב
 
א
ת
 
ה
ל
ו
י
 
כ
ל
 
י
מ
י
ך
 
ע
ל
 
א
ד
מ
ת
ך
 
כ
י
 
י
ר
ח
י
ב
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ג
ב
ו
ל
ך
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
ך
 
ו
א
מ
ר
ת
 
א
כ
ל
ה
 
ב
ש
ר
 
כ
י
 
ת
א
ו
ה
 
נ
פ
ש
ך
 
ל
א
כ
ל
 
ב
ש
ר
 
ב
כ
ל
 
א
ו
ת
 
נ
פ
ש
ך
 
ת
א
כ
ל
 
ב
ש
ר
 
כ
י
 
י
ר
ח
ק
 
מ
מ
ך
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ו
ז
ב
ח
ת
 
מ
ב
ק
ר
ך
 
ו
מ
צ
א
נ
ך
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
ל
ך
 
כ
א
ש
ר
 
צ
ו
י
ת
י
ך
 
ו
א
כ
ל
ת
 
ב
ש
ע
ר
י
ך
 
ב
כ
ל
 
א
ו
ת
 
נ
פ
ש
ך
 
א
ך
 
כ
א
ש
ר
 
י
א
כ
ל
 
א
ת
 
ה
צ
ב
י
 
ו
א
ת
 
ה
א
י
ל
 
כ
ן
 
ת
א
כ
ל
נ
ו
 
ה
ט
מ
א
 
ב
ך
 
ו
ה
ט
ה
ו
ר
 
י
א
כ
ל
נ
ו
 
י
ח
ד
ו
 
ר
ק
 
ח
ז
ק
 
ל
ב
ל
ת
י
 
א
כ
ל
 
ה
ד
ם
 
כ
י
 
ה
ד
ם
 
ה
ו
א
 
ה
נ
פ
ש
 
ו
ל
א
 
ת
א
כ
ל
 
ה
נ
פ
ש
 
ע
ם
 
ה
ב
ש
ר
 
ל
א
 
ת
א
כ
ל
נ
ו
 
ע
ל
 
ה
א
ר
ץ
 
ת
ש
פ
כ
נ
ו
 
כ
מ
י
ם
 
ל
א
 
ת
א
כ
ל
נ
ו
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ך
 
ו
ל
ב
נ
י
ך
 
א
ח
ר
י
ך
 
כ
י
 
ת
ע
ש
ה
 
ה
י
ש
ר
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ר
ק
 
ק
ד
ש
י
ך
 
א
ש
ר
 
י
ה
י
ו
 
ל
ך
 
ו
נ
ד
ר
י
ך
 
ת
ש
א
 
ו
ב
א
ת
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
ו
ע
ש
י
ת
 
ע
ל
ת
י
ך
 
ה
ב
ש
ר
 
ו
ה
ד
ם
 
ע
ל
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ד
ם
 
ז
ב
ח
י
ך
 
י
ש
פ
ך
 
ע
ל
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ב
ש
ר
 
ת
א
כ
ל
 
ש
מ
ו
ר
 
ו
ש
מ
ע
ת
 
ו
ע
ש
י
ת
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ך
 
ו
ל
ב
נ
י
ך
 
א
ח
ר
י
ך
 
ע
ד
 
ע
ו
ל
ם
 
כ
י
 
ת
ע
ש
ה
 
ה
י
ש
ר
 
ו
ה
ט
ו
ב
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
י
כ
ר
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ה
ג
ו
י
ם
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
ם
 
ל
ר
ש
ת
 
א
ת
ם
 
מ
פ
נ
י
ך
 
ו
י
ר
ש
ת
 
א
ת
ם
 
ו
י
ש
ב
ת
 
ב
א
ר
צ
ם
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
ת
נ
ק
ש
 
א
ח
ר
י
ה
ם
 
א
ח
ר
י
 
ה
ש
מ
י
ד
ם
 
מ
פ
נ
י
ך
 
ו
פ
ן
 
ת
ד
ר
ש
 
ל
א
ל
ה
י
ה
ם
 
ל
א
מ
ר
 
א
י
ך
 
י
ע
ב
ד
ו
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
א
ת
 
א
ל
ה
י
ה
ם
 
ו
א
ע
ש
ה
 
כ
ן
 
ג
ם
 
א
נ
י
 
ל
א
 
ת
ע
ש
ה
 
כ
ן
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
א
ת
 
כ
ל
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ש
ר
 
ש
נ
א
 
ע
ש
ו
 
ל
א
ל
ה
י
ה
ם
 
כ
י
 
ג
ם
 
א
ת
 
ב
נ
י
ה
ם
 
ו
א
ת
 
ב
נ
ת
י
ה
ם
 
י
ש
ר
פ
ו
 
ב
א
ש
 
ל
א
ל
ה
י
ה
ם
 
א
ת
 
כ
ל
 
ה
ד
ב
ר
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
א
ת
ו
 
ת
ש
מ
ר
ו
 
ל
ע
ש
ו
ת
 
ל
א
 
ת
ו
ס
י
פ
ו
 
ע
ל
י
ו
 
ו
ל
א
 
ת
ג
ר
ע
ו
 
מ
מ
נ
ו
 
כ
י
 
י
ק
ו
ם
 
ב
ק
ר
ב
ך
 
נ
ב
י
א
 
א
ו
 
ח
ל
ם
 
ח
ל
ו
ם
 
ו
נ
ת
ן
 
א
ל
י
ך
 
א
ו
ת
 
א
ו
 
מ
ו
פ
ת
 
ו
ב
א
 
ה
א
ו
ת
 
ו
ה
מ
ו
פ
ת
 
א
ש
ר
 
ד
ב
ר
 
א
ל
י
ך
 
ל
א
מ
ר
 
נ
ל
כ
ה
 
א
ח
ר
י
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
ם
 
ו
נ
ע
ב
ד
ם
 
ל
א
 
ת
ש
מ
ע
 
א
ל
 
ד
ב
ר
י
 
ה
נ
ב
י
א
 
ה
ה
ו
א
 
א
ו
 
א
ל
 
ה
ח
ל
ם
 
ה
ח
ל
ו
ם
 
ה
ה
ו
א
 
כ
י
 
מ
נ
ס
ה
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
א
ת
כ
ם
 
ל
ד
ע
ת
 
ה
י
ש
כ
ם
 
א
ה
ב
י
ם
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ב
כ
ל
 
ל
ב
ב
כ
ם
 
ו
ב
כ
ל
 
נ
פ
ש
כ
ם
 
א
ח
ר
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ת
ל
כ
ו
ן
 
ו
א
ת
ו
 
ת
י
ר
א
ו
ן
 
ו
א
ת
 
מ
צ
ו
ת
י
ו
 
ת
ש
מ
ר
ו
ן
 
ו
ב
ק
ו
ל
ו
 
ת
ש
מ
ע
ו
ן
 
ו
א
ת
ו
 
ת
ע
ב
ד
ו
 
ו
ב
ו
 
ת
ד
ב
ק
ו
 
ו
ה
נ
ב
י
א
 
ה
ה
ו
א
 
א
ו
 
ה
ח
ל
ם
 
ה
ח
ל
ו
ם
 
ה
ה
ו
א
 
י
ו
מ
ת
 
כ
י
 
ד
ב
ר
 
ס
ר
ה
 
ע
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
מ
ו
צ
י
א
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ה
פ
ד
ך
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
ל
ה
ד
י
ח
ך
 
מ
ן
 
ה
ד
ר
ך
 
א
ש
ר
 
צ
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ל
כ
ת
 
ב
ה
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
כ
י
 
י
ס
י
ת
ך
 
א
ח
י
ך
 
ב
ן
 
א
ב
י
ך
 
א
ו
 
ב
ן
 
א
מ
ך
 
א
ו
 
ב
נ
ך
 
א
ו
 
ב
ת
ך
 
א
ו
 
א
ש
ת
 
ח
י
ק
ך
 
א
ו
 
ר
ע
ך
 
א
ש
ר
 
כ
נ
פ
ש
ך
 
ב
ס
ת
ר
 
ל
א
מ
ר
 
נ
ל
כ
ה
 
ו
נ
ע
ב
ד
ה
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
 
א
ת
ה
 
ו
א
ב
ת
י
ך
 
מ
א
ל
ה
י
 
ה
ע
מ
י
ם
 
א
ש
ר
 
ס
ב
י
ב
ת
י
כ
ם
 
ה
ק
ר
ו
ב
י
ם
 
א
ל
י
ך
 
א
ו
 
ה
ר
ח
ו
ק
י
ם
 
מ
מ
ך
 
מ
ק
צ
ה
 
ה
א
ר
ץ
 
ו
ע
ד
 
ק
צ
ה
 
ה
א
ר
ץ
 
ל
א
 
ת
א
ב
ה
 
א
ל
י
ו
 
ו
ל
א
 
ת
ש
מ
ע
 
א
ל
י
ו
 
ו
ל
א
 
ת
ח
ו
ס
 
ע
י
נ
ך
 
ע
ל
י
ו
 
ו
ל
א
 
ת
ח
מ
ל
 
ו
ל
א
 
ת
כ
ס
ה
 
ע
ל
י
ו
 
כ
י
 
ה
ר
ג
 
ת
ה
ר
ג
נ
ו
 
י
ד
ך
 
ת
ה
י
ה
 
ב
ו
 
ב
ר
א
י
ש
ו
נ
ה
 
ל
ה
מ
י
ת
ו
 
ו
י
ד
 
כ
ל
 
ה
ע
ם
 
ב
א
ח
ר
נ
ה
 
ו
ס
ק
ל
ת
ו
 
ב
א
ב
נ
י
ם
 
ו
מ
ת
 
כ
י
 
ב
ק
ש
 
ל
ה
ד
י
ח
ך
 
מ
ע
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
מ
ו
צ
י
א
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
מ
ב
י
ת
 
ע
ב
ד
י
ם
 
ו
כ
ל
 
י
ש
ר
א
ל
 
י
ש
מ
ע
ו
 
ו
י
י
ר
א
ו
 
ו
ל
א
 
י
ו
ס
י
פ
ו
 
ע
ו
ד
 
ל
ע
ש
ו
ת
 
כ
ד
ב
ר
 
ה
ר
ע
 
ה
ז
ה
 
ב
ק
ר
ב
ך
 
כ
י
 
ת
ש
מ
ע
 
ב
א
ח
ת
 
ע
ר
י
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
ש
ב
ת
 
ש
ם
 
ל
א
מ
ר
 
י
צ
א
ו
 
א
נ
ש
י
ם
 
ב
נ
י
 
ב
ל
ע
י
ל
 
מ
ק
ר
ב
ך
 
ו
י
ד
י
ח
ו
 
א
ת
 
י
ש
ב
י
 
ע
י
ר
ם
 
ל
א
מ
ר
 
נ
ל
כ
ה
 
ו
נ
ע
ב
ד
ה
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
ם
 
ו
ד
ר
ש
ת
 
ו
ח
ק
ר
ת
 
ו
ש
א
ל
ת
 
ה
י
י
ט
ב
 
ו
ה
נ
ה
 
א
מ
ת
 
נ
כ
ו
ן
 
ה
ד
ב
ר
 
נ
ע
ש
ת
ה
 
ה
ת
ו
ע
ב
ה
 
ה
ז
א
ת
 
ב
ק
ר
ב
ך
 
ה
כ
ה
 
ת
כ
ה
 
א
ת
 
י
ש
ב
י
 
ה
ע
י
ר
 
ה
ה
י
א
 
ל
פ
י
 
ח
ר
ב
 
ה
ח
ר
י
ם
 
א
ת
ה
 
ו
א
ת
 
כ
ל
 
א
ש
ר
 
ב
ה
 
ו
א
ת
 
ב
ה
מ
ת
ה
 
ל
פ
י
 
ח
ר
ב
 
ו
א
ת
 
כ
ל
 
ש
ל
ל
ה
 
ת
ק
ב
ץ
 
א
ל
 
ת
ו
ך
 
ר
ח
ב
ה
 
ו
ש
ר
פ
ת
 
ב
א
ש
 
א
ת
 
ה
ע
י
ר
 
ו
א
ת
 
כ
ל
 
ש
ל
ל
ה
 
כ
ל
י
ל
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
י
ת
ה
 
ת
ל
 
ע
ו
ל
ם
 
ל
א
 
ת
ב
נ
ה
 
ע
ו
ד
 
ו
ל
א
 
י
ד
ב
ק
 
ב
י
ד
ך
 
מ
א
ו
מ
ה
 
מ
ן
 
ה
ח
ר
ם
 
ל
מ
ע
ן
 
י
ש
ו
ב
 
י
ה
ו
ה
 
מ
ח
ר
ו
ן
 
א
פ
ו
 
ו
נ
ת
ן
 
ל
ך
 
ר
ח
מ
י
ם
 
ו
ר
ח
מ
ך
 
ו
ה
ר
ב
ך
 
כ
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
כ
י
 
ת
ש
מ
ע
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
א
ת
 
כ
ל
 
מ
צ
ו
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
ע
ש
ו
ת
 
ה
י
ש
ר
 
ו
ה
ט
ו
ב
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
נ
י
ם
 
א
ת
ם
 
ל
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ל
א
 
ת
ת
ג
ד
ד
ו
 
ו
ל
א
 
ת
ש
י
מ
ו
 
ק
ר
ח
ה
 
ב
י
ן
 
ע
י
נ
י
כ
ם
 
ל
מ
ת
 
כ
י
 
ע
ם
 
ק
ד
ש
 
א
ת
ה
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ב
ך
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ה
י
ו
ת
 
ל
ו
 
ל
ע
ם
 
ס
ג
ל
ה
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
ה
א
ד
מ
ה
 
ל
א
 
ת
א
כ
ל
ו
 
כ
ל
 
ת
ו
ע
ב
ה
 
ו
ז
א
ת
 
ה
ב
ה
מ
ה
 
א
ש
ר
 
ת
א
כ
ל
ו
 
ש
ו
ר
 
ו
ש
ה
 
כ
ש
ב
י
ם
 
ו
ש
ה
 
ע
ז
י
ם
 
א
י
ל
 
ו
צ
ב
י
 
ו
י
ח
מ
ו
ר
 
א
ק
ו
 
ו
ד
י
ש
ו
ן
 
ו
ת
א
י
 
ו
ז
מ
ר
 
כ
ל
 
ב
ה
מ
ה
 
מ
פ
ר
י
ס
ת
 
פ
ר
ס
ה
 
ו
ש
ס
ע
ת
 
ש
ס
ע
 
ש
ת
י
 
פ
ר
ס
ו
ת
 
מ
ע
ל
ו
ת
 
ג
ר
ה
 
ב
ב
ה
מ
ה
 
א
ת
ה
 
ת
א
כ
ל
ו
 
א
ך
 
א
ת
 
ז
ה
 
ל
א
 
ת
א
כ
ל
ו
 
מ
מ
ע
ל
י
 
ה
ג
ר
ה
 
ו
מ
מ
פ
ר
ס
י
 
ה
פ
ר
ס
ה
 
א
ת
 
ה
ג
מ
ל
 
ו
א
ת
 
ה
א
ר
נ
ב
ת
 
ו
א
ת
 
ה
ש
פ
ן
 
כ
י
 
מ
ע
ל
ה
 
ג
ר
ה
 
ה
ם
 
ו
פ
ר
ס
ה
 
ל
א
 
ה
פ
ר
י
ס
ו
 
ט
מ
א
י
ם
 
ה
ם
 
ל
כ
ם
 
ו
א
ת
 
ה
ח
ז
י
ר
 
כ
י
 
מ
פ
ר
י
ס
 
פ
ר
ס
ה
 
ה
ו
א
 
ו
ש
ס
ע
 
ש
ס
ע
 
פ
ר
ס
ה
 
ו
ה
ו
א
 
ג
ר
ה
 
ל
א
 
י
ג
ו
ר
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
מ
ב
ש
ר
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ו
ב
נ
ב
ל
ת
ם
 
ל
א
 
ת
ג
ע
ו
 
ו
א
ת
 
ז
ה
 
ת
א
כ
ל
ו
 
מ
כ
ל
 
א
ש
ר
 
ב
מ
י
ם
 
כ
ל
 
א
ש
ר
 
ל
ו
 
ס
נ
פ
י
ר
 
ו
ק
ש
ק
ש
ת
 
ת
א
כ
ל
ו
 
ו
כ
ל
 
א
ש
ר
 
א
י
ן
 
ל
ו
 
ס
נ
פ
י
ר
 
ו
ק
ש
ק
ש
ת
 
ל
א
 
ת
א
כ
ל
ו
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
כ
ל
 
צ
פ
ו
ר
 
ט
ה
ר
ה
 
ת
א
כ
ל
ו
 
ו
ז
ה
 
א
ש
ר
 
ל
א
 
ת
א
כ
ל
ו
 
מ
ה
ם
 
א
ת
 
ה
נ
ש
ר
 
ו
א
ת
 
ה
פ
ר
ס
 
ו
א
ת
 
ה
ע
ז
נ
י
ה
 
ו
א
ת
 
ה
ד
א
ה
 
ו
א
ת
 
ה
א
י
ה
 
ל
מ
י
נ
ה
 
ו
א
ת
 
כ
ל
 
ע
ר
ב
 
ל
מ
י
נ
ו
 
ו
א
ת
 
ב
ת
 
ה
י
ע
נ
ה
 
ו
א
ת
 
ה
ת
ח
מ
ו
ס
 
ו
א
ת
 
ה
ש
ח
ף
 
ל
מ
י
נ
ו
 
ו
א
ת
 
ה
נ
ץ
 
ו
א
ת
 
ה
כ
ו
ס
 
ו
א
ת
 
ה
ש
ל
ך
 
ו
א
ת
 
ה
י
נ
ש
ו
ף
 
ו
א
ת
 
ה
ת
נ
ש
מ
ת
 
ו
א
ת
 
ה
ק
א
ת
 
ו
א
ת
 
ה
ר
ח
מ
ה
 
ו
א
ת
 
ה
ח
ס
י
ד
ה
 
ו
ה
א
נ
פ
ה
 
ל
מ
י
נ
ה
 
ו
א
ת
 
ה
ד
ג
י
פ
ת
 
ו
א
ת
 
ה
ע
ט
ל
ף
 
כ
ל
 
ש
ר
ץ
 
ה
ע
ו
ף
 
ט
מ
א
 
ה
ו
א
 
ל
כ
ם
 
ל
א
 
ת
א
כ
ל
ו
 
מ
ה
ם
 
כ
ל
 
ע
ו
ף
 
ט
ה
ו
ר
 
ת
א
כ
ל
ו
 
ל
א
 
ת
א
כ
ל
ו
 
כ
ל
 
נ
ב
ל
ה
 
ל
ג
ר
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ת
ת
נ
נ
ה
 
ו
א
כ
ל
ה
 
א
ו
 
מ
כ
ר
ה
 
ל
נ
כ
ר
י
 
כ
י
 
ע
ם
 
ק
ד
ש
 
א
ת
ה
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ב
ש
ל
 
ג
ד
י
 
ב
ח
ל
ב
 
א
מ
ו
 
ע
ש
ר
 
ת
ע
ש
ר
 
א
ת
 
כ
ל
 
ת
ב
ו
א
ת
 
ז
ר
ע
ך
 
י
ו
צ
א
 
ה
ש
ד
ה
 
ש
נ
ה
 
ב
ש
נ
ה
 
ו
א
כ
ל
ת
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
מ
ע
ש
ר
 
ד
ג
נ
ך
 
ת
י
ר
ש
ך
 
ו
י
צ
ה
ר
ך
 
ו
ב
כ
ו
ר
ת
 
ב
ק
ר
ך
 
ו
צ
א
נ
ך
 
ל
מ
ע
ן
 
ת
ל
מ
ד
 
ל
י
ר
א
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
ל
 
ה
י
מ
י
ם
 
ו
כ
י
 
י
ר
ב
ה
 
מ
מ
ך
 
ה
ד
ר
ך
 
כ
י
 
ל
א
 
ת
ו
כ
ל
 
ש
א
ת
ו
 
כ
י
 
י
ר
ח
ק
 
מ
מ
ך
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
כ
י
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
נ
ת
ת
ה
 
ב
כ
ס
ף
 
ו
צ
ר
ת
 
ה
כ
ס
ף
 
ב
י
ד
ך
 
ו
ה
ל
כ
ת
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ו
 
ו
נ
ת
ת
ה
 
ה
כ
ס
ף
 
ב
כ
ל
 
א
ש
ר
 
ת
א
ו
ה
 
נ
פ
ש
ך
 
ב
ב
ק
ר
 
ו
ב
צ
א
ן
 
ב
י
י
ן
 
ו
ב
ש
כ
ר
 
ו
ב
כ
ל
 
א
ש
ר
 
ת
ש
א
ל
ך
 
נ
פ
ש
ך
 
ו
א
כ
ל
ת
 
ש
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ח
ת
 
א
ת
ה
 
ו
ב
י
ת
ך
 
ו
ה
ל
ו
י
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ל
א
 
ת
ע
ז
ב
נ
ו
 
כ
י
 
א
י
ן
 
ל
ו
 
ח
ל
ק
 
ו
נ
ח
ל
ה
 
ע
מ
ך
 
מ
ק
ץ
 
ש
ל
ש
 
ש
נ
י
ם
 
ת
ו
צ
א
 
א
ת
 
כ
ל
 
מ
ע
ש
ר
 
ת
ב
ו
א
ת
ך
 
ב
ש
נ
ה
 
ה
ה
י
א
 
ו
ה
נ
ח
ת
ו
 
ב
ש
ע
ר
י
ך
 
ו
ב
א
 
ה
ל
ו
י
 
כ
י
 
א
י
ן
 
ל
ו
 
ח
ל
ק
 
ו
נ
ח
ל
ה
 
ע
מ
ך
 
ו
ה
ג
ר
 
ו
ה
י
ת
ו
ם
 
ו
ה
א
ל
מ
נ
ה
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ו
א
כ
ל
ו
 
ו
ש
ב
ע
ו
 
ל
מ
ע
ן
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
מ
ע
ש
ה
 
י
ד
י
ך
 
א
ש
ר
 
ת
ע
ש
ה
 
מ
ק
ץ
 
ש
ב
ע
 
ש
נ
י
ם
 
ת
ע
ש
ה
 
ש
מ
ט
ה
 
ו
ז
ה
 
ד
ב
ר
 
ה
ש
מ
ט
ה
 
ש
מ
ט
 
כ
ל
 
ב
ע
ל
 
מ
ש
א
 
י
ד
ו
 
א
ש
ר
 
י
ש
א
 
ב
ר
ע
ה
ו
 
ל
א
 
י
ג
ש
 
א
ת
 
ר
ע
ה
ו
 
א
ת
 
א
ח
י
ו
 
כ
י
 
ק
ר
א
 
ש
מ
ט
ה
 
ל
י
ה
ו
ה
 
א
ת
 
ה
נ
כ
ר
י
 
ת
ג
ש
 
ו
א
ש
ר
 
י
ה
י
ה
 
ל
ך
 
א
ת
 
א
ח
י
ך
 
ת
ש
מ
ט
 
י
ד
ך
 
א
פ
ס
 
כ
י
 
ל
א
 
י
ה
י
ה
 
ב
ך
 
א
ב
י
ו
ן
 
כ
י
 
ב
ר
ו
ך
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
ל
ר
ש
ת
ה
 
ר
ק
 
א
ם
 
ש
מ
ע
 
ת
ש
מ
ע
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
ה
ז
א
ת
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ר
כ
ך
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
ך
 
ו
ה
ע
ב
ט
ת
 
ג
ו
י
ם
 
ר
ב
י
ם
 
ו
א
ת
ה
 
ל
א
 
ת
ע
ב
ט
 
ו
מ
ש
ל
ת
 
ב
ג
ו
י
ם
 
ר
ב
י
ם
 
ו
ב
ך
 
ל
א
 
י
מ
ש
ל
ו
 
כ
י
 
י
ה
י
ה
 
ב
ך
 
א
ב
י
ו
ן
 
מ
א
ח
ד
 
א
ח
י
ך
 
ב
א
ח
ת
 
ש
ע
ר
י
ך
 
ב
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
א
 
ת
א
מ
ץ
 
א
ת
 
ל
ב
ב
ך
 
ו
ל
א
 
ת
כ
פ
ץ
 
א
ת
 
י
ד
ך
 
מ
א
ח
י
ך
 
ה
א
ב
י
ו
ן
 
כ
י
 
פ
ת
ח
 
ת
פ
ת
ח
 
י
ד
ך
 
ל
ו
 
ה
ע
ב
י
ט
 
ת
ע
ב
י
ט
נ
ו
 
ד
י
 
מ
ח
ס
ר
ו
 
א
ש
ר
 
י
ח
ס
ר
 
ל
ו
 
ה
ש
מ
ר
 
ל
ך
 
פ
ן
 
י
ה
י
ה
 
ד
ב
ר
 
ע
ם
 
ל
ב
ב
ך
 
ב
ל
ע
י
ל
 
ל
א
מ
ר
 
ק
ר
ו
ב
ה
 
ש
נ
ת
 
ה
ש
ב
ע
ה
 
ש
נ
ת
 
ה
ש
מ
ט
ה
 
ו
ר
ע
ה
 
ע
י
נ
ך
 
ב
א
ח
י
ך
 
ה
א
ב
י
ו
ן
 
ו
ל
א
 
ת
ת
ן
 
ל
ו
 
ו
ק
ר
א
 
ע
ל
י
ך
 
א
ל
 
י
ה
ו
ה
 
ו
ה
י
ה
 
ב
ך
 
ח
ט
א
 
נ
ת
ן
 
ת
ת
ן
 
ל
ו
 
ו
ל
א
 
י
ר
ע
 
ב
ל
ב
ב
ך
 
ב
ת
ת
ך
 
ל
ו
 
כ
י
 
ב
ג
ל
ל
 
ה
ד
ב
ר
 
ה
ז
ה
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
מ
ע
ש
י
ך
 
ו
ב
כ
ל
 
מ
ש
ל
ח
 
י
ד
י
ך
 
כ
י
 
ל
א
 
י
ח
ד
ל
 
ה
א
ב
י
ו
ן
 
מ
ק
ר
ב
 
ה
א
ר
ץ
 
ע
ל
 
כ
ן
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ל
א
מ
ר
 
פ
ת
ח
 
ת
פ
ת
ח
 
י
ד
ך
 
ל
א
ח
י
ך
 
ל
ע
נ
י
ך
 
ו
ל
א
ב
י
ו
נ
ך
 
ב
א
ר
צ
ך
 
כ
י
 
י
מ
כ
ר
 
ל
ך
 
א
ח
י
ך
 
ה
ע
ב
ר
י
 
א
ו
 
ה
ע
ב
ר
י
ה
 
ו
ע
ב
ד
ך
 
ש
ש
 
ש
נ
י
ם
 
ו
ב
ש
נ
ה
 
ה
ש
ב
י
ע
י
ת
 
ת
ש
ל
ח
נ
ו
 
ח
פ
ש
י
 
מ
ע
מ
ך
 
ו
כ
י
 
ת
ש
ל
ח
נ
ו
 
ח
פ
ש
י
 
מ
ע
מ
ך
 
ל
א
 
ת
ש
ל
ח
נ
ו
 
ר
י
ק
ם
 
ה
ע
נ
י
ק
 
ת
ע
נ
י
ק
 
ל
ו
 
מ
צ
א
נ
ך
 
ו
מ
ג
ר
נ
ך
 
ו
מ
י
ק
ב
ך
 
כ
א
ש
ר
 
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ת
ת
ן
 
ל
ו
 
ו
ז
כ
ר
ת
 
כ
י
 
ע
ב
ד
 
ה
י
י
ת
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
פ
ד
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ע
ל
 
כ
ן
 
א
נ
כ
י
 
מ
צ
ו
ך
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
ה
י
ו
ם
 
ו
ה
י
ה
 
כ
י
 
י
א
מ
ר
 
א
ל
י
ך
 
ל
א
 
א
צ
א
 
מ
ע
מ
ך
 
כ
י
 
א
ה
ב
ך
 
ו
א
ת
 
ב
י
ת
ך
 
כ
י
 
ט
ו
ב
 
ל
ו
 
ע
מ
ך
 
ו
ל
ק
ח
ת
 
א
ת
 
ה
מ
ר
צ
ע
 
ו
נ
ת
ת
ה
 
ב
א
ז
נ
ו
 
ו
ב
ד
ל
ת
 
ו
ה
י
ה
 
ל
ך
 
ע
ב
ד
 
ע
ו
ל
ם
 
ו
א
ף
 
ל
א
מ
ת
ך
 
ת
ע
ש
ה
 
כ
ן
 
ו
ל
א
 
י
ק
ש
ה
 
ב
ע
י
נ
י
ך
 
ב
ש
ל
ח
ך
 
א
ת
ו
 
ח
פ
ש
י
 
מ
ע
מ
ך
 
כ
י
 
מ
ש
נ
ה
 
ש
כ
ר
 
ש
כ
י
ר
 
ע
ב
ד
ך
 
ש
ש
 
ש
נ
י
ם
 
ו
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
א
ש
ר
 
ת
ע
ש
ה
 
כ
ל
 
ה
ב
כ
ו
ר
 
א
ש
ר
 
י
ו
ל
ד
 
ב
ב
ק
ר
ך
 
ו
ב
צ
א
נ
ך
 
ה
ז
כ
ר
 
ת
ק
ד
י
ש
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ע
ב
ד
 
ב
ב
כ
ו
ר
 
ש
ו
ר
ך
 
ו
ל
א
 
ת
ג
ז
 
א
ת
 
ב
כ
ו
ר
 
צ
א
נ
ך
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ת
א
כ
ל
נ
ו
 
ש
נ
ה
 
ב
ש
נ
ה
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ת
ה
 
ו
ב
י
ת
ך
 
ו
כ
י
 
י
ה
י
ה
 
ב
ו
 
מ
ו
ם
 
פ
ס
ח
 
א
ו
 
ע
ו
ר
 
א
ו
 
כ
ל
 
מ
ו
ם
 
ר
ע
 
ל
א
 
ת
ז
ב
ח
נ
ו
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ש
ע
ר
י
ך
 
ת
א
כ
ל
נ
ו
 
ה
ט
מ
א
 
ו
ה
ט
ה
ו
ר
 
י
ח
ד
ו
 
כ
צ
ב
י
 
ו
כ
א
י
ל
 
ר
ק
 
א
ת
 
ד
מ
ו
 
ל
א
 
ת
א
כ
ל
 
ע
ל
 
ה
א
ר
ץ
 
ת
ש
פ
כ
נ
ו
 
כ
מ
י
ם
 
ש
מ
ו
ר
 
א
ת
 
ח
ד
ש
 
ה
א
ב
י
ב
 
ו
ע
ש
י
ת
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
ב
ח
ד
ש
 
ה
א
ב
י
ב
 
ה
ו
צ
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
מ
צ
ר
י
ם
 
ל
י
ל
ה
 
ו
ז
ב
ח
ת
 
פ
ס
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
צ
א
ן
 
ו
ב
ק
ר
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ל
א
 
ת
א
כ
ל
ו
 
ע
ל
י
ו
 
ח
מ
ץ
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
א
כ
ל
ו
 
ע
ל
י
ו
 
מ
צ
ו
ת
 
ל
ח
ם
 
ע
נ
י
 
כ
י
 
ב
ח
פ
ז
ו
ן
 
י
צ
א
ת
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
מ
ע
ן
 
ת
ז
כ
ר
 
א
ת
 
י
ו
ם
 
צ
א
ת
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
כ
ל
 
י
מ
י
 
ח
י
י
ך
 
ו
ל
א
 
י
ר
א
ה
 
ל
ך
 
ש
א
ר
 
ב
כ
ל
 
ג
ב
ו
ל
ך
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ו
ל
א
 
י
ל
י
ן
 
מ
ן
 
ה
ב
ש
ר
 
א
ש
ר
 
ת
ז
ב
ח
 
ב
י
ן
 
ה
ע
ר
ב
י
ם
 
ב
י
ו
ם
 
ה
ר
א
י
ש
ו
ן
 
ל
ב
ק
ר
 
ו
ל
א
 
ת
ו
כ
ל
 
ל
ז
ב
ח
 
א
ת
 
ה
פ
ס
ח
 
ב
א
ח
ת
 
ש
ע
ר
י
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
כ
י
 
א
ם
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ש
ם
 
ת
ז
ב
ח
 
א
ת
 
ה
פ
ס
ח
 
ב
ע
ר
ב
 
כ
ב
ו
א
 
ה
ש
מ
ש
 
מ
ו
ע
ד
 
צ
א
ת
ך
 
מ
מ
צ
ר
י
ם
 
ו
ב
ש
ל
ת
 
ו
א
כ
ל
ת
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ו
 
ו
פ
נ
י
ת
 
ב
ב
ק
ר
 
ו
ה
ל
כ
ת
 
ל
א
ה
ל
י
ך
 
ש
ש
ת
 
י
מ
י
ם
 
ת
א
כ
ל
 
מ
צ
ו
ת
 
ו
ב
י
ו
ם
 
ה
ש
ב
י
ע
י
 
ח
ג
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ע
ש
ה
 
כ
ל
 
מ
ל
א
כ
ת
 
ע
ב
ד
ה
 
ש
ב
ע
ה
 
ש
ב
ע
ו
ת
 
ת
ס
פ
ר
 
ל
ך
 
מ
ה
ח
ל
ך
 
ח
ר
מ
ש
 
ב
ק
מ
ה
 
ת
ח
ל
 
ל
ס
פ
ר
 
ש
ב
ע
ה
 
ש
ב
ע
ו
ת
 
ו
ע
ש
י
ת
 
ח
ג
 
ש
ב
ע
ו
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ס
ת
 
נ
ד
ב
ת
 
י
ד
י
ך
 
א
ש
ר
 
ת
ת
ן
 
כ
א
ש
ר
 
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ח
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
ה
 
ו
ב
נ
ך
 
ו
ב
ת
ך
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
ו
ה
ל
ו
י
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ו
ה
ג
ר
 
ו
ה
י
ת
ו
ם
 
ו
ה
א
ל
מ
נ
ה
 
א
ש
ר
 
ב
ק
ר
ב
ך
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ו
ז
כ
ר
ת
 
כ
י
 
ע
ב
ד
 
ה
י
י
ת
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ש
מ
ר
ת
 
ו
ע
ש
י
ת
 
א
ת
 
ה
ח
ק
י
ם
 
ה
א
ל
ה
 
ח
ג
 
ה
ס
כ
ו
ת
 
ת
ע
ש
ה
 
ל
ך
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ב
א
ס
פ
ך
 
מ
ג
ר
נ
ך
 
ו
מ
י
ק
ב
ך
 
ו
ש
מ
ח
ת
 
ב
ח
ג
ך
 
א
ת
ה
 
ו
ב
נ
ך
 
ו
ב
ת
ך
 
ע
ב
ד
ך
 
ו
א
מ
ת
ך
 
ו
ה
ל
ו
י
 
ו
ה
ג
ר
 
ו
ה
י
ת
ו
ם
 
ו
ה
א
ל
מ
נ
ה
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ש
ב
ע
ת
 
י
מ
י
ם
 
ת
ח
ג
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
ת
ב
ו
א
ת
ך
 
ו
ב
כ
ל
 
מ
ע
ש
ה
 
י
ד
י
ך
 
ו
ה
י
י
ת
 
א
ך
 
ש
מ
ח
 
ש
ל
ש
 
פ
ע
מ
י
ם
 
ב
ש
נ
ה
 
י
ר
א
ה
 
כ
ל
 
ז
כ
ו
ר
ך
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
ב
ו
 
ב
ח
ג
 
ה
מ
צ
ו
ת
 
ו
ב
ח
ג
 
ה
ש
ב
ע
ו
ת
 
ו
ב
ח
ג
 
ה
ס
כ
ו
ת
 
ו
ל
א
 
י
ר
א
ו
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
ר
ק
י
ם
 
א
י
ש
 
כ
מ
ת
נ
ת
 
י
ד
ו
 
כ
ב
ר
כ
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
נ
ת
ן
 
ל
ך
 
ש
פ
ט
י
ם
 
ו
ש
ט
ר
י
ם
 
ת
ת
ן
 
ל
ך
 
ב
כ
ל
 
ש
ע
ר
י
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
ש
ב
ט
י
ך
 
ו
ש
פ
ט
ו
 
א
ת
 
ה
ע
ם
 
מ
ש
פ
ט
 
צ
ד
ק
 
ל
א
 
ת
ט
ה
 
מ
ש
פ
ט
 
ו
ל
א
 
ת
כ
י
ר
 
פ
נ
י
ם
 
ו
ל
א
 
ת
ק
ח
 
ש
ח
ד
 
כ
י
 
ה
ש
ח
ד
 
י
ע
ו
ר
 
ע
י
נ
י
 
ח
כ
מ
י
ם
 
ו
י
ס
ל
ף
 
ד
ב
ר
י
 
צ
ד
ק
י
ם
 
צ
ד
ק
 
צ
ד
ק
 
ת
ר
ד
ף
 
ל
מ
ע
ן
 
ת
ח
י
ה
 
ו
י
ר
ש
ת
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
א
 
ת
ט
ע
 
ל
ך
 
א
ש
ר
ה
 
כ
ל
 
ע
ץ
 
א
צ
ל
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
ת
ע
ש
ה
 
ל
ך
 
ו
ל
א
 
ת
ק
י
ם
 
ל
ך
 
מ
צ
ב
ה
 
א
ש
ר
 
ש
נ
א
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ז
ב
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ש
ו
ר
 
ו
ש
ה
 
א
ש
ר
 
י
ה
י
ה
 
ב
ו
 
מ
ו
ם
 
כ
ל
 
ד
ב
ר
 
ר
ע
 
כ
י
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ו
א
 
כ
י
 
י
מ
צ
א
 
ב
ק
ר
ב
ך
 
ב
א
ח
ת
 
ש
ע
ר
י
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
א
י
ש
 
א
ו
 
א
ש
ה
 
א
ש
ר
 
י
ע
ש
ה
 
א
ת
 
ה
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ע
ב
ר
 
ב
ר
י
ת
ו
 
ו
י
ל
ך
 
ו
י
ע
ב
ד
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
י
ש
ת
ח
ו
י
 
ל
ה
ם
 
ו
ל
ש
מ
ש
 
א
ו
 
ל
י
ר
ח
 
א
ו
 
ל
כ
ל
 
צ
ב
א
 
ה
ש
מ
י
ם
 
א
ש
ר
 
ל
א
 
צ
ו
י
ת
י
ו
 
ו
ה
ג
י
ד
ו
 
ל
ך
 
ו
ש
מ
ע
ת
 
ו
ד
ר
ש
ת
 
ה
י
י
ט
ב
 
ו
ה
נ
ה
 
א
מ
ת
 
נ
כ
ו
ן
 
ה
ד
ב
ר
 
נ
ע
ש
ת
ה
 
ה
ת
ו
ע
ב
ה
 
ה
ז
א
ת
 
ב
י
ש
ר
א
ל
 
ו
ה
ו
צ
א
ת
 
א
ת
 
ה
א
י
ש
 
ה
ה
ו
א
 
א
ו
 
א
ת
 
ה
א
ש
ה
 
ה
ה
י
א
 
א
ש
ר
 
ע
ש
ו
 
א
ת
 
ה
ד
ב
ר
 
ה
ר
ע
 
ה
ז
ה
 
א
ל
 
ש
ע
ר
י
ך
 
א
ת
 
ה
א
י
ש
 
א
ו
 
א
ת
 
ה
א
ש
ה
 
ו
ס
ק
ל
ת
ם
 
ב
א
ב
נ
י
ם
 
ו
מ
ת
ו
 
ע
ל
 
פ
י
 
ש
נ
י
 
ע
ד
י
ם
 
א
ו
 
ע
ל
 
פ
י
 
ש
ל
ש
ה
 
ע
ד
י
ם
 
י
ו
מ
ת
 
ה
מ
ת
 
ל
א
 
י
ו
מ
ת
 
ע
ל
 
פ
י
 
ע
ד
 
א
ח
ד
 
י
ד
 
ה
ע
ד
י
ם
 
ת
ה
י
ה
 
ב
ו
 
ב
ר
א
י
ש
ו
נ
ה
 
ל
ה
מ
י
ת
ו
 
ו
י
ד
 
כ
ל
 
ה
ע
ם
 
ב
א
ח
ר
נ
ה
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
כ
י
 
י
פ
ל
א
 
מ
מ
ך
 
ד
ב
ר
 
ל
מ
ש
פ
ט
 
ב
י
ן
 
ד
ם
 
ל
ד
ם
 
ו
ב
י
ן
 
ד
י
ן
 
ל
ד
י
ן
 
ו
ב
י
ן
 
נ
ג
ע
 
ל
נ
ג
ע
 
ד
ב
ר
י
 
ר
י
ב
ו
ת
 
ב
ש
ע
ר
י
ך
 
ו
ק
מ
ת
 
ו
ע
ל
י
ת
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ב
א
ת
 
א
ל
 
ה
כ
ה
נ
י
ם
 
ה
ל
ו
י
ם
 
ו
א
ל
 
ה
ש
ו
פ
ט
 
א
ש
ר
 
י
ה
י
ה
 
ב
י
מ
י
ם
 
ה
ה
ם
 
ו
ד
ר
ש
ו
 
ו
ה
ג
י
ד
ו
 
ל
ך
 
א
ת
 
ד
ב
ר
 
ה
מ
ש
פ
ט
 
ו
ע
ש
י
ת
 
ע
ל
 
פ
י
 
ה
ד
ב
ר
 
א
ש
ר
 
י
ג
י
ד
ו
 
ל
ך
 
מ
ן
 
ה
מ
ק
ו
ם
 
ה
ה
ו
א
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ר
ת
 
ל
ע
ש
ו
ת
 
כ
כ
ל
 
א
ש
ר
 
י
ו
ר
ו
ך
 
ע
ל
 
פ
י
 
ה
ת
ו
ר
ה
 
א
ש
ר
 
י
ו
ר
ו
ך
 
ו
ע
ל
 
פ
י
 
ה
מ
ש
פ
ט
 
א
ש
ר
 
י
א
מ
ר
ו
 
ל
ך
 
ת
ע
ש
ה
 
ו
ל
א
 
ת
ס
ו
ר
 
מ
ן
 
ה
ד
ב
ר
 
א
ש
ר
 
י
ג
י
ד
ו
 
ל
ך
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ו
ה
א
י
ש
 
א
ש
ר
 
י
ע
ש
ה
 
ב
ז
ד
ו
ן
 
ל
ב
ל
ת
י
 
ש
מ
ע
 
א
ל
 
ה
כ
ה
ן
 
ה
ע
מ
ד
 
ל
ש
ר
ת
 
ש
ם
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ו
 
א
ל
 
ה
ש
ו
פ
ט
 
ו
מ
ת
 
ה
א
י
ש
 
ה
ה
ו
א
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
י
ש
ר
א
ל
 
ו
כ
ל
 
ה
ע
ם
 
י
ש
מ
ע
ו
 
ו
י
י
ר
א
ו
 
ו
ל
א
 
י
ז
י
ד
ו
 
ע
ו
ד
 
כ
י
 
ת
ב
ו
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ו
י
ר
ש
ת
 
ו
י
ש
ב
ת
 
ב
ה
 
ו
א
מ
ר
ת
 
א
ש
י
מ
ה
 
ע
ל
י
 
מ
ל
ך
 
כ
כ
ל
 
ה
ג
ו
י
ם
 
א
ש
ר
 
ס
ב
י
ב
ת
י
 
ש
י
ם
 
ת
ש
י
ם
 
ע
ל
י
ך
 
מ
ל
ך
 
א
ש
ר
 
י
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ו
 
מ
ק
ר
ב
 
א
ח
י
ך
 
ת
ש
י
ם
 
ע
ל
י
ך
 
מ
ל
ך
 
ל
א
 
ת
ו
כ
ל
 
ל
ת
ת
 
ע
ל
י
ך
 
א
י
ש
 
נ
כ
ר
י
 
א
ש
ר
 
ל
א
 
א
ח
י
ך
 
ה
ו
א
 
ר
ק
 
ל
א
 
י
ר
ב
ה
 
ל
ו
 
ס
ו
ס
י
ם
 
ו
ל
א
 
י
ש
י
ב
 
א
ת
 
ה
ע
ם
 
מ
צ
ר
י
מ
ה
 
ל
מ
ע
ן
 
ה
ר
ב
ו
ת
 
ס
ו
ס
 
ו
י
ה
ו
ה
 
ה
א
מ
ר
 
ל
כ
ם
 
ל
א
 
ת
ו
ס
י
פ
ו
ן
 
ל
ש
ו
ב
 
ב
ד
ר
ך
 
ה
ז
ה
 
ע
ו
ד
 
ו
ל
א
 
י
ר
ב
ה
 
ל
ו
 
נ
ש
י
ם
 
ו
ל
א
 
י
ס
ו
ר
 
ל
ב
ב
ו
 
ו
כ
ס
ף
 
ו
ז
ה
ב
 
ל
א
 
י
ר
ב
ה
 
ל
ו
 
מ
א
ד
 
ו
ה
י
ה
 
כ
ש
ב
ת
ו
 
ע
ל
 
כ
ס
א
 
מ
מ
ל
כ
ת
ו
 
ו
כ
ת
ב
 
ל
ו
 
א
ת
 
מ
ש
נ
ה
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ע
ל
 
ס
פ
ר
 
מ
ל
פ
נ
י
 
ה
כ
ה
נ
י
ם
 
ה
ל
ו
י
ם
 
ו
ה
י
ת
ה
 
ע
מ
ו
 
ו
ק
ר
א
 
ב
ה
 
כ
ל
 
י
מ
י
 
ח
י
י
ו
 
ל
מ
ע
ן
 
י
ל
מ
ד
 
ל
י
ר
א
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ו
 
ל
ש
מ
ר
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
א
ת
 
ה
ח
ק
י
ם
 
ה
א
ל
ה
 
ל
ע
ש
ו
ת
ם
 
ל
ב
ל
ת
י
 
ר
ם
 
ל
ב
ב
ו
 
מ
א
ח
י
ו
 
ו
ל
ב
ל
ת
י
 
ס
ר
 
מ
ן
 
ה
מ
צ
ו
ה
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ל
מ
ע
ן
 
י
א
ר
י
ך
 
י
מ
י
ם
 
ע
ל
 
כ
ס
א
 
מ
מ
ל
כ
ת
ו
 
ה
ו
א
 
ו
ב
נ
י
ו
 
ב
ק
ר
ב
 
י
ש
ר
א
ל
 
ל
א
 
י
ה
י
ה
 
ל
כ
ה
נ
י
ם
 
ה
ל
ו
י
ם
 
כ
ל
 
ש
ב
ט
 
ל
ו
י
 
ח
ל
ק
 
ו
נ
ח
ל
ה
 
ע
ם
 
י
ש
ר
א
ל
 
א
ש
י
 
י
ה
ו
ה
 
ו
נ
ח
ל
ת
ו
 
י
א
כ
ל
ו
ן
 
ו
נ
ח
ל
ה
 
ל
א
 
י
ה
י
ה
 
ל
ו
 
ב
ק
ר
ב
 
א
ח
י
ו
 
י
ה
ו
ה
 
ה
ו
א
 
נ
ח
ל
ת
ו
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
ו
 
ו
ז
ה
 
י
ה
י
ה
 
מ
ש
פ
ט
 
ה
כ
ה
נ
י
ם
 
מ
א
ת
 
ה
ע
ם
 
מ
א
ת
 
ז
ב
ח
י
 
ה
ז
ב
ח
 
א
ם
 
ש
ו
ר
 
א
ם
 
ש
ה
 
ו
נ
ת
ן
 
ל
כ
ה
ן
 
ה
ז
ר
ו
ע
 
ו
ה
ל
ח
י
ם
 
ו
ה
ק
ב
ה
 
ר
א
ש
י
ת
 
ד
ג
נ
ך
 
ת
י
ר
ש
ך
 
ו
י
צ
ה
ר
ך
 
ו
ר
א
ש
י
ת
 
ג
ז
 
צ
א
נ
ך
 
ת
ת
ן
 
ל
ו
 
כ
י
 
ב
ו
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
כ
ל
 
ש
ב
ט
י
ך
 
ל
ע
מ
ד
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
ר
ת
ו
 
ו
ל
ב
ר
ך
 
ב
ש
מ
ו
 
ה
ו
א
 
ו
ב
נ
י
ו
 
כ
ל
 
ה
י
מ
י
ם
 
ו
כ
י
 
י
ב
ו
א
 
ה
ל
ו
י
 
מ
א
ח
ת
 
ש
ע
ר
י
ך
 
מ
כ
ל
 
י
ש
ר
א
ל
 
א
ש
ר
 
ה
ו
א
 
ג
ר
 
ש
ם
 
ו
ב
א
 
ב
כ
ל
 
א
ו
ת
 
נ
פ
ש
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
ו
ש
ר
ת
 
ב
ש
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ו
 
כ
כ
ל
 
א
ח
י
ו
 
ה
ל
ו
י
ם
 
ה
ע
מ
ד
י
ם
 
ש
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ח
ל
ק
 
כ
ח
ל
ק
 
י
א
כ
ל
 
ל
ב
ד
 
מ
מ
כ
ר
ו
 
ע
ל
 
ה
א
ב
ו
ת
 
כ
י
 
א
ת
ה
 
ב
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
א
 
ת
ל
מ
ד
 
ל
ע
ש
ו
ת
 
כ
ת
ו
ע
ב
ו
ת
 
ה
ג
ו
י
ם
 
ה
ה
ם
 
ל
א
 
י
מ
צ
א
 
ב
ך
 
מ
ע
ב
י
ר
 
ב
נ
ו
 
ו
ב
ת
ו
 
ב
א
ש
 
ק
ס
ם
 
ק
ס
מ
י
ם
 
מ
ע
נ
ן
 
מ
נ
ח
ש
 
מ
כ
ש
ף
 
ח
ב
ר
 
ח
ב
ר
 
ש
א
ל
 
א
ו
ב
 
א
ו
 
י
ד
ע
ו
נ
י
 
ו
ד
ר
ש
 
א
ל
 
ה
מ
ת
י
ם
 
כ
י
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
ל
 
ע
ש
ה
 
א
ל
ה
 
ו
ב
ג
ל
ל
 
ה
ת
ו
ע
ב
ו
ת
 
ה
א
ל
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ו
ר
י
ש
ם
 
מ
פ
נ
י
ך
 
ת
מ
י
ם
 
ת
ה
י
ה
 
ע
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
א
ת
ם
 
י
ר
ש
י
ם
 
א
ת
ם
 
א
ל
 
ה
מ
ע
נ
נ
י
ם
 
ו
א
ל
 
ה
ק
ס
מ
י
ם
 
י
ש
מ
ע
ו
 
ו
א
ת
ה
 
ל
א
 
כ
ן
 
נ
ת
ן
 
ל
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ב
י
א
 
מ
ק
ר
ב
 
א
ח
י
ך
 
כ
מ
ו
נ
י
 
י
ק
י
ם
 
ל
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
י
ו
 
ת
ש
מ
ע
ו
ן
 
כ
כ
ל
 
א
ש
ר
 
ש
א
ל
ת
 
מ
ע
ם
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ח
ו
ר
ב
 
ב
י
ו
ם
 
ה
ק
ה
ל
 
ל
א
מ
ר
 
ל
א
 
א
ו
ס
י
ף
 
ל
ש
מ
ע
 
א
ת
 
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
 
ו
א
ת
 
א
ש
ו
 
ה
ג
ד
ל
ה
 
ה
ז
א
ת
 
ל
א
 
א
ר
א
ה
 
ע
ו
ד
 
ו
ל
א
 
א
מ
ו
ת
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
 
ה
ט
י
ב
ו
 
א
ש
ר
 
ד
ב
ר
ו
 
נ
ב
י
א
 
א
ק
י
ם
 
ל
ה
ם
 
מ
ק
ר
ב
 
א
ח
י
ה
ם
 
כ
מ
ו
ך
 
ו
נ
ת
ת
י
 
ד
ב
ר
י
 
ב
פ
י
ו
 
ו
ד
ב
ר
 
א
ל
י
ה
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
א
צ
ו
נ
ו
 
ו
ה
י
ה
 
ה
א
י
ש
 
א
ש
ר
 
ל
א
 
י
ש
מ
ע
 
א
ל
 
ד
ב
ר
י
ו
 
א
ש
ר
 
י
ד
ב
ר
 
ב
ש
מ
י
 
א
נ
כ
י
 
א
ד
ר
ש
 
מ
ע
מ
ו
 
א
ך
 
ה
נ
ב
י
א
 
א
ש
ר
 
י
ז
י
ד
 
ל
ד
ב
ר
 
ד
ב
ר
 
ב
ש
מ
י
 
א
ת
 
א
ש
ר
 
ל
א
 
צ
ו
י
ת
י
ו
 
ל
ד
ב
ר
 
ו
א
ש
ר
 
י
ד
ב
ר
 
ב
ש
ם
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
מ
ת
 
ה
נ
ב
י
א
 
ה
ה
ו
א
 
ו
כ
י
 
ת
א
מ
ר
 
ב
ל
ב
ב
ך
 
א
י
ך
 
נ
ו
ד
ע
 
א
ת
 
ה
ד
ב
ר
 
א
ש
ר
 
ל
א
 
ד
ב
ר
ו
 
י
ה
ו
ה
 
א
ש
ר
 
י
ד
ב
ר
 
ה
נ
ב
י
א
 
ב
ש
ם
 
י
ה
ו
ה
 
ל
א
 
י
ה
י
ה
 
ה
ד
ב
ר
 
ו
ל
א
 
י
ב
ו
א
 
ה
ו
א
 
ה
ד
ב
ר
 
א
ש
ר
 
ל
א
 
ד
ב
ר
ו
 
י
ה
ו
ה
 
ב
ז
ד
ו
ן
 
ד
ב
ר
ו
 
ה
נ
ב
י
א
 
ל
א
 
ת
ג
ו
ר
 
מ
מ
נ
ו
 
כ
י
 
י
כ
ר
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ה
ג
ו
י
ם
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
א
ת
 
א
ר
צ
ם
 
ו
י
ר
ש
ת
ם
 
ו
י
ש
ב
ת
 
ב
ע
ר
י
ה
ם
 
ו
ב
ב
ת
י
ה
ם
 
ש
ל
ש
 
ע
ר
י
ם
 
ת
ב
ד
י
ל
 
ל
ך
 
ב
ת
ו
ך
 
א
ר
צ
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
ר
ש
ת
ה
 
ת
כ
ן
 
ל
ך
 
ה
ד
ר
ך
 
ו
ש
ל
ש
ת
 
א
ת
 
ג
ב
ו
ל
 
א
ר
צ
ך
 
א
ש
ר
 
י
נ
ח
י
ל
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
י
ה
 
ל
נ
ו
ס
 
ש
מ
ה
 
כ
ל
 
ר
צ
ח
 
ו
ז
ה
 
ד
ב
ר
 
ה
ר
צ
ח
 
א
ש
ר
 
י
נ
ו
ס
 
ש
מ
ה
 
ו
ח
י
 
א
ש
ר
 
י
כ
ה
 
א
ת
 
ר
ע
ה
ו
 
ב
ב
ל
י
 
ד
ע
ת
 
ו
ה
ו
א
 
ל
א
 
ש
נ
א
 
ל
ו
 
מ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ו
א
ש
ר
 
י
ב
ו
א
 
א
ת
 
ר
ע
ה
ו
 
ב
י
ע
ר
 
ל
ח
ט
ב
 
ע
צ
י
ם
 
ו
נ
ד
ח
 
י
ד
ו
 
ב
ג
ר
ז
ן
 
ל
כ
ר
ת
 
ה
ע
ץ
 
ו
נ
ש
ל
 
ה
ב
ר
ז
ל
 
מ
ן
 
ה
ע
ץ
 
ו
מ
צ
א
 
א
ת
 
ר
ע
ה
ו
 
ו
מ
ת
 
ה
ו
א
 
י
נ
ו
ס
 
א
ל
 
א
ח
ת
 
מ
ן
 
ה
ע
ר
י
ם
 
ה
א
ל
ה
 
ו
ח
י
 
פ
ן
 
י
ר
ד
ף
 
ג
א
ל
 
ה
ד
ם
 
א
ח
ר
י
 
ה
ר
צ
ח
 
כ
י
 
י
ח
ם
 
ל
ב
ב
ו
 
ו
ה
ש
י
ג
ו
 
כ
י
 
י
ר
ב
ה
 
ה
ד
ר
ך
 
ו
ה
כ
ה
ו
 
נ
פ
ש
 
ו
ל
ו
 
א
י
ן
 
מ
ש
פ
ט
 
מ
ו
ת
 
כ
י
 
ל
א
 
ש
נ
א
 
ה
ו
א
 
ל
ו
 
מ
ת
מ
ו
ל
 
ש
ל
ש
ו
ם
 
ע
ל
 
כ
ן
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ל
א
מ
ר
 
ש
ל
ש
 
ע
ר
י
ם
 
ת
ב
ד
י
ל
 
ל
ך
 
ו
א
ם
 
י
ר
ח
י
ב
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ג
ב
ו
ל
ך
 
כ
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
י
ך
 
ו
נ
ת
ן
 
ל
ך
 
א
ת
 
כ
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
ד
ב
ר
 
ל
ת
ת
 
ל
א
ב
ת
י
ך
 
כ
י
 
ת
ש
מ
ר
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
ה
ז
א
ת
 
ל
ע
ש
ו
ת
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
א
ה
ב
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ל
כ
ת
 
ב
ד
ר
כ
י
ו
 
כ
ל
 
ה
י
מ
י
ם
 
ו
י
ס
פ
ת
 
ל
ך
 
ע
ו
ד
 
ש
ל
ש
 
ע
ר
י
ם
 
ע
ל
 
ה
ש
ל
ש
 
ה
א
ל
ה
 
ו
ל
א
 
י
ש
פ
ך
 
ד
ם
 
נ
ק
י
א
 
ב
ק
ר
ב
 
א
ר
צ
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
ו
ה
י
ה
 
ע
ל
י
ך
 
ד
מ
י
ם
 
כ
י
 
י
ה
י
ה
 
א
י
ש
 
ש
נ
א
 
ל
ר
ע
ה
ו
 
ו
א
ר
ב
 
ל
ו
 
ו
ק
ם
 
ע
ל
י
ו
 
ו
ה
כ
ה
ו
 
נ
פ
ש
 
ו
מ
ת
 
ו
נ
ס
 
א
ל
 
א
ח
ת
 
מ
ן
 
ה
ע
ר
י
ם
 
ה
א
ל
ה
 
ו
ש
ל
ח
ו
 
ז
ק
נ
י
 
ע
י
ר
ו
 
ו
ל
ק
ח
ו
 
א
ת
ו
 
מ
ש
ם
 
ו
נ
ת
נ
ו
 
א
ת
ו
 
ב
י
ד
 
ג
א
ל
 
ה
ד
ם
 
ו
ה
ו
מ
ת
 
ל
א
 
ת
ח
ו
ס
 
ע
י
נ
ך
 
ע
ל
י
ו
 
ו
ב
ע
ר
ת
 
ה
ד
ם
 
ה
נ
ק
י
א
 
מ
י
ש
ר
א
ל
 
ו
ט
ו
ב
 
ל
ך
 
ל
א
 
ת
ס
י
ג
 
ג
ב
ו
ל
 
ר
ע
ך
 
א
ש
ר
 
ג
ב
ל
ו
 
ר
א
י
ש
ו
נ
י
ם
 
ב
נ
ח
ל
ת
ך
 
א
ש
ר
 
ת
נ
ח
ל
 
ב
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
ר
ש
ת
ה
 
ל
א
 
י
ק
ו
ם
 
ע
ד
 
א
ח
ד
 
ב
א
י
ש
 
ל
כ
ל
 
ע
ו
ן
 
ו
ל
כ
ל
 
ח
ט
א
 
ב
כ
ל
 
ח
ט
א
 
א
ש
ר
 
י
ח
ט
א
 
ע
ל
 
פ
י
 
ש
נ
י
 
ע
ד
י
ם
 
א
ו
 
ע
ל
 
פ
י
 
ש
ל
ש
ה
 
ע
ד
י
ם
 
י
ק
ו
ם
 
ד
ב
ר
 
ו
כ
י
 
י
ק
ו
ם
 
ע
ד
 
ח
מ
ס
 
ב
א
י
ש
 
ל
ע
נ
ו
ת
 
ב
ו
 
ס
ר
ה
 
ו
ע
מ
ד
ו
 
ש
נ
י
 
ה
א
נ
ש
י
ם
 
א
ש
ר
 
ל
ה
ם
 
ה
ר
י
ב
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ל
פ
נ
י
 
ה
כ
ה
נ
י
ם
 
ו
ה
ש
פ
ט
י
ם
 
א
ש
ר
 
י
ה
י
ה
 
ב
י
מ
י
ם
 
ה
ה
ם
 
ו
ד
ר
ש
ו
 
ה
ש
פ
ט
י
ם
 
ה
י
י
ט
ב
 
ו
ה
נ
ה
 
ע
ד
 
ש
ק
ר
 
ה
ע
ד
 
ש
ק
ר
 
ע
נ
ה
 
ב
א
ח
י
ו
 
ו
ע
ש
י
ת
ם
 
ל
ו
 
כ
א
ש
ר
 
ז
מ
ם
 
ל
ע
ש
ו
ת
 
ל
א
ח
י
ו
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
ו
ה
נ
ש
א
ר
י
ם
 
י
ש
מ
ע
ו
 
ו
י
י
ר
א
ו
 
ו
ל
א
 
י
ו
ס
י
פ
ו
 
ע
ו
ד
 
ל
ע
ש
ו
ת
 
כ
ד
ב
ר
 
ה
ר
ע
 
ה
ז
ה
 
ב
ק
ר
ב
ך
 
ל
א
 
ת
ח
ו
ס
 
ע
י
נ
ך
 
נ
פ
ש
 
ב
נ
פ
ש
 
ע
י
ן
 
ב
ע
י
ן
 
ש
ן
 
ב
ש
ן
 
י
ד
 
ב
י
ד
 
ר
ג
ל
 
ב
ר
ג
ל
 
כ
י
 
ת
צ
א
 
ל
מ
ל
ח
מ
ה
 
ע
ל
 
א
י
ב
י
ך
 
ו
ר
א
י
ת
 
ס
ו
ס
 
ו
ר
כ
ב
 
ו
ע
ם
 
ר
ב
 
מ
מ
ך
 
ל
א
 
ת
י
ר
א
 
מ
ה
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ע
מ
ך
 
ה
מ
ע
ל
ך
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
ה
י
ה
 
כ
ק
ר
ב
כ
ם
 
א
ל
 
ה
מ
ל
ח
מ
ה
 
ו
נ
ג
ש
 
ה
כ
ה
ן
 
ו
ד
ב
ר
 
א
ל
 
ה
ע
ם
 
ו
א
מ
ר
 
א
ל
י
ה
ם
 
ש
מ
ע
 
י
ש
ר
א
ל
 
א
ת
ם
 
ק
ר
ב
י
ם
 
ה
י
ו
ם
 
ל
מ
ל
ח
מ
ה
 
ע
ל
 
א
י
ב
י
כ
ם
 
א
ל
 
י
ר
ך
 
ל
ב
ב
כ
ם
 
א
ל
 
ת
י
ר
א
ו
 
ו
א
ל
 
ת
ע
ר
צ
ו
 
ו
א
ל
 
ת
ח
פ
ז
ו
 
מ
פ
נ
י
ה
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ה
ה
ל
ך
 
ע
מ
כ
ם
 
ל
ה
ל
ח
ם
 
ל
כ
ם
 
ע
ם
 
א
י
ב
י
כ
ם
 
ו
ל
ה
ו
ש
י
ע
 
א
ת
כ
ם
 
ו
ד
ב
ר
ו
 
ה
ש
ט
ר
י
ם
 
א
ל
 
ה
ע
ם
 
ל
א
מ
ר
 
מ
י
 
ה
א
י
ש
 
א
ש
ר
 
ב
נ
ה
 
ב
י
ת
 
ח
ד
ש
 
ו
ל
א
 
ח
נ
כ
ו
 
י
ל
ך
 
ו
י
ש
ו
ב
 
ל
ב
י
ת
ו
 
פ
ן
 
י
מ
ו
ת
 
ב
מ
ל
ח
מ
ה
 
ו
א
י
ש
 
א
ח
ר
 
י
ח
נ
כ
נ
ו
 
ו
מ
י
 
ה
א
י
ש
 
א
ש
ר
 
נ
ט
ע
 
כ
ר
ם
 
ו
ל
א
 
ח
ל
ל
ו
 
י
ל
ך
 
ו
י
ש
ו
ב
 
ל
ב
י
ת
ו
 
פ
ן
 
י
מ
ו
ת
 
ב
מ
ל
ח
מ
ה
 
ו
א
י
ש
 
א
ח
ר
 
י
ח
ל
ל
נ
ו
 
ו
מ
י
 
ה
א
י
ש
 
א
ש
ר
 
א
ר
ש
 
א
ש
ה
 
ו
ל
א
 
ל
ק
ח
ה
 
י
ל
ך
 
ו
י
ש
ו
ב
 
ל
ב
י
ת
ו
 
פ
ן
 
י
מ
ו
ת
 
ב
מ
ל
ח
מ
ה
 
ו
א
י
ש
 
א
ח
ר
 
י
ק
ח
נ
ה
 
ו
י
ו
ס
י
פ
ו
 
ה
ש
ט
ר
י
ם
 
ל
ד
ב
ר
 
א
ל
 
ה
ע
ם
 
ו
א
מ
ר
ו
 
מ
י
 
ה
א
י
ש
 
ה
י
ר
א
 
ו
ר
ך
 
ה
ל
ב
ב
 
י
ל
ך
 
ו
י
ש
ו
ב
 
ל
ב
י
ת
ו
 
ו
ל
א
 
י
מ
י
ס
 
א
ת
 
ל
ב
ב
 
א
ח
י
ו
 
כ
ל
ב
ב
ו
 
ו
ה
י
ה
 
כ
כ
ל
ו
ת
 
ה
ש
ט
ר
י
ם
 
ל
ד
ב
ר
 
א
ל
 
ה
ע
ם
 
ו
פ
ק
ד
ו
 
ש
ר
י
 
צ
ב
א
ו
ת
 
ב
ר
א
ש
 
ה
ע
ם
 
כ
י
 
ת
ק
ר
ב
 
ע
ל
 
ע
י
ר
 
ל
ה
ל
ח
ם
 
ע
ל
י
ה
 
ו
ק
ר
א
ת
 
א
ל
י
ה
 
ל
ש
ל
ו
ם
 
ו
ה
י
ה
 
א
ם
 
ש
ל
ו
ם
 
ת
ע
נ
ך
 
ו
פ
ת
ח
ה
 
ל
ך
 
ו
ה
י
ה
 
כ
ל
 
ה
ע
ם
 
ה
נ
מ
צ
א
 
ב
ה
 
י
ה
י
ו
 
ל
ך
 
ל
מ
ס
 
ו
ע
ב
ד
ו
ך
 
ו
א
ם
 
ל
א
 
ת
ש
ל
י
ם
 
ע
מ
ך
 
ו
ע
ש
ת
ה
 
ע
מ
ך
 
מ
ל
ח
מ
ה
 
ו
צ
ר
ת
 
ע
ל
י
ה
 
ו
נ
ת
נ
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
י
ד
ך
 
ו
ה
כ
י
ת
 
א
ת
 
כ
ל
 
ז
כ
ו
ר
ה
 
ל
פ
י
 
ח
ר
ב
 
ר
ק
 
ה
נ
ש
י
ם
 
ו
ה
ט
ף
 
ו
ה
ב
ה
מ
ה
 
ו
כ
ל
 
א
ש
ר
 
י
ה
י
ה
 
ב
ע
י
ר
 
כ
ל
 
ש
ל
ל
ה
 
ת
ב
ז
 
ל
ך
 
ו
א
כ
ל
ת
 
א
ת
 
ש
ל
ל
 
א
י
ב
י
ך
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ך
 
כ
ן
 
ת
ע
ש
ה
 
ל
כ
ל
 
ה
ע
ר
י
ם
 
ה
ר
ח
ו
ק
ו
ת
 
מ
מ
ך
 
מ
א
ד
 
א
ש
ר
 
ל
א
 
מ
ע
ר
י
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
ה
נ
ה
 
ר
ק
 
מ
ע
ר
י
 
ה
ע
מ
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
ל
א
 
ת
ח
י
ה
 
כ
ל
 
נ
ש
מ
ה
 
כ
י
 
ה
ח
ר
י
ם
 
ת
ח
ר
י
מ
ם
 
ה
כ
נ
ע
נ
י
 
ו
ה
א
מ
ר
י
 
ו
ה
ח
ת
י
 
ו
ה
ג
ר
ג
ש
י
 
ו
ה
פ
ר
ז
י
 
ו
ה
ח
ו
י
 
ו
ה
י
ב
ו
ס
י
 
כ
א
ש
ר
 
צ
ו
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
מ
ע
ן
 
א
ש
ר
 
ל
א
 
י
ל
מ
ד
ו
 
א
ת
כ
ם
 
ל
ע
ש
ו
ת
 
כ
כ
ל
 
ת
ו
ע
ב
ת
ם
 
א
ש
ר
 
ע
ש
ו
 
ל
א
ל
ה
י
ה
ם
 
ו
ח
ט
א
ת
ם
 
ל
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
כ
י
 
ת
צ
ו
ר
 
ע
ל
 
ע
י
ר
 
י
מ
י
ם
 
ר
ב
י
ם
 
ל
ה
ל
ח
ם
 
ע
ל
י
ה
 
ל
ת
פ
ש
ה
 
ל
א
 
ת
ש
ח
י
ת
 
א
ת
 
ע
צ
ה
 
ל
נ
ד
ח
 
ע
ל
י
ו
 
ג
ר
ז
ן
 
כ
י
 
מ
מ
נ
ו
 
ת
א
כ
ל
 
ו
א
ת
ו
 
ל
א
 
ת
כ
ר
י
ת
 
כ
י
 
ה
א
ד
ם
 
ע
ץ
 
ה
ש
ד
ה
 
ל
ב
ו
א
 
מ
פ
נ
י
ך
 
ב
מ
צ
ו
ר
 
ר
ק
 
ע
ץ
 
א
ש
ר
 
ת
ד
ע
 
כ
י
 
ל
א
 
ע
ץ
 
מ
א
כ
ל
 
ה
ו
א
 
א
ת
ו
 
ת
ש
ח
י
ת
 
ו
כ
ר
ת
 
ו
ב
נ
י
ת
 
מ
צ
ו
ר
 
ע
ל
 
ה
ע
י
ר
 
א
ש
ר
 
ה
י
א
 
ע
ש
ת
ה
 
ע
מ
ך
 
מ
ל
ח
מ
ה
 
ע
ד
 
ר
ד
ת
ה
 
כ
י
 
י
מ
צ
א
 
ח
ל
ל
 
ב
א
ד
מ
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ל
ר
ש
ת
ה
 
נ
פ
ל
 
ב
ש
ד
ה
 
ל
א
 
נ
ו
ד
ע
 
מ
י
 
ה
כ
ה
ו
 
ו
י
צ
א
ו
 
ז
ק
נ
י
ך
 
ו
ש
ט
ר
י
ך
 
ו
מ
ד
ד
ו
 
ע
ל
 
ה
ע
ר
י
ם
 
א
ש
ר
 
ס
ב
י
ב
ת
 
ה
ח
ל
ל
 
ו
ה
י
ה
 
ה
ע
י
ר
 
ה
ק
ר
ו
ב
ה
 
א
ל
 
ה
ח
ל
ל
 
ו
ל
ק
ח
ו
 
ז
ק
נ
י
 
ה
ע
י
ר
 
ה
ה
י
א
 
ע
ג
ל
ת
 
ב
ק
ר
 
א
ש
ר
 
ל
א
 
ע
ב
ד
 
ב
ה
 
ו
א
ש
ר
 
ל
א
 
מ
ש
כ
ה
 
ב
ע
ל
 
ו
ה
ו
ר
י
ד
ו
 
ז
ק
נ
י
 
ה
ע
י
ר
 
ה
ה
י
א
 
א
ת
 
ה
ע
ג
ל
ה
 
א
ל
 
נ
ח
ל
 
א
י
ת
ן
 
א
ש
ר
 
ל
א
 
י
ע
ב
ד
 
ב
ו
 
ו
ל
א
 
י
ז
ר
ע
 
ו
ע
ר
פ
ו
 
ש
ם
 
א
ת
 
ה
ע
ג
ל
ה
 
ב
נ
ח
ל
 
ו
נ
ג
ש
ו
 
ה
כ
ה
נ
י
ם
 
ב
נ
י
 
ל
ו
י
 
כ
י
 
ב
ם
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
ר
ת
 
ו
ל
ב
ר
ך
 
ב
ש
ם
 
י
ה
ו
ה
 
ו
ע
ל
 
פ
י
ם
 
י
ה
י
ה
 
כ
ל
 
ר
י
ב
 
ו
כ
ל
 
נ
ג
ע
 
ו
כ
ל
 
ז
ק
נ
י
 
ה
ע
י
ר
 
ה
ק
ר
ו
ב
י
ם
 
א
ל
 
ה
ח
ל
ל
 
י
ר
ח
צ
ו
 
א
ת
 
י
ד
י
ה
ם
 
ע
ל
 
ה
ע
ג
ל
ה
 
ה
ע
ר
ו
פ
ה
 
ב
נ
ח
ל
 
ו
ע
נ
ו
 
ו
א
מ
ר
ו
 
י
ד
י
נ
ו
 
ל
א
 
ש
פ
כ
ו
 
א
ת
 
ה
ד
ם
 
ה
ז
ה
 
ו
ע
י
נ
י
נ
ו
 
ל
א
 
ר
א
ו
 
כ
פ
ר
 
ל
ע
מ
ך
 
י
ש
ר
א
ל
 
א
ש
ר
 
פ
ד
י
ת
 
י
ה
ו
ה
 
ו
א
ל
 
ת
ת
ן
 
ד
ם
 
נ
ק
י
א
 
ב
ק
ר
ב
 
ע
מ
ך
 
י
ש
ר
א
ל
 
ו
נ
כ
פ
ר
 
ל
ה
ם
 
ה
ד
ם
 
ו
א
ת
ה
 
ת
ב
ע
ר
 
ה
ד
ם
 
ה
נ
ק
י
א
 
מ
ק
ר
ב
ך
 
כ
י
 
ת
ע
ש
ה
 
ה
י
ש
ר
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
כ
י
 
ת
צ
א
 
ל
מ
ל
ח
מ
ה
 
ע
ל
 
א
י
ב
י
ך
 
ו
נ
ת
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
י
ד
ך
 
ו
ש
ב
י
ת
 
ש
ב
י
ו
 
ו
ר
א
י
ת
 
ב
ש
ב
י
ו
 
א
ש
ה
 
י
פ
ת
 
ת
א
ר
 
ו
ח
ש
ק
ת
 
ב
ה
 
ו
ל
ק
ח
ת
ה
 
ל
ך
 
ל
א
ש
ה
 
ו
ה
ב
א
ת
ה
 
א
ל
 
ת
ו
ך
 
ב
י
ת
ך
 
ו
ג
ל
ח
ה
 
א
ת
 
ר
א
ש
ה
 
ו
ע
ש
ת
ה
 
א
ת
 
צ
פ
ר
נ
י
ה
 
ו
ה
ס
י
ר
ה
 
א
ת
 
ש
מ
ל
ת
 
ש
ב
י
ה
 
מ
ע
ל
י
ה
 
ו
י
ש
ב
ה
 
ב
ב
י
ת
ך
 
ו
ב
כ
ת
ה
 
א
ת
 
א
ב
י
ה
 
ו
א
ת
 
א
מ
ה
 
י
ר
ח
 
י
מ
י
ם
 
ו
א
ח
ר
 
כ
ן
 
ת
ב
ו
א
 
א
ל
י
ה
 
ו
ב
ע
ל
ת
ה
 
ו
ה
י
ת
ה
 
ל
ך
 
ל
א
ש
ה
 
ו
ה
י
ה
 
א
ם
 
ל
א
 
ח
פ
צ
ת
 
ב
ה
 
ו
ש
ל
ח
ת
ה
 
ל
נ
פ
ש
ה
 
ו
מ
כ
ר
 
ל
א
 
ת
מ
כ
ר
נ
ה
 
ב
כ
ס
ף
 
ל
א
 
ת
ת
ע
מ
ר
 
ב
ה
 
ת
ח
ת
 
א
ש
ר
 
ע
נ
ת
ה
 
כ
י
 
ת
ה
י
י
נ
ה
 
ל
א
י
ש
 
ש
ת
י
 
נ
ש
י
ם
 
א
ח
ת
 
א
ה
ו
ב
ה
 
ו
א
ח
ת
 
ש
נ
ו
א
ה
 
ו
י
ל
ד
ו
 
ל
ו
 
ב
נ
י
ם
 
ה
א
ה
ו
ב
ה
 
ו
ה
ש
נ
ו
א
ה
 
ו
ה
י
ה
 
ה
ב
ן
 
ה
ב
כ
ו
ר
 
ל
ש
נ
ו
א
ה
 
ו
ה
י
ה
 
ב
י
ו
ם
 
ה
נ
ח
י
ל
ו
 
א
ת
 
ב
נ
י
ו
 
א
ת
 
א
ש
ר
 
י
ה
י
ה
 
ל
ו
 
ל
א
 
י
ו
כ
ל
 
ל
ב
כ
ר
 
א
ת
 
ב
ן
 
ה
א
ה
ו
ב
ה
 
ע
ל
 
פ
נ
י
 
ב
ן
 
ה
ש
נ
ו
א
ה
 
ה
ב
כ
ו
ר
 
כ
י
 
א
ת
 
ה
ב
כ
ו
ר
 
ב
ן
 
ה
ש
נ
ו
א
ה
 
י
כ
י
ר
 
ל
ת
ת
 
ל
ו
 
פ
י
 
ש
נ
י
ם
 
ב
כ
ל
 
א
ש
ר
 
י
מ
צ
א
 
ל
ו
 
כ
י
 
ה
ו
א
 
ר
א
ש
י
ת
 
א
ו
נ
ו
 
ו
ל
ו
 
מ
ש
פ
ט
 
ה
ב
כ
ו
ר
ה
 
כ
י
 
י
ה
י
ה
 
ל
א
י
ש
 
ב
ן
 
ס
ו
ר
ר
 
ו
מ
ו
ר
ה
 
א
י
נ
נ
ו
 
ש
מ
ע
 
ב
ק
ו
ל
 
א
ב
י
ו
 
ו
ב
ק
ו
ל
 
א
מ
ו
 
ו
י
ס
ר
ו
 
א
ת
ו
 
ו
ל
א
 
י
ש
מ
ע
 
א
ל
י
ה
ם
 
ו
ת
פ
ש
 
ב
ו
 
א
ב
י
ו
 
ו
א
מ
ו
 
ו
ה
ו
צ
י
א
ו
 
א
ת
ו
 
א
ל
 
ז
ק
נ
י
 
ע
י
ר
ו
 
א
ל
 
ש
ע
ר
 
מ
ק
ו
מ
ו
 
ו
א
מ
ר
ו
 
א
ל
 
א
נ
ש
י
 
ע
י
ר
ו
 
ב
נ
נ
ו
 
ז
ה
 
ס
ו
ר
ר
 
ו
מ
ו
ר
ה
 
א
י
נ
נ
ו
 
ש
מ
ע
 
ב
ק
ו
ל
נ
ו
 
ז
ו
ל
ל
 
ו
ס
ו
ב
ה
 
ו
ר
ג
מ
ה
ו
 
כ
ל
 
א
נ
ש
י
 
ע
י
ר
ו
 
ב
א
ב
נ
י
ם
 
ו
מ
ת
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
ו
כ
ל
 
י
ש
ר
א
ל
 
י
ש
מ
ע
ו
 
ו
י
י
ר
א
ו
 
כ
י
 
י
ה
י
ה
 
ב
א
י
ש
 
ח
ט
א
 
מ
ש
פ
ט
 
מ
ו
ת
 
ו
ה
ו
מ
ת
 
ו
ת
ל
י
ת
 
א
ת
ו
 
ע
ל
 
ה
ע
ץ
 
ל
א
 
ת
ל
י
ן
 
נ
ב
ל
ת
ו
 
ע
ל
 
ה
ע
ץ
 
כ
י
 
ק
ב
ר
 
ת
ק
ב
ר
נ
ו
 
ב
י
ו
ם
 
ה
ה
ו
א
 
כ
י
 
ק
ל
ל
ת
 
א
ל
ה
י
ם
 
ת
ל
א
ו
י
 
ו
ל
א
 
ת
ט
מ
א
 
א
ת
 
א
ד
מ
ת
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
ל
א
 
ת
ר
א
ה
 
א
ת
 
ש
ו
ר
 
א
ח
י
ך
 
א
ו
 
א
ת
 
ש
ה
ו
 
א
ו
 
א
ת
 
כ
ל
 
ב
ה
מ
ת
ו
 
נ
ד
ח
י
ם
 
ו
ה
ת
ע
ל
מ
ת
 
מ
ה
ם
 
ה
ש
ב
 
ת
ש
י
ב
ם
 
ל
א
ח
י
ך
 
ו
א
ם
 
ל
א
 
ק
ר
ו
ב
 
א
ח
י
ך
 
א
ל
י
ך
 
ו
ל
א
 
י
ד
ע
ת
ו
 
ו
א
ס
פ
ת
ו
 
א
ל
 
ת
ו
ך
 
ב
י
ת
ך
 
ו
ה
י
ה
 
ע
מ
ך
 
ע
ד
 
ד
ר
ש
 
א
ח
י
ך
 
א
ת
ו
 
מ
ע
מ
ך
 
ו
ה
ש
ב
ת
ו
 
ל
ו
 
כ
ן
 
ת
ע
ש
ה
 
ל
ח
מ
ר
ו
 
ו
כ
ן
 
ת
ע
ש
ה
 
ל
ש
מ
ל
ת
ו
 
ו
כ
ן
 
ת
ע
ש
ה
 
ל
כ
ל
 
א
ב
ד
ת
 
א
ח
י
ך
 
א
ש
ר
 
ת
א
ב
ד
 
מ
מ
נ
ו
 
ו
מ
צ
א
ת
ה
 
ל
א
 
ת
ו
כ
ל
 
ל
ה
ת
ע
ל
ם
 
ל
א
 
ת
ר
א
ה
 
א
ת
 
ח
מ
ו
ר
 
א
ח
י
ך
 
א
ו
 
א
ת
 
ש
ו
ר
ו
 
א
ו
 
א
ת
 
כ
ל
 
ב
ה
מ
ת
ו
 
נ
פ
ל
י
ם
 
ב
ד
ר
ך
 
ו
ה
ת
ע
ל
מ
ת
 
מ
ה
ם
 
ה
ק
ם
 
ת
ק
י
ם
 
ע
מ
ו
 
ל
א
 
י
ה
י
ה
 
כ
ל
י
 
ג
ב
ר
 
ע
ל
 
א
ש
ה
 
ו
ל
א
 
י
ל
ב
ש
 
ג
ב
ר
 
ש
מ
ל
ת
 
א
ש
ה
 
כ
י
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
ל
 
ע
ש
ה
 
א
ל
ה
 
כ
י
 
י
ק
ר
א
 
ק
ן
 
צ
פ
ו
ר
 
ל
פ
נ
י
ך
 
ב
ד
ר
ך
 
ב
כ
ל
 
ע
ץ
 
א
ו
 
ע
ל
 
ה
א
ר
ץ
 
א
פ
ר
ח
י
ם
 
א
ו
 
ב
צ
י
ם
 
ו
ה
א
ם
 
ר
ב
צ
ת
 
ע
ל
 
ה
א
פ
ר
ח
י
ם
 
א
ו
 
ע
ל
 
ה
ב
צ
י
ם
 
ל
א
 
ת
ק
ח
 
ה
א
ם
 
ע
ל
 
ה
ב
נ
י
ם
 
ש
ל
ח
 
ת
ש
ל
ח
 
א
ת
 
ה
א
ם
 
ו
א
ת
 
ה
ב
נ
י
ם
 
ת
ק
ח
 
ל
ך
 
ל
מ
ע
ן
 
י
י
ט
ב
 
ל
ך
 
ו
ה
א
ר
כ
ת
 
י
מ
י
ם
 
כ
י
 
ת
ב
נ
ה
 
ב
י
ת
 
ח
ד
ש
 
ו
ע
ש
י
ת
 
מ
ע
ק
ה
 
ל
ג
ג
ך
 
ו
ל
א
 
ת
ש
י
ם
 
ד
מ
י
ם
 
ב
ב
י
ת
ך
 
כ
י
 
י
פ
ל
 
ה
נ
פ
ל
 
מ
מ
נ
ו
 
ל
א
 
ת
ז
ר
ע
 
כ
ר
מ
ך
 
כ
ל
א
י
ם
 
פ
ן
 
ת
ק
ד
י
ש
 
ה
מ
ל
א
ה
 
ה
ז
ר
ע
 
א
ש
ר
 
ת
ז
ר
ע
 
ו
ת
ב
ו
א
ת
 
ה
כ
ר
ם
 
ל
א
 
ת
ח
ר
י
ש
 
ב
ש
ו
ר
 
ו
ב
ח
מ
ו
ר
 
י
ח
ד
ו
 
ל
א
 
ת
ל
ב
ש
 
ש
ע
ט
נ
י
ז
 
צ
מ
ר
 
ו
פ
ש
ת
י
ם
 
י
ח
ד
ו
 
ג
ד
ל
י
ם
 
ת
ע
ש
ה
 
ל
ך
 
ע
ל
 
א
ר
ב
ע
 
כ
נ
פ
ו
ת
 
כ
ס
ו
ת
ך
 
א
ש
ר
 
ת
כ
ס
ה
 
ב
ה
 
כ
י
 
י
ק
ח
 
א
י
ש
 
א
ש
ה
 
ו
ב
א
 
א
ל
י
ה
 
ו
ש
נ
א
ה
 
ו
ש
ם
 
ל
ה
 
ע
ל
י
ל
ת
 
ד
ב
ר
י
ם
 
ו
ה
ו
צ
י
א
 
ע
ל
י
ה
 
ש
ם
 
ר
ע
 
ו
א
מ
ר
 
א
ת
 
ה
א
ש
ה
 
ה
ז
א
ת
 
ל
ק
ח
ת
י
 
ו
א
ק
ר
ב
ה
 
א
ל
י
ה
 
ו
ל
א
 
מ
צ
א
ת
י
 
ל
ה
 
ב
ת
ו
ל
י
ם
 
ו
ל
ק
ח
 
א
ב
י
 
ה
נ
ע
ר
ה
 
ו
א
מ
ה
 
ו
ה
ו
צ
י
א
ו
 
א
ת
 
ב
ת
ו
ל
י
 
ה
נ
ע
ר
ה
 
א
ל
 
ז
ק
נ
י
 
ה
ע
י
ר
 
ה
ש
ע
ר
ה
 
ו
א
מ
ר
 
א
ב
י
 
ה
נ
ע
ר
ה
 
א
ל
 
ה
ז
ק
נ
י
ם
 
א
ת
 
ב
ת
י
 
נ
ת
ת
י
 
ל
א
י
ש
 
ה
ז
ה
 
ל
א
ש
ה
 
ו
י
ש
נ
א
ה
 
ו
ה
נ
ה
 
ה
ו
א
 
ש
ם
 
ל
ה
 
ע
ל
י
ל
ת
 
ד
ב
ר
י
ם
 
ל
א
מ
ר
 
ל
א
 
מ
צ
א
ת
י
 
ל
ב
ת
ך
 
ב
ת
ו
ל
י
ם
 
ו
א
ל
ה
 
ב
ת
ו
ל
י
 
ב
ת
י
 
ו
פ
ר
ש
 
ה
ש
מ
ל
ה
 
ל
פ
נ
י
 
ז
ק
נ
י
 
ה
ע
י
ר
 
ו
ל
ק
ח
ו
 
ז
ק
נ
י
 
ה
ע
י
ר
 
ה
ה
י
א
 
א
ת
 
ה
א
י
ש
 
ה
ה
ו
א
 
ו
י
ס
ר
ו
 
א
ת
ו
 
ו
ע
נ
ש
ו
 
א
ת
ו
 
מ
א
ה
 
כ
ס
ף
 
ו
נ
ת
נ
ו
 
ל
א
ב
י
 
ה
נ
ע
ר
ה
 
כ
י
 
ה
ו
צ
י
א
 
ש
ם
 
ר
ע
 
ע
ל
 
ב
ת
ו
ל
ת
 
י
ש
ר
א
ל
 
ו
ל
ו
 
ת
ה
י
ה
 
ל
א
ש
ה
 
ל
א
 
י
ו
כ
ל
 
ש
ל
ח
ה
 
כ
ל
 
י
מ
י
ו
 
ו
א
ם
 
א
מ
ת
 
ה
י
ה
 
ה
ד
ב
ר
 
ל
א
 
נ
מ
צ
א
ו
 
ב
ת
ו
ל
י
ם
 
ל
נ
ע
ר
ה
 
ו
ה
ו
צ
י
א
ו
 
א
ת
 
ה
נ
ע
ר
ה
 
א
ל
 
פ
ת
ח
 
ב
י
ת
 
א
ב
י
ה
 
ו
ס
ק
ל
ו
ה
 
א
נ
ש
י
 
ע
י
ר
ה
 
ב
א
ב
נ
י
ם
 
ו
מ
ת
ה
 
כ
י
 
ע
ש
ת
ה
 
נ
ב
ל
ה
 
ב
י
ש
ר
א
ל
 
ל
ז
נ
ו
ת
 
א
ת
 
ב
י
ת
 
א
ב
י
ה
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
כ
י
 
י
מ
צ
א
 
א
י
ש
 
ש
כ
ב
 
ע
ם
 
א
ש
ה
 
ב
ע
י
ל
ת
 
ב
ע
ל
 
ו
מ
ת
ו
 
ג
ם
 
ש
נ
י
ה
ם
 
ה
א
י
ש
 
ה
ש
כ
ב
 
ע
ם
 
ה
א
ש
ה
 
ו
ה
א
ש
ה
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
י
ש
ר
א
ל
 
כ
י
 
י
ה
י
ה
 
נ
ע
ר
ה
 
ב
ת
ו
ל
ה
 
מ
א
ר
ש
ה
 
ל
א
י
ש
 
ו
מ
צ
א
ה
 
א
י
ש
 
ב
ע
י
ר
 
ו
ש
כ
ב
 
ע
מ
ה
 
ו
ה
ו
צ
א
ת
ם
 
א
ת
 
ש
נ
י
ה
ם
 
א
ל
 
ש
ע
ר
 
ה
ע
י
ר
 
ה
ה
י
א
 
ו
ס
ק
ל
ת
ם
 
א
ת
ם
 
ב
א
ב
נ
י
ם
 
ו
מ
ת
ו
 
א
ת
 
ה
נ
ע
ר
ה
 
ע
ל
 
ד
ב
ר
 
א
ש
ר
 
ל
א
 
צ
ע
ק
ה
 
ב
ע
י
ר
 
ו
א
ת
 
ה
א
י
ש
 
ע
ל
 
ד
ב
ר
 
א
ש
ר
 
ע
נ
ה
 
א
ת
 
א
ש
ת
 
ר
ע
ה
ו
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
ו
א
ם
 
ב
ש
ד
ה
 
י
מ
צ
א
 
ה
א
י
ש
 
א
ת
 
ה
נ
ע
ר
ה
 
ה
מ
א
ר
ש
ה
 
ו
ה
ח
ז
י
ק
 
ב
ה
 
ה
א
י
ש
 
ו
ש
כ
ב
 
ע
מ
ה
 
ו
מ
ת
 
ה
א
י
ש
 
א
ש
ר
 
ש
כ
ב
 
ע
מ
ה
 
ל
ב
ד
ו
 
ו
ל
נ
ע
ר
ה
 
ל
א
 
ת
ע
ש
ו
 
ד
ב
ר
 
א
י
ן
 
ל
נ
ע
ר
ה
 
ח
ט
א
 
מ
ו
ת
 
כ
י
 
כ
א
ש
ר
 
י
ק
ו
ם
 
א
י
ש
 
ע
ל
 
ר
ע
ה
ו
 
ו
ר
צ
ח
ו
 
נ
פ
ש
 
כ
ן
 
ה
ד
ב
ר
 
ה
ז
ה
 
כ
י
 
ב
ש
ד
ה
 
מ
צ
א
ה
 
צ
ע
ק
ה
 
ה
נ
ע
ר
ה
 
ה
מ
א
ר
ש
ה
 
ו
א
י
ן
 
מ
ו
ש
י
ע
 
ל
ה
 
כ
י
 
י
מ
צ
א
 
א
י
ש
 
נ
ע
ר
ה
 
ב
ת
ו
ל
ה
 
א
ש
ר
 
ל
א
 
א
ר
ש
ה
 
ו
ת
פ
ש
ה
 
ו
ש
כ
ב
 
ע
מ
ה
 
ו
נ
מ
צ
א
ו
 
ו
נ
ת
ן
 
ה
א
י
ש
 
ה
ש
כ
ב
 
ע
מ
ה
 
ל
א
ב
י
 
ה
נ
ע
ר
ה
 
ח
מ
ש
י
ם
 
כ
ס
ף
 
ו
ל
ו
 
ת
ה
י
ה
 
ל
א
ש
ה
 
ת
ח
ת
 
א
ש
ר
 
ע
נ
ה
 
ל
א
 
י
ו
כ
ל
 
ש
ל
ח
ה
 
כ
ל
 
י
מ
י
ו
 
ל
א
 
י
ק
ח
 
א
י
ש
 
א
ת
 
א
ש
ת
 
א
ב
י
ו
 
ו
ל
א
 
י
ג
ל
ה
 
כ
נ
ף
 
א
ב
י
ו
 
ל
א
 
י
ב
ו
א
 
פ
צ
ע
 
ד
כ
ה
 
ו
כ
ר
ו
ת
 
ש
פ
כ
ת
 
ב
ק
ה
ל
 
י
ה
ו
ה
 
ל
א
 
י
ב
ו
א
 
מ
מ
ז
ר
 
ב
ק
ה
ל
 
י
ה
ו
ה
 
ג
ם
 
ד
ו
ר
 
ע
ש
י
ר
י
 
ל
א
 
י
ב
ו
א
 
ל
ו
 
ב
ק
ה
ל
 
י
ה
ו
ה
 
ל
א
 
י
ב
ו
א
 
ע
מ
ו
נ
י
 
ו
מ
ו
א
ב
י
 
ב
ק
ה
ל
 
י
ה
ו
ה
 
ג
ם
 
ד
ו
ר
 
ע
ש
י
ר
י
 
ל
א
 
י
ב
ו
א
 
ל
ה
ם
 
ב
ק
ה
ל
 
י
ה
ו
ה
 
ע
ד
 
ע
ו
ל
ם
 
ע
ל
 
ד
ב
ר
 
א
ש
ר
 
ל
א
 
ק
ד
מ
ו
 
א
ת
כ
ם
 
ב
ל
ח
ם
 
ו
ב
מ
י
ם
 
ב
ד
ר
ך
 
ב
צ
א
ת
כ
ם
 
מ
מ
צ
ר
י
ם
 
ו
א
ש
ר
 
ש
כ
ר
 
ע
ל
י
ך
 
א
ת
 
ב
ל
ע
ם
 
ב
ן
 
ב
ע
ו
ר
 
פ
ת
ר
ה
 
א
ר
ם
 
נ
ה
ר
י
ם
 
ל
ק
ל
ל
ך
 
ו
ל
א
 
א
ב
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ע
 
א
ל
 
ב
ל
ע
ם
 
ו
י
ה
פ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ך
 
א
ת
 
ה
ק
ל
ל
ה
 
ל
ב
ר
כ
ה
 
כ
י
 
א
ה
ב
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ד
ר
ש
 
ש
ל
מ
ם
 
ו
ט
ו
ב
ת
ם
 
כ
ל
 
י
מ
י
ך
 
ל
ע
ל
ם
 
ל
א
 
ת
ת
ע
ב
 
א
ד
ו
מ
י
 
כ
י
 
א
ח
י
ך
 
ה
ו
א
 
ו
ל
א
 
ת
ת
ע
ב
 
מ
צ
ר
י
 
כ
י
 
ג
ר
 
ה
י
י
ת
 
ב
א
ר
צ
ו
 
ב
נ
י
ם
 
א
ש
ר
 
י
ו
ל
ד
ו
 
ל
ה
ם
 
ד
ו
ר
 
ש
ל
י
ש
י
 
י
ב
ו
א
 
ל
ה
ם
 
ב
ק
ה
ל
 
י
ה
ו
ה
 
כ
י
 
ת
צ
א
 
מ
ח
נ
ה
 
ע
ל
 
א
י
ב
י
ך
 
ו
נ
ש
מ
ר
ת
 
מ
כ
ל
 
ד
ב
ר
 
ר
ע
 
כ
י
 
י
ה
י
ה
 
ב
ך
 
א
י
ש
 
א
ש
ר
 
ל
א
 
י
ה
י
ה
 
ט
ה
ו
ר
 
מ
ק
ר
י
 
ל
י
ל
ה
 
ו
י
צ
א
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ל
א
 
י
ב
ו
א
 
א
ל
 
ת
ו
ך
 
ה
מ
ח
נ
ה
 
כ
י
 
א
ם
 
ר
ח
ץ
 
ב
ש
ר
ו
 
ב
מ
י
ם
 
ו
ב
א
 
ה
ש
מ
ש
 
ו
א
ח
ר
י
 
כ
ן
 
י
ב
ו
א
 
א
ל
 
ה
מ
ח
נ
ה
 
ו
י
ד
 
י
ה
י
ה
 
ל
ך
 
מ
ח
ו
ץ
 
ל
מ
ח
נ
ה
 
ו
י
צ
א
ת
 
ש
ם
 
ה
ח
ו
צ
ה
 
ו
י
ת
ד
 
ת
ה
י
ה
 
ל
ך
 
ע
ל
 
א
ז
נ
ך
 
ו
ה
י
ה
 
ב
ש
ב
ת
ך
 
ה
ח
ו
צ
ה
 
ו
ח
פ
ר
ת
 
ב
ה
 
ו
ש
ב
ת
 
ו
כ
ס
י
ת
 
א
ת
 
צ
א
ת
ך
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ת
ה
ל
ך
 
ב
ק
ר
ב
 
מ
ח
נ
י
ך
 
ל
ה
צ
י
ל
ך
 
ו
ל
ת
ת
 
א
י
ב
י
ך
 
ל
פ
נ
י
ך
 
ו
ה
י
ה
 
מ
ח
נ
י
ך
 
ק
ד
ו
ש
 
ו
ל
א
 
י
ר
א
ה
 
ב
ך
 
ע
ר
ו
ת
 
ד
ב
ר
 
ו
ש
ב
 
מ
א
ח
ר
י
ך
 
ל
א
 
ת
ס
ג
י
ר
 
ע
ב
ד
 
א
ל
 
א
ד
נ
י
ו
 
א
ש
ר
 
י
נ
צ
ל
 
א
ל
י
ך
 
מ
ע
ם
 
א
ד
נ
י
ו
 
ע
מ
ך
 
י
ש
ב
 
ב
ק
ר
ב
ך
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
י
ב
ח
ר
 
ב
א
ח
ת
 
ש
ע
ר
י
ך
 
ב
ט
ו
ב
 
ל
ו
 
ל
א
 
ת
ו
נ
נ
ו
 
ל
א
 
ת
ח
י
ה
 
ק
ד
ש
ה
 
מ
ב
נ
ו
ת
 
י
ש
ר
א
ל
 
ו
ל
א
 
י
ח
י
ה
 
ק
ד
ש
 
מ
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
 
ת
ב
י
א
 
א
ת
נ
ן
 
ז
ו
נ
ה
 
ו
מ
ח
י
ר
 
כ
ל
ב
 
ב
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
כ
ל
 
נ
ד
ר
 
כ
י
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ג
ם
 
ש
נ
י
ה
ם
 
ל
א
 
ת
ש
י
ך
 
ל
א
ח
י
ך
 
נ
ש
ך
 
כ
ס
ף
 
נ
ש
ך
 
א
כ
ל
 
נ
ש
ך
 
כ
ל
 
ד
ב
ר
 
א
ש
ר
 
י
ש
ך
 
ל
נ
כ
ר
י
 
ת
ש
י
ך
 
ו
ל
א
ח
י
ך
 
ל
א
 
ת
ש
י
ך
 
ל
מ
ע
ן
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
מ
ש
ל
ח
 
י
ד
י
ך
 
ע
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
כ
י
 
ת
ד
ר
 
נ
ד
ר
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
א
ח
ר
 
ל
ש
ל
מ
ו
 
כ
י
 
ד
ר
ש
 
י
ד
ר
ש
נ
ו
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ע
מ
ך
 
ו
ה
י
ה
 
ב
ך
 
ח
ט
א
 
ו
כ
י
 
ת
ח
ד
ל
 
ל
נ
ד
ר
 
ל
א
 
י
ה
י
ה
 
ב
ך
 
ח
ט
א
 
מ
ו
צ
א
 
ש
פ
ת
י
ך
 
ת
ש
מ
ר
 
ו
ע
ש
י
ת
 
כ
א
ש
ר
 
נ
ד
ר
ת
 
ל
י
ה
ו
ה
 
נ
ד
ב
ה
 
א
ש
ר
 
ד
ב
ר
ת
 
ב
פ
י
ך
 
כ
י
 
ת
ב
ו
א
 
ב
כ
ר
ם
 
ר
ע
ך
 
ו
א
כ
ל
ת
 
ע
נ
ב
י
ם
 
כ
נ
פ
ש
ך
 
ש
ב
ע
ך
 
ו
א
ל
 
כ
ל
י
ך
 
ל
א
 
ת
ת
ן
 
כ
י
 
ת
ב
ו
א
 
ב
ק
מ
ת
 
ר
ע
ך
 
ו
ק
ט
פ
ת
 
מ
ל
י
ל
ת
 
ב
י
ד
ך
 
ו
ח
ר
מ
ש
 
ל
א
 
ת
נ
י
ף
 
ע
ל
 
ק
מ
ת
 
ר
ע
ך
 
כ
י
 
י
ק
ח
 
א
י
ש
 
א
ש
ה
 
ו
ב
א
 
א
ל
י
ה
 
ו
ב
ע
ל
ה
 
ו
ה
י
ה
 
א
ם
 
ל
א
 
ת
מ
צ
א
 
ח
ן
 
ב
ע
י
נ
י
ו
 
כ
י
 
מ
צ
א
 
ב
ה
 
ע
ר
ו
ת
 
ד
ב
ר
 
ו
כ
ת
ב
 
ל
ה
 
ס
פ
ר
 
כ
ר
י
ת
ת
 
ו
נ
ת
ן
 
ב
י
ד
ה
 
ו
ש
ל
ח
ה
 
מ
ב
י
ת
ו
 
ו
י
צ
א
ה
 
מ
ב
י
ת
ו
 
ו
ה
ל
כ
ה
 
ו
ה
י
ת
ה
 
ל
א
י
ש
 
א
ח
ר
 
ו
ש
נ
א
ה
 
ה
א
י
ש
 
ה
א
ח
ר
ו
ן
 
ו
כ
ת
ב
 
ל
ה
 
ס
פ
ר
 
כ
ר
י
ת
ת
 
ו
נ
ת
ן
 
ב
י
ד
ה
 
ו
ש
ל
ח
ה
 
מ
ב
י
ת
ו
 
א
ו
 
כ
י
 
י
מ
ו
ת
 
ב
ע
ל
ה
 
ה
א
ח
ר
ו
ן
 
א
ש
ר
 
ל
ק
ח
ה
 
ל
ו
 
ל
א
ש
ה
 
ל
א
 
י
ו
כ
ל
 
ב
ע
ל
ה
 
ה
ר
א
י
ש
ו
ן
 
א
ש
ר
 
ש
ל
ח
ה
 
ל
ש
ו
ב
 
ל
ק
ח
ת
ה
 
ל
ה
י
ו
ת
 
ל
ו
 
ל
א
ש
ה
 
א
ח
ר
י
 
א
ש
ר
 
ה
ט
מ
א
ה
 
כ
י
 
ת
ו
ע
ב
ה
 
ה
י
א
 
ל
פ
נ
י
 
י
ה
ו
ה
 
ו
ל
א
 
ת
ח
ט
י
א
ו
 
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
כ
י
 
י
ק
ח
 
א
י
ש
 
א
ש
ה
 
ח
ד
ש
ה
 
ל
א
 
י
צ
א
 
ב
צ
ב
א
 
ו
ל
א
 
י
ע
ב
ר
 
ע
ל
י
ו
 
ל
כ
ל
 
ד
ב
ר
 
נ
ק
י
א
 
י
ה
י
ה
 
ל
ב
י
ת
ו
 
ש
נ
ה
 
א
ח
ת
 
ו
ש
מ
ח
 
א
ת
 
א
ש
ת
ו
 
א
ש
ר
 
ל
ק
ח
 
ל
א
 
י
ח
ב
ל
 
ר
ח
י
ם
 
ו
ר
כ
ב
 
כ
י
 
נ
פ
ש
 
ה
ו
א
 
ח
ב
ל
 
כ
י
 
י
מ
צ
א
 
א
י
ש
 
ג
נ
ב
 
נ
פ
ש
 
מ
א
ח
י
ו
 
מ
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ה
ת
ע
מ
ר
 
ב
ו
 
ו
מ
כ
ר
ו
 
ו
מ
ת
 
ה
ג
נ
ב
 
ה
ה
ו
א
 
ו
ב
ע
ר
ת
 
ה
ר
ע
 
מ
ק
ר
ב
ך
 
ה
ש
מ
ר
 
ב
נ
ג
ע
 
ה
צ
ר
ע
ת
 
ל
ש
מ
ר
 
מ
א
ד
 
ל
ע
ש
ו
ת
 
כ
כ
ל
 
ה
ת
ו
ר
ה
 
א
ש
ר
 
י
ו
ר
ו
 
א
ת
כ
ם
 
ה
כ
ה
נ
י
ם
 
ה
ל
ו
י
ם
 
כ
א
ש
ר
 
צ
ו
י
ת
ם
 
ת
ש
מ
ר
ו
 
ל
ע
ש
ו
ת
 
ז
כ
ו
ר
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
מ
ר
י
ם
 
ב
ד
ר
ך
 
ב
צ
א
ת
כ
ם
 
מ
מ
צ
ר
י
ם
 
כ
י
 
ת
ש
א
 
ב
ר
ע
ך
 
מ
ש
א
ת
 
מ
א
ו
מ
ה
 
ל
א
 
ת
ב
ו
א
 
א
ל
 
ב
י
ת
ו
 
ל
ע
ב
ט
 
ע
ב
ו
ט
ו
 
ב
ח
ו
ץ
 
ת
ע
מ
ד
 
ו
ה
א
י
ש
 
א
ש
ר
 
א
ת
ה
 
נ
ש
א
 
ב
ו
 
ה
ו
א
 
י
ו
צ
א
 
א
ל
י
ך
 
א
ת
 
ה
ע
ב
ו
ט
 
ה
ח
ו
צ
ה
 
ו
א
ם
 
א
י
ש
 
ע
נ
י
 
ה
ו
א
 
ל
א
 
ת
ש
כ
ב
 
ב
ע
ב
ו
ט
ו
 
ה
ש
ב
 
ת
ש
י
ב
 
ל
ו
 
א
ת
 
ה
ע
ב
ו
ט
 
כ
ב
ו
א
 
ה
ש
מ
ש
 
ו
ש
כ
ב
 
ב
ש
מ
ל
ת
ו
 
ו
ב
ר
כ
ך
 
ו
ל
ך
 
ת
ה
י
ה
 
צ
ד
ק
ה
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
א
 
ת
ע
ש
ק
 
ש
כ
י
ר
 
ע
נ
י
 
ו
א
ב
י
ו
ן
 
מ
א
ח
י
ך
 
א
ו
 
מ
ג
ר
ך
 
א
ש
ר
 
ב
א
ר
צ
ך
 
ב
ש
ע
ר
י
ך
 
ב
י
ו
מ
ו
 
ת
ת
ן
 
ש
כ
ר
ו
 
ו
ל
א
 
ת
ב
ו
א
 
ע
ל
י
ו
 
ה
ש
מ
ש
 
כ
י
 
ע
נ
י
 
ה
ו
א
 
ו
א
ל
י
ו
 
ה
ו
א
 
נ
ש
א
 
א
ת
 
נ
פ
ש
ו
 
ו
ל
א
 
י
ק
ר
א
 
ע
ל
י
ך
 
א
ל
 
י
ה
ו
ה
 
ו
ה
י
ה
 
ב
ך
 
ח
ט
א
 
ל
א
 
י
ו
מ
ת
ו
 
א
ב
ו
ת
 
ע
ל
 
ב
נ
י
ם
 
ו
ב
נ
י
ם
 
ל
א
 
י
ו
מ
ת
ו
 
ע
ל
 
ה
א
ב
ו
ת
 
א
י
ש
 
ב
ח
ט
א
ו
 
י
ו
מ
ת
 
ל
א
 
ת
ט
ה
 
מ
ש
פ
ט
 
ג
ר
 
י
ת
ו
ם
 
ו
ל
א
 
ת
ח
ב
ל
 
ב
ג
ד
 
א
ל
מ
נ
ה
 
ו
ז
כ
ר
ת
 
כ
י
 
ע
ב
ד
 
ה
י
י
ת
 
ב
מ
צ
ר
י
ם
 
ו
י
פ
ד
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ע
ל
 
כ
ן
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ל
ע
ש
ו
ת
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
כ
י
 
ת
ק
צ
ר
 
ק
צ
י
ר
ך
 
ב
ש
ד
ך
 
ו
ש
כ
ח
ת
 
ע
מ
ר
 
ב
ש
ד
ה
 
ל
א
 
ת
ש
ו
ב
 
ל
ק
ח
ת
ו
 
ל
ג
ר
 
ל
י
ת
ו
ם
 
ו
ל
א
ל
מ
נ
ה
 
י
ה
י
ה
 
ל
מ
ע
ן
 
י
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
מ
ע
ש
ה
 
י
ד
י
ך
 
כ
י
 
ת
ח
ב
ט
 
ז
י
ת
ך
 
ל
א
 
ת
פ
א
ר
 
א
ח
ר
י
ך
 
ל
ג
ר
 
ל
י
ת
ו
ם
 
ו
ל
א
ל
מ
נ
ה
 
י
ה
י
ה
 
כ
י
 
ת
ב
צ
ר
 
כ
ר
מ
ך
 
ל
א
 
ת
ע
ו
ל
ל
 
א
ח
ר
י
ך
 
ל
ג
ר
 
ל
י
ת
ו
ם
 
ו
ל
א
ל
מ
נ
ה
 
י
ה
י
ה
 
ו
ז
כ
ר
ת
 
כ
י
 
ע
ב
ד
 
ה
י
י
ת
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ע
ל
 
כ
ן
 
א
נ
כ
י
 
מ
צ
ו
ך
 
א
ת
 
ה
ד
ב
ר
 
ה
ז
ה
 
כ
י
 
י
ה
י
ה
 
ר
י
ב
 
ב
י
ן
 
א
נ
ש
י
ם
 
ו
נ
ג
ש
ו
 
א
ל
 
ה
מ
ש
פ
ט
 
ו
ש
פ
ט
ו
ם
 
ו
ה
צ
ד
י
ק
ו
 
א
ת
 
ה
צ
ד
י
ק
 
ו
ה
ר
ש
י
ע
ו
 
א
ת
 
ה
ר
ש
ע
 
ו
ה
י
ה
 
א
ם
 
ב
ן
 
ה
כ
ו
ת
 
ה
ר
ש
ע
 
ו
ה
פ
י
ל
ו
 
ה
ש
ו
פ
ט
 
ו
ה
כ
ה
ו
 
ל
פ
נ
י
ו
 
כ
ד
י
 
ר
ש
ע
ת
ו
 
ב
מ
ס
פ
ר
 
א
ר
ב
ע
י
ם
 
י
כ
נ
ו
 
ל
א
 
י
ס
ף
 
פ
ן
 
י
ס
ף
 
ל
ה
כ
ו
ת
ו
 
ע
ל
 
א
ל
ה
 
מ
כ
ה
 
ר
ב
ה
 
ו
נ
ק
ל
 
א
ח
י
ך
 
ל
ע
י
נ
י
ך
 
ל
א
 
ת
ח
ס
ם
 
ש
ו
ר
 
ב
ד
י
ש
ו
 
כ
י
 
י
ש
ב
ו
 
א
ח
י
ם
 
י
ח
ד
ו
 
ו
מ
ת
 
א
ח
ד
 
מ
ה
ם
 
ו
ב
ן
 
א
י
ן
 
ל
ו
 
ל
א
 
ת
ה
י
ה
 
א
ש
ת
 
ה
מ
ת
 
ה
ח
ו
צ
ה
 
ל
א
י
ש
 
ז
ר
 
י
ב
מ
ה
 
י
ב
ו
א
 
א
ל
י
ה
 
ו
ל
ק
ח
ה
 
ל
ו
 
ל
א
ש
ה
 
ו
י
ב
מ
ה
 
ו
ה
י
ה
 
ה
ב
ן
 
ה
ב
כ
ו
ר
 
א
ש
ר
 
ת
ל
ד
 
י
ק
ו
ם
 
ע
ל
 
ש
ם
 
א
ח
י
ו
 
ה
מ
ת
 
ו
ל
א
 
י
מ
ח
ה
 
ש
מ
ו
 
מ
י
ש
ר
א
ל
 
ו
א
ם
 
ל
א
 
י
ח
פ
ץ
 
ה
א
י
ש
 
ל
ק
ח
ת
 
א
ת
 
י
ב
מ
ת
ו
 
ו
ע
ל
ת
ה
 
י
ב
מ
ת
ו
 
ה
ש
ע
ר
ה
 
א
ל
 
ה
ז
ק
נ
י
ם
 
ו
א
מ
ר
ה
 
מ
א
ן
 
י
ב
מ
י
 
ל
ה
ק
י
ם
 
ל
א
ח
י
ו
 
ש
ם
 
ב
י
ש
ר
א
ל
 
ל
א
 
א
ב
ה
 
י
ב
מ
י
 
ו
ק
ר
א
ו
 
ל
ו
 
ז
ק
נ
י
 
ע
י
ר
ו
 
ו
ד
ב
ר
ו
 
א
ל
י
ו
 
ו
ע
מ
ד
 
ו
א
מ
ר
 
ל
א
 
ח
פ
צ
ת
י
 
ל
ק
ח
ת
ה
 
ו
נ
ג
ש
ה
 
י
ב
מ
ת
ו
 
א
ל
י
ו
 
ל
ע
י
נ
י
 
ה
ז
ק
נ
י
ם
 
ו
ח
ל
צ
ה
 
נ
ע
ל
ו
 
מ
ע
ל
 
ר
ג
ל
ו
 
ו
י
ר
ק
ה
 
ב
פ
נ
י
ו
 
ו
ע
נ
ת
ה
 
ו
א
מ
ר
ה
 
כ
כ
ה
 
י
ע
ש
ה
 
ל
א
י
ש
 
א
ש
ר
 
ל
א
 
י
ב
נ
ה
 
א
ת
 
ב
י
ת
 
א
ח
י
ו
 
ו
נ
ק
ר
א
 
ש
מ
ו
 
ב
י
ש
ר
א
ל
 
ב
י
ת
 
ח
ל
ו
ץ
 
ה
נ
ע
ל
 
כ
י
 
י
נ
צ
ו
 
א
נ
ש
י
ם
 
י
ח
ד
ו
 
א
י
ש
 
ו
א
ח
י
ו
 
ו
ק
ר
ב
ה
 
א
ש
ת
 
א
ח
ד
 
ל
ה
צ
י
ל
 
א
ת
 
א
י
ש
ה
 
מ
י
ד
 
מ
כ
ה
ו
 
ו
ש
ל
ח
ה
 
א
ת
 
י
ד
ה
 
ו
ה
ח
ז
י
ק
ה
 
ב
ב
ש
ר
ו
 
ו
ק
צ
ת
 
א
ת
 
כ
פ
ה
 
ל
א
 
ת
ח
ו
ס
 
ע
י
נ
ך
 
ל
א
 
י
ה
י
ה
 
ל
ך
 
ב
כ
י
ס
ך
 
א
ב
ן
 
ו
א
ב
ן
 
ג
ד
ל
ה
 
ו
ק
ט
נ
ה
 
ל
א
 
י
ה
י
ה
 
ל
ך
 
ב
ב
י
ת
ך
 
א
י
פ
ה
 
ו
א
י
פ
ה
 
ג
ד
ל
ה
 
ו
ק
ט
נ
ה
 
א
ב
ן
 
ש
ל
מ
ה
 
ו
צ
ד
ק
 
י
ה
י
ה
 
ל
ך
 
א
י
פ
ה
 
ש
ל
מ
ה
 
ו
צ
ד
ק
 
י
ה
י
ה
 
ל
ך
 
ל
מ
ע
ן
 
י
א
ר
י
כ
ו
ן
 
י
מ
י
ך
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
כ
י
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
ל
 
ע
ש
ה
 
א
ל
ה
 
כ
ל
 
ע
ש
ה
 
ע
ו
ל
 
ז
כ
ו
ר
 
א
ת
 
א
ש
ר
 
ע
ש
ה
 
ל
ך
 
ע
מ
ל
ק
 
ב
ד
ר
ך
 
ב
צ
א
ת
כ
ם
 
מ
מ
צ
ר
י
ם
 
א
ש
ר
 
ק
ר
ך
 
ב
ד
ר
ך
 
ו
י
ז
נ
ב
 
ב
ך
 
כ
ל
 
ה
נ
ש
ל
י
ם
 
א
ח
ר
י
ך
 
ו
א
ת
ה
 
ע
י
ף
 
ו
י
ג
ע
 
ו
ל
א
 
י
ר
א
 
א
ל
ה
י
ם
 
ו
ה
י
ה
 
ב
ה
נ
י
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ך
 
מ
כ
ל
 
א
י
ב
י
ך
 
מ
ס
ב
י
ב
 
ב
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
ל
ר
ש
ת
ה
 
ת
מ
ח
ה
 
א
ת
 
ז
כ
ר
 
ע
מ
ל
ק
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
ל
א
 
ת
ש
כ
ח
 
ו
ה
י
ה
 
כ
י
 
ת
ב
ו
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
נ
ח
ל
ה
 
ו
י
ר
ש
ת
 
ו
י
ש
ב
ת
 
ב
ה
 
ו
ל
ק
ח
ת
 
מ
ר
א
ש
י
ת
 
פ
ר
י
 
ה
א
ד
מ
ה
 
א
ש
ר
 
ת
ב
י
א
 
מ
א
ר
צ
ך
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ו
ש
מ
ת
 
ב
ט
נ
א
 
ו
ה
ל
כ
ת
 
א
ל
 
ה
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
כ
ן
 
א
ת
 
ש
מ
ו
 
ש
ם
 
ו
ב
א
ת
 
א
ל
 
ה
כ
ה
ן
 
א
ש
ר
 
י
ה
י
ה
 
ב
י
מ
י
ם
 
ה
ה
ם
 
ו
א
מ
ר
ת
 
א
ל
י
ו
 
ה
ג
ד
ת
י
 
ה
י
ו
ם
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
י
 
ב
א
ת
י
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
נ
ו
 
ל
ת
ת
 
ל
נ
ו
 
ו
ל
ק
ח
 
ה
כ
ה
ן
 
ה
ט
נ
א
 
מ
י
ד
ך
 
ו
ה
נ
י
ח
ו
 
ל
פ
נ
י
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ע
נ
י
ת
 
ו
א
מ
ר
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ר
מ
י
 
א
ב
ד
 
א
ב
י
 
ו
י
ר
ד
 
מ
צ
ר
י
מ
ה
 
ו
י
ג
ר
 
ש
ם
 
ב
מ
ת
י
 
מ
ע
ט
 
ו
י
ה
י
 
ש
ם
 
ל
ג
ו
י
 
ג
ד
ו
ל
 
ו
ע
צ
ו
ם
 
ו
ר
ב
 
ו
י
ר
י
ע
ו
 
א
ת
נ
ו
 
ה
מ
צ
ר
י
ם
 
ו
י
ע
נ
נ
ו
 
ו
י
ת
נ
ו
 
ע
ל
י
נ
ו
 
ע
ב
ד
ה
 
ק
ש
ה
 
ו
נ
צ
ע
ק
 
א
ל
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
נ
ו
 
ו
י
ש
מ
ע
 
י
ה
ו
ה
 
א
ת
 
ק
ו
ל
נ
ו
 
ו
י
ר
א
 
א
ת
 
ע
נ
י
נ
ו
 
ו
א
ת
 
ע
מ
ל
נ
ו
 
ו
א
ת
 
ל
ח
צ
נ
ו
 
ו
י
ו
צ
י
א
נ
ו
 
י
ה
ו
ה
 
מ
מ
צ
ר
י
ם
 
ב
י
ד
 
ח
ז
ק
ה
 
ו
ב
ז
ר
ו
ע
 
נ
ט
ו
י
ה
 
ו
ב
מ
ר
א
ה
 
ג
ד
ו
ל
 
ו
ב
א
ת
ו
ת
 
ו
ב
מ
ו
פ
ת
י
ם
 
ו
י
ב
י
א
נ
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
ו
י
ת
ן
 
ל
נ
ו
 
א
ת
 
ה
א
ר
ץ
 
ה
ז
א
ת
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ו
ע
ת
ה
 
ה
נ
ה
 
ה
ב
א
ת
י
 
א
ת
 
ר
א
ש
י
ת
 
פ
ר
י
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ת
ת
ה
 
ל
י
 
י
ה
ו
ה
 
ו
ה
נ
ח
ת
ו
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ש
ת
ח
ו
י
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ח
ת
 
ב
כ
ל
 
ה
ט
ו
ב
 
א
ש
ר
 
נ
ת
ן
 
ל
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ל
ב
י
ת
ך
 
א
ת
ה
 
ו
ה
ל
ו
י
 
ו
ה
ג
ר
 
א
ש
ר
 
ב
ק
ר
ב
ך
 
כ
י
 
ת
כ
ל
ה
 
ל
ע
ש
ר
 
א
ת
 
כ
ל
 
מ
ע
ש
ר
 
ת
ב
ו
א
ת
ך
 
ב
ש
נ
ה
 
ה
ש
ל
י
ש
י
ת
 
ש
נ
ת
 
ה
מ
ע
ש
ר
 
ו
נ
ת
ת
ו
 
ל
ל
ו
י
 
ל
ג
ר
 
ל
י
ת
ו
ם
 
ו
ל
א
ל
מ
נ
ה
 
ו
א
כ
ל
ו
 
ב
ש
ע
ר
י
ך
 
ו
ש
ב
ע
ו
 
ו
א
מ
ר
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ע
ר
ת
י
 
ה
ק
ד
ש
 
מ
ן
 
ה
ב
י
ת
 
ו
ג
ם
 
נ
ת
ת
י
ו
 
ל
ל
ו
י
 
ל
ג
ר
 
ל
י
ת
ו
ם
 
ו
ל
א
ל
מ
נ
ה
 
כ
כ
ל
 
מ
צ
ו
ת
י
ך
 
א
ש
ר
 
צ
ו
י
ת
נ
י
 
ל
א
 
ע
ב
ר
ת
י
 
מ
מ
צ
ו
ת
י
ך
 
ו
ל
א
 
ש
כ
ח
ת
י
 
ל
א
 
א
כ
ל
ת
י
 
ב
א
נ
י
 
מ
מ
נ
ו
 
ו
ל
א
 
ב
ע
ר
ת
י
 
מ
מ
נ
ו
 
ב
ט
מ
א
 
ו
ל
א
 
נ
ת
ת
י
 
מ
מ
נ
ו
 
ל
מ
ת
 
ש
מ
ע
ת
י
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
 
ע
ש
י
ת
י
 
כ
כ
ל
 
א
ש
ר
 
צ
ו
י
ת
נ
י
 
ה
ש
ק
ף
 
מ
מ
ע
ו
ן
 
ק
ד
ש
ך
 
מ
ן
 
ה
ש
מ
י
ם
 
ו
ב
ר
ך
 
א
ת
 
ע
מ
ך
 
א
ת
 
י
ש
ר
א
ל
 
ו
א
ת
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ת
ת
ה
 
ל
נ
ו
 
כ
א
ש
ר
 
נ
ש
ב
ע
ת
 
ל
א
ב
ת
י
נ
ו
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ה
י
ו
ם
 
ה
ז
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
צ
ו
ך
 
ל
ע
ש
ו
ת
 
א
ת
 
ה
ח
ק
י
ם
 
ה
א
ל
ה
 
ו
א
ת
 
ה
מ
ש
פ
ט
י
ם
 
ו
ש
מ
ר
ת
 
ו
ע
ש
י
ת
 
א
ת
ם
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
א
ת
 
י
ה
ו
ה
 
ה
א
מ
ר
ת
 
ה
י
ו
ם
 
ל
ה
י
ו
ת
 
ל
ך
 
ל
א
ל
ה
י
ם
 
ו
ל
ל
כ
ת
 
ב
ד
ר
כ
י
ו
 
ו
ל
ש
מ
ר
 
ח
ק
י
ו
 
ו
מ
צ
ו
ת
י
ו
 
ו
ל
ש
מ
ע
 
ב
ק
ו
ל
ו
 
ו
י
ה
ו
ה
 
ה
א
מ
ר
ך
 
ה
י
ו
ם
 
ל
ה
י
ו
ת
 
ל
ו
 
ל
ע
ם
 
ס
ג
ל
ה
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
ך
 
ו
ל
ש
מ
ר
 
כ
ל
 
מ
צ
ו
ת
י
ו
 
ו
ל
ת
ת
ך
 
ע
ל
י
ו
ן
 
ע
ל
 
כ
ל
 
ה
ג
ו
י
ם
 
א
ש
ר
 
ע
ש
ה
 
ל
ת
ה
ל
ה
 
ל
ש
ם
 
ו
ל
ת
פ
א
ר
ת
 
ו
ל
ה
י
ו
ת
ך
 
ע
ם
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
א
ש
ר
 
ד
ב
ר
 
ו
י
צ
ו
 
מ
ש
ה
 
ו
ז
ק
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
ה
ע
ם
 
ל
א
מ
ר
 
ש
מ
ר
ו
 
א
ת
 
כ
ל
 
ה
מ
צ
ו
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ו
ה
י
ה
 
ב
י
ו
ם
 
א
ש
ר
 
ת
ע
ב
ר
ו
 
א
ת
 
ה
י
ר
ד
ן
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
ו
ה
ק
מ
ת
 
ל
ך
 
א
ב
נ
י
ם
 
ג
ד
ל
ו
ת
 
ו
ש
ד
ת
 
א
ת
ם
 
ב
ש
י
ד
 
ו
כ
ת
ב
ת
 
ע
ל
י
ה
ן
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ב
ע
ב
ר
ך
 
ל
מ
ע
ן
 
א
ש
ר
 
ת
ב
ו
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
א
ר
ץ
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ת
י
ך
 
ל
ך
 
ו
ה
י
ה
 
ב
ע
ב
ר
כ
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ת
ק
י
מ
ו
 
א
ת
 
ה
א
ב
נ
י
ם
 
ה
א
ל
ה
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ה
 
א
ת
כ
ם
 
ה
י
ו
ם
 
ב
ה
ר
ג
ר
י
ז
י
ם
 
ו
ש
ד
ת
 
א
ת
ם
 
ב
ש
י
ד
 
ו
ב
נ
י
ת
 
ש
ם
 
מ
ז
ב
ח
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
מ
ז
ב
ח
 
א
ב
נ
י
ם
 
ל
א
 
ת
נ
י
ף
 
ע
ל
י
ה
ם
 
ב
ר
ז
ל
 
א
ב
נ
י
ם
 
ש
ל
מ
ו
ת
 
ת
ב
נ
ה
 
א
ת
 
מ
ז
ב
ח
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ע
ל
י
ת
 
ע
ל
י
ו
 
ע
ל
ו
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ז
ב
ח
ת
 
ש
ל
מ
י
ם
 
ו
א
כ
ל
ת
 
ש
ם
 
ו
ש
מ
ח
ת
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
כ
ת
ב
ת
 
ע
ל
 
ה
א
ב
נ
י
ם
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ב
א
ר
 
ה
י
י
ט
ב
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
ו
ה
כ
ה
נ
י
ם
 
ה
ל
ו
י
ם
 
א
ל
 
כ
ל
 
י
ש
ר
א
ל
 
ל
א
מ
ר
 
ה
ס
כ
ת
 
ו
ש
מ
ע
 
י
ש
ר
א
ל
 
ה
י
ו
ם
 
ה
ז
ה
 
נ
ה
י
ת
 
ל
ע
ם
 
ק
ד
ש
 
ל
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ע
ת
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ע
ש
י
ת
 
א
ת
 
מ
צ
ו
ת
י
ו
 
ו
א
ת
 
ח
ק
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ו
י
צ
ו
 
מ
ש
ה
 
א
ת
 
ה
ע
ם
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ל
א
מ
ר
 
א
ל
ה
 
י
ע
מ
ד
ו
 
ל
ב
ר
ך
 
א
ת
 
ה
ע
ם
 
ע
ל
 
ה
ר
ג
ר
י
ז
י
ם
 
ב
ע
ב
ר
כ
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ש
מ
ע
ו
ן
 
ו
ל
ו
י
 
י
ה
ו
ד
ה
 
ו
י
ש
ש
כ
ר
 
י
ו
ס
ף
 
ו
ב
נ
י
מ
י
ם
 
ו
א
ל
ה
 
י
ע
מ
ד
ו
 
ע
ל
 
ה
ק
ל
ל
ה
 
ב
ה
ר
 
ע
י
ב
ל
 
ר
א
ו
ב
ן
 
ג
ד
 
ו
א
ש
ר
 
ז
ב
ו
ל
ן
 
ד
ן
 
ו
נ
פ
ת
ל
י
 
ו
ע
נ
ו
 
ה
ל
ו
י
ם
 
ו
א
מ
ר
ו
 
א
ל
 
כ
ל
 
א
י
ש
 
י
ש
ר
א
ל
 
ק
ו
ל
 
ר
ם
 
א
ר
ו
ר
 
ה
א
י
ש
 
א
ש
ר
 
י
ע
ש
ה
 
פ
ס
ל
 
ו
מ
ס
כ
ה
 
ת
ו
ע
ב
ת
 
י
ה
ו
ה
 
מ
ע
ש
ה
 
י
ד
י
 
ח
ר
ש
 
ו
ש
ם
 
ב
ס
ת
ר
 
ו
ע
נ
ו
 
כ
ל
 
ה
ע
ם
 
ו
א
מ
ר
ו
 
א
מ
ן
 
א
ר
ו
ר
 
מ
ק
ל
ה
 
א
ב
י
ו
 
ו
א
מ
ו
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
מ
ס
י
ג
 
ג
ב
ו
ל
 
ר
ע
ה
ו
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
מ
ש
ג
ה
 
ע
ו
ר
 
ב
ד
ר
ך
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
מ
ט
ה
 
מ
ש
פ
ט
 
ג
ר
 
י
ת
ו
ם
 
ו
א
ל
מ
נ
ה
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
ש
כ
ב
 
ע
ם
 
א
ש
ת
 
א
ב
י
ו
 
כ
י
 
ג
ל
ה
 
כ
נ
ף
 
א
ב
י
ו
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
ש
כ
ב
 
ע
ם
 
כ
ל
 
ב
ה
מ
ה
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
ש
כ
ב
 
ע
ם
 
א
ח
ו
ת
ו
 
ב
ת
 
א
ב
י
ו
 
א
ו
 
ב
ת
 
א
מ
ו
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
ש
כ
ב
 
ע
ם
 
ח
ת
נ
ת
ו
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
מ
כ
ה
 
ר
ע
ה
ו
 
ב
ס
ת
ר
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
ל
ק
ח
 
ש
ח
ד
 
ל
ה
כ
ו
ת
 
נ
פ
ש
 
ד
ם
 
נ
ק
י
א
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
א
ר
ו
ר
 
א
ש
ר
 
ל
א
 
י
ק
י
ם
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ל
ע
ש
ו
ת
ם
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ע
ם
 
א
מ
ן
 
ו
ה
י
ה
 
א
ם
 
ש
מ
ע
 
ת
ש
מ
ע
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
מ
צ
ו
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ו
נ
ת
נ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ע
ל
י
ו
ן
 
ע
ל
 
כ
ל
 
ג
ו
י
 
ה
א
ר
ץ
 
ו
ב
א
ו
 
ע
ל
י
ך
 
כ
ל
 
ה
ב
ר
כ
ו
ת
 
ה
א
ל
ה
 
ו
ה
ש
י
ג
ו
ך
 
כ
י
 
ת
ש
מ
ע
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ר
ו
ך
 
א
ת
ה
 
ב
ע
י
ר
 
ו
ב
ר
ו
ך
 
א
ת
ה
 
ב
ש
ד
ה
 
ב
ר
ו
ך
 
פ
ר
י
 
ב
ט
נ
ך
 
ו
פ
ר
י
 
א
ד
מ
ת
ך
 
ו
פ
ר
י
 
ב
ה
מ
ת
ך
 
ש
ג
ר
 
א
ל
פ
י
ך
 
ו
ע
ש
ת
ר
ו
ת
 
צ
א
נ
ך
 
ב
ר
ו
ך
 
ט
נ
א
ך
 
ו
מ
ש
א
ר
ת
ך
 
ב
ר
ו
ך
 
א
ת
ה
 
ב
ב
א
ך
 
ו
ב
ר
ו
ך
 
א
ת
ה
 
ב
צ
א
ת
ך
 
י
ת
ן
 
י
ה
ו
ה
 
א
ת
 
א
י
ב
י
ך
 
ה
ק
מ
י
ם
 
ע
ל
י
ך
 
נ
ג
פ
י
ם
 
ל
פ
נ
י
ך
 
ב
ד
ר
ך
 
א
ח
ת
 
י
צ
א
ו
 
א
ל
י
ך
 
ו
ב
ש
ב
ע
ה
 
ד
ר
כ
י
ם
 
י
נ
ו
ס
ו
 
ל
פ
נ
י
ך
 
י
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
ך
 
א
ת
 
ה
ב
ר
כ
ה
 
ב
א
ס
י
מ
ך
 
ו
ב
כ
ל
 
מ
ש
ל
ח
 
י
ד
י
ך
 
ו
ב
ר
כ
ך
 
ב
א
ר
ץ
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
נ
ת
ן
 
ל
ך
 
י
ק
י
מ
ך
 
י
ה
ו
ה
 
ל
ו
 
ל
ע
ם
 
ק
ד
ש
 
כ
א
ש
ר
 
נ
ש
ב
ע
 
ל
ך
 
כ
י
 
ת
ש
מ
ר
 
א
ת
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
ל
כ
ת
 
ב
ד
ר
כ
י
ו
 
ו
ר
א
ו
 
כ
ל
 
ע
מ
י
 
ה
א
ר
ץ
 
כ
י
 
ש
ם
 
י
ה
ו
ה
 
נ
ק
ר
א
 
ע
ל
י
ך
 
ו
י
י
ר
א
ו
 
מ
מ
ך
 
ו
ה
ו
ת
י
ר
ך
 
י
ה
ו
ה
 
ל
ט
ו
ב
 
ב
פ
ר
י
 
ב
ט
נ
ך
 
ו
ב
פ
ר
י
 
ב
ה
מ
ת
ך
 
ו
ב
פ
ר
י
 
א
ד
מ
ת
ך
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
ך
 
ל
ת
ת
 
ל
ך
 
י
פ
ת
ח
 
י
ה
ו
ה
 
ל
ך
 
א
ת
 
א
ו
צ
ר
ו
 
ה
ט
ו
ב
 
א
ת
 
ה
ש
מ
י
ם
 
ל
ת
ת
 
א
ת
 
מ
ט
ר
 
א
ר
צ
ך
 
ב
ע
ת
ו
 
ל
ב
ר
ך
 
א
ת
 
כ
ל
 
מ
ע
ש
ה
 
י
ד
י
ך
 
ו
ה
ל
ו
י
ת
 
ג
ו
י
ם
 
ר
ב
י
ם
 
ו
א
ת
ה
 
ל
א
 
ת
ל
ו
ה
 
ו
נ
ת
נ
ך
 
י
ה
ו
ה
 
ל
ר
א
ש
 
ו
ל
א
 
ל
ז
נ
ב
 
ו
ה
י
י
ת
 
ר
ק
 
ל
מ
ע
ל
ה
 
ו
ל
א
 
ת
ה
י
ה
 
ל
מ
ט
ה
 
כ
י
 
ת
ש
מ
ע
 
א
ל
 
מ
צ
ו
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
ש
מ
ר
 
ו
ל
ע
ש
ו
ת
 
ו
ל
א
 
ת
ס
ו
ר
 
מ
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
י
מ
י
ן
 
ו
ש
מ
א
ל
 
ל
ל
כ
ת
 
א
ח
ר
י
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ל
ע
ב
ד
ם
 
ו
ה
י
ה
 
א
ם
 
ל
א
 
ת
ש
מ
ע
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
מ
צ
ו
ת
י
ו
 
ו
ח
ק
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ו
ב
א
ו
 
ע
ל
י
ך
 
כ
ל
 
ה
ק
ל
ל
ו
ת
 
ה
א
ל
ה
 
ו
ה
ש
י
ג
ו
ך
 
א
ר
ו
ר
 
א
ת
ה
 
ב
ע
י
ר
 
ו
א
ר
ו
ר
 
א
ת
ה
 
ב
ש
ד
ה
 
א
ר
ו
ר
 
ט
נ
א
ך
 
ו
מ
ש
א
ר
ת
ך
 
א
ר
ו
ר
 
פ
ר
י
 
ב
ט
נ
ך
 
ו
פ
ר
י
 
א
ד
מ
ת
ך
 
ו
פ
ר
י
 
ב
ה
מ
ת
ך
 
ש
ג
ר
 
א
ל
פ
י
ך
 
ו
ע
ש
ת
ר
ו
ת
 
צ
א
נ
ך
 
א
ר
ו
ר
 
א
ת
ה
 
ב
ב
א
ך
 
ו
א
ר
ו
ר
 
א
ת
ה
 
ב
צ
א
ת
ך
 
י
ש
ל
ח
 
י
ה
ו
ה
 
ב
ך
 
א
ת
 
ה
מ
ר
ה
 
ו
א
ת
 
ה
מ
ה
מ
ה
 
ו
א
ת
 
ה
מ
ג
ע
ר
ת
 
ב
כ
ל
 
מ
ש
ל
ח
 
י
ד
י
ך
 
א
ש
ר
 
ת
ע
ש
ה
 
ע
ד
 
ה
ש
מ
י
ד
ך
 
ו
ע
ד
 
א
ב
י
ד
ך
 
מ
ה
ר
 
מ
פ
נ
י
 
ר
ע
 
מ
ע
ל
ל
י
ך
 
א
ש
ר
 
ע
ז
ב
ת
נ
י
 
י
ד
ב
ק
 
י
ה
ו
ה
 
ב
ך
 
א
ת
 
ה
ד
ב
ר
 
ע
ד
 
כ
ל
ו
ת
ו
 
א
ת
ך
 
מ
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
י
כ
ך
 
י
ה
ו
ה
 
ב
ש
ח
פ
ת
 
ו
ב
ק
ד
ח
ת
 
ו
ב
ד
ל
ק
ת
 
ו
ב
ח
ר
ח
ר
 
ו
ב
ח
ר
ב
 
ו
ב
ש
ד
פ
ו
ן
 
ו
ב
י
ר
ק
ו
ן
 
י
ר
ד
פ
ו
ך
 
ע
ד
 
א
ב
י
ד
ו
ך
 
ו
ה
י
ו
 
ש
מ
י
ך
 
א
ש
ר
 
ע
ל
 
ר
א
ש
ך
 
נ
ח
ש
ת
 
ו
ה
א
ר
ץ
 
א
ש
ר
 
ת
ח
ת
י
ך
 
ב
ר
ז
ל
 
י
ת
ן
 
י
ה
ו
ה
 
א
ת
 
מ
ט
ר
 
א
ר
צ
ך
 
א
ב
ק
 
ו
ע
פ
ר
 
מ
ן
 
ה
ש
מ
י
ם
 
י
ר
ד
 
ע
ל
י
ך
 
ע
ד
 
ה
ש
מ
י
ד
ך
 
י
ת
נ
ך
 
י
ה
ו
ה
 
נ
ג
ף
 
ל
פ
נ
י
 
א
י
ב
י
ך
 
ב
ד
ר
ך
 
א
ח
ת
 
ת
צ
א
 
א
ל
י
ו
 
ו
ב
ש
ב
ע
ה
 
ד
ר
כ
י
ם
 
ת
נ
ו
ס
 
ל
פ
נ
י
ו
 
ו
ה
י
י
ת
 
ל
ז
ו
ע
ה
 
ל
כ
ל
 
מ
מ
ל
כ
ת
 
ה
א
ר
ץ
 
ו
ה
י
ת
ה
 
נ
ב
ל
ת
ך
 
ל
מ
א
כ
ל
 
ל
ע
ו
ף
 
ה
ש
מ
י
ם
 
ו
ל
ב
ה
מ
ת
 
ה
א
ר
ץ
 
ו
א
י
ן
 
מ
ח
ר
י
ד
 
י
כ
ך
 
י
ה
ו
ה
 
ב
ש
ח
י
ן
 
מ
צ
ר
י
ם
 
ו
ב
ע
פ
ל
י
ם
 
ו
ב
ג
ר
ב
 
ו
ב
ח
ר
ס
 
א
ש
ר
 
ל
א
 
ת
ו
כ
ל
 
ל
ה
ר
פ
א
 
י
כ
ך
 
י
ה
ו
ה
 
ב
ש
ג
ע
ו
ן
 
ו
ב
ע
ו
ר
ו
ן
 
ו
ב
ת
מ
ה
ו
ן
 
ל
ב
ב
 
ו
ה
י
י
ת
 
מ
מ
ש
ש
 
ב
צ
ה
ר
י
ם
 
כ
א
ש
ר
 
י
מ
ש
ש
 
ה
ע
ו
ר
 
ב
א
פ
ל
ה
 
ו
ל
א
 
ת
צ
ל
י
ח
 
ד
ר
כ
ך
 
ו
ה
י
י
ת
 
ר
ק
 
ע
ש
ו
ק
 
ו
ג
ז
ו
ל
 
כ
ל
 
ה
י
מ
י
ם
 
ו
א
י
ן
 
מ
ו
ש
י
ע
 
א
ש
ה
 
ת
א
ר
ש
 
ו
א
י
ש
 
א
ח
ר
 
י
ש
כ
ב
 
ע
מ
ה
 
ב
י
ת
 
ת
ב
נ
ה
 
ו
ל
א
 
ת
ש
ב
 
ב
ו
 
כ
ר
ם
 
ת
ט
ע
 
ו
ל
א
 
ת
ח
ל
ל
נ
ו
 
ש
ו
ר
ך
 
ט
ב
ו
ח
 
ל
ע
י
נ
י
ך
 
ו
ל
א
 
ת
א
כ
ל
 
מ
מ
נ
ו
 
ח
מ
ו
ר
ך
 
ג
ז
ו
ל
 
מ
ל
פ
נ
י
ך
 
ו
ל
א
 
י
ש
ו
ב
 
ל
ך
 
צ
א
נ
ך
 
נ
ת
נ
ו
ת
 
ל
א
י
ב
י
ך
 
ו
א
י
ן
 
ל
ך
 
מ
ו
ש
י
ע
 
ב
נ
י
ך
 
ו
ב
נ
ת
י
ך
 
נ
ת
נ
י
ם
 
ל
ע
ם
 
א
ח
ר
 
ו
ע
י
נ
י
ך
 
ר
א
ו
ת
 
ו
כ
ל
ו
ת
 
א
ל
י
ה
ם
 
כ
ל
 
ה
י
ו
ם
 
ו
א
י
ן
 
ל
א
ל
 
י
ד
ך
 
פ
ר
י
 
א
ד
מ
ת
ך
 
ו
כ
ל
 
י
ג
ע
ך
 
י
א
כ
ל
 
ע
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
 
ו
ה
י
י
ת
 
ר
ק
 
ע
ש
ו
ק
 
ו
ר
צ
ו
ץ
 
כ
ל
 
ה
י
מ
י
ם
 
ו
ה
י
י
ת
 
מ
ש
ג
ע
 
מ
מ
ר
א
ה
 
ע
י
נ
י
ך
 
א
ש
ר
 
ת
ר
א
ה
 
י
כ
ך
 
י
ה
ו
ה
 
ב
ש
ח
י
ן
 
ר
ע
 
ע
ל
 
ה
ב
ר
כ
י
ם
 
ו
ע
ל
 
ה
ש
ק
י
ם
 
א
ש
ר
 
ל
א
 
ת
ו
כ
ל
 
ל
ה
ר
פ
א
 
מ
כ
ף
 
ר
ג
ל
ך
 
ו
ע
ד
 
ק
ד
ק
ד
ך
 
י
ו
ל
י
ך
 
י
ה
ו
ה
 
א
ת
ך
 
ו
א
ת
 
מ
ל
כ
ך
 
א
ש
ר
 
ת
ק
י
ם
 
ע
ל
י
ך
 
א
ל
 
ג
ו
י
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
 
א
ת
ה
 
ו
א
ב
ת
י
ך
 
ו
ע
ב
ד
ת
 
ש
ם
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ע
ץ
 
ו
א
ב
ן
 
ו
ה
י
י
ת
 
ל
ש
ם
 
ו
ל
מ
ש
ל
 
ו
ל
ש
נ
י
נ
ה
 
ב
כ
ל
 
ה
ע
מ
י
ם
 
א
ש
ר
 
י
נ
ה
ג
ך
 
י
ה
ו
ה
 
ש
מ
ה
 
ז
ר
ע
 
ר
ב
 
ת
ו
צ
א
 
ה
ש
ד
ה
 
ו
מ
ע
ט
 
ת
א
ס
ף
 
כ
י
 
י
ח
ס
ל
נ
ו
 
ה
א
ר
ב
ה
 
כ
ר
מ
י
ם
 
ת
ט
ע
 
ו
ע
ב
ד
ת
 
ו
י
י
ן
 
ל
א
 
ת
ש
ת
ה
 
ו
ל
א
 
ת
א
ג
ר
 
כ
י
 
ת
א
כ
ל
נ
ו
 
ה
ת
ו
ל
ע
ת
 
ז
י
ת
י
ם
 
י
ה
י
ו
 
ל
ך
 
ב
כ
ל
 
ג
ב
ו
ל
ך
 
ו
ש
מ
ן
 
ל
א
 
ת
ס
ך
 
כ
י
 
י
ש
ע
ל
 
ז
י
ת
י
ך
 
ב
נ
י
ם
 
ו
ב
נ
ו
ת
 
ת
ו
ל
י
ד
 
ו
ל
א
 
י
ה
י
ו
 
ל
ך
 
כ
י
 
י
ל
כ
ו
 
ב
ש
ב
י
 
כ
ל
 
ע
צ
ך
 
ו
פ
ר
י
 
א
ד
מ
ת
ך
 
י
ו
ר
י
ש
 
ה
צ
ל
צ
ל
 
ה
ג
ר
 
א
ש
ר
 
ב
ק
ר
ב
ך
 
י
ע
ל
ה
 
ע
ל
י
ך
 
מ
ע
ל
ה
 
מ
ע
ל
ה
 
ו
א
ת
ה
 
ת
ר
ד
 
מ
ט
ה
 
מ
ט
ה
 
ה
ו
א
 
י
ל
ו
ך
 
ו
א
ת
ה
 
ל
א
 
ת
ל
ו
נ
ו
 
ה
ו
א
 
י
ה
י
ה
 
ל
ר
א
ש
 
ו
א
ת
ה
 
ת
ה
י
ה
 
ל
ז
נ
ב
 
ו
ב
א
ו
 
ע
ל
י
ך
 
כ
ל
 
ה
ק
ל
ל
ו
ת
 
ה
א
ל
ה
 
ו
ר
ד
פ
ו
ך
 
ו
ה
ש
י
ג
ו
ך
 
ע
ד
 
ה
ש
מ
י
ד
ו
ך
 
כ
י
 
ל
א
 
ש
מ
ע
ת
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
מ
צ
ו
ת
י
ו
 
ו
ח
ק
ת
י
ו
 
א
ש
ר
 
צ
ו
ך
 
ו
ה
י
ו
 
ב
ך
 
ל
א
ו
ת
 
ו
ל
מ
ו
פ
ת
 
ו
ב
ז
ר
ע
ך
 
ע
ד
 
ע
ו
ל
ם
 
ת
ח
ת
 
א
ש
ר
 
ל
א
 
ע
ב
ד
ת
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
ש
מ
ח
ה
 
ו
ב
ט
ו
ב
 
ל
ב
ב
 
מ
ר
ב
 
כ
ל
 
ו
ע
ב
ד
ת
 
א
ת
 
א
י
ב
י
ך
 
א
ש
ר
 
י
ש
ל
ח
נ
ו
 
י
ה
ו
ה
 
ב
ך
 
ב
ר
ע
ב
 
ו
ב
צ
מ
א
 
ו
ב
ע
ר
ו
ם
 
ו
ב
ח
ס
ר
 
כ
ל
 
ו
נ
ת
ן
 
ע
ו
ל
 
ב
ר
ז
ל
 
ע
ל
 
צ
ו
א
ר
ך
 
ע
ד
 
ה
ש
מ
י
ד
ו
 
א
ת
ך
 
י
ש
א
 
י
ה
ו
ה
 
ע
ל
י
ך
 
ג
ו
י
 
מ
ר
ח
ק
 
מ
ק
צ
ה
 
ה
א
ר
ץ
 
כ
א
ש
ר
 
י
ר
א
ה
 
ה
נ
ש
ר
 
ג
ו
י
 
א
ש
ר
 
ל
א
 
ת
ש
מ
ע
 
ל
ש
נ
ו
 
ג
ו
י
 
ע
ז
 
פ
נ
י
ם
 
א
ש
ר
 
ל
א
 
י
ש
א
 
פ
נ
י
ם
 
ל
ז
ק
ן
 
ו
נ
ע
ר
 
ל
א
 
י
ח
ן
 
ו
א
כ
ל
 
פ
ר
י
 
ב
ה
מ
ת
ך
 
ו
פ
ר
י
 
א
ד
מ
ת
ך
 
ע
ד
 
ה
ש
מ
י
ד
ך
 
א
ש
ר
 
ל
א
 
י
ש
א
י
ר
 
ל
ך
 
ד
ג
ן
 
ו
ת
י
ר
ש
 
ו
י
צ
ה
ר
 
ש
ג
ר
 
א
ל
פ
י
ך
 
ו
ע
ש
ת
ר
ו
ת
 
צ
א
נ
ך
 
ע
ד
 
א
ב
י
ד
ו
 
א
ת
ך
 
ו
ה
צ
ר
 
ל
ך
 
ב
כ
ל
 
ש
ע
ר
י
ך
 
ע
ד
 
ר
ד
ת
 
ח
ו
מ
ת
ך
 
ה
ג
ב
ח
ו
ת
 
ו
ה
ב
צ
ר
ו
ת
 
א
ש
ר
 
א
ת
ה
 
ב
ט
ח
 
ב
ה
ן
 
ב
כ
ל
 
א
ר
צ
ך
 
ו
ה
צ
ר
 
ל
ך
 
ב
כ
ל
 
ש
ע
ר
י
ך
 
ב
כ
ל
 
א
ר
צ
ך
 
א
ש
ר
 
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ך
 
ו
א
כ
ל
ת
 
פ
ר
י
 
ב
ט
נ
ך
 
ב
ש
ר
 
ב
נ
י
ך
 
ו
ב
נ
ת
י
ך
 
א
ש
ר
 
נ
ת
ן
 
ל
ך
 
ב
מ
צ
ו
ר
 
ו
ב
מ
צ
ו
ק
 
א
ש
ר
 
י
צ
י
ק
 
ל
ך
 
א
י
ב
י
ך
 
ה
א
י
ש
 
ה
ר
ך
 
ב
ך
 
ו
ה
ע
נ
ג
 
מ
א
ד
 
ת
ר
ע
 
ע
י
נ
ו
 
ב
א
ח
י
ו
 
ו
ב
א
ש
ת
 
ח
י
ק
ו
 
ו
ב
י
ת
ר
 
ב
נ
י
ו
 
א
ש
ר
 
י
ו
ת
ר
 
מ
ת
ת
 
ל
א
ח
ד
 
מ
ה
ם
 
מ
ב
ש
ר
 
ב
נ
י
ו
 
א
ש
ר
 
י
א
כ
ל
 
מ
ב
ל
י
 
ה
ש
א
י
ר
 
ל
ו
 
כ
ל
 
ב
מ
צ
ו
ר
 
ו
ב
מ
צ
ו
ק
 
א
ש
ר
 
י
צ
י
ק
 
ל
ך
 
א
י
ב
י
ך
 
ב
כ
ל
 
ש
ע
ר
י
ך
 
ה
ר
כ
ה
 
ב
ך
 
ו
ה
ע
נ
ג
ה
 
א
ש
ר
 
ל
א
 
נ
ס
ת
ה
 
כ
ף
 
ר
ג
ל
ה
 
ה
צ
י
ג
ה
 
ע
ל
 
ה
א
ר
ץ
 
מ
ה
ת
ע
נ
ג
 
ו
מ
ר
ך
 
ת
ר
ע
 
ע
י
נ
ה
 
ב
א
י
ש
 
ח
י
ק
ה
 
ב
ב
נ
ה
 
ו
ב
ב
ת
ה
 
ו
ב
ש
ל
ת
ה
 
ה
י
צ
א
ת
 
מ
ב
י
ן
 
ר
ג
ל
י
ה
 
ו
ב
ב
נ
י
ה
 
א
ש
ר
 
ת
ל
ד
 
כ
י
 
ת
א
כ
ל
ם
 
ב
ח
ס
ר
 
כ
ל
 
ב
ס
ת
ר
 
ב
מ
צ
ו
ר
 
ו
ב
מ
צ
ו
ק
 
א
ש
ר
 
י
צ
י
ק
ו
 
ל
ך
 
א
י
ב
י
ך
 
ב
ש
ע
ר
י
ך
 
א
ם
 
ל
א
 
ת
ש
מ
ר
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ה
כ
ת
ו
ב
י
ם
 
ב
ס
פ
ר
 
ה
ז
ה
 
ל
י
ר
א
ה
 
א
ת
 
ה
ש
ם
 
ה
נ
כ
ב
ד
 
ו
ה
נ
ו
ר
א
 
ה
ז
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ה
פ
ל
א
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
מ
כ
ו
ת
ך
 
ו
א
ת
 
מ
כ
ו
ת
 
ז
ר
ע
ך
 
מ
כ
ו
ת
 
ג
ד
ל
ו
ת
 
ו
נ
א
מ
נ
ו
ת
 
ו
ח
ל
י
ם
 
ר
ע
י
ם
 
ו
נ
א
מ
נ
י
ם
 
ו
ה
ש
י
ב
 
ב
ך
 
א
ת
 
כ
ל
 
מ
ד
ו
י
 
מ
צ
ר
י
ם
 
א
ש
ר
 
י
ג
ר
ת
 
מ
פ
נ
י
ה
ם
 
ו
ד
ב
ק
 
ב
ך
 
ג
ם
 
כ
ל
 
ח
ל
י
 
ו
כ
ל
 
מ
כ
ה
 
א
ש
ר
 
ל
א
 
כ
ת
ו
ב
 
ב
ס
פ
ר
 
ה
ת
ו
ר
ה
 
ה
ז
ה
 
י
ע
ל
ם
 
י
ה
ו
ה
 
ע
ל
י
ך
 
ע
ד
 
ה
ש
מ
י
ד
ך
 
ו
נ
ש
א
ר
ת
ם
 
ב
מ
ת
י
 
מ
ע
ט
 
ת
ח
ת
 
א
ש
ר
 
ה
י
י
ת
ם
 
כ
כ
ו
כ
ב
י
 
ה
ש
מ
י
ם
 
ל
ר
ב
 
כ
י
 
ל
א
 
ש
מ
ע
ת
ם
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ה
י
ה
 
כ
א
ש
ר
 
ש
ש
 
י
ה
ו
ה
 
ע
ל
י
כ
ם
 
ל
ה
ט
י
ב
 
א
ת
כ
ם
 
ו
ל
ה
ר
ב
ו
ת
 
א
ת
כ
ם
 
כ
ן
 
י
ש
ש
 
י
ה
ו
ה
 
ע
ל
י
כ
ם
 
ל
ה
א
ב
י
ד
 
א
ת
כ
ם
 
ו
ל
ה
ש
מ
י
ד
 
א
ת
כ
ם
 
ו
נ
ס
ח
ת
ם
 
מ
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
ה
פ
י
צ
ך
 
י
ה
ו
ה
 
ב
כ
ל
 
ה
ע
מ
י
ם
 
מ
ק
צ
ה
 
ה
א
ר
ץ
 
ו
ע
ד
 
ק
צ
ה
 
ה
א
ר
ץ
 
ו
ע
ב
ד
ת
 
ש
ם
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ת
 
א
ת
ה
 
ו
א
ב
ת
י
ך
 
ע
ץ
 
ו
א
ב
ן
 
ו
ב
ג
ו
י
ם
 
ה
ה
ם
 
ל
א
 
ת
ר
ג
י
ע
 
ו
ל
א
 
י
ה
י
ה
 
מ
נ
ו
ח
 
ל
כ
ף
 
ר
ג
ל
ך
 
ו
נ
ת
ן
 
י
ה
ו
ה
 
ל
ך
 
ש
ם
 
ל
ב
 
ר
ג
ז
 
כ
ל
י
ו
ן
 
ע
י
נ
י
ם
 
ו
ד
י
ב
ו
ן
 
נ
פ
ש
 
ו
ה
י
ו
 
ח
י
י
ך
 
ת
ל
א
י
ם
 
ל
ך
 
מ
נ
ג
ד
 
ו
פ
ח
ד
ת
 
ל
י
ל
ה
 
ו
י
ו
מ
ם
 
ו
ל
א
 
ת
א
מ
ן
 
ב
ח
י
י
ך
 
ב
ב
ק
ר
 
ת
א
מ
ר
 
מ
י
 
י
ת
ן
 
ע
ר
ב
 
ו
ב
ע
ר
ב
 
ת
א
מ
ר
 
מ
י
 
י
ת
ן
 
ב
ק
ר
 
מ
פ
ח
ד
 
ל
ב
ב
ך
 
א
ש
ר
 
ת
פ
ח
ד
 
ו
מ
מ
ר
א
ה
 
ע
י
נ
י
ך
 
א
ש
ר
 
ת
ר
א
ה
 
ו
ה
ש
י
ב
ך
 
י
ה
ו
ה
 
מ
צ
ר
י
מ
ה
 
ב
א
נ
י
ו
ת
 
ב
ד
ר
ך
 
א
ש
ר
 
א
מ
ר
ת
י
 
ל
כ
ם
 
ל
א
 
ת
ו
ס
י
פ
ו
ן
 
ע
ו
ד
 
ל
ר
א
ו
ת
ה
 
ו
ה
ת
מ
כ
ר
ת
ם
 
ש
ם
 
ל
א
י
ב
י
כ
ם
 
ל
ע
ב
ד
י
ם
 
ו
ל
ש
פ
ח
ו
ת
 
ו
א
י
ן
 
ק
נ
ה
 
א
ל
ה
 
ד
ב
ר
י
 
ה
ב
ר
י
ת
 
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ל
כ
ר
ת
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
א
ר
ץ
 
מ
ו
א
ב
 
מ
ל
ב
ד
 
ה
ב
ר
י
ת
 
א
ש
ר
 
כ
ר
ת
 
א
ת
ם
 
ב
ח
ו
ר
ב
 
ו
י
ק
ר
א
 
מ
ש
ה
 
א
ל
 
כ
ל
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
א
ת
ם
 
ר
א
י
ת
ם
 
א
ת
 
כ
ל
 
א
ש
ר
 
ע
ש
ה
 
י
ה
ו
ה
 
ל
ע
י
נ
י
כ
ם
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
פ
ר
ע
ה
 
ו
ל
כ
ל
 
ע
ב
ד
י
ו
 
ו
ל
כ
ל
 
א
ר
צ
ו
 
ה
מ
ס
ו
ת
 
ה
ג
ד
ל
ו
ת
 
א
ש
ר
 
ר
א
ו
 
ע
י
נ
י
ך
 
ה
א
ת
ו
ת
 
ו
ה
מ
ו
פ
ת
י
ם
 
ה
ג
ד
ל
י
ם
 
ה
ה
ם
 
ו
ל
א
 
נ
ת
ן
 
י
ה
ו
ה
 
ל
כ
ם
 
ל
ב
 
ל
ד
ע
ת
 
ו
ע
י
נ
י
ם
 
ל
ר
א
ו
ת
 
ו
א
ז
נ
י
ם
 
ל
ש
מ
ע
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
א
ו
ל
י
ך
 
א
ת
כ
ם
 
א
ר
ב
ע
י
ם
 
ש
נ
ה
 
ב
מ
ד
ב
ר
 
ל
א
 
ב
ל
ו
 
ש
מ
ל
ת
י
כ
ם
 
מ
ע
ל
י
כ
ם
 
ו
נ
ע
ל
י
כ
ם
 
ל
א
 
ב
ל
ו
 
מ
ע
ל
 
ר
ג
ל
י
כ
ם
 
ל
ח
ם
 
ל
א
 
א
כ
ל
ת
ם
 
ו
י
י
ן
 
ו
ש
כ
ר
 
ל
א
 
ש
ת
י
ת
ם
 
ל
מ
ע
ן
 
ת
ד
ע
ו
 
כ
י
 
א
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ת
ב
א
ו
 
א
ל
 
ה
מ
ק
ו
ם
 
ה
ז
ה
 
ו
י
צ
א
 
ס
י
ח
ו
ן
 
מ
ל
ך
 
ח
ש
ב
ו
ן
 
ו
ע
ו
ג
 
מ
ל
ך
 
ה
ב
ש
ן
 
ל
ק
ר
א
ת
נ
ו
 
ל
מ
ל
ח
מ
ה
 
ו
נ
כ
ם
 
ו
נ
ק
ח
 
א
ת
 
א
ר
צ
ם
 
ו
נ
ת
נ
ה
 
נ
ח
ל
ה
 
ל
ר
א
ו
ב
נ
י
 
ו
ל
ג
ד
י
 
ו
ל
ח
צ
י
 
ש
ב
ט
 
ה
מ
נ
ש
ה
 
ו
ש
מ
ר
ת
ם
 
א
ת
 
ד
ב
ר
י
 
ה
ב
ר
י
ת
 
ה
ז
א
ת
 
ו
ע
ש
י
ת
ם
 
א
ת
ם
 
ל
מ
ע
ן
 
ת
ש
כ
י
ל
ו
 
א
ת
 
כ
ל
 
א
ש
ר
 
ת
ע
ש
ו
ן
 
א
ת
ם
 
נ
צ
ב
י
ם
 
ה
י
ו
ם
 
כ
ל
כ
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ר
א
ש
י
כ
ם
 
ש
ב
ט
י
כ
ם
 
ז
ק
נ
י
כ
ם
 
ו
ש
ט
ר
י
כ
ם
 
כ
ל
 
א
י
ש
 
י
ש
ר
א
ל
 
ט
פ
כ
ם
 
ו
נ
ש
י
כ
ם
 
ו
ג
ר
ך
 
א
ש
ר
 
ב
ק
ר
ב
 
מ
ח
נ
י
ך
 
מ
ח
ט
ב
 
ע
צ
י
ך
 
ו
ע
ד
 
ש
א
ב
 
מ
י
מ
י
ך
 
ל
ע
ב
ר
ך
 
ב
ב
ר
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ב
א
ל
ת
ו
 
א
ש
ר
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
כ
ר
ת
 
ע
מ
ך
 
ה
י
ו
ם
 
ו
ל
מ
ע
ן
 
ה
ק
י
ם
 
א
ת
ך
 
ה
י
ו
ם
 
ל
ו
 
ל
ע
ם
 
ו
ה
ו
א
 
י
ה
י
ה
 
ל
ך
 
ל
א
ל
ה
י
ם
 
כ
א
ש
ר
 
ד
ב
ר
 
ל
ך
 
ו
כ
א
ש
ר
 
נ
ש
ב
ע
 
ל
א
ב
ת
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ו
ל
א
 
א
ת
כ
ם
 
ל
ב
ד
כ
ם
 
א
נ
כ
י
 
כ
ר
ת
 
א
ת
 
ה
ב
ר
י
ת
 
ה
ז
א
ת
 
ו
א
ת
 
ה
א
ל
ה
 
ה
ז
א
ת
 
כ
י
 
א
ת
 
א
ש
ר
 
י
ש
נ
ו
 
פ
ה
 
ע
מ
נ
ו
 
ע
מ
ד
 
ה
י
ו
ם
 
ל
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
א
ת
 
א
ש
ר
 
א
י
נ
נ
ו
 
פ
ה
 
ע
מ
נ
ו
 
ה
י
ו
ם
 
כ
י
 
א
ת
ם
 
י
ד
ע
ת
ם
 
א
ת
 
א
ש
ר
 
י
ש
ב
נ
ו
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
א
ת
 
א
ש
ר
 
ע
ב
ר
נ
ו
 
ב
ק
ר
ב
 
ה
ג
ו
י
ם
 
א
ש
ר
 
ע
ב
ר
ת
ם
 
ו
ת
ר
א
ו
 
א
ת
 
ש
ק
צ
י
ה
ם
 
ו
א
ת
 
ג
ל
ל
י
ה
ם
 
ע
ץ
 
ו
א
ב
ן
 
כ
ס
ף
 
ו
ז
ה
ב
 
א
ש
ר
 
ע
מ
ה
ם
 
פ
ן
 
י
ש
 
ב
כ
ם
 
א
י
ש
 
א
ו
 
א
ש
ה
 
א
ו
 
מ
ש
פ
ח
ה
 
א
ו
 
ש
ב
ט
 
א
ש
ר
 
ל
ב
ב
ו
 
פ
נ
ה
 
ה
י
ו
ם
 
מ
ע
ם
 
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ל
ל
כ
ת
 
ל
ע
ב
ד
 
א
ת
 
א
ל
ה
י
 
ה
ג
ו
י
ם
 
ה
ה
ם
 
פ
ן
 
י
ש
 
ב
כ
ם
 
ש
ר
ש
 
פ
ר
ה
 
ר
א
ש
 
ו
ל
ע
נ
ה
 
ו
ה
י
ה
 
ב
ש
מ
ע
ו
 
א
ת
 
ד
ב
ר
י
 
ה
א
ל
ה
 
ה
ז
א
ת
 
ו
ה
ת
ב
ר
ך
 
ב
ל
ב
ב
ו
 
ל
א
מ
ר
 
ש
ל
ו
ם
 
י
ה
י
ה
 
ל
י
 
כ
י
 
ב
ש
ר
י
ר
ת
 
ל
ב
י
 
א
ל
ך
 
ל
מ
ע
ן
 
ס
פ
ו
ת
 
ה
ר
ו
א
ה
 
א
ת
 
ה
צ
מ
א
ה
 
ל
א
 
י
א
ב
ה
 
י
ה
ו
ה
 
ל
ס
ל
ח
 
ל
ו
 
כ
י
 
א
ז
 
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ו
ק
נ
א
ת
ו
 
ב
א
י
ש
 
ה
ה
ו
א
 
ו
ר
ב
צ
ו
 
ב
ו
 
כ
ל
 
ה
א
ל
ה
 
ה
כ
ת
ו
ב
ה
 
ב
ס
פ
ר
 
ה
ז
ה
 
ו
מ
ח
ה
 
י
ה
ו
ה
 
א
ת
 
ש
מ
ו
 
מ
ת
ח
ת
 
ה
ש
מ
י
ם
 
ו
ה
ב
ד
י
ל
ו
 
י
ה
ו
ה
 
ל
ר
ע
ה
 
מ
כ
ל
 
ש
ב
ט
י
 
י
ש
ר
א
ל
 
כ
כ
ל
 
ה
א
ל
ו
ת
 
ה
ב
ר
י
ת
 
ה
כ
ת
ו
ב
ה
 
ב
ס
פ
ר
 
ה
ת
ו
ר
ה
 
ה
ז
ה
 
ו
א
מ
ר
 
ה
ד
ו
ר
 
ה
א
ח
ר
ו
ן
 
ב
נ
י
כ
ם
 
א
ש
ר
 
י
ק
ו
מ
ו
 
מ
א
ח
ר
י
כ
ם
 
ו
ה
נ
כ
ר
י
 
א
ש
ר
 
י
ב
ו
א
 
מ
א
ר
ץ
 
ר
ח
ו
ק
ה
 
ו
ר
א
ה
 
א
ת
 
מ
כ
ו
ת
 
ה
א
ר
ץ
 
ה
ה
י
א
 
ו
א
ת
 
ת
ח
ל
א
י
ה
 
א
ש
ר
 
ח
ל
א
 
י
ה
ו
ה
 
ב
ה
 
ג
פ
ר
י
ת
 
ו
מ
ל
ח
 
ש
ר
פ
ה
 
כ
ל
 
א
ר
צ
ה
 
ל
א
 
ת
ז
ר
י
ע
 
ו
ל
א
 
ת
צ
מ
י
ח
 
ו
ל
א
 
י
ע
ל
ה
 
ב
ה
 
כ
ל
 
ע
ש
ב
 
כ
מ
ה
פ
כ
ת
 
ס
ד
ם
 
ו
ע
מ
ר
ה
 
א
ד
מ
ה
 
ו
צ
ב
א
י
ם
 
א
ש
ר
 
ה
פ
ך
 
י
ה
ו
ה
 
ב
א
פ
ו
 
ו
ב
ח
מ
ת
ו
 
ו
א
מ
ר
ו
 
כ
ל
 
ה
ג
ו
י
ם
 
ע
ל
 
מ
ה
 
ע
ש
ה
 
י
ה
ו
ה
 
כ
כ
ה
 
ל
א
ר
ץ
 
ה
ז
א
ת
 
ו
מ
ה
 
ח
ר
י
 
ה
א
ף
 
ה
ג
ד
ו
ל
 
ה
ז
ה
 
ו
א
מ
ר
ו
 
ע
ל
 
א
ש
ר
 
ע
ז
ב
ו
 
א
ת
 
ב
ר
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
 
א
ב
ו
ת
ם
 
א
ש
ר
 
כ
ר
ת
 
ע
מ
ה
ם
 
ב
ה
ו
צ
א
ו
 
א
ת
ם
 
מ
א
ר
ץ
 
מ
צ
ר
י
ם
 
ו
י
ל
כ
ו
 
ו
י
ע
ב
ד
ו
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
י
ש
ת
ח
ו
ו
 
ל
ה
ם
 
א
ל
ה
י
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
ם
 
ו
ל
א
 
ח
ל
ק
 
ל
ה
ם
 
ו
י
ח
ר
 
א
ף
 
י
ה
ו
ה
 
ב
א
ר
ץ
 
ה
ה
י
א
 
ל
ה
ב
י
א
 
ע
ל
י
ה
 
א
ת
 
כ
ל
 
ה
ק
ל
ל
ה
 
ה
כ
ת
ו
ב
ה
 
ב
ס
פ
ר
 
ה
ז
ה
 
ו
י
ת
ש
ם
 
י
ה
ו
ה
 
מ
ע
ל
 
א
ד
מ
ת
ם
 
ב
א
ף
 
ו
ב
ח
מ
ה
 
ו
ב
ק
צ
ף
 
ג
ד
ו
ל
 
ו
י
ש
ל
כ
ם
 
א
ל
 
א
ר
ץ
 
א
ח
ר
ת
 
כ
י
ו
ם
 
ה
ז
ה
 
ה
נ
ס
ת
ר
ו
ת
 
ל
י
ה
ו
ה
 
א
ל
ה
י
נ
ו
 
ו
ה
נ
ג
ל
א
ו
ת
 
ל
נ
ו
 
ו
ל
ב
נ
י
נ
ו
 
ע
ד
 
ע
ו
ל
ם
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
ה
י
ה
 
כ
י
 
י
ב
א
ו
 
ע
ל
י
ך
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ה
ב
ר
כ
ה
 
ו
ה
ק
ל
ל
ה
 
א
ש
ר
 
נ
ת
ת
י
 
ל
פ
נ
י
ך
 
ו
ה
ש
ב
ו
ת
 
א
ל
 
ל
ב
ב
ך
 
ב
כ
ל
 
ה
ג
ו
י
ם
 
א
ש
ר
 
י
ד
י
ח
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ש
מ
ה
 
ו
ש
ב
ת
 
ע
ד
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ש
מ
ע
ת
 
ב
ק
ו
ל
ו
 
כ
כ
ל
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
א
ת
ה
 
ו
ב
נ
י
ך
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
ו
ש
ב
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ש
ו
ב
ת
ך
 
ו
ר
ח
מ
ך
 
ו
ש
ב
 
ו
ק
ב
צ
ך
 
מ
כ
ל
 
ה
ע
מ
י
ם
 
א
ש
ר
 
ה
פ
י
צ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ש
ם
 
א
ם
 
י
ה
י
ה
 
נ
ד
ח
ך
 
ב
ק
צ
ה
 
ה
ש
מ
י
ם
 
מ
ש
ם
 
י
ק
ב
צ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
מ
ש
ם
 
י
ק
ח
ך
 
ו
ה
ב
י
א
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
י
ר
ש
ו
 
א
ב
ת
י
ך
 
ו
י
ר
ש
ת
ה
 
ו
ה
ר
ב
ך
 
מ
א
ב
ת
י
ך
 
ו
מ
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
ל
ב
ב
ך
 
ו
א
ת
 
ל
ב
ב
 
ז
ר
ע
ך
 
ל
א
ה
ב
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
ל
מ
ע
ן
 
ח
י
י
ך
 
ו
נ
ת
ן
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
א
ת
 
כ
ל
 
ה
א
ל
ו
ת
 
ה
א
ל
ה
 
ע
ל
 
א
י
ב
י
ך
 
ו
ע
ל
 
ש
נ
א
י
ך
 
א
ש
ר
 
ר
ד
פ
ו
ך
 
ו
א
ת
ה
 
ת
ש
ו
ב
 
ו
ש
מ
ע
ת
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ע
ש
י
ת
 
א
ת
 
כ
ל
 
מ
צ
ו
ת
י
ו
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ו
ה
ו
ת
י
ר
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
מ
ע
ש
ה
 
י
ד
י
ך
 
ב
פ
ר
י
 
ב
ט
נ
ך
 
ו
ב
פ
ר
י
 
א
ד
מ
ת
ך
 
ו
ב
פ
ר
י
 
ב
ה
מ
ת
ך
 
ל
ט
ו
ב
ה
 
כ
י
 
י
ש
ו
ב
 
י
ה
ו
ה
 
ל
ש
ש
 
ע
ל
י
ך
 
ל
ט
ו
ב
 
כ
א
ש
ר
 
ש
ש
 
ע
ל
 
א
ב
ת
י
ך
 
כ
י
 
ת
ש
מ
ע
 
ב
ק
ו
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ל
ש
מ
ר
 
מ
צ
ו
ת
י
ו
 
ו
ח
ק
ת
י
ו
 
ה
כ
ת
ו
ב
ה
 
ב
ס
פ
ר
 
ה
ת
ו
ר
ה
 
ה
ז
ה
 
כ
י
 
ת
ש
ו
ב
 
א
ל
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
כ
ל
 
ל
ב
ב
ך
 
ו
ב
כ
ל
 
נ
פ
ש
ך
 
כ
י
 
ה
מ
צ
ו
ה
 
ה
ז
א
ת
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
א
 
נ
פ
ל
א
ת
 
ה
י
א
 
מ
מ
ך
 
ו
ל
א
 
ר
ח
ו
ק
ה
 
ה
י
א
 
ל
א
 
ב
ש
מ
י
ם
 
ה
י
א
 
ל
א
מ
ר
 
מ
י
 
י
ע
ל
ה
 
ל
נ
ו
 
ה
ש
מ
י
ם
 
ו
י
ק
ח
ה
 
ל
נ
ו
 
ו
י
ש
מ
ע
נ
ו
 
א
ת
ה
 
ו
נ
ע
ש
נ
ה
 
ו
ל
א
 
מ
ע
ב
ר
 
ל
י
ם
 
ה
י
א
 
ל
א
מ
ר
 
מ
י
 
י
ע
ב
ר
 
ל
נ
ו
 
א
ל
 
ע
ב
ר
 
ה
י
ם
 
ו
י
ק
ח
ה
 
ל
נ
ו
 
ו
י
ש
מ
ע
נ
ו
 
א
ת
ה
 
ו
נ
ע
ש
נ
ה
 
כ
י
 
ק
ר
ו
ב
 
א
ל
י
ך
 
ה
ד
ב
ר
 
מ
א
ד
 
ב
פ
י
ך
 
ו
ב
ל
ב
ב
ך
 
ל
ע
ש
ו
ת
ו
 
ר
א
ה
 
נ
ת
ת
י
 
ל
פ
נ
י
ך
 
א
ת
 
ה
ח
י
י
ם
 
ו
א
ת
 
ה
ט
ו
ב
 
ו
א
ת
 
ה
מ
ו
ת
 
ו
א
ת
 
ה
ר
ע
 
א
ש
ר
 
א
נ
כ
י
 
מ
צ
ו
ך
 
ה
י
ו
ם
 
ל
א
ה
ב
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ל
ל
כ
ת
 
ב
ד
ר
כ
י
ו
 
ו
ל
ש
מ
ר
 
ח
ק
י
ו
 
ו
מ
צ
ו
ת
י
ו
 
ו
מ
ש
פ
ט
י
ו
 
ו
ח
י
י
ת
 
ו
ר
ב
י
ת
 
ו
ב
ר
כ
ך
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
א
ר
ץ
 
א
ש
ר
 
א
ת
ה
 
ב
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
א
ם
 
י
פ
נ
ה
 
ל
ב
ב
ך
 
ו
ל
א
 
ת
ש
מ
ע
 
ו
נ
ד
ח
ת
 
ו
ה
ש
ת
ח
ו
י
ת
 
ל
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
ע
ב
ד
ת
ם
 
ה
ג
ד
ת
י
 
ל
כ
ם
 
ה
י
ו
ם
 
כ
י
 
א
ב
ד
 
ת
א
ב
ד
ו
ן
 
ל
א
 
ת
א
ר
י
כ
ו
ן
 
י
מ
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ל
ב
ו
א
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ה
ע
ד
ת
י
 
ב
כ
ם
 
ה
י
ו
ם
 
א
ת
 
ה
ש
מ
י
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
ה
ח
י
י
ם
 
ו
ה
מ
ו
ת
 
נ
ת
ת
י
 
ל
פ
נ
י
ך
 
ה
ב
ר
כ
ה
 
ו
ה
ק
ל
ל
ה
 
ו
ב
ח
ר
ת
 
ב
ח
י
י
ם
 
ל
מ
ע
ן
 
ת
ח
י
ה
 
א
ת
ה
 
ו
ז
ר
ע
ך
 
ל
א
ה
ב
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ו
ל
ש
מ
ע
 
ב
ק
ו
ל
ו
 
ו
ל
ה
ד
ב
ק
ה
 
ב
ו
 
כ
י
 
ה
ו
א
 
ח
י
י
ך
 
ו
א
ר
ך
 
י
מ
י
ך
 
ל
ש
ב
ת
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
י
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ל
ת
ת
 
ל
כ
ם
 
ו
י
ל
ך
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
א
ל
 
כ
ל
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ב
ן
 
מ
א
ה
 
ו
ע
ש
ר
י
ם
 
ש
נ
ה
 
א
נ
כ
י
 
ה
י
ו
ם
 
ל
א
 
א
ו
כ
ל
 
ע
ו
ד
 
ל
צ
א
ת
 
ו
ל
א
ב
ו
א
 
ו
י
ה
ו
ה
 
ה
א
מ
ר
 
א
ל
י
 
ל
א
 
ת
ע
ב
ר
 
א
ת
 
ה
י
ר
ד
ן
 
ה
ז
ה
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ו
א
 
ה
ע
ב
ר
 
ל
פ
נ
י
ך
 
ה
ו
א
 
י
ש
מ
י
ד
 
א
ת
 
ה
ג
ו
י
ם
 
ה
א
ל
ה
 
מ
ל
פ
נ
י
ך
 
ו
י
ר
ש
ת
ם
 
ו
י
ה
ו
ש
ע
 
ה
ו
א
 
ה
ע
ב
ר
 
ל
פ
נ
י
ך
 
כ
א
ש
ר
 
ד
ב
ר
 
י
ה
ו
ה
 
ו
ע
ש
ה
 
י
ה
ו
ה
 
ל
ה
ם
 
כ
א
ש
ר
 
ע
ש
ה
 
ל
ס
י
ח
ו
ן
 
ו
ל
ע
ו
ג
 
מ
ל
כ
י
 
ה
א
מ
ר
י
 
ו
ל
א
ר
צ
ם
 
א
ש
ר
 
ה
ש
מ
י
ד
 
א
ת
ם
 
ו
נ
ת
נ
ם
 
י
ה
ו
ה
 
ל
פ
נ
י
כ
ם
 
ו
ע
ש
י
ת
ם
 
ל
ה
ם
 
כ
כ
ל
 
ה
מ
צ
ו
ה
 
א
ש
ר
 
צ
ו
י
ת
י
 
א
ת
כ
ם
 
ח
ז
ק
ו
 
ו
א
מ
צ
ו
 
א
ל
 
ת
י
ר
א
ו
 
ו
א
ל
 
ת
ע
ר
צ
ו
 
מ
פ
נ
י
ה
ם
 
כ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ה
ו
א
 
ה
ה
ל
ך
 
ע
מ
ך
 
ל
א
 
י
ר
פ
ך
 
ו
ל
א
 
י
ע
ז
ב
ך
 
ו
י
ק
ר
א
 
מ
ש
ה
 
ל
י
ה
ו
ש
ע
 
ו
י
א
מ
ר
 
א
ל
י
ו
 
ל
ע
י
נ
י
 
כ
ל
 
י
ש
ר
א
ל
 
ח
ז
ק
 
ו
א
מ
ץ
 
כ
י
 
א
ת
ה
 
ת
ב
י
א
 
א
ת
 
ה
ע
ם
 
ה
ז
ה
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
 
י
ה
ו
ה
 
ל
א
ב
ת
ם
 
ל
ת
ת
 
ל
ה
ם
 
ו
א
ת
ה
 
ת
נ
ח
י
ל
נ
ה
 
א
ת
ם
 
ו
י
ה
ו
ה
 
ה
ו
א
 
ה
ה
ל
ך
 
ל
פ
נ
י
ך
 
ה
ו
א
 
י
ה
י
ה
 
ע
מ
ך
 
ל
א
 
י
ר
פ
ך
 
ו
ל
א
 
י
ע
ז
ב
ך
 
ל
א
 
ת
י
ר
א
 
ו
ל
א
 
ת
ח
ת
 
ו
י
כ
ת
ב
 
מ
ש
ה
 
א
ת
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
י
ת
נ
ה
 
א
ל
 
ה
כ
ה
נ
י
ם
 
ב
נ
י
 
ל
ו
י
 
ה
נ
ש
א
י
ם
 
א
ת
 
א
ר
ו
ן
 
ב
ר
י
ת
 
י
ה
ו
ה
 
ו
א
ל
 
כ
ל
 
ז
ק
נ
י
 
י
ש
ר
א
ל
 
ו
י
צ
ו
 
מ
ש
ה
 
א
ת
ם
 
ל
א
מ
ר
 
מ
ק
ץ
 
ש
ב
ע
 
ש
נ
י
ם
 
ב
מ
ו
ע
ד
 
ש
נ
ת
 
ה
ש
מ
ט
ה
 
ב
ח
ג
 
ה
ס
כ
ו
ת
 
ב
ב
ו
א
 
כ
ל
 
י
ש
ר
א
ל
 
ל
ה
ר
א
ו
ת
 
א
ת
 
פ
נ
י
 
י
ה
ו
ה
 
א
ל
ה
י
ך
 
ב
מ
ק
ו
ם
 
א
ש
ר
 
ב
ח
ר
 
י
ק
ר
א
 
א
ת
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
נ
ג
ד
 
כ
ל
 
י
ש
ר
א
ל
 
ב
א
ז
נ
י
ה
ם
 
ה
ק
ה
ל
 
א
ת
 
ה
ע
ם
 
ה
א
נ
ש
י
ם
 
ו
ה
נ
ש
י
ם
 
ו
ה
ט
ף
 
ו
ג
ר
ך
 
א
ש
ר
 
ב
ש
ע
ר
י
ך
 
ל
מ
ע
ן
 
י
ש
מ
ע
ו
 
ו
ל
מ
ע
ן
 
י
ל
מ
ד
ו
 
ו
י
י
ר
א
ו
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ש
מ
ר
ו
 
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ו
ב
נ
י
ה
ם
 
א
ש
ר
 
ל
א
 
י
ד
ע
ו
 
י
ש
מ
ע
ו
 
ו
ל
מ
ד
ו
 
ל
י
ר
א
ה
 
א
ת
 
י
ה
ו
ה
 
א
ל
ה
י
ה
ם
 
כ
ל
 
ה
י
מ
י
ם
 
א
ש
ר
 
ה
ם
 
ח
י
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
ן
 
ק
ר
ב
ו
 
י
מ
י
ך
 
ל
מ
ו
ת
 
ק
ר
א
 
א
ת
 
י
ה
ו
ש
ע
 
ו
ה
ת
י
צ
ב
ו
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
א
צ
ו
נ
ו
 
ו
י
ל
ך
 
מ
ש
ה
 
ו
י
ה
ו
ש
ע
 
ו
י
ת
י
צ
ב
ו
 
ב
א
ה
ל
 
מ
ו
ע
ד
 
ו
י
ר
א
ה
 
י
ה
ו
ה
 
ב
א
ה
ל
 
ב
ע
מ
ו
ד
 
ע
נ
ן
 
ו
י
ע
מ
ד
 
ע
מ
ו
ד
 
ה
ע
נ
ן
 
א
ל
 
פ
ת
ח
 
ה
א
ה
ל
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ה
נ
ך
 
ש
כ
ב
 
ע
ם
 
א
ב
ת
י
ך
 
ו
ק
ם
 
ה
ע
ם
 
ה
ז
ה
 
ו
ז
נ
ה
 
א
ח
ר
י
 
א
ל
ה
י
 
נ
כ
ר
 
ה
א
ר
ץ
 
א
ש
ר
 
ה
ו
א
 
ב
א
 
ש
מ
ה
 
ב
ק
ר
ב
ו
 
ו
ע
ז
ב
ו
נ
י
 
ו
ה
פ
ר
ו
 
א
ת
 
ב
ר
י
ת
י
 
א
ש
ר
 
כ
ר
ת
י
 
א
ת
ו
 
ו
ח
ר
ה
 
א
פ
י
 
ב
ו
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
ע
ז
ב
ת
י
ם
 
ו
ה
ס
ת
ר
ת
י
 
פ
נ
י
 
מ
ה
ם
 
ו
ה
י
ו
 
ל
א
כ
ל
ה
 
ו
מ
צ
א
ה
ו
 
ר
ע
ו
ת
 
ר
ב
ו
ת
 
ו
צ
ר
ו
ת
 
ו
א
מ
ר
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ה
ל
ו
א
 
ע
ל
 
כ
י
 
א
י
ן
 
א
ל
ה
י
 
ב
ק
ר
ב
י
 
מ
צ
א
ו
נ
י
 
ה
ר
ע
ו
ת
 
ה
א
ל
ה
 
ו
א
נ
כ
י
 
ה
ס
ת
ר
 
א
ס
ת
י
ר
 
פ
נ
י
 
מ
ה
ם
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ע
ל
 
כ
ל
 
ה
ר
ע
ה
 
א
ש
ר
 
ע
ש
ו
 
כ
י
 
פ
נ
ו
 
א
ל
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
ע
ת
ה
 
כ
ת
ב
ו
 
ל
כ
ם
 
א
ת
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ו
ל
מ
ד
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ש
י
מ
ה
 
ב
פ
י
ם
 
ל
מ
ע
ן
 
ת
ה
י
ה
 
ל
י
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ל
ע
ד
 
ב
ב
נ
י
 
י
ש
ר
א
ל
 
כ
י
 
א
ב
י
א
נ
ו
 
א
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ת
י
ו
 
ל
ת
ת
 
ל
ה
ם
 
ז
ב
ת
 
ח
ל
ב
 
ו
ד
ב
ש
 
ו
א
כ
ל
 
ו
ש
ב
ע
 
ו
ד
ש
ן
 
ו
פ
נ
ה
 
א
ל
 
א
ל
ה
י
ם
 
א
ח
ר
י
ם
 
ו
ע
ב
ד
ו
ם
 
ו
נ
א
צ
ו
נ
י
 
ו
ה
פ
ר
ו
 
א
ת
 
ב
ר
י
ת
י
 
ו
ה
י
ה
 
כ
י
 
ת
מ
צ
א
נ
ה
 
א
ת
ו
 
ר
ע
ו
ת
 
ר
ב
ו
ת
 
ו
צ
ר
ו
ת
 
ו
ע
נ
ת
ה
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ל
פ
נ
י
ו
 
ל
ע
ד
 
כ
י
 
ל
א
 
ת
ש
כ
ח
 
מ
פ
י
 
ז
ר
ע
ו
 
כ
י
 
י
ד
ע
ת
י
 
א
ת
 
י
צ
ר
ו
 
א
ש
ר
 
ה
ו
א
 
ע
ש
ה
 
ה
י
ו
ם
 
ב
ט
ר
ם
 
א
ב
י
א
נ
ו
 
א
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ת
י
ו
 
ו
י
כ
ת
ב
 
מ
ש
ה
 
א
ת
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ב
י
ו
ם
 
ה
ה
ו
א
 
ו
י
ל
מ
ד
ה
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
צ
ו
 
א
ת
 
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
י
א
מ
ר
 
ח
ז
ק
 
ו
א
מ
ץ
 
כ
י
 
א
ת
ה
 
ת
ב
י
א
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
ה
ם
 
ו
א
נ
כ
י
 
א
ה
י
ה
 
ע
מ
ך
 
ו
י
ה
י
 
כ
כ
ל
ו
ת
 
מ
ש
ה
 
ל
כ
ת
ב
 
א
ת
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
ע
ל
 
ס
פ
ר
 
ע
ד
 
ת
מ
ם
 
ו
י
צ
ו
 
מ
ש
ה
 
א
ת
 
ה
ל
ו
י
ם
 
נ
ש
א
י
 
א
ר
ו
ן
 
ב
ר
י
ת
 
י
ה
ו
ה
 
ל
א
מ
ר
 
ל
ק
ח
ו
 
א
ת
 
ס
פ
ר
 
ה
ת
ו
ר
ה
 
ה
ז
ה
 
ו
ש
מ
ת
ם
 
א
ת
ו
 
מ
צ
ד
 
א
ר
ו
ן
 
ב
ר
י
ת
 
י
ה
ו
ה
 
א
ל
ה
י
כ
ם
 
ו
ה
י
ה
 
ש
ם
 
ב
ך
 
ל
ע
ד
 
כ
י
 
א
נ
כ
י
 
י
ד
ע
ת
י
 
א
ת
 
מ
ר
י
ך
 
ו
א
ת
 
ע
ר
פ
ך
 
ה
ק
ש
ה
 
ה
ן
 
ב
ע
ו
ד
נ
י
 
ח
י
 
ע
מ
כ
ם
 
ה
י
ו
ם
 
מ
מ
ר
י
ם
 
ה
י
י
ת
ם
 
ע
ם
 
י
ה
ו
ה
 
ו
א
ף
 
כ
י
 
א
ח
ר
י
 
מ
ו
ת
י
 
ה
ק
ה
ל
ו
 
א
ל
י
 
א
ת
 
כ
ל
 
ז
ק
נ
י
 
ש
ב
ט
י
כ
ם
 
ו
ש
ט
ר
י
כ
ם
 
ו
א
ד
ב
ר
ה
 
ב
א
ז
נ
י
ה
ם
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
ו
א
ע
י
ד
ה
 
ב
ם
 
א
ת
 
ה
ש
מ
י
ם
 
ו
א
ת
 
ה
א
ר
ץ
 
כ
י
 
י
ד
ע
ת
י
 
א
ח
ר
י
 
מ
ו
ת
י
 
כ
י
 
ה
ש
ח
ת
 
ת
ש
ח
ת
ו
ן
 
ו
ס
ר
ת
ם
 
מ
ן
 
ה
ד
ר
ך
 
א
ש
ר
 
צ
ו
י
ת
י
 
א
ת
כ
ם
 
ו
ק
ר
ת
ה
 
א
ת
כ
ם
 
ה
ר
ע
ה
 
ב
א
ח
ר
י
ת
 
ה
י
מ
י
ם
 
כ
י
 
ת
ע
ש
ו
 
א
ת
 
ה
ר
ע
 
ב
ע
י
נ
י
 
י
ה
ו
ה
 
ל
ה
כ
ע
י
ס
ו
 
ב
מ
ע
ש
ה
 
י
ד
י
כ
ם
 
ו
י
ד
ב
ר
 
מ
ש
ה
 
ב
א
ז
נ
י
 
כ
ל
 
ק
ה
ל
 
י
ש
ר
א
ל
 
א
ת
 
ד
ב
ר
י
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ע
ד
 
ת
מ
ם
 
ה
א
ז
י
נ
ו
 
ה
ש
מ
י
ם
 
ו
א
ד
ב
ר
ה
 
ו
ת
ש
מ
ע
 
ה
א
ר
ץ
 
א
מ
ר
י
 
פ
י
י
 
י
ע
ר
ף
 
כ
מ
ט
ר
 
ל
ק
ח
י
 
ו
ת
א
ז
ל
 
כ
ט
ל
 
א
מ
י
ר
ת
י
 
כ
ש
ע
י
ר
י
ם
 
ע
ל
י
 
ד
ש
א
 
ו
כ
ר
ב
י
ב
י
ם
 
ע
ל
י
 
ע
ש
ב
 
כ
י
 
ב
ש
ם
 
י
ה
ו
ה
 
א
ק
ר
א
 
ו
ה
ב
ו
 
ג
ד
ל
 
ל
א
ל
ה
י
נ
ו
 
ה
צ
ו
ר
 
ת
מ
י
ם
 
פ
ע
ל
ו
 
כ
י
 
כ
ל
 
ד
ר
כ
י
ו
 
מ
ש
פ
ט
 
א
ל
 
א
מ
ו
נ
ה
 
ו
א
י
ן
 
ע
ו
ל
 
צ
ד
י
ק
 
ו
י
ש
ר
 
ה
ו
א
 
ש
ח
ת
ו
 
ל
א
 
ל
ו
 
ב
נ
י
 
מ
ו
ם
 
ד
ו
ר
 
ע
ק
ש
 
ו
פ
ת
ל
ת
ל
 
ה
ל
י
ה
ו
ה
 
ת
ג
מ
ל
ו
 
ז
א
ת
 
ע
ם
 
נ
ב
ל
 
ו
ל
א
 
ח
כ
ם
 
ה
ל
ו
א
 
ה
ו
א
 
א
ב
י
ך
 
ק
נ
ך
 
ה
ו
א
 
ע
ש
ך
 
ו
י
כ
ו
נ
נ
ך
 
ז
כ
ר
ו
 
י
ו
מ
ת
 
ע
ו
ל
ם
 
ב
י
נ
ו
 
ש
נ
ת
 
ד
ו
ר
 
ו
ד
ר
 
ש
א
ל
 
א
ב
י
ך
 
ו
י
ג
י
ד
ך
 
ז
ק
נ
י
ך
 
ו
י
א
מ
ר
ו
 
ל
ך
 
ב
ה
נ
ח
י
ל
 
ע
ל
י
ו
ן
 
ג
ו
י
ם
 
ב
ה
פ
ר
י
ד
ו
 
ב
נ
י
 
א
ד
ם
 
י
צ
ב
 
ג
ב
ו
ל
ת
 
ע
מ
י
ם
 
ל
מ
ס
פ
ר
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
י
 
ח
ל
ק
 
י
ה
ו
ה
 
ע
מ
ו
 
י
ע
ק
ב
 
ח
ב
ל
 
נ
ח
ל
ת
ו
 
י
ש
ר
א
ל
 
י
א
מ
צ
ה
ו
 
ב
א
ר
ץ
 
ה
מ
ד
ב
ר
 
ו
ב
ת
ה
ל
ל
ו
ת
 
י
ש
מ
נ
ה
ו
 
י
ס
ב
ב
נ
ה
ו
 
ו
י
ב
נ
נ
ה
ו
 
ו
י
צ
ר
נ
ה
ו
 
כ
א
י
ש
ן
 
ע
י
נ
ו
 
כ
נ
ש
ר
 
י
ע
ר
 
ק
נ
ו
 
ו
ע
ל
 
ג
ו
ז
ל
י
ו
 
י
ר
ח
ף
 
י
פ
ר
ש
 
כ
נ
פ
י
ו
 
ו
י
ק
ח
ה
ו
 
י
ש
א
ה
ו
 
ע
ל
 
א
ב
ר
ת
ו
 
י
ה
ו
ה
 
ב
ד
ד
 
י
נ
ח
נ
ו
 
ו
א
י
ן
 
ע
מ
ו
 
א
ל
 
נ
כ
ר
 
י
ר
כ
ב
ה
ו
 
ע
ל
 
ב
מ
ת
י
 
ה
א
ר
ץ
 
י
א
כ
ל
ה
ו
 
ת
נ
ו
פ
ת
 
ש
ד
י
 
י
י
נ
ק
ה
ו
 
ד
ב
ש
 
מ
ס
ל
ע
 
ו
ש
מ
ן
 
מ
ח
ל
מ
י
ש
 
צ
ו
ר
 
ח
מ
ת
 
ב
ק
ר
 
ו
ח
ל
ב
 
צ
א
ן
 
ע
ם
 
ח
מ
ת
 
כ
ר
י
ם
 
ו
א
י
ל
י
ם
 
ב
נ
י
 
ב
ש
ן
 
ו
ע
ת
ו
ד
י
ם
 
ע
ם
 
ח
ל
ב
 
כ
ל
י
ו
ת
 
ח
ט
ה
 
ו
ד
ם
 
ע
נ
ב
 
ת
ש
ת
ה
 
ח
מ
ר
 
י
א
כ
ל
 
י
ע
ק
ב
 
ו
י
ש
ב
ע
 
י
ש
מ
ן
 
י
ש
ר
ו
ן
 
ו
י
ב
ע
ט
 
ש
מ
נ
ת
 
ע
ב
י
ת
 
כ
ש
י
ת
 
ו
י
ט
ש
 
א
ל
ה
 
ע
ש
ה
ו
 
ו
י
נ
ב
ל
ו
 
צ
ו
ר
 
י
ש
ו
ע
ת
ו
 
י
ק
נ
א
ה
ו
 
ב
ז
ר
י
ם
 
ו
ב
ת
ו
ע
ב
ו
ת
 
י
כ
ע
י
ס
ה
ו
 
י
ז
ב
ח
ו
 
ל
ש
ד
י
ם
 
ל
א
 
א
ל
ה
 
א
ל
ה
י
ם
 
ל
א
 
י
ד
ע
ו
ם
 
ח
ד
ש
י
ם
 
מ
ק
ר
ב
 
ב
א
ו
 
ו
ל
א
 
ש
ע
ר
ו
ם
 
א
ב
ת
י
כ
ם
 
צ
ו
ר
 
י
ל
ד
ך
 
ת
ש
א
 
ו
ת
ש
כ
ח
 
א
ל
 
מ
ה
ל
ל
ך
 
ו
י
ר
א
 
י
ה
ו
ה
 
ו
י
נ
א
ץ
 
מ
כ
ע
ס
 
ב
נ
י
ו
 
ו
ב
נ
ת
י
ו
 
ו
י
א
מ
ר
 
א
ס
ת
י
ר
 
פ
נ
י
 
מ
ה
ם
 
ו
א
ר
א
ה
 
מ
ה
 
א
ח
ר
י
ת
ם
 
כ
י
 
ד
ו
ר
 
ה
פ
כ
ו
ת
 
ה
ם
 
ב
נ
י
ם
 
ל
א
 
ה
א
מ
ן
 
ב
ם
 
ה
ם
 
ק
נ
א
ו
נ
י
 
ב
ל
א
 
א
ל
 
כ
ע
ס
ו
נ
י
 
ב
א
ב
ל
י
ה
ם
 
ו
א
נ
י
 
א
ק
נ
י
א
ם
 
ב
ל
א
 
ע
ם
 
ב
ג
ו
י
 
נ
ב
ל
 
א
כ
ע
י
ס
ם
 
כ
י
 
א
ש
 
ק
ד
ח
ה
 
ב
א
פ
י
 
ו
ת
ו
ק
ד
 
ע
ד
 
ש
א
ל
 
ת
ח
ת
י
ת
 
ת
א
כ
ל
 
א
ר
ץ
 
ו
י
ב
ו
ל
ה
 
ת
ל
ח
ט
 
מ
ו
ס
ד
י
 
ה
ר
י
ם
 
א
ס
פ
ה
 
ע
ל
י
ה
ם
 
ר
ע
ו
ת
 
ו
ח
צ
י
 
א
כ
ל
ה
 
ב
ם
 
מ
ז
ה
 
ר
ע
ב
 
ל
ח
מ
ו
 
ר
ש
ף
 
ק
ט
ף
 
מ
ר
ר
י
ם
 
ו
ש
ן
 
ב
ה
מ
ו
ת
 
א
ש
ל
ח
 
ב
ם
 
ע
ם
 
ח
מ
ת
 
ז
ח
ל
י
 
ע
פ
ר
 
מ
ח
ו
ץ
 
ת
ש
כ
ל
 
ח
ר
ב
 
ו
מ
ח
ד
ר
י
ם
 
א
י
מ
ה
 
ג
ם
 
ב
ח
ו
ר
 
ג
ם
 
ב
ת
ו
ל
ה
 
ו
י
נ
ק
 
ע
ם
 
א
י
ש
 
ש
י
ב
ה
 
א
מ
ר
ת
י
 
א
פ
י
 
ה
ם
 
א
ש
ב
י
ת
 
מ
א
נ
ו
ש
 
ז
כ
ר
ם
 
ל
ו
 
ל
א
 
כ
ע
ס
 
א
י
ב
י
 
א
ג
ו
ר
 
פ
ן
 
י
נ
כ
ר
ו
 
צ
ר
י
נ
ו
 
פ
ן
 
י
א
מ
ר
ו
 
י
ד
י
נ
ו
 
ר
מ
ה
 
ו
ל
א
 
י
ה
ו
ה
 
פ
ע
ל
 
כ
ל
 
ז
א
ת
 
כ
י
 
ג
ו
י
 
א
ב
ד
 
ע
צ
ו
ת
 
ה
ם
 
ו
א
י
ן
 
ב
ה
ם
 
ת
ב
ו
נ
ה
 
ל
א
 
ח
כ
מ
ו
 
ו
י
ש
כ
י
ל
ו
 
ז
א
ת
 
ו
י
ב
י
נ
ו
 
ל
א
ח
ר
י
ת
ם
 
א
י
ך
 
י
ר
ד
ף
 
א
ח
ד
 
א
ל
ף
 
ו
ש
נ
י
ם
 
י
נ
י
ס
ו
 
ר
ב
ב
ה
 
א
ם
 
ל
א
 
צ
ו
ר
ם
 
מ
כ
ר
ם
 
ו
י
ה
ו
ה
 
ה
ס
ג
י
ר
ם
 
כ
י
 
ל
א
 
כ
צ
ו
ר
נ
ו
 
צ
ו
ר
ם
 
ו
א
י
ב
י
נ
ו
 
פ
ל
ל
י
ם
 
כ
י
 
מ
ג
פ
ן
 
ס
ד
ם
 
ג
פ
נ
ם
 
ו
מ
ש
ד
מ
ו
ת
 
ע
מ
ר
ה
 
ע
נ
ב
י
ה
ם
 
ע
נ
ב
י
 
ר
א
ש
 
ו
א
ש
כ
ל
י
 
מ
ר
ר
ו
ת
 
ל
מ
ו
 
ח
מ
ת
 
ת
נ
י
נ
י
ם
 
י
י
נ
ם
 
ו
ר
א
ש
 
פ
ת
נ
י
ם
 
א
ך
 
ז
ר
י
 
ה
ל
ו
א
 
ה
ו
א
 
כ
נ
ו
ס
 
ע
מ
ד
י
 
ח
ת
ו
ם
 
ב
א
ו
צ
ר
ת
י
 
ל
י
ו
ם
 
נ
ק
ם
 
ו
ש
ל
ם
 
ל
ע
ת
 
ת
מ
ו
ט
 
ר
ג
ל
ם
 
כ
י
 
ק
ר
ו
ב
 
י
ו
ם
 
א
י
ד
ם
 
ו
ח
ש
 
ע
ת
י
ד
ת
 
ל
מ
ו
 
כ
י
 
י
ד
י
ן
 
י
ה
ו
ה
 
ע
מ
ו
 
ו
ע
ל
 
ע
ב
ד
י
ו
 
י
ת
נ
ח
ם
 
כ
י
 
י
ר
א
ה
 
כ
י
 
א
ז
ל
ת
 
י
ד
 
ו
א
פ
ס
 
ע
צ
ו
ר
 
ו
ע
ז
ו
ב
 
ו
א
מ
ר
ו
 
א
י
ה
 
א
ל
ה
י
מ
ו
 
צ
ו
ר
 
ח
ס
י
ו
 
ב
ו
 
א
ש
ר
 
ח
ל
ב
 
ז
ב
ח
י
ה
ם
 
י
א
כ
ל
ו
 
ו
י
ש
ת
ו
 
י
י
ן
 
נ
ס
כ
ם
 
י
ק
ו
מ
ו
 
ו
י
ע
ז
ר
ו
כ
ם
 
י
ה
י
ו
 
ע
ל
י
כ
ם
 
ס
ת
ר
ה
 
ר
א
ו
 
ע
ת
ה
 
כ
י
 
א
נ
י
 
א
נ
י
 
ה
ו
א
 
ו
א
י
ן
 
א
ל
ה
י
ם
 
ע
מ
ד
י
 
א
נ
י
 
א
מ
י
ת
 
ו
א
ח
י
ה
 
מ
ח
צ
ת
י
 
ו
א
נ
כ
י
 
א
ר
פ
א
 
ו
א
י
ן
 
מ
י
ד
י
 
מ
צ
י
ל
 
כ
י
 
א
ש
א
 
א
ל
 
ה
ש
מ
י
ם
 
י
ד
י
 
ו
א
מ
ר
ת
י
 
ח
י
 
א
נ
כ
י
 
ל
ע
ו
ל
ם
 
א
ם
 
ש
נ
ת
י
 
ב
ר
ק
 
ח
ר
ב
י
 
ו
ת
א
ח
ז
 
ב
מ
ש
פ
ט
 
י
ד
י
 
א
ש
י
ב
 
נ
ק
ם
 
ל
צ
ר
י
 
ו
ל
מ
ש
נ
א
י
 
א
ש
ל
ם
 
א
ש
כ
י
ר
 
ח
צ
י
 
מ
ד
ם
 
ו
ח
ר
ב
י
 
ת
א
כ
ל
 
ב
ש
ר
 
מ
ד
ם
 
ח
ל
ל
 
ו
ש
ב
י
ה
 
מ
ר
א
ש
 
פ
ר
ע
ת
 
א
ו
י
ב
 
ה
ר
נ
י
נ
ו
 
ג
ו
י
ם
 
ע
מ
ו
 
כ
י
 
ד
ם
 
ע
ב
ד
י
ו
 
י
ק
ם
 
ו
נ
ק
ם
 
י
ש
י
ב
 
ל
צ
ר
י
ו
 
ו
כ
פ
ר
 
א
ד
מ
ת
 
ע
מ
ו
 
ו
י
ב
א
 
מ
ש
ה
 
ו
י
ד
ב
ר
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ש
י
ר
ה
 
ה
ז
א
ת
 
ב
א
ז
נ
י
 
ה
ע
ם
 
ה
ו
א
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
ו
י
כ
ל
 
מ
ש
ה
 
מ
ד
ב
ר
 
א
ת
 
ה
ד
ב
ר
י
ם
 
ה
א
ל
ה
 
א
ל
 
כ
ל
 
י
ש
ר
א
ל
 
ו
י
א
מ
ר
 
א
ל
י
ה
ם
 
ש
י
מ
ו
 
ל
ב
ב
כ
ם
 
ע
ל
 
כ
ל
 
ה
ד
ב
ר
י
ם
 
א
ש
ר
 
א
נ
כ
י
 
מ
ע
י
ד
 
ב
כ
ם
 
ה
י
ו
ם
 
א
ש
ר
 
ת
צ
ו
ם
 
א
ת
 
ב
נ
י
כ
ם
 
ל
ש
מ
ר
 
ו
ל
ע
ש
ו
ת
 
א
ת
 
כ
ל
 
ד
ב
ר
י
 
ה
ת
ו
ר
ה
 
ה
ז
א
ת
 
כ
י
 
ל
א
 
ד
ב
ר
 
ר
ק
 
ה
ו
א
 
מ
כ
ם
 
כ
י
 
ה
ו
א
 
ח
י
י
כ
ם
 
ו
ב
ד
ב
ר
 
ה
ז
ה
 
ת
א
ר
י
כ
ו
ן
 
י
מ
י
ם
 
ע
ל
 
ה
א
ד
מ
ה
 
א
ש
ר
 
א
ת
ם
 
ע
ב
ר
י
ם
 
א
ת
 
ה
י
ר
ד
ן
 
ש
מ
ה
 
ל
ר
ש
ת
ה
 
ו
י
ד
ב
ר
 
י
ה
ו
ה
 
א
ל
 
מ
ש
ה
 
ב
ע
צ
ם
 
ה
י
ו
ם
 
ה
ז
ה
 
ל
א
מ
ר
 
ע
ל
ה
 
א
ל
 
ה
ר
 
ה
ע
ב
ר
י
ם
 
ה
ז
ה
 
ה
ר
 
נ
ב
א
 
א
ש
ר
 
ב
א
ר
ץ
 
מ
ו
א
ב
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
י
ר
י
ח
ו
 
ו
ר
א
ה
 
א
ת
 
א
ר
ץ
 
כ
נ
ע
ן
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ל
א
ח
ז
ה
 
ו
מ
ו
ת
 
ב
ה
ר
 
א
ש
ר
 
א
ת
ה
 
ע
ל
ה
 
ש
מ
ה
 
ו
ה
א
ס
ף
 
א
ל
 
ע
מ
ך
 
כ
א
ש
ר
 
מ
ת
 
א
ה
ר
ן
 
א
ח
י
ך
 
ב
ה
ר
 
ה
ה
ר
 
ו
י
א
ס
ף
 
א
ל
 
ע
מ
ו
 
ע
ל
 
א
ש
ר
 
מ
ע
ל
ת
ם
 
ב
י
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
ב
מ
י
 
מ
ר
י
ב
ת
 
ק
ד
ש
 
מ
ד
ב
ר
 
צ
ן
 
ע
ל
 
א
ש
ר
 
ל
א
 
ק
ד
ש
ת
ם
 
א
ת
י
 
ב
ת
ו
ך
 
ב
נ
י
 
י
ש
ר
א
ל
 
כ
י
 
מ
נ
ג
ד
 
ת
ר
א
ה
 
א
ת
 
ה
א
ר
ץ
 
ו
ש
מ
ה
 
ל
א
 
ת
ב
ו
א
 
א
ל
 
ה
א
ר
ץ
 
א
ש
ר
 
א
נ
י
 
נ
ת
ן
 
ל
ב
נ
י
 
י
ש
ר
א
ל
 
ו
ז
א
ת
 
ה
ב
ר
כ
ה
 
א
ש
ר
 
ב
ר
ך
 
מ
ש
ה
 
א
י
ש
 
ה
א
ל
ה
י
ם
 
א
ת
 
ב
נ
י
 
י
ש
ר
א
ל
 
ל
פ
נ
י
 
מ
ו
ת
ו
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
מ
ס
י
נ
י
 
ב
א
 
ו
ז
ר
ח
 
מ
ש
ע
י
ר
 
ל
מ
ו
 
ה
ו
פ
י
ע
 
מ
ה
ר
 
פ
ר
א
ן
 
ו
א
ת
ו
 
מ
ר
ב
ב
ו
ת
 
ק
ד
ש
 
מ
י
מ
י
נ
ו
 
א
ש
ד
ו
ת
 
ל
מ
ו
 
א
ף
 
ח
ו
ב
ב
 
ע
מ
י
ם
 
ו
כ
ל
 
ק
ד
ש
י
ו
 
ב
י
ד
ך
 
ו
ה
ם
 
ת
כ
ו
 
ל
ר
ג
ל
י
ך
 
ו
ש
א
ו
 
מ
ד
ב
ר
ת
ך
 
ת
ו
ר
ה
 
צ
ו
ה
 
ל
נ
ו
 
מ
ש
ה
 
מ
ו
ר
ש
ה
 
ק
ה
ל
ת
 
י
ע
ק
ב
 
ו
י
ה
י
 
ב
י
ש
ר
ו
ן
 
מ
ל
ך
 
ב
ה
ת
א
ס
פ
ו
 
ר
א
ש
י
 
ה
ע
ם
 
י
ח
ד
ו
 
ש
ב
ט
י
 
י
ש
ר
א
ל
 
י
ח
י
 
ר
א
ו
ב
ן
 
ו
א
ל
 
י
מ
ו
ת
 
ו
י
ה
י
 
מ
א
ת
ו
 
מ
ס
פ
ר
 
ו
ז
א
ת
 
ל
י
ה
ו
ד
ה
 
ו
י
א
מ
ר
 
ש
מ
ע
 
י
ה
ו
ה
 
ק
ו
ל
 
י
ה
ו
ד
ה
 
ו
א
ל
 
ע
מ
ו
 
ת
ב
י
א
נ
ה
 
י
ד
ו
 
ר
י
ב
 
ל
ו
 
ו
ע
ז
ר
 
מ
צ
ר
י
ו
 
ת
ה
י
ה
 
ו
ל
ו
י
 
א
מ
ר
 
ת
מ
י
ך
 
ו
א
ר
י
ך
 
ל
א
י
ש
 
ח
ס
י
ד
ך
 
א
ש
ר
 
נ
ס
י
ת
ה
ו
 
ב
מ
ס
ה
 
ו
ת
ר
י
ב
ה
ו
 
ע
ל
 
מ
י
 
מ
ר
י
ב
ה
 
ה
א
מ
ר
 
ל
א
ב
י
ו
 
ו
ל
א
מ
ו
 
ל
א
 
ר
א
י
ת
י
 
ו
א
ת
 
א
ח
י
ו
 
ל
א
 
ה
כ
ר
 
ו
א
ת
 
ב
נ
ו
 
ל
א
 
י
ד
ע
 
כ
י
 
ש
מ
ר
ו
 
א
מ
י
ר
ת
ך
 
ו
ב
ר
י
ת
ך
 
י
נ
צ
ר
ו
 
י
ו
ר
ו
 
מ
ש
פ
ט
י
ך
 
ל
י
ע
ק
ב
 
ו
ת
ו
ר
ת
י
ך
 
ל
י
ש
ר
א
ל
 
י
ש
י
מ
ו
 
ק
ט
ר
ה
 
ב
א
פ
י
ך
 
ו
כ
ל
י
ל
 
ע
ל
 
מ
ז
ב
ח
ך
 
ב
ר
ך
 
י
ה
ו
ה
 
ח
י
ל
ו
 
ו
פ
ע
ל
 
י
ד
ו
 
ת
ר
צ
ה
 
מ
ח
ץ
 
מ
ת
נ
י
 
ק
מ
י
ו
 
ו
מ
ש
נ
א
י
ו
 
מ
י
 
י
ק
י
מ
נ
ו
 
ו
ל
ב
נ
י
מ
י
ם
 
א
מ
ר
 
י
ד
 
י
ד
 
י
ה
ו
ה
 
י
ש
כ
ן
 
ל
ב
ט
ח
 
ו
ח
ו
פ
ף
 
ע
ל
י
ו
 
כ
ל
 
ה
י
ו
ם
 
ו
ב
י
ן
 
כ
ת
פ
ו
ת
י
ו
 
ש
כ
ן
 
ו
ל
י
ו
ס
ף
 
א
מ
ר
 
מ
ב
ר
כ
ת
 
י
ה
ו
ה
 
א
ר
צ
ו
 
מ
מ
ג
ד
 
ש
מ
י
ם
 
מ
ט
ל
 
ו
מ
ת
ה
ו
ם
 
ר
ב
צ
ת
 
ת
ח
ת
 
ו
מ
מ
ג
ד
 
ת
ב
ו
א
ת
 
ש
מ
ש
 
ו
מ
מ
ג
ד
 
ג
ר
ו
ש
י
 
י
ר
ח
י
ם
 
ו
מ
ר
א
ש
 
ה
ר
י
 
ק
ד
ם
 
ו
מ
מ
ג
ד
 
ג
ב
ע
ת
 
ע
ו
ל
ם
 
ו
מ
מ
ג
ד
 
א
ר
ץ
 
ו
מ
ל
ו
א
ה
 
ו
ר
צ
ו
ן
 
ש
כ
ן
 
ס
נ
ה
 
ת
ב
ו
א
ת
ה
 
ל
ר
א
ש
 
י
ו
ס
ף
 
ו
ל
ק
ד
ק
ד
 
נ
ז
י
ר
 
א
ח
י
ו
 
ב
כ
ו
ר
 
ש
ו
ר
 
ה
ד
ר
 
ל
ו
 
ו
ק
ר
נ
י
 
ר
א
מ
י
 
ק
ר
נ
י
ו
 
ב
ה
ם
 
ע
מ
י
ם
 
י
נ
ג
ח
 
י
ח
ד
ו
 
א
פ
ס
י
 
ה
א
ר
ץ
 
ה
ם
 
ר
ב
ב
ו
ת
 
א
פ
ר
י
ם
 
ו
ה
ם
 
א
ל
פ
י
 
מ
נ
ש
ה
 
ו
ל
ז
ב
ו
ל
ן
 
א
מ
ר
 
ש
מ
ח
 
ז
ב
ו
ל
ן
 
ב
צ
א
ת
ך
 
ו
י
ש
ש
כ
ר
 
ב
א
ה
ל
י
ך
 
ע
מ
י
ם
 
ה
ר
י
 
י
ק
ר
א
ו
 
ו
ש
ם
 
י
ז
ב
ח
ו
 
ז
ב
ח
י
 
צ
ד
ק
 
כ
י
 
ש
פ
ע
 
י
מ
י
ם
 
י
י
נ
ק
 
ו
ש
פ
ו
נ
י
 
ט
מ
ו
נ
י
 
ח
ו
ל
 
ו
ל
ג
ד
 
א
מ
ר
 
ב
ר
ו
ך
 
מ
ר
ח
י
ב
 
ג
ד
 
כ
ל
ב
י
ה
 
ש
כ
ן
 
ט
ר
ו
ף
 
ז
ר
ו
ע
 
ג
ם
 
ק
ד
ק
ד
 
ו
י
ר
א
 
ר
א
ש
י
ת
 
ל
ו
 
כ
י
 
ש
ם
 
ח
ל
ק
ת
 
מ
ח
ו
ק
ק
 
ס
פ
ו
ן
 
ו
י
ת
א
 
ר
א
ש
י
 
ה
ע
ם
 
צ
ד
ק
ת
 
י
ה
ו
ה
 
ע
ש
ה
 
ו
מ
ש
פ
ט
י
ו
 
ע
ם
 
י
ש
ר
א
ל
 
ו
ל
ד
ן
 
א
מ
ר
 
ד
ן
 
ג
ו
ר
 
א
ר
י
ה
 
ו
י
ז
נ
ק
 
מ
ן
 
ה
ב
ש
ן
 
ו
ל
נ
פ
ת
ל
י
 
א
מ
ר
 
נ
פ
ת
ל
י
 
ש
ב
ע
 
ו
ר
צ
ו
ן
 
ו
מ
ל
א
 
ב
ר
כ
ת
 
י
ה
ו
ה
 
י
מ
ה
 
ו
ד
ר
ו
ם
 
י
י
ר
ש
 
ו
ל
א
ש
ר
 
א
מ
ר
 
ב
ר
ו
ך
 
מ
ב
נ
י
ם
 
א
ש
ר
 
ו
י
ה
י
 
ר
צ
ו
י
 
א
ח
י
ו
 
ו
ט
ב
ל
 
ב
ש
מ
ן
 
ר
ג
ל
י
ו
 
ב
ר
ז
ל
 
ו
נ
ח
ש
ת
 
מ
נ
ע
ל
י
ך
 
ו
כ
י
מ
י
ך
 
ר
ב
י
ך
 
א
י
ן
 
כ
א
ל
 
י
ש
ר
ו
ן
 
ר
כ
ב
 
ש
מ
י
ם
 
ב
ע
ז
ר
ך
 
ו
ב
ג
א
ת
ו
 
ש
ח
ק
י
ם
 
מ
ע
ו
נ
ה
 
א
ל
ה
י
 
ק
ד
ם
 
ו
מ
ת
ח
ת
 
ז
ר
ו
ע
ת
 
ע
ו
ל
ם
 
ו
י
ג
ר
ש
 
מ
פ
נ
י
ך
 
א
ו
י
ב
 
ו
י
א
מ
ר
 
ה
ש
מ
י
ד
 
ו
י
ש
כ
ן
 
י
ש
ר
א
ל
 
ב
ט
ח
 
ב
ד
ד
 
ע
י
ן
 
י
ע
ק
ב
 
ע
ל
 
א
ר
ץ
 
ד
ג
ן
 
ו
ת
י
ר
ש
 
ו
א
ף
 
ש
מ
י
ך
 
י
ע
ר
פ
ו
 
ט
ל
 
א
ש
ר
ך
 
י
ש
ר
א
ל
 
מ
י
 
כ
מ
ו
ך
 
ה
ע
ם
 
ה
נ
ו
ש
ע
 
ב
י
ה
ו
ה
 
מ
ג
ן
 
ע
ז
ר
ך
 
ו
א
ש
ר
 
ח
ר
ב
 
ג
א
ת
ך
 
ו
י
כ
ח
ש
ו
 
א
י
ב
י
ך
 
ל
ך
 
ו
א
ת
ה
 
ע
ל
 
ב
מ
ת
ם
 
ת
ד
ר
ך
 
ו
י
ע
ל
 
מ
ש
ה
 
מ
ע
ר
ב
ת
 
מ
ו
א
ב
 
א
ל
 
ה
ר
 
נ
ב
א
 
ר
א
ש
 
ה
פ
ס
ג
ה
 
א
ש
ר
 
ע
ל
 
פ
נ
י
 
י
ר
י
ח
ו
 
ו
י
ר
א
ה
ו
 
י
ה
ו
ה
 
א
ת
 
כ
ל
 
ה
א
ר
ץ
 
מ
נ
ה
ר
 
מ
צ
ר
י
ם
 
ע
ד
 
ה
נ
ה
ר
 
ה
ג
ד
ו
ל
 
נ
ה
ר
 
פ
ר
ת
 
ו
ע
ד
 
ה
י
ם
 
ה
א
ח
ר
ו
ן
 
ו
י
א
מ
ר
 
י
ה
ו
ה
 
א
ל
י
ו
 
ז
א
ת
 
ה
א
ר
ץ
 
א
ש
ר
 
נ
ש
ב
ע
ת
י
 
ל
א
ב
ת
י
ך
 
ל
א
ב
ר
ה
ם
 
ל
י
צ
ח
ק
 
ו
ל
י
ע
ק
ב
 
ל
א
מ
ר
 
ל
ז
ר
ע
ך
 
א
ת
נ
נ
ה
 
ה
ר
א
ת
י
ך
 
ב
ע
י
נ
י
ך
 
ו
ש
מ
ה
 
ל
א
 
ת
ע
ב
ר
 
ו
י
מ
ת
 
ש
ם
 
מ
ש
ה
 
ע
ב
ד
 
י
ה
ו
ה
 
ב
א
ר
ץ
 
מ
ו
א
ב
 
ע
ל
 
פ
י
 
י
ה
ו
ה
 
ו
י
ק
ב
ר
 
א
ת
ו
 
ב
ג
י
א
 
ב
א
ר
ץ
 
מ
ו
א
ב
 
מ
ו
ל
 
ב
י
ת
 
פ
ע
ו
ר
 
ו
ל
א
 
י
ד
ע
 
א
י
ש
 
א
ת
 
ק
ב
ר
ת
ו
 
ע
ד
 
ה
י
ו
ם
 
ה
ז
ה
 
ו
מ
ש
ה
 
ב
ן
 
מ
א
ה
 
ו
ע
ש
ר
י
ם
 
ש
נ
ה
 
ב
מ
ו
ת
ו
 
ל
א
 
כ
ה
ת
ה
 
ע
י
נ
ו
 
ו
ל
א
 
נ
ס
 
ל
ח
ה
 
ו
י
ב
כ
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
א
ת
 
מ
ש
ה
 
ב
ע
ר
ב
ת
 
מ
ו
א
ב
 
ש
ל
ש
י
ם
 
י
ו
ם
 
ו
י
ת
מ
ו
 
י
מ
י
 
ב
כ
י
 
א
ב
ל
 
מ
ש
ה
 
ו
י
ה
ו
ש
ע
 
ב
ן
 
נ
ו
ן
 
מ
ל
א
 
ר
ו
ח
 
ח
כ
מ
ה
 
כ
י
 
ס
מ
ך
 
מ
ש
ה
 
א
ת
 
י
ד
ו
 
ע
ל
י
ו
 
ו
י
ש
מ
ע
ו
 
א
ל
י
ו
 
ב
נ
י
 
י
ש
ר
א
ל
 
ו
י
ע
ש
ו
 
כ
א
ש
ר
 
צ
ו
ה
 
י
ה
ו
ה
 
א
ת
 
מ
ש
ה
 
ו
ל
א
 
ק
ם
 
ע
ו
ד
 
נ
ב
י
א
 
ב
י
ש
ר
א
ל
 
כ
מ
ש
ה
 
א
ש
ר
 
י
ד
ע
ו
 
י
ה
ו
ה
 
פ
נ
י
ם
 
א
ל
 
פ
נ
י
ם
 
ל
כ
ל
 
ה
א
ת
ו
ת
 
ו
ה
מ
ו
פ
ת
י
ם
 
א
ש
ר
 
ש
ל
ח
ו
 
י
ה
ו
ה
 
ל
ע
ש
ו
ת
 
ב
א
ר
ץ
 
מ
צ
ר
י
ם
 
ל
פ
ר
ע
ה
 
ו
ל
כ
ל
 
ע
ב
ד
י
ו
 
ו
ל
כ
ל
 
א
ר
צ
ו
 
ו
ל
כ
ל
 
ה
י
ד
 
ה
ח
ז
ק
ה
 
ו
ל
כ
ל
 
ה
מ
ר
א
ה
 
ה
ג
ד
ו
ל
 
א
ש
ר
 
ע
ש
ה
 
מ
ש
ה
 
ל
ע
י
נ
י
 
כ
ל
 
י
ש
ר
א
ל
 
