@node
@convertedBy=Martijn Naaijer and Christian Canu Højgaard
@createdBy=Stefan Schorch in colloboration with Evelyn Burkhardt, Ulrike Hirschfelder, Irina Wandrey and József Zsengellér
@description=realized verbal preformative consonantal
@licence=Creative Commons Attribution-NonCommercial 4.0 International License
@licenceUrl=http://creativecommons.org/licenses/by-nc/4.0/
@name=The Samaritan Pentateuch vol 1. Genesis
@purpose=Adding verbal tense
@source=Stefan Schorch's data files, personal communication
@valueType=str
@version=0.8
@writtenBy=Text-Fabric
@dateWritten=2022-12-06T14:15:23Z

101887	

























!M!





!J!

!J!


!J!


!J!







!J!









!J!










!J!


!J!




!J!

!J!






!J!
!M!





!J!





!J!


















!J!


!J!





!J!


!J!




!J!

!J!










!T!



!J!


!J!












!J!




!J!

!T!




!M!















!J!


!T!




!M!













!J!




!J!


!J!




!J!

!J!












!!




























!!




!J!


!J!































!J!







!!





!!








!!








!J!




!J!


!J!




!J!

!J!







!J!









!J!




























!J!




!J!



!!
!!

!!

!!













!J!


!J!




!J!

!T!
















!J!


!J!






















!J!




!J!

!N!







!J!





























!J!

















!J!



!J!


!!

!!

!!






!!




















!J!


























!J!

































!J!


!J!










!J!


!J!





!J!









!J!










!J!











!J!





!J!











!!








!H!



!!











!J!









!J!












!!





!J!











!J!










!J!





!J!





!J!








!J!







!J!




































!!






!J!





































































!J!






!J!




!!


!!

!J!






!!





!!
!T!









!T!





!!

!!
!T!

!J!




!!




!>!





!J!


















!J!




!!

!J!




!J!








!J!



























!J!







!J!

!J!




!J!



!J!













!J!




!J!














!J!








!J!


















!J!







!J!















!J!








!T!






!T!










!N!















!T!



!T!




!J!






!!








!!













!T!



















!!

!T!



!T!

!T!





!J!

!T!



!J!




!J!



!J!



!J!




!M!







!J!













!J!






!J!



!J!






!>!




!>!

!J!














!!



!J!














!>!

!J!








!T!






!>!

!J!






















!T!


!T!





!>!












!J!



!T!






!!
!>!





!T!







!J!











!T!






!!

!T!








!T!







!T!










!T!


!!












!T!

!J!












!J!










!J!

!J!










!!






!J!















!J!





!!








!J!




!J!














!M!

!!













!T!

!T!



!T!





!T!

!!





!J!









!J!




!J!




















!J!















!J!




!J!


!J!













!T!




!T!









!T!


!J!




!N!



!J!

!!



!J!





!J!

!J!







!J!







!J!




























!T!




!T!
!!





!T!




!J!






!!


























!J!

!J!







!J!

!J!






!!




!J!






!J!






!J!




!T!

!T!



!J!



!J!









!J!




















!J!














!T!








































!J!







!!
















!J!







!J!





!T!


!J!






















!J!






!!










!!












!J!


!J!









!J!






!J!





!J!




!J!



!!






!J!




!J!












!J!

!J!







!J!



!J!


!!









!J!




!J!











!J!

!J!




!J!



!J!


!!










!J!




!J!










!J!

!J!




!J!



!J!


!!









!J!




!J!










!J!

!J!







!J!



!J!


!!









!J!




!J!












!J!

!J!






!J!



!J!


!!











!J!




!J!












!J!

!J!






!J!



!J!





!!






!J!




!J!












!J!











!J!






!J!



!J!


!!











!J!




!J!










!J!

!J!






!J!


!J!




!!

!J!













!J!


!!






!J!




!J!












!J!

!J!






!J!









!J!





!!









!J!











!J!







!J!


!J!

































!J!








!J!











!J!




















!J!









!J!



!J!

!>!
















































!J!












!T!







!T!




!J!

















!J!






















!!





!T!
















!T!
















!T!





!T!









!T!




!T!



!M!








!!














!J!































!T!




!!






























!J!


!!


!!





!J!











!J!










!J!



!!























!T!

































!!












!M!






















!J!





















!J!



























































!J!

















































!J!






































































!J!
































!J!



!J!








!J!



!J!




!T!





!J!



!J!





!T!
















!J!




















!J!



!J!












































!J!




















!J!




!J!








!J!










!J!


















!J!






!J!



!J!








!J!






!J!










!J!









!T!








































!J!





!J!








!J!




!J!
!!

!!

!!







!J!






!!



















!T!












!J!



!J!

!J!






!J!





!J!
!!







!T!














!J!










!J!





!J!










!J!





















!J!






!J!























!J!




!!
!!



















































!J!
























!J!





!J!














!J!





!J!






!J!




!>!


!!

















!>!


!!
























!J!

!J!







!J!

!!

!!

!!







!J!















!T!

















!J!
















!T!





!>!




!>!









!>!











!J!










!!

!!

!!



!!


!J!








!!



!M!













































!J!










!J!








































!!































!J!







!!






























!J!



















!J!



























!J!





!J!


!J!




!J!

!J!




!J!







!J!






!J!







!J!




!J!


!J!












!J!




!J!








!J!




!J!



!J!





!J!



!J!




!J!




!J!




!J!











!J!










!J!










!J!

















































































!!












!J!








!T!





















!J!






































































































!J!












































































































































!J!



!!




































!J!









!J!

!!



!J!





!J!


!J!



!!
!N!



!N!



!T!













!J!
!!
!N!









!N!



!N!






!J!


!!













!J!











!!

!!



!J!



!J!

!!
!!
!N!

!N!




!J!





!J!










!J!









































!J!







!J!


!!






!J!




!J!







!J!










!J!



!J!


!!









!J!




!J!












!J!

!J!







!J!



!J!


!!









!J!




!J!












!J!

!J!








!J!



!J!


!!








!J!




!J!










!J!

!J!







!J!



!J!


!!








!J!




!J!










!J!

!J!








!J!



!J!


!!








!J!




!J!










!J!

!J!







!J!



!J!


!!





!J!




!J!









!J!

!J!






!J!



!J!


!!








!J!




!J!











!J!

!J!




!J!



























!J!












!J!






















!T!






!J!
























!J!




!!



!J!



!J!


!J!










!J!




!J!



!!














!>!

!>!




!>!

!>!






!M!


!>!








!J!







!J!











!!



!J!
























!J!

!!



!J!



!J!

















!J!




!J!



!>!






!J!








!J!










!J!










!J!





!J!




!J!

!!





!J!




!J!



!!








!J!




!!


!J!














!J!












!J!
!!




!J!









!J!

!!



!J!










!J!




!J!




!T!











!J!

















!J!














!J!




!J!

















!>!








!!



!J!




!J!













!J!



























!J!
































!J!


























!!









!!


!J!

















!J!



!J!





!T!





















!H!

















!J!




!J!










!!












!!


!J!








!J!




!J!

















!J!

















!H!



!!



!!






















!>!















!J!


!!






!J!
!!
!!









!>!

!J!


!J!

!J!







!J!





!J!












































































!J!
































!J!

!J!





!J!















!J!

















!J!


































!J!






!J!








!J!











!J!

!J!










!J!






!J!



!J!























!J!





!J!










!J!



!J!






!J!

!J!








!J!






















!J!



!!

!!

!!































!J!



!J!



















!J!





!J!











!!


!J!
























!>!






!T!

!>!



















!J!















!!

!T!









!J!




!T!













!J!


















!!

!J!




!J!



!J!

!J!




!J!
!!




!!



!T!

!!


!J!


!J!






!J!



!J!









!!







!!

!J!




!>!



!J!




!M!


!M!


!M!





!J!





!J!




!J!




!!








!J!






!J!



!J!



!!













!J!


!!
!T!


!J!



















!J!





!J!





!T!




!T!


















!J!































!!












































































!T!








!!
!!




!>!


!J!





!T!













!!






!T!








!J!



!T!

!T!



!T!




!T!











!T!



!>!


!J!





!J!














!T!


!T!



!J!
















!J!









!T!

!T!







!J!



!!



!!



!J!



!!
!>!




!J!



!J!




















!J!














!J!

!T!






























!T!





!J!

















!!






!J!







!J!




!J!




!!






!>!





!>!





!J!




!J!



!!













!J!

























!J!

















!!






























!J!







!T!









!T!







!H!














!J!



















!H!
!J!



















!J!




















!J!






!T!

























!J!

!J!




!J!

!J!















!T!

!J!






!J!



!J!












































!J!








!>!



!T!











!J!

!!


!J!





!J!





















!J!






















!H!











!H!





























!J!












!!



!J!


!J!







!J!

!J!

!!





!J!


!J!









!T!



!J!




!!







!>!



!!



!T!







!J!

!T!




!J!






!J!
!!




!!










!J!






!J!




!J!

!!

!J!











!J!










!J!

!J!





!J!




!J!
!!
!>!



























!!







!T!




!!

!!







!J!








!!



!>!




!J!





!>!









!T!


!!





!J!




!J!





!J!








!!




!M!









!!
!J!
















!J!












!!




!!








!J!












!>!


!>!











!>!

!J!





!J!









!J!


!J!


!T!













!T!


!T!












!!





!!

















!J!


!J!


!>!

















!J!


!J!




!!









!T!







!J!

!>!

!>!





!J!


!!


!J!


!J!





!J!


!J!



!>!

!J!



!J!

!>!

!>!



!J!




!!



!J!



!J!

!>!





!J!


!J!



!>!




!J!



!J!

!>!





!J!





!!








!J!













!J!



!J!



!!





!!

!!








!J!




!N!

!J!



!J!


!J!



!J!






!J!

!J!




















!J!



!J!









!!





!J!










!J!



!T!














!!











!T!









!J!



!J!



!!

!J!







!J!






!J!

!!



!J!





!J!



























!J!

!!



!J!

























!M!













!J!


!!

!J!


!J!





!J!
!!
!!






!M!





!J!

!M!









!J!





!!
!!
!!









!T!





!J!

!J!


















!J!

!J!





!J!

!!




!J!
!H!



!T!



!T!






!H!

!T!

!J!













!T!





!!





!>!

!H!



!T!












!!




!>!







!T!


!J!











!!





!!
!H!



!>!

!!


!!




































!J!





















!T!




!T!



!J!














!J!














!J!











!J!

!!






!J!




!J!







!!








!J!



!J!









!!



!J!








!T!













!!







!N!




!N!


!N!




!T!









!T!



!T!






!!


!!

!J!



!T!
















!!
!!


!N!




!T!










!T!



!T!





!!




!T!






!T!




!T!

















!T!











!J!







!J!






!J!



!J!







!J!




!J!



!J!








!J!



















!J!





!T!























!J!















!>!









!T!

!!



!!








!J!


!!



!M!
!!

!!
!T!






!J!





!J!




!J!









!J!





!J!




!J!























!J!













!J!
































!T!




!J!













!>!




!T!






!N!

!!




!J!












!J!



!J!





!J!









!!



























!J!











!J!

!!






















!J!







!T!

!T!













!J!













!J!


















!H!





!T!








!J!


!T!














!J!



!J!

!J!












!T!










!M!

!T!


!!










!J!










!J!










!J!




!J!










!T!


!!





!J!













!>!




!J!





!J!





!J!










!J!

!T!

!T!





!J!






!T!








!T!

!T!





!M!




!>!





!T!



!T!



!T!

!J!






!J!








!J!




!T!











!!
!!












!>!

!J!




!T!



!T!

!T!





!T!




!J!





!J!

!J!




!J!



!J!





!T!







!J!





!J!









!!
















!T!













!T!









!J!



















!J!

























!J!





!J!



!J!



!J!







!J!















!J!






!T!




!T!
























!J!






!J!







!J!




!J!






!J!







!J!







!J!












!J!



!J!


!J!
!!










!!






!!







!>!


!J!





!J!



!J!









!J!




!J!

!J!














!J!




!J!






!J!



!!










!N!








!J!






!J!




!J!










!J!



!J!





!J!


!J!



!J!













!J!


!J!






!J!



!J!









!J!






!J!




!J!




!J!









!J!




!J!




!!



!J!







!J!



!J!


!J!

!T!






!T!


















!J!




!J!










!J!


!J!




!J!




!J!








!J!

!J!





!J!

!J!









!J!























!>!

!!
!>!















!J!


















!J!




!J!

!J!





!J!





!J!






!J!



!!























































!T!














!J!















!T!











!J!


!!




!!

!J!






!J!




!!





!!





!>!






!J!





!!

!!










!!







!J!


!!


!J!


!J!








!J!


!!




!!





!!

!!








!J!














!J!














!J!















!!


!!

















!!


!J!







!J!








!!




!!




!!


!>!




!J!




!!


!!













!!

!J!




!J!


















!!

!J!































































!J!































!J!











!!





!>!











!T!









!J!









!T!








!J!





!T!



!!







!>!










!J!





!T!

























!!


!>!






!J!













!T!



!!










!T!


!J!









!J!







!J!








!J!







!J!

!J!







!J!















!!


!J!











!!


















!!






!>!

!!


!>!


!!



!>!








!>!







!J!




!!
































!T!



!T!


!T!

!J!



!!

!J!







!T!
!!


!T!

!T!




!T!

!T!

!!

!T!



!>!




!!

!T!

!T!





!T!





!!

!T!









!M!

!!







!J!






!!

!J!







!J!











!J!



!!










!!

!T!











!T!











!!

!J!



!J!



!J!
























!T!



!T!















!J!










!J!

!!












!!





!!






!J!













!J!
!!



!T!













!J!





!J!



!J!








!!








!J!



!!

!J!

!!





!J!
!!

!J!










!J!

!J!















!T!









!J!






!J!


!!

!T!


















!T!









!>!




!T!




!J!






!J!

















!T!



!T!





!J!







!>!






!>!







!M!



















!!



!!










!!




!>!










!>!

!!











!T!



!T!

!>!

!!






!T!

!T!




!T!
!!



!>!









!>!


!>!




!T!




















!>!





!>!



























!!




!!


!>!








!J!




!J!






!N!









!!

!!

!T!









!J!








!J!




!J!










!J!











!J!

!J!







!J!

!J!




!J!




!J!



!T!








!T!

!J!


!T!






!!

!>!



!J!
!N!







!J!



!J!


!T!






!T!
!>!

!J!














!J!



!J!








!J!





!T!




!T!




!T!




!J!





!J!
















!J!


!!



!!


!J!


!J!






!T!




!T!



!T!





!T!












!!

!J!





!T!



!T!

!J!











!J!






!J!



!T!




!J!

!J!




!J!


!J!





!T!



















































!J!




















!J!





























!J!

!J!









!J!



!J!




































!J!




!J!





!J!


















































































!J!

!J!

!J!



!J!








!!

















!J!





!!

















!J!










!J!



!T!



!J!





!T!






!T!

!!



!J!













!J!




!J!


!J!


!J!


!!







!J!








!J!














!J!








!!


!J!



!J!













!J!













!J!



!J!








!J!





















!J!

!!







!J!





!!






!J!








!J!


!J!














!J!

!J!

!J!

!J!

!J!





!J!


















!J!







!J!



!J!

!T!

!!



!>!








!>!


!>!





!>!




















































!J!




!J!






!J!





!!



!J!










!J!








!J!







!J!



!M!




!J!




!J!










!J!





!>!


!J!


















!J!





!!









!!
!J!

!J!






!J!







!J!


!J!



!J!








!J!










!J!

















!J!


!J!



!!







!J!




!J!




!J!


!J!


!J!










!J!





!J!









!J!





!J!





!J!






!!




!J!








!J!



!J!



!J!



!J!



!J!







!J!



!J!










!J!





!J!







!J!





!T!














!J!



!J!




!J!



!J!


















!J!










!T!



!J!
!!






!N!
!T!







!N!



!T!














!N!







!J!



!J!

!J!

!J!




!J!




!J!


!J!





!J!






!J!



!J!








!J!




!J!















!J!





!J!















!T!








!J!




!T!



!J!






!J!



!J!



!J!









!!






!!







!!












!T!



!>!




!!





!J!




!!


!!







!!




!M!




!!
!!



!!



!>!











!!





!M!

!!





!!








!>!
















!J!




!J!














!J!






!M!








!T!






!!



!!
!!


!J!

!J!

!J!


!T!







!T!














!T!



















!T!














!J!



!J!


!J!





!J!











!!

!!

!!




!T!


!J!







!!


!J!







!J!



!!












!J!





!J!

!J!





















!J!

!J!






!J!


!J!








!T!


!J!


!J!

!J!



!J!

!J!



!!


!!



!J!

!J!


!J!




!J!

!J!











!J!

















!J!


!J!








!J!






!M!


!J!





!!



!J!

!!














!J!




!J!



!J!


!J!


!J!





!T!


!J!






!J!





!J!






!J!






!J!


!>!




!T!

!>!



!J!

!J!

!!





!J!







!J!


!!




!J!





!J!



!J!






!J!











!J!






!J!


!J!























!>!


!J!









!!




!J!



!J!

!J!



!J!






!J!










!T!



!T!




!T!







!J!










!J!



!J!




!>!




!J!









!T!

!T!






!T!




!M!


!!



!!



!!
!!












!T!



!!
















!>!





!T!



























!J!




!J!


!J!

!J!


!T!




!!
!!







!!
!!











!J!


!J!

!J!






!J!











!!









!J!




!J!















!J!


















!!


!J!


!!

!T!





!J!







!J!



!J!










!J!


!J!














!J!





!!


!J!



!J!






!J!





!J!


!J!






!J!



!M!



!M!
















!J!















!>!






































!T!









!>!









!J!



!J!












!J!

!J!


















!J!





!J!







!J!



!J!




!J!

















!J!



!!

!J!
















!!




!!





















!J!





!T!

!>!
!>!


!J!



!J!




!J!



















!J!










































!J!







!J!




!J!








!J!


!J!





!J!










!J!








!H!


!!



!!
!!

!J!

!N!


!J!


































!J!

















!J!


!J!









!J!






!J!




!J!



!J!

!J!













!T!

!T!



!J!

!!







!J!

!!

!J!


!J!


!J!



!J!









!J!








!J!




!J!




































!J!




!J!
!>!








!J!


!!



!!




!!


!J!






!J!










!J!



!!






!>!


!J!







!J!


!J!



!J!




!J!



!J!



!J!










!J!








!J!
















!J!


!J!




!!






!!











!T!






!J!



!J!



!J!








!J!











!J!




!J!





!J!






!J!





!J!






!T!


!T!


!T!












!J!


!T!


!T!


!T!







!J!





!T!




!T!


!T!


!T!



!J!













!T!


!T!


!T!


!>!








!T!

!!

!T!







!T!




!T!


!!








!J!





!J!











!T!



!!


!T!



!>!




!T!







!J!



!T!


!T!




!T!









!J!








!T!


!T!








!T!










!T!




!T!




!!

!T!




!T!






!T!







!T!



!T!




!T!








!T!







!T!




!J!






!J!




!J!





!T!



!!






!T!













!T!


!J!







!J!







!T!


!!

!T!

!T!



!!





!J!






!J!




!T!

!T!





!T!










!T!




!T!



!T!





!T!








!J!







!T!








!T!




!J!




!J!



!J!



!T!

!T!


!T!





!T!




!!
!J!





!J!







!J!



!!

!>!





!!










!>!








!J!










!J!




!J!
!!



!>!

!J!




















!J!



!J!







!>!





!J!

!>!


!J!


!T!



!T!






!>!
!>!

!>!
!>!





































!J!




















!J!




!J!



!J!

































!J!




!J!
















!J!







!J!


!J!


!J!
!!



!!





































!!
!!






!!




!>!


!J!










!J!












!J!








!!



!T!



!!





!J!


!!

!!

!J!






!T!












!J!












!J!











!J!


!!



!M!












!!




!!



!J!












!J!





!J!











!J!





!!




















!J!












!J!



!!







!>!


!J!


!J!










!J!
































!J!









!!



!J!

!J!










!J!

!J!








!J!





!J!


!J!


!!



!>!



















!J!








!>!


!J!
!!



!!





































!!
!!






!!




!T!




!T!




















!J!

























!!

!J!


!J!









!J!

















!!









!!



!T!








!J!














!J!






!J!

!J!




!J!






!J!










!J!




!J!





!J!






!J!










!J!

!H!


!T!







!J!




















!J!






!T!



!T!








!!

!T!






!>!













!!













!!









!!
!H!

!M!








!!


!!









!J!


!J!







!T!






!T!



!J!


!!




!!









!J!


!J!

















!J!




!J!










!T!





!T!


!J!









!T!



!J!





!>!

!!








!J!







!J!



!J!



!J!


!J!






















!!






!J!





















!>!


















!T!






















!T!































!J!


!J!
























!>!











!!
!N!












!J!



!J!


!J!



!!


!J!


!J!


!J!





!J!










!J!





















!J!





!N!




!T!




!T!






!!






!J!













!J!















!>!










!T!



















!J!




!J!






!J!





!J!



!!


!J!


!J!



!J!





!J!






!J!


!J!

!J!









!J!




!J!








!J!







!J!












!J!


!!

!T!





!!






!>!



!J!











!>!

!!



!!




!J!





!!









!!






!J!



!J!


!J!











!J!

!J!

















!J!











!!


















































!J!











!>!











!J!



!J!







!J!



































!J!








!J!


!!




!T!






!J!




!!

!J!





!!






















!J!



















!!




!T!



!!











!>!










!>!


!J!


!T!














!J!





!J!













!J!





!J!

!J!




!J!





!J!




!J!



!!



!J!





!J!




!T!




!H!


!J!
!!





!J!

!>!




!J!




!J!


!J!


!J!













!T!

!J!


!J!
!!



!J!


!T!



!J!



!J!












!T!


!J!
















!J!



























!J!



!J!










!J!














!J!


























!J!




!!



!J!


!!

!J!

!J!



!J!

!J!

!J!


!J!








!J!




!J!








!T!






!T!

!T!





!J!







!J!

!J!










!J!

!!





!J!






!J!




!J!




















!!



!T!
!!















!J!


!J!

!J!
!N!

!N!

!>!



!J!













!>!










!J!







!>!
















!>!




!J!

!>!








!J!


!>!





!J!














!J!















!J!









!!




!J!





!J!


















!J!



!J!





!T!








!!





!J!










!J!


!J!


!J!

!T!






!J!




!J!





!J!




!!
!!



























!!

!J!






!!









!!

!J!



!J!








!!






!J!

!J!



!!






!!






!!


!T!




!T!



!T!



!T!


!!





!J!






!>!





!T!

!>!
!!









!T!


!!







!J!











!J!






!J!


!N!

!!






!!














!N!


!T!


!!











!N!












!T!


!H!







!J!















!!















!J!








!J!




!!







!J!




!J!











!N!







!N!









!!


!!




!H!






















!J!


!J!











!J!







!J!






!!


!J!











!J!





!J!














!J!






!J!








!J!




































!J!






!J!









!!
























!J!



!J!



!J!



!!
!!


!!


!!









!!





!J!

















!!

!!


!N!

!N!


!>!












!J!






!J!


















!J!









!J!

!J!














!J!


















!J!



!J!












!!




!T!




!T!









!J!




!J!





!!




!J!



!J!





!J!






!J!


!J!




!J!





!!

!!




!J!





!J!












!>!




!>!




!J!










!J!











!J!



!J!



!J!













!J!




!J!





!!


!T!


!T!

!!

!J!

!!

!!

!T!


!M!

!T!






!J!

!!




!T!









!T!


!T!






!J!












!J!


!J!






!J!

!!






!J!


!J!





!J!


!J!



















































!J!















!J!









!J!


!J!

!J!







!J!









































!T!































!J!































!J!












!!







!!





!J!
































!J!




















!T!





































!T!





























































































































!J!







































!!















































































!!





!J!










!J!


!J!







!J!


!J!







!J!


!J!





!M!











!J!


!J!





!J!


!J!







!J!


!J!





!J!


!J!































































!J!





































!J!




















!J!




!J!









!J!








!J!



!J!



!J!

!!


!J!

!!










!M!














!T!


!T!



!J!




!T!



!T!




!!







!J!




!J!




!J!















!M!


!J!






!J!



!J!









!!
!N!






!!



!J!









!J!


!!






!J!











!>!


!J!



!J!

!!


!!









!!


!J!




!J!


!J!








!J!



!!

!T!

!J!



!M!
!!






!J!








!N!


!J!




!J!



!J!





!J!


!J!


!!

!J!











!!

!N!












!N!

!J!


!J!


!J!



!J!

!N!


!J!



!T!

!!













!T!


!!




!!



!J!







!J!











!J!

!J!











!J!

!!


!J!


!J!

















!!


!J!






!N!






!!
!N!





!T!







!J!


!J!




!J!

!J!






!J!








!J!




!J!












!J!



!J!



!J!









!J!




!J!



!J!






!J!





!J!



!J!


!!








!J!

!J!






!!



!J!



!J!




!J!





!J!






!!

!J!

!!

!J!

!>!





!J!

















!J!





!J!





!J!







!J!









!J!

!J!


!T!

!T!


!T!




!T!


!T!


!T!




!T!


!T!


!T!




!J!



!!


!J!









!J!








!J!


!J!



!!




!!


!!




!J!




!J!














!!




!J!







!J!



!J!




!!




!J!





!J!





!T!


!T!



!J!



!T!





!J!


!J!











!J!




!!





!!


!T!





!T!



!T!

!T!




















!J!


!J!






!J!





!J!



!>!








!T!

!T!


!T!


!J!

!>!






!T!

!T!


!!

!J!




!>!


!T!









!J!


!J!


!T!


!T!

!T!

!T!




!T!



!J!





















!J!





!!











!J!






!J!



!J!














!J!

!T!


!N!














!J!





!!










!J!



!T!

!M!






!!








!T!
!!














!J!


!J!















!!

!J!


!!






!J!

!!

!J!


!T!

!M!

!T!




!!




!J!

!M!






!T!





!T!














!T!







!J!
















!J!




!J!

!M!

!J!





!J!










!M!



!J!






!J!


!J!











!J!













!J!









!J!













!J!



















!J!







!J!






!T!







!T!
!!


!J!

!J!








































!>!











!J!

!!










!!


!!


!J!





!J!




!!














!T!




!!
!!


!J!




!J!

!J!



!J!

!!






!J!

!J!



!T!




!T!


!!
!!





!!




!!


!>!




!J!

!!




!>!

!J!




!J!

!J!



!T!



!!




!T!






!!










!!


!J!

!!


!>!

!J!



!J!



!J!

!!








!!








!J!


!J!




!J!











!J!






!J!




!J!



!J!








!J!














































!M!

!J!










!J!







!M!






!J!

















!J!







!J!


!J!





!J!












!M!















!J!






!J!





!J!










!!






!J!








!J!







!!



!J!


!M!





!J!
















absent











!>!




!>!





!>!







!J!














!J!


























!J!





































!J!







!J!





































!J!


!J!












!J!




















!J!









!J!





!J!




!M!










!J!



!M!



!J!






















!M!



!J!

!J!



























!T!


















!T!








!T!




















!J!


!J!

!J!























!T!














!J!





!J!




!T!


!J!

!J!









!J!











!J!


!M!



!!



!M!







!J!






































!N!


!J!








!J!














!J!


!J!




!J!



!J!














!!



!!


!J!




!!



!J!




!J!


























!T!



























!T!

















!T!

















!>!



























!T!











!>!





!M!


!J!












!>!















































!J!



















































!J!








































!!


!J!







!J!




!J!


!J!





!J!









!J!














!J!








!J!














!T!





!T!





!J!











!J!




!N!








!J!




!!











!T!





!J!





!>!


!J!



!!







!J!







!J!





!J!




!J!





!J!








!J!











!J!








!J!











!J!





!J!










!J!










!!






!J!






!J!





!T!










!J!















!J!













!J!







!!





!!











!T!











!J!





























!T!











!T!





!!





!J!














!T!




!J!







!J!




!!




!J!

!T!










!J!







!J!



!J!













!!











!J!







!J!




!T!

!J!








!!


!!




!N!


!N!

!J!




!!
















!J!


!J!



!!






















!M!






!J!



!J!




!J!




!J!

!J!


!J!



!J!





!J!




!!


!J!








!J!








!J!

!M!


!!






!J!







!!











!M!

!J!








!!

!J!

























!J!







!!
!M!



!T!



!T!





!!




!!



!J!




!H!

!J!










!M!


!J!

!J!



!!









!J!






!J!








!!

!!











!J!





!!

!!









!T!


!J!



!T!

!J!


!J!














!!














!J!



!!





!!

!T!



















!M!


!J!



!J!

!J!


!J!


!J!





!J!




!J!


!J!





!!







!!





!J!



!J!





!J!



!J!




!!






!J!









!J!











!J!


!J!




!!






!J!






!J!







!!









!J!


!M!




!N!





!M!





















!J!








!>!






!!





!!

!!

!!






!>!


!M!






!>!





!T!

!J!

!M!









!J!







!J!

!J!













!T!




!J!




!!



!T!


!>!

!!





!>!


!J!

!J!
















!T!















!J!




!!








!J!




!!


!!

!J!



!!
!!





!!

!T!






!M!



!N!

!N!





!M!

!N!






!T!





!J!






!!







!J!
!!








!!



















!N!

!J!
!!



!J!









!N!

!N!

!N!


!N!







!>!


!T!
























!J!







!!
!!







!!


















!!







!M!



!T!








!!

!!

!!






!J!























!J!

















!J!

!J!


!J!




!J!






!J!




!!






!!


!!


!J!





!J!







!J!








!J!







!J!











!M!

!!



!!









!J!








!J!





!J!


!!




!!


!J!































!!









!J!



!T!













!J!




!J!








!J!


!J!


!J!




!J!




!!







!J!


!J!




!J!










!J!



!J!




!J!










!J!








!J!








!J!

!J!

!J!


!J!






!J!









!J!

!J!


!J!







!J!

!!

!J!



!J!


!J!


!J!

!J!

!J!
!!


!J!

















!J!



!!











!J!













!J!






!J!






!T!








!J!

!J!


!J!





!!
!!







!J!
!!

!!











!T!










!J!





























!!
!!

















!J!




!!
!J!






!J!

!J!







!J!

!J!









!!



















!N!







!J!



!J!



!N!





!J!







!J!

!J!




!T!


!J!

!J!




!J!



!J!








!J!






!J!


!J!




!J!



!J!










!J!




!J!













!!
!J!




!J!


!N!




!N!


!N!





















!J!



!!










!J!




!!





!J!



!J!


!J!








!J!












!!







!N!







!J!





!J!









!T!





!>!



!N!



!J!



!!



!!





!T!




!J!




!T!

!!


!J!












!J!



!!




!N!

!N!

!!










!N!

!!











!J!











!J!





!>!

!!



























!!
















!!



























!!


!>!










!J!











!J!




!>!








!>!



!J!







!!






!J!

!!










!!




!J!





!J!


!J!



!J!














!!






!J!



!!



!J!

!J!










!T!


!J!































!J!




!!





















!J!


















!!
















!!


!T!
































!T!


















!M!























!J!





!J!







!J!




!J!














!!




!J!








!J!



!!



!!
!!



!!

!!



!!






!!


!>!






!!








!!
!!
















!T!










!J!




!J!







!J!

















































!J!



!J!

!J!


!T!



!J!



!J!






!J!


!!












!J!






!J!









!J!







!!


!T!




!J!






!>!

!>!


!>!

!J!






!J!



!J!






!J!








!J!



!J!


!J!






!T!

!!





!>!


!>!




!>!

!!


!J!




!J!





!J!

















!!


!J!











!J!















































































!J!







!J!
























































































!T!















!J!






































































!T!

























































!!




!J!



!J!



!J!

!!




!J!


!J!



!J!




!J!



!>!









!J!







!>!

!>!




































!J!























!T!











!J!


!J!



!J!






























!J!




!J!







!J!










!J!



!!





















!J!






!J!




!!














!!





!J!



















!J!





!J!




!J!




!J!









!J!





























!J!




!J!





!J!







!J!




















!J!





























!T!










!J!




















!J!







!J!










!J!





!!
!!




!N!






!J!

!!












!J!





!J!



















!J!











!T!





!J!






!J!


!N!
























!N!






!!







!N!







!!


!N!


!N!




!T!

!J!


















!T!














































!J!



































!J!















!!



!J!

!N!










!J!



























!J!








!J!


!J!

!J!


!J!








!J!












!J!



!!

!J!




!J!







!!













!T!
















!J!

!>!



!J!




!J!


!J!






!J!






!J!






!J!










!J!



!J!






!J!


!J!




!J!













!J!


!J!


































!!












!J!







!J!



!J!






!!


















!!


!>!







!J!





!J!




!J!











!J!
!!



!>!



!!

!J!



!J!


!J!


!J!



!!












!J!






!J!




!J!



















!J!


!J!



























!J!



!J!




























!J!






!J!









!J!







!J!


!J!








!J!



!J!



!!









!J!










!!




!J!


!J!





!J!





!J!





!J!



!J!




!J!






!!

!J!


!!
!J!







!J!






!J!






























!J!




!J!
!H!

!>!



!J!







!!



!!






































!T!





!J!



















!>!



!>!










!J!


















!J!

!J!




!M!





!J!



!J!

































!J!

















!J!










!J!


!!

!J!




!J!





!J!












!J!








!J!


!J!







!J!





















!J!

!J!

!J!



!T!




!J!















!J!



!J!
























!T!










!J!



!J!




!J!














!J!







!J!


!J!





!!











































































!J!


!!



!J!





!J!

!J!



!J!





!J!


!J!


!J!







!!



!J!





!J!





!J!




!J!





!J!



!J!





!!






!!





!!






!!












!T!


!>!


!>!






!>!

!J!

!!

!!






!J!


!!



!J!






























!J!






!J!





!J!










!J!







!J!






!J!













!J!
















!J!







!J!





!J!
























!J!











!!



!!



!J!






!J!

!J!

!!
!J!









!J!



!!






!!

!T!



!!










!!







!J!


!!


!J!



!J!



!J!





!J!



!T!















!!






!!





!T!

!>!





!J!


!J!



!J!








!J!






!J!















!J!








!!
!J!






















!J!





!!
!!
!J!










!J!







!J!


!J!




